[
  {
    "con": "Theo nguyên lý Von Newmann, để truy cập một khối dữ liệu, ta cần:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý sử dụng kiến trúc RISC, thì các lệnh sẽ có độ dài cố định và đơn giản hơn.",
    "re": "Điều này giúp tăng tốc độ thực thi lệnh."
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn, thì khả năng lưu trữ dữ liệu thường xuyên sử dụng sẽ cao hơn.",
    "re": "Điều này dẫn đến giảm thời gian truy cập bộ nhớ chính."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi, thì nó có thể thực hiện nhiều tác vụ song song.",
    "re": "Điều này cải thiện hiệu suất tổng thể của hệ thống."
  },
  {
    "con": "Nếu một CPU có tốc độ xung nhịp cao hơn, thì khả năng xử lý lệnh trong một giây sẽ tăng lên.",
    "re": "Điều này có thể dẫn đến hiệu suất cao hơn trong các ứng dụng yêu cầu tính toán nặng."
  },
  {
    "con": "Nếu một hệ thống sử dụng bus dữ liệu rộng hơn, thì nó có thể truyền tải nhiều dữ liệu hơn cùng một lúc.",
    "re": "Điều này giúp tăng băng thông và hiệu suất truyền tải dữ liệu."
  },
  {
    "con": "Nếu một hệ thống có nhiều loại bộ nhớ (như RAM, ROM, Cache), thì nó có thể tối ưu hóa hiệu suất truy cập dữ liệu.",
    "re": "Điều này giúp cải thiện tốc độ và hiệu quả của các ứng dụng."
  },
  {
    "con": "Nếu một kiến trúc sử dụng pipelining, thì các giai đoạn thực thi lệnh có thể diễn ra đồng thời.",
    "re": "Điều này giúp tăng tốc độ xử lý lệnh tổng thể."
  },
  {
    "con": "Nếu một hệ thống có khả năng xử lý đồng thời (multithreading), thì nó có thể tận dụng tốt hơn tài nguyên CPU.",
    "re": "Điều này dẫn đến hiệu suất cao hơn trong các ứng dụng đa nhiệm."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Harvard, thì nó có thể truy cập bộ nhớ lệnh và bộ nhớ dữ liệu đồng thời.",
    "re": "Điều này giúp cải thiện hiệu suất so với kiến trúc Von Neumann."
  },
  {
    "con": "Thông tin được lưu trữ và truyền bên trong máy tính dưới dạng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn:",
    "re": "Có khả năng xử lý đa nhiệm tốt hơn"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn:",
    "re": "Tốc độ truy cập dữ liệu nhanh hơn"
  },
  {
    "con": "Kiến trúc máy tính sử dụng pipelining:",
    "re": "Tăng hiệu suất xử lý bằng cách thực hiện nhiều lệnh đồng thời"
  },
  {
    "con": "Bộ nhớ RAM có tốc độ cao hơn:",
    "re": "Cải thiện hiệu suất tổng thể của hệ thống"
  },
  {
    "con": "Hệ thống sử dụng bus rộng hơn:",
    "re": "Có khả năng truyền tải dữ liệu lớn hơn trong một lần"
  },
  {
    "con": "Kiến trúc RISC được áp dụng:",
    "re": "Giảm độ phức tạp của lệnh và tăng tốc độ thực thi"
  },
  {
    "con": "Sử dụng bộ điều khiển DMA:",
    "re": "Giảm tải cho CPU trong việc truyền dữ liệu"
  },
  {
    "con": "Hệ thống có nhiều tầng bộ nhớ:",
    "re": "Tối ưu hóa chi phí và hiệu suất truy cập dữ liệu"
  },
  {
    "con": "Sử dụng kỹ thuật phân chia thời gian:",
    "re": "Tăng cường khả năng chia sẻ tài nguyên giữa các tác vụ"
  },
  {
    "con": "Theo nguyên lý Von Newmann, việc cài đặt dữ liệu vào máy tính được thực hiện bằng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý sử dụng kiến trúc RISC, thì các lệnh sẽ có độ dài cố định và đơn giản hơn",
    "re": "Điều này giúp tăng tốc độ thực thi lệnh"
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn, thì khả năng lưu trữ dữ liệu tạm thời sẽ cao hơn",
    "re": "Điều này giúp giảm thời gian truy cập dữ liệu từ bộ nhớ chính"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi, thì nó có thể thực hiện nhiều tác vụ song song",
    "re": "Điều này cải thiện hiệu suất tổng thể của hệ thống"
  },
  {
    "con": "Nếu bus dữ liệu có băng thông cao hơn, thì tốc độ truyền tải dữ liệu giữa các thành phần sẽ nhanh hơn",
    "re": "Điều này giúp cải thiện hiệu suất của hệ thống"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo, thì nó có thể sử dụng không gian lưu trữ lớn hơn so với bộ nhớ vật lý",
    "re": "Điều này cho phép chạy nhiều ứng dụng hơn cùng một lúc"
  },
  {
    "con": "Nếu một CPU có nhiều đơn vị thực thi, thì nó có thể xử lý nhiều lệnh cùng một lúc",
    "re": "Điều này giúp tăng cường khả năng xử lý của CPU"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc pipelining, thì các giai đoạn thực thi lệnh sẽ được thực hiện đồng thời",
    "re": "Điều này giúp tăng tốc độ xử lý lệnh"
  },
  {
    "con": "Nếu một hệ thống có khả năng xử lý đồng thời (multithreading), thì nó có thể tối ưu hóa việc sử dụng tài nguyên",
    "re": "Điều này giúp cải thiện hiệu suất ứng dụng"
  },
  {
    "con": "Nếu một hệ thống sử dụng công nghệ SIMD (Single Instruction, Multiple Data), thì nó có thể thực hiện cùng một lệnh trên nhiều dữ liệu",
    "re": "Điều này giúp tăng tốc độ xử lý cho các tác vụ tính toán lớn"
  },
  {
    "con": "CPU có nhiều lõi xử lý",
    "re": "có khả năng thực hiện nhiều tác vụ song song hơn"
  },
  {
    "con": "Bộ nhớ cache có dung lượng nhỏ hơn bộ nhớ RAM",
    "re": "có tốc độ truy cập nhanh hơn"
  },
  {
    "con": "Sử dụng kiến trúc RISC",
    "re": "giúp giảm độ phức tạp của bộ lệnh và tăng hiệu suất"
  },
  {
    "con": "Tăng băng thông của bus dữ liệu",
    "re": "có thể cải thiện hiệu suất truyền tải dữ liệu giữa các thành phần"
  },
  {
    "con": "Sử dụng kỹ thuật pipelining",
    "re": "có thể tăng tốc độ xử lý của CPU bằng cách thực hiện nhiều giai đoạn xử lý đồng thời"
  },
  {
    "con": "Bộ điều khiển (control unit) hoạt động hiệu quả",
    "re": "giúp điều phối các hoạt động của CPU và các thành phần khác"
  },
  {
    "con": "Sử dụng bộ nhớ ảo",
    "re": "cho phép hệ thống sử dụng nhiều bộ nhớ hơn so với bộ nhớ vật lý có sẵn"
  },
  {
    "con": "Thiết kế kiến trúc đa lõi",
    "re": "có thể cải thiện hiệu suất tổng thể của hệ thống trong các ứng dụng đa nhiệm"
  },
  {
    "con": "Sử dụng kỹ thuật phân chia thời gian (time-sharing)",
    "re": "có thể tối ưu hóa việc sử dụng CPU trong môi trường đa người dùng"
  },
  {
    "con": "Tăng tốc độ xung nhịp của CPU",
    "re": "có thể cải thiện hiệu suất xử lý nhưng cũng làm tăng tiêu thụ năng lượng"
  },
  {
    "con": "Hãy chỉ ra khẳng định sai trong các khẳng định sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn",
    "re": "Có khả năng xử lý nhiều tác vụ đồng thời tốt hơn"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn",
    "re": "Tốc độ truy cập dữ liệu sẽ nhanh hơn"
  },
  {
    "con": "Kiến trúc Harvard",
    "re": "Cho phép truy cập đồng thời vào bộ nhớ lệnh và bộ nhớ dữ liệu"
  },
  {
    "con": "Tần số xung nhịp của CPU cao hơn",
    "re": "CPU có khả năng thực hiện nhiều phép toán hơn trong một giây"
  },
  {
    "con": "Sử dụng kỹ thuật pipelining",
    "re": "Tăng hiệu suất xử lý bằng cách cho phép nhiều lệnh được thực hiện đồng thời"
  },
  {
    "con": "Số lượng bit trong bus dữ liệu lớn hơn",
    "re": "Cho phép truyền tải nhiều dữ liệu hơn trong một lần"
  },
  {
    "con": "Sử dụng kiến trúc RISC",
    "re": "Giảm độ phức tạp của lệnh và tăng tốc độ thực thi"
  },
  {
    "con": "Sử dụng bộ điều khiển đa kênh",
    "re": "Tăng cường khả năng truy cập dữ liệu từ nhiều nguồn khác nhau"
  },
  {
    "con": "Sử dụng công nghệ siêu phân luồng (Hyper-Threading)",
    "re": "Tăng cường hiệu suất xử lý bằng cách cho phép mỗi lõi xử lý nhiều luồng cùng lúc"
  },
  {
    "con": "Sử dụng bộ nhớ ảo",
    "re": "Cho phép hệ thống sử dụng không gian bộ nhớ lớn hơn so với bộ nhớ vật lý thực tế"
  },
  {
    "con": "Trong hệ đếm thập phân, giá trị của mỗi con số phụ thuộc vào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý có nhiều lõi,",
    "re": "thì khả năng xử lý đa nhiệm sẽ được cải thiện."
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ vi xử lý tăng,",
    "re": "thì hiệu suất xử lý của nó cũng có khả năng tăng lên."
  },
  {
    "con": "Nếu bộ nhớ cache có dung lượng lớn hơn,",
    "re": "thì thời gian truy cập dữ liệu sẽ giảm."
  },
  {
    "con": "Nếu kiến trúc máy tính sử dụng pipelining,",
    "re": "thì hiệu suất thực thi các lệnh sẽ được cải thiện."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo,",
    "re": "thì nó có thể chạy nhiều ứng dụng hơn so với dung lượng RAM vật lý."
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng lớn hơn,",
    "re": "thì lượng dữ liệu truyền tải trong một lần sẽ tăng lên."
  },
  {
    "con": "Nếu kiến trúc máy tính sử dụng SIMD (Single Instruction, Multiple Data),",
    "re": "thì nó có thể xử lý nhiều dữ liệu cùng một lúc, tăng tốc độ xử lý."
  },
  {
    "con": "Nếu một hệ thống sử dụng công nghệ đa xử lý,",
    "re": "thì nó có thể cải thiện hiệu suất tổng thể của hệ thống."
  },
  {
    "con": "Nếu một bộ vi xử lý có kiến trúc RISC,",
    "re": "thì nó sẽ có số lượng lệnh đơn giản hơn và hiệu suất cao hơn trong một số ứng dụng."
  },
  {
    "con": "CPU có nhiều lõi xử lý",
    "re": "hiệu suất xử lý đa nhiệm sẽ được cải thiện"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn",
    "re": "tốc độ truy cập dữ liệu sẽ nhanh hơn"
  },
  {
    "con": "Sử dụng kiến trúc RISC",
    "re": "sẽ giảm thiểu số lượng chu kỳ đồng hồ cần thiết để thực hiện một lệnh"
  },
  {
    "con": "Tốc độ xung nhịp của CPU tăng",
    "re": "hiệu suất xử lý của CPU cũng sẽ tăng lên"
  },
  {
    "con": "Sử dụng bus dữ liệu rộng hơn",
    "re": "sẽ cho phép truyền tải nhiều dữ liệu hơn trong một lần"
  },
  {
    "con": "Số lượng transistor trên chip tăng",
    "re": "khả năng xử lý và hiệu suất của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Sử dụng bộ điều khiển DMA",
    "re": "sẽ giảm tải cho CPU trong việc quản lý dữ liệu"
  },
  {
    "con": "Hệ thống sử dụng bộ nhớ ảo",
    "re": "sẽ cho phép chạy nhiều ứng dụng hơn so với dung lượng RAM vật lý"
  },
  {
    "con": "Kiến trúc máy tính sử dụng pipelining",
    "re": "sẽ tăng cường hiệu suất xử lý bằng cách thực hiện nhiều lệnh song song"
  },
  {
    "con": "Sử dụng công nghệ siêu phân luồng (Hyper-Threading)",
    "re": "sẽ cải thiện hiệu suất xử lý trong các tác vụ đa nhiệm"
  },
  {
    "con": "Trong hệ đếm La Mã, giá trị của mỗi chữ số phụ thuộc vào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong hệ đếm nhị phân, giá trị của mỗi con số phụ thuộc vào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý có nhiều lõi,",
    "re": "thì khả năng xử lý đa nhiệm sẽ được cải thiện."
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ vi xử lý tăng lên,",
    "re": "thì hiệu suất xử lý của nó cũng có khả năng tăng theo."
  },
  {
    "con": "Nếu bộ nhớ cache có dung lượng lớn hơn,",
    "re": "thì khả năng truy cập dữ liệu nhanh hơn sẽ tăng lên."
  },
  {
    "con": "Nếu kiến trúc máy tính sử dụng pipelining,",
    "re": "thì hiệu suất thực thi các lệnh sẽ được cải thiện."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo,",
    "re": "thì nó có thể chạy nhiều ứng dụng hơn so với dung lượng RAM thực tế."
  },
  {
    "con": "Nếu một bộ xử lý hỗ trợ SIMD (Single Instruction, Multiple Data),",
    "re": "thì nó có thể thực hiện các phép toán trên nhiều dữ liệu cùng một lúc."
  },
  {
    "con": "Nếu bus dữ liệu có băng thông cao,",
    "re": "thì tốc độ truyền tải dữ liệu giữa các thành phần sẽ nhanh hơn."
  },
  {
    "con": "Nếu kiến trúc Harvard được sử dụng,",
    "re": "thì bộ nhớ cho dữ liệu và lệnh sẽ được tách biệt, giúp tăng tốc độ xử lý."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc RISC (Reduced Instruction Set Computing),",
    "re": "thì nó sẽ có số lượng lệnh ít hơn nhưng thực thi nhanh hơn."
  },
  {
    "con": "Trong số dấu chấm động biểu diễn dạng 32 bit trong máy tính, thành phần định trị có độ dài bao nhiêu bit?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi bộ xử lý sử dụng kiến trúc RISC, số lượng lệnh thường ít hơn so với kiến trúc CISC?",
    "re": "Đúng"
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn, thì thời gian truy cập dữ liệu sẽ giảm?",
    "re": "Đúng"
  },
  {
    "con": "Khi sử dụng kiến trúc đa lõi, hiệu suất xử lý sẽ tăng lên khi chạy nhiều tác vụ song song?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng bus dữ liệu rộng hơn, thì băng thông truyền tải dữ liệu sẽ tăng lên?",
    "re": "Đúng"
  },
  {
    "con": "Khi một CPU có tốc độ xung nhịp cao hơn, thì khả năng xử lý của nó sẽ tốt hơn?",
    "re": "Không hoàn toàn đúng, còn phụ thuộc vào nhiều yếu tố khác"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ RAM nhanh hơn, thì hiệu suất tổng thể của hệ thống sẽ được cải thiện?",
    "re": "Đúng"
  },
  {
    "con": "Khi một hệ thống có nhiều tầng bộ nhớ, thì thời gian truy cập dữ liệu sẽ phụ thuộc vào vị trí của dữ liệu trong các tầng bộ nhớ?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một vi xử lý có nhiều đơn vị thực thi, thì nó có thể thực hiện nhiều lệnh cùng một lúc?",
    "re": "Đúng"
  },
  {
    "con": "Khi một hệ thống sử dụng công nghệ siêu phân luồng, thì số lượng luồng xử lý có thể vượt quá số lượng lõi vật lý?",
    "re": "Đúng"
  },
  {
    "con": "Trong số dấu chấm động biểu diễn dạng 32 bit trong máy tính, thành phần định trị có độ dài bao nhiêu bit?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý có kiến trúc RISC, thì số lượng lệnh thường ít hơn so với kiến trúc CISC.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống máy tính sử dụng bộ nhớ cache, thì tốc độ truy cập dữ liệu sẽ nhanh hơn so với truy cập trực tiếp vào bộ nhớ chính.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một vi xử lý có nhiều lõi, thì nó có khả năng xử lý nhiều tác vụ đồng thời tốt hơn so với vi xử lý đơn lõi.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc phân tán, thì khả năng mở rộng và tính khả dụng của hệ thống sẽ cao hơn.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một vi xử lý có tốc độ xung nhịp cao hơn, thì nó có khả năng thực hiện nhiều phép toán hơn trong một giây.",
    "re": "Đúng"
  },
  {
    "con": "Nếu bộ nhớ RAM có dung lượng lớn hơn, thì khả năng chạy nhiều ứng dụng cùng lúc sẽ tốt hơn.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống máy tính sử dụng bus dữ liệu rộng hơn, thì nó có thể truyền tải nhiều dữ liệu hơn trong một lần.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một vi xử lý hỗ trợ đa luồng, thì nó có thể xử lý nhiều luồng dữ liệu cùng lúc, cải thiện hiệu suất.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc pipelining, thì nó có thể tăng tốc độ thực thi lệnh bằng cách xử lý nhiều lệnh cùng lúc.",
    "re": "Đúng"
  },
  {
    "con": "Trong số dấu chấm động biểu diễn dạng 32 bit trong máy tính, thành phần số mũ có độ dài bao nhiêu bit?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi tăng số lượng lõi trong một bộ vi xử lý, hiệu suất xử lý đa nhiệm sẽ được cải thiện.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ nhớ cache có dung lượng lớn hơn, thì thời gian truy cập dữ liệu sẽ giảm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi sử dụng kiến trúc Harvard, bộ nhớ chương trình và bộ nhớ dữ liệu được tách biệt.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng bus dữ liệu rộng hơn, thì băng thông truyền tải dữ liệu sẽ tăng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi sử dụng kỹ thuật pipelining, hiệu suất thực thi lệnh sẽ được cải thiện.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một bộ vi xử lý hỗ trợ đa luồng, thì nó có thể xử lý nhiều luồng lệnh cùng một lúc.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi sử dụng kiến trúc RISC, số lượng lệnh đơn giản và thời gian thực thi ngắn hơn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hệ thống có bộ nhớ ảo, thì nó có thể sử dụng không gian lưu trữ lớn hơn bộ nhớ vật lý.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi sử dụng kỹ thuật phân chia thời gian, nhiều người dùng có thể chia sẻ tài nguyên hệ thống hiệu quả.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC.",
    "re": "Điều này giúp tăng tốc độ thực thi lệnh."
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn,",
    "re": "thì khả năng lưu trữ dữ liệu tạm thời sẽ tốt hơn, giảm thiểu thời gian truy cập bộ nhớ chính."
  },
  {
    "con": "Khi sử dụng kiến trúc đa lõi,",
    "re": "thì hiệu suất xử lý đa nhiệm sẽ được cải thiện đáng kể."
  },
  {
    "con": "Nếu một hệ thống sử dụng bus dữ liệu rộng hơn,",
    "re": "thì băng thông truyền tải dữ liệu sẽ cao hơn."
  },
  {
    "con": "Khi một CPU có tốc độ xung nhịp cao hơn,",
    "re": "thì khả năng xử lý lệnh trong một giây sẽ tăng lên."
  },
  {
    "con": "Nếu một hệ thống sử dụng kỹ thuật pipelining,",
    "re": "thì thời gian thực thi trung bình của các lệnh sẽ giảm."
  },
  {
    "con": "Khi bộ nhớ RAM có tốc độ truy cập nhanh hơn,",
    "re": "thì hiệu suất tổng thể của hệ thống sẽ được cải thiện."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Harvard,",
    "re": "thì nó có thể truy cập đồng thời bộ nhớ lệnh và bộ nhớ dữ liệu."
  },
  {
    "con": "Khi một hệ thống có nhiều cấp độ bộ nhớ cache,",
    "re": "thì hiệu suất truy cập dữ liệu sẽ được tối ưu hóa."
  },
  {
    "con": "Nếu một hệ thống sử dụng kỹ thuật phân chia thời gian (time-sharing),",
    "re": "thì nhiều người dùng có thể sử dụng tài nguyên hệ thống đồng thời mà không bị gián đoạn."
  },
  {
    "con": "Chữ số L trong hệ đếm La mã tương ứng với giá trị nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chữ số C trong hệ đếm La mã tương ứng với giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC",
    "re": "Điều này giúp tăng tốc độ thực thi lệnh"
  },
  {
    "con": "Bộ nhớ cache có kích thước nhỏ hơn bộ nhớ chính",
    "re": "Điều này giúp tăng tốc độ truy cập dữ liệu"
  },
  {
    "con": "Kiến trúc đa lõi cho phép nhiều lõi xử lý thực hiện song song",
    "re": "Điều này cải thiện hiệu suất xử lý của hệ thống"
  },
  {
    "con": "Sử dụng bus dữ liệu rộng hơn cho phép truyền tải nhiều bit hơn cùng một lúc",
    "re": "Điều này làm tăng băng thông của hệ thống"
  },
  {
    "con": "Khi tần số xung nhịp của bộ xử lý tăng lên",
    "re": "Hiệu suất xử lý của bộ xử lý cũng có khả năng tăng lên"
  },
  {
    "con": "Sử dụng kỹ thuật pipelining trong bộ xử lý",
    "re": "Điều này giúp tăng cường khả năng thực thi lệnh đồng thời"
  },
  {
    "con": "Bộ nhớ ảo cho phép hệ thống sử dụng không gian bộ nhớ lớn hơn bộ nhớ vật lý",
    "re": "Điều này giúp chạy nhiều ứng dụng hơn mà không gặp phải thiếu bộ nhớ"
  },
  {
    "con": "Khi sử dụng kiến trúc Harvard",
    "re": "Dữ liệu và lệnh được lưu trữ trong các bộ nhớ riêng biệt, giúp tăng tốc độ truy cập"
  },
  {
    "con": "Khi một hệ thống sử dụng RAID",
    "re": "Điều này giúp cải thiện độ tin cậy và hiệu suất của lưu trữ dữ liệu"
  },
  {
    "con": "CPU có nhiều lõi xử lý hơn",
    "re": "có khả năng thực hiện nhiều tác vụ đồng thời tốt hơn"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn",
    "re": "giúp tăng tốc độ truy cập dữ liệu cho CPU"
  },
  {
    "con": "Sử dụng kiến trúc RISC",
    "re": "giúp đơn giản hóa các lệnh và tăng hiệu suất xử lý"
  },
  {
    "con": "Tốc độ xung nhịp của CPU cao hơn",
    "re": "có thể xử lý nhiều lệnh hơn trong một giây"
  },
  {
    "con": "Sử dụng bus dữ liệu rộng hơn",
    "re": "cho phép truyền tải nhiều dữ liệu hơn cùng một lúc"
  },
  {
    "con": "Sử dụng bộ điều khiển bộ nhớ hiệu quả",
    "re": "giúp tối ưu hóa việc truy cập và sử dụng bộ nhớ"
  },
  {
    "con": "Sử dụng kiến trúc đa xử lý",
    "re": "có thể cải thiện hiệu suất tổng thể của hệ thống"
  },
  {
    "con": "Sử dụng công nghệ siêu phân luồng (Hyper-Threading)",
    "re": "giúp tăng cường khả năng xử lý đồng thời của CPU"
  },
  {
    "con": "Bộ nhớ RAM có tốc độ cao hơn",
    "re": "giúp cải thiện hiệu suất của các ứng dụng yêu cầu nhiều tài nguyên"
  },
  {
    "con": "Sử dụng hệ thống làm mát hiệu quả",
    "re": "giúp duy trì hiệu suất tối ưu của CPU và các linh kiện khác"
  },
  {
    "con": "Chữ số D trong hệ đếm La mã tương ứng với giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC",
    "re": "Bộ xử lý RISC có thể thực hiện lệnh nhanh hơn do đơn giản hóa"
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache",
    "re": "Thời gian truy cập dữ liệu có thể giảm nhưng chi phí sản xuất tăng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi",
    "re": "Nó có thể xử lý nhiều tác vụ đồng thời hiệu quả hơn"
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo",
    "re": "Hệ thống có thể chạy nhiều chương trình hơn so với dung lượng RAM thực tế"
  },
  {
    "con": "Nếu một CPU có tốc độ xung nhịp cao hơn",
    "re": "Nó có khả năng thực hiện nhiều phép toán hơn trong cùng một khoảng thời gian"
  },
  {
    "con": "Khi sử dụng bus dữ liệu rộng hơn",
    "re": "Tốc độ truyền tải dữ liệu giữa các thành phần trong hệ thống sẽ tăng lên"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc pipelining",
    "re": "Thời gian thực hiện lệnh có thể giảm do các giai đoạn thực hiện lệnh được chồng chéo"
  },
  {
    "con": "Khi một hệ thống có nhiều loại bộ nhớ (cache, RAM, disk)",
    "re": "Nó có thể tối ưu hóa hiệu suất bằng cách sử dụng từng loại bộ nhớ cho các tác vụ khác nhau"
  },
  {
    "con": "Nếu một chương trình có nhiều vòng lặp lồng ghép",
    "re": "Nó có thể gây ra tình trạng tắc nghẽn trong bộ xử lý do sử dụng tài nguyên không hiệu quả"
  },
  {
    "con": "Khi một hệ thống sử dụng công nghệ siêu phân luồng (Hyper-Threading)",
    "re": "Nó có thể cải thiện hiệu suất bằng cách cho phép mỗi lõi xử lý nhiều luồng cùng một lúc"
  },
  {
    "con": "Chữ số M trong hệ đếm La mã tương ứng với giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong hệ La mã số CD nhận giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ tăng lên"
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache",
    "re": "Thời gian truy cập dữ liệu sẽ giảm"
  },
  {
    "con": "Nếu sử dụng kiến trúc Harvard thay vì kiến trúc Von Neumann",
    "re": "Tốc độ xử lý có thể được cải thiện do không có xung đột giữa dữ liệu và lệnh"
  },
  {
    "con": "Khi tăng băng thông bus dữ liệu",
    "re": "Khả năng truyền tải dữ liệu giữa các thành phần sẽ được cải thiện"
  },
  {
    "con": "Nếu sử dụng kỹ thuật pipelining trong bộ xử lý",
    "re": "Thời gian thực hiện các lệnh sẽ giảm do các lệnh có thể được xử lý song song"
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo",
    "re": "Hệ thống có thể chạy nhiều ứng dụng hơn so với dung lượng bộ nhớ vật lý"
  },
  {
    "con": "Nếu tần số xung nhịp của bộ xử lý tăng lên",
    "re": "Tốc độ xử lý của bộ xử lý sẽ tăng lên, nhưng có thể tiêu tốn nhiều năng lượng hơn"
  },
  {
    "con": "Khi sử dụng kiến trúc đa xử lý",
    "re": "Hệ thống có thể xử lý các tác vụ phức tạp hơn một cách hiệu quả hơn"
  },
  {
    "con": "Nếu sử dụng các kỹ thuật tối ưu hóa như superscalar",
    "re": "Bộ xử lý có thể thực hiện nhiều lệnh trong một chu kỳ xung nhịp"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn sẽ giảm thiểu thời gian truy cập dữ liệu",
    "re": "Tốc độ xử lý của CPU sẽ tăng lên"
  },
  {
    "con": "Sử dụng kiến trúc RISC thay vì CISC sẽ đơn giản hóa thiết kế bộ xử lý",
    "re": "Thời gian phát triển và chi phí sản xuất sẽ giảm"
  },
  {
    "con": "Khi tăng tốc độ xung nhịp của CPU mà không thay đổi kiến trúc",
    "re": "Nhiệt độ hoạt động của CPU sẽ tăng lên"
  },
  {
    "con": "Sử dụng bus dữ liệu rộng hơn sẽ cho phép truyền tải nhiều dữ liệu hơn cùng một lúc",
    "re": "Băng thông của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo, hệ thống sẽ có khả năng sử dụng nhiều bộ nhớ hơn so với bộ nhớ vật lý",
    "re": "Tuy nhiên, hiệu suất có thể bị giảm do truy cập đĩa cứng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa xử lý",
    "re": "Nó có thể xử lý các tác vụ phức tạp hơn và cải thiện hiệu suất tổng thể"
  },
  {
    "con": "Khi sử dụng kỹ thuật pipelining trong CPU",
    "re": "Thời gian thực hiện lệnh sẽ được giảm thiểu"
  },
  {
    "con": "Nếu một hệ thống có nhiều tầng bộ nhớ",
    "re": "Thời gian truy cập dữ liệu sẽ được tối ưu hóa"
  },
  {
    "con": "Khi sử dụng các kỹ thuật tối ưu hóa như out-of-order execution",
    "re": "Hiệu suất xử lý của CPU sẽ được nâng cao"
  },
  {
    "con": "Trong hệ La mã số DC nhận giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ tăng lên"
  },
  {
    "con": "Khi bộ nhớ cache có dung lượng lớn hơn",
    "re": "Thời gian truy cập dữ liệu sẽ giảm"
  },
  {
    "con": "Nếu kiến trúc máy tính sử dụng pipelining",
    "re": "Tốc độ xử lý lệnh sẽ được cải thiện"
  },
  {
    "con": "Khi sử dụng bộ nhớ RAM tốc độ cao hơn",
    "re": "Thời gian truy cập dữ liệu sẽ nhanh hơn"
  },
  {
    "con": "Nếu hệ thống sử dụng bus rộng hơn",
    "re": "Băng thông truyền tải dữ liệu sẽ tăng lên"
  },
  {
    "con": "Khi sử dụng kiến trúc RISC thay vì CISC",
    "re": "Số lượng lệnh thực thi sẽ giảm, nhưng hiệu suất có thể tăng"
  },
  {
    "con": "Nếu có nhiều tầng trong kiến trúc bộ nhớ",
    "re": "Thời gian truy cập dữ liệu sẽ phụ thuộc vào tầng bộ nhớ"
  },
  {
    "con": "Khi sử dụng kỹ thuật phân chia thời gian (time-sharing)",
    "re": "Nhiều người dùng có thể sử dụng tài nguyên hệ thống đồng thời"
  },
  {
    "con": "Nếu hệ thống có khả năng xử lý song song",
    "re": "Thời gian hoàn thành tác vụ sẽ giảm"
  },
  {
    "con": "Khi sử dụng kiến trúc máy tính đa nhân",
    "re": "Khả năng xử lý đa nhiệm sẽ được cải thiện"
  },
  {
    "con": "Trong hệ La mã số LD nhận giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache",
    "re": "Thời gian truy cập dữ liệu sẽ giảm"
  },
  {
    "con": "Nếu sử dụng kiến trúc Harvard thay vì kiến trúc Von Neumann",
    "re": "Băng thông cho dữ liệu và lệnh sẽ được tối ưu hóa"
  },
  {
    "con": "Khi tần số xung nhịp của bộ xử lý tăng lên",
    "re": "Tốc độ xử lý của bộ xử lý sẽ tăng lên"
  },
  {
    "con": "Nếu sử dụng kỹ thuật pipelining trong bộ xử lý",
    "re": "Thời gian thực hiện các lệnh sẽ được giảm thiểu"
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo",
    "re": "Hệ thống có thể chạy nhiều ứng dụng hơn so với bộ nhớ vật lý có sẵn"
  },
  {
    "con": "Nếu một hệ thống có bus dữ liệu rộng hơn",
    "re": "Khả năng truyền tải dữ liệu sẽ cao hơn"
  },
  {
    "con": "Khi sử dụng kỹ thuật phân chia thời gian (time-sharing)",
    "re": "Nhiều người dùng có thể sử dụng tài nguyên hệ thống đồng thời"
  },
  {
    "con": "Nếu một chương trình có nhiều vòng lặp lồng ghép",
    "re": "Hiệu suất có thể bị giảm do xung đột tài nguyên"
  },
  {
    "con": "Khi sử dụng các kỹ thuật tối ưu hóa biên dịch",
    "re": "Mã máy sẽ chạy nhanh hơn và tiêu tốn ít tài nguyên hơn"
  },
  {
    "con": "Trong hệ La mã số MD nhận giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC",
    "re": "Hiệu suất thực thi lệnh cao hơn do đơn giản hóa trong thiết kế"
  },
  {
    "con": "Khi bộ nhớ cache đầy",
    "re": "Các dữ liệu mới sẽ thay thế các dữ liệu cũ theo chính sách thay thế đã định"
  },
  {
    "con": "Khi tốc độ xung nhịp của bộ xử lý tăng",
    "re": "Hiệu suất xử lý của bộ xử lý cũng có khả năng tăng lên"
  },
  {
    "con": "Khi sử dụng kiến trúc đa lõi",
    "re": "Có thể thực hiện nhiều tác vụ song song, cải thiện hiệu suất tổng thể"
  },
  {
    "con": "Khi dữ liệu được lưu trữ trong bộ nhớ chính",
    "re": "Thời gian truy cập sẽ lâu hơn so với bộ nhớ cache"
  },
  {
    "con": "Khi một hệ thống sử dụng bus dữ liệu rộng hơn",
    "re": "Có thể truyền tải nhiều dữ liệu hơn trong một chu kỳ đồng hồ"
  },
  {
    "con": "Khi một chương trình sử dụng nhiều biến toàn cục",
    "re": "Có thể dẫn đến việc tiêu tốn nhiều bộ nhớ và làm giảm hiệu suất"
  },
  {
    "con": "Khi một hệ thống sử dụng kỹ thuật pipelining",
    "re": "Thời gian thực thi của các lệnh có thể được giảm thiểu"
  },
  {
    "con": "Khi một bộ xử lý sử dụng kiến trúc Harvard",
    "re": "Có thể truy cập đồng thời bộ nhớ lệnh và bộ nhớ dữ liệu"
  },
  {
    "con": "Trong hệ La mã số CM nhận giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "CPU có nhiều lõi xử lý",
    "re": "Hiệu suất xử lý đa nhiệm sẽ được cải thiện"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn",
    "re": "Tốc độ truy cập dữ liệu sẽ nhanh hơn"
  },
  {
    "con": "Sử dụng kiến trúc RISC",
    "re": "Số lượng lệnh đơn giản và hiệu quả hơn sẽ tăng lên"
  },
  {
    "con": "Tăng băng thông bus dữ liệu",
    "re": "Tốc độ truyền tải dữ liệu giữa các thành phần sẽ nhanh hơn"
  },
  {
    "con": "Sử dụng bộ điều khiển DMA",
    "re": "CPU sẽ giảm tải công việc và tăng hiệu suất tổng thể"
  },
  {
    "con": "Sử dụng bộ nhớ ảo",
    "re": "Có thể chạy nhiều ứng dụng hơn so với dung lượng RAM vật lý"
  },
  {
    "con": "Tăng số lượng transistor trên chip",
    "re": "Khả năng xử lý và hiệu suất của CPU sẽ được cải thiện"
  },
  {
    "con": "Sử dụng kiến trúc đa lõi",
    "re": "Có thể xử lý nhiều tác vụ đồng thời hiệu quả hơn"
  },
  {
    "con": "Sử dụng công nghệ siêu phân luồng",
    "re": "Tăng cường khả năng xử lý đồng thời của CPU"
  },
  {
    "con": "Sử dụng hệ thống làm mát hiệu quả",
    "re": "Giúp duy trì hiệu suất hoạt động của CPU và tránh quá nhiệt"
  },
  {
    "con": "Trong hệ La mã số MCL nhận giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong hệ La mã số MCC nhận giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC.",
    "re": "Hiệu suất thực thi cao hơn trong nhiều trường hợp."
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache mà không thay đổi tốc độ truy cập bộ nhớ chính:",
    "re": "Thời gian truy cập trung bình sẽ giảm."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi:",
    "re": "Nó có thể thực hiện nhiều tác vụ song song hiệu quả hơn."
  },
  {
    "con": "Khi sử dụng kỹ thuật pipelining trong bộ xử lý:",
    "re": "Thời gian thực thi của các lệnh sẽ được giảm thiểu."
  },
  {
    "con": "Nếu một chương trình có nhiều vòng lặp lồng ghép:",
    "re": "Hiệu suất có thể bị giảm do xung đột tài nguyên."
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo:",
    "re": "Hệ thống có thể chạy các ứng dụng lớn hơn kích thước bộ nhớ vật lý."
  },
  {
    "con": "Nếu một bộ xử lý hỗ trợ đa luồng:",
    "re": "Nó có thể cải thiện hiệu suất cho các ứng dụng đa nhiệm."
  },
  {
    "con": "Khi sử dụng kỹ thuật phân chia bộ nhớ:",
    "re": "Quản lý bộ nhớ sẽ trở nên hiệu quả hơn."
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ xử lý tăng lên:",
    "re": "Hiệu suất xử lý có thể được cải thiện, nhưng tiêu thụ năng lượng cũng sẽ tăng."
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ tăng lên"
  },
  {
    "con": "Khi bộ nhớ cache có dung lượng lớn hơn",
    "re": "Thời gian truy cập dữ liệu sẽ giảm"
  },
  {
    "con": "Nếu kiến trúc máy tính sử dụng pipelining",
    "re": "Tốc độ xử lý lệnh sẽ được cải thiện"
  },
  {
    "con": "Khi sử dụng bộ nhớ RAM tốc độ cao hơn",
    "re": "Thời gian truy cập dữ liệu sẽ nhanh hơn"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc RISC",
    "re": "Số lượng lệnh sẽ ít hơn nhưng mỗi lệnh sẽ thực hiện nhanh hơn"
  },
  {
    "con": "Khi có nhiều bus dữ liệu trong hệ thống",
    "re": "Băng thông truyền tải dữ liệu sẽ tăng lên"
  },
  {
    "con": "Nếu một hệ thống sử dụng kỹ thuật phân chia thời gian (time-sharing)",
    "re": "Nhiều người dùng có thể sử dụng tài nguyên máy tính đồng thời"
  },
  {
    "con": "Khi một hệ thống có khả năng xử lý song song",
    "re": "Thời gian hoàn thành tác vụ sẽ giảm"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa xử lý",
    "re": "Khả năng mở rộng và hiệu suất sẽ được cải thiện"
  },
  {
    "con": "Trong hệ La mã số MLD nhận giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn sẽ giảm thiểu thời gian truy cập dữ liệu",
    "re": "Tốc độ xử lý của CPU sẽ tăng lên"
  },
  {
    "con": "Sử dụng kiến trúc RISC thay vì CISC sẽ đơn giản hóa thiết kế bộ xử lý",
    "re": "Thời gian phát triển và chi phí sản xuất sẽ giảm"
  },
  {
    "con": "Khi tăng tốc độ xung nhịp của CPU",
    "re": "Hiệu suất xử lý sẽ tăng lên, nhưng tiêu thụ năng lượng cũng sẽ tăng"
  },
  {
    "con": "Sử dụng bus dữ liệu rộng hơn sẽ cho phép truyền tải nhiều dữ liệu hơn trong một lần",
    "re": "Băng thông của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo",
    "re": "Hệ thống có thể chạy nhiều ứng dụng hơn so với dung lượng RAM vật lý"
  },
  {
    "con": "Nếu một hệ thống có nhiều card đồ họa",
    "re": "Khả năng xử lý đồ họa và tính toán song song sẽ được nâng cao"
  },
  {
    "con": "Khi sử dụng kiến trúc đa tầng trong thiết kế hệ thống",
    "re": "Tính linh hoạt và khả năng mở rộng của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Nếu bộ xử lý hỗ trợ đa luồng",
    "re": "Nó có thể xử lý nhiều tác vụ hơn trong cùng một thời gian"
  },
  {
    "con": "Khi sử dụng công nghệ FPGA trong thiết kế phần cứng",
    "re": "Thời gian phát triển sản phẩm sẽ được rút ngắn và tính linh hoạt sẽ tăng lên"
  },
  {
    "con": "Trong hệ La mã số DLL nhận giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ tăng lên"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn sẽ giảm thiểu thời gian truy cập dữ liệu",
    "re": "Tốc độ xử lý của CPU sẽ được cải thiện"
  },
  {
    "con": "Sử dụng kiến trúc RISC thay vì CISC sẽ dẫn đến số lượng lệnh đơn giản hơn",
    "re": "Thời gian thực thi của chương trình sẽ giảm"
  },
  {
    "con": "Khi tăng tốc độ xung nhịp của CPU mà không thay đổi kiến trúc",
    "re": "Nhiệt độ của CPU sẽ tăng lên"
  },
  {
    "con": "Sử dụng bus dữ liệu rộng hơn sẽ cho phép truyền tải nhiều dữ liệu hơn cùng một lúc",
    "re": "Băng thông của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo, hệ thống sẽ sử dụng ổ cứng để mở rộng bộ nhớ RAM",
    "re": "Khả năng chạy nhiều ứng dụng cùng lúc sẽ tăng lên"
  },
  {
    "con": "Nếu một hệ thống có nhiều card đồ họa",
    "re": "Khả năng xử lý đồ họa và tính toán song song sẽ được cải thiện"
  },
  {
    "con": "Khi sử dụng kiến trúc đa tầng cho hệ thống",
    "re": "Khả năng mở rộng và bảo trì của hệ thống sẽ tốt hơn"
  },
  {
    "con": "Nếu bộ xử lý sử dụng công nghệ siêu phân luồng",
    "re": "Số lượng tác vụ có thể thực thi đồng thời sẽ tăng lên"
  },
  {
    "con": "Khi giảm độ trễ của bus hệ thống",
    "re": "Tốc độ truyền dữ liệu giữa các thành phần sẽ được cải thiện"
  },
  {
    "con": "Trong hệ La mã số MMCMLXXVI nhận giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "CPU có nhiều lõi xử lý hơn",
    "re": "Có khả năng thực hiện nhiều tác vụ song song hơn"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn",
    "re": "Thời gian truy cập dữ liệu sẽ nhanh hơn"
  },
  {
    "con": "Kiến trúc Harvard được sử dụng",
    "re": "Có thể truy cập đồng thời bộ nhớ chương trình và bộ nhớ dữ liệu"
  },
  {
    "con": "Sử dụng bộ xử lý 64-bit",
    "re": "Có thể xử lý dữ liệu lớn hơn và tăng hiệu suất cho các ứng dụng yêu cầu cao"
  },
  {
    "con": "Tăng tốc độ xung nhịp của CPU",
    "re": "Tăng khả năng xử lý của CPU trong cùng một khoảng thời gian"
  },
  {
    "con": "Sử dụng kiến trúc RISC",
    "re": "Giảm độ phức tạp của các lệnh và tăng tốc độ thực thi"
  },
  {
    "con": "Sử dụng bus dữ liệu rộng hơn",
    "re": "Tăng băng thông truyền tải dữ liệu giữa các thành phần"
  },
  {
    "con": "Sử dụng kỹ thuật pipelining",
    "re": "Tăng hiệu suất xử lý bằng cách cho phép nhiều lệnh được thực hiện đồng thời"
  },
  {
    "con": "Sử dụng bộ nhớ ảo",
    "re": "Cho phép hệ thống sử dụng nhiều bộ nhớ hơn so với bộ nhớ vật lý thực tế"
  },
  {
    "con": "Trong hệ nhị phân số 11101.11(2) tương ứng với giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý sử dụng kiến trúc RISC sẽ có số lượng lệnh đơn giản hơn kiến trúc CISC,",
    "re": "thời gian thực thi lệnh sẽ nhanh hơn."
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache mà không thay đổi tốc độ truy cập bộ nhớ chính,",
    "re": "hiệu suất của hệ thống sẽ được cải thiện."
  },
  {
    "con": "Nếu một hệ thống sử dụng bus dữ liệu rộng hơn,",
    "re": "băng thông truyền tải dữ liệu sẽ tăng lên."
  },
  {
    "con": "Khi sử dụng kỹ thuật pipelining trong bộ xử lý,",
    "re": "tốc độ xử lý các lệnh sẽ được cải thiện."
  },
  {
    "con": "Nếu một chương trình có nhiều vòng lặp lồng ghép,",
    "re": "thì hiệu suất sẽ bị giảm do xung đột tài nguyên."
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo,",
    "re": "hệ thống có thể chạy nhiều ứng dụng hơn so với dung lượng bộ nhớ vật lý."
  },
  {
    "con": "Nếu một hệ thống có nhiều lõi xử lý,",
    "re": "thì khả năng xử lý đa nhiệm sẽ được cải thiện."
  },
  {
    "con": "Khi sử dụng kiến trúc đa xử lý,",
    "re": "các tác vụ có thể được thực hiện song song, giảm thời gian hoàn thành."
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ xử lý tăng lên,",
    "re": "thì khả năng xử lý của bộ xử lý cũng sẽ tăng theo."
  },
  {
    "con": "Trong hệ nhị phân số 10101.11(2) tương ứng với giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC,",
    "re": "thì hiệu suất thực thi lệnh có thể cao hơn do đơn giản hóa trong thiết kế."
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache,",
    "re": "thì khả năng truy cập dữ liệu nhanh chóng sẽ được cải thiện."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi,",
    "re": "thì khả năng xử lý đồng thời các tác vụ sẽ được nâng cao."
  },
  {
    "con": "Khi sử dụng bus dữ liệu rộng hơn,",
    "re": "thì băng thông truyền tải dữ liệu giữa các thành phần sẽ tăng lên."
  },
  {
    "con": "Nếu một bộ xử lý có tốc độ xung nhịp cao hơn,",
    "re": "thì khả năng thực hiện các phép toán trong một đơn vị thời gian sẽ tăng lên."
  },
  {
    "con": "Khi áp dụng kỹ thuật pipelining trong bộ xử lý,",
    "re": "thì hiệu suất thực thi các lệnh sẽ được cải thiện nhờ vào việc xử lý song song."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo,",
    "re": "thì nó có thể chạy các ứng dụng lớn hơn dung lượng bộ nhớ vật lý."
  },
  {
    "con": "Khi sử dụng kỹ thuật phân chia thời gian trong CPU,",
    "re": "thì nhiều tiến trình có thể được thực thi đồng thời trên cùng một lõi."
  },
  {
    "con": "Nếu một hệ thống có kiến trúc SIMD,",
    "re": "thì nó có thể xử lý nhiều dữ liệu cùng một lúc, tăng tốc độ xử lý cho các tác vụ tính toán lớn."
  },
  {
    "con": "Trong hệ nhị phân số 10101.01(2) tương ứng với giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý sử dụng kiến trúc RISC sẽ có số lượng lệnh ít hơn kiến trúc CISC.",
    "re": "Hiệu suất thực thi cao hơn trong nhiều trường hợp"
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache, thời gian truy cập dữ liệu sẽ giảm.",
    "re": "Tăng hiệu suất của hệ thống"
  },
  {
    "con": "Nếu một hệ thống có nhiều lõi xử lý, thì khả năng xử lý đa nhiệm sẽ được cải thiện.",
    "re": "Tăng cường hiệu suất tổng thể của hệ thống"
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo, nếu không đủ bộ nhớ vật lý, thì hệ thống sẽ sử dụng ổ đĩa cứng để lưu trữ tạm thời.",
    "re": "Giảm hiệu suất do thời gian truy cập lâu hơn"
  },
  {
    "con": "Nếu một kiến trúc máy tính sử dụng pipelining, thì thời gian thực hiện lệnh sẽ được giảm thiểu.",
    "re": "Tăng tốc độ xử lý tổng thể"
  },
  {
    "con": "Khi sử dụng bus dữ liệu rộng hơn, thì băng thông truyền tải dữ liệu sẽ tăng lên.",
    "re": "Cải thiện hiệu suất truyền tải dữ liệu"
  },
  {
    "con": "Nếu một hệ thống sử dụng công nghệ siêu phân luồng (Hyper-Threading), thì số lượng luồng thực thi có thể tăng lên.",
    "re": "Tăng cường khả năng xử lý đồng thời"
  },
  {
    "con": "Khi một bộ xử lý có tốc độ xung nhịp cao hơn, thì khả năng thực hiện lệnh trong một khoảng thời gian nhất định sẽ tăng lên.",
    "re": "Cải thiện hiệu suất xử lý"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi, thì khả năng xử lý song song sẽ được tối ưu hóa.",
    "re": "Tăng cường hiệu suất cho các ứng dụng đa nhiệm"
  },
  {
    "con": "Trong hệ nhị phân số 11101.01(2) tương ứng với giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC,",
    "re": "thì hiệu suất thực thi lệnh có thể cao hơn do đơn giản hóa trong thiết kế."
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache,",
    "re": "thì khả năng truy cập dữ liệu nhanh chóng sẽ được cải thiện, giảm thiểu thời gian truy cập bộ nhớ chính."
  },
  {
    "con": "Nếu sử dụng kiến trúc đa lõi,",
    "re": "thì khả năng xử lý đồng thời nhiều tác vụ sẽ được nâng cao, cải thiện hiệu suất tổng thể của hệ thống."
  },
  {
    "con": "Khi sử dụng bus dữ liệu rộng hơn,",
    "re": "thì băng thông truyền tải dữ liệu giữa các thành phần trong hệ thống sẽ tăng lên."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo,",
    "re": "thì nó có thể chạy các chương trình lớn hơn kích thước bộ nhớ vật lý của nó."
  },
  {
    "con": "Khi áp dụng kỹ thuật pipelining trong bộ xử lý,",
    "re": "thì hiệu suất thực thi lệnh sẽ được cải thiện nhờ vào việc thực hiện nhiều giai đoạn của lệnh song song."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Harvard,",
    "re": "thì nó có thể truy cập đồng thời bộ nhớ lệnh và bộ nhớ dữ liệu, dẫn đến hiệu suất cao hơn."
  },
  {
    "con": "Khi sử dụng kỹ thuật phân chia tải (load balancing) trong hệ thống đa xử lý,",
    "re": "thì hiệu suất tổng thể của hệ thống sẽ được tối ưu hóa, giảm thiểu tình trạng tắc nghẽn."
  },
  {
    "con": "Nếu một bộ xử lý có tốc độ xung nhịp cao hơn,",
    "re": "thì khả năng xử lý các lệnh trong một đơn vị thời gian sẽ tăng lên."
  },
  {
    "con": "Trong hệ nhị phân số 10111.1(2) tương ứng với giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC,",
    "re": "thì hiệu suất thực thi lệnh có thể cao hơn do đơn giản hóa trong thiết kế."
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache,",
    "re": "thì khả năng truy cập dữ liệu nhanh chóng sẽ được cải thiện, giảm thiểu thời gian truy cập bộ nhớ chính."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi,",
    "re": "thì khả năng xử lý đồng thời nhiều tác vụ sẽ được nâng cao."
  },
  {
    "con": "Khi sử dụng bus dữ liệu rộng hơn,",
    "re": "thì băng thông truyền tải dữ liệu giữa các thành phần sẽ tăng lên."
  },
  {
    "con": "Nếu một bộ xử lý có tốc độ xung nhịp cao hơn,",
    "re": "thì khả năng thực hiện các phép toán trong một khoảng thời gian ngắn hơn sẽ được cải thiện."
  },
  {
    "con": "Khi áp dụng kỹ thuật pipelining trong xử lý lệnh,",
    "re": "thì hiệu suất tổng thể của bộ xử lý sẽ được cải thiện do giảm thời gian chờ giữa các giai đoạn thực thi."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo,",
    "re": "thì khả năng sử dụng bộ nhớ vật lý sẽ được tối ưu hóa, cho phép chạy nhiều ứng dụng hơn cùng lúc."
  },
  {
    "con": "Khi sử dụng kiến trúc Harvard,",
    "re": "thì tốc độ truy cập dữ liệu và lệnh có thể được cải thiện do có hai bus riêng biệt."
  },
  {
    "con": "Nếu một hệ thống có khả năng xử lý song song,",
    "re": "thì hiệu suất tổng thể sẽ cao hơn so với xử lý tuần tự trong nhiều tác vụ tính toán."
  },
  {
    "con": "Trong hệ nhị phân số 11001.01(2) tương ứng với giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý sử dụng kiến trúc RISC sẽ có số lượng lệnh đơn giản hơn kiến trúc CISC.",
    "re": "Hiệu suất thực thi cao hơn trong nhiều trường hợp."
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache, thời gian truy cập dữ liệu sẽ giảm.",
    "re": "Hiệu suất của hệ thống sẽ được cải thiện."
  },
  {
    "con": "Nếu số lượng lõi trong bộ xử lý tăng lên mà không tăng tần số xung nhịp.",
    "re": "Khả năng xử lý đa nhiệm sẽ được cải thiện."
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo, hệ thống có thể sử dụng không gian lưu trữ lớn hơn bộ nhớ vật lý.",
    "re": "Điều này giúp chạy nhiều ứng dụng hơn đồng thời."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc pipelining, các lệnh sẽ được thực thi song song.",
    "re": "Tăng tốc độ xử lý tổng thể của bộ xử lý."
  },
  {
    "con": "Khi sử dụng bus dữ liệu rộng hơn, băng thông truyền tải dữ liệu sẽ tăng.",
    "re": "Giúp cải thiện hiệu suất truyền tải dữ liệu giữa các thành phần."
  },
  {
    "con": "Nếu một chương trình có nhiều vòng lặp lồng ghép, hiệu suất sẽ bị ảnh hưởng.",
    "re": "Thời gian thực thi sẽ tăng lên do độ trễ."
  },
  {
    "con": "Khi sử dụng công nghệ siêu phân luồng (Hyper-Threading), mỗi lõi có thể xử lý nhiều luồng đồng thời.",
    "re": "Tăng cường hiệu suất trong các tác vụ đa nhiệm."
  },
  {
    "con": "Nếu một hệ thống có kiến trúc đa xử lý, khả năng mở rộng sẽ cao hơn.",
    "re": "Hệ thống có thể xử lý khối lượng công việc lớn hơn."
  },
  {
    "con": "Trong hệ nhị phân số 11001.11(2) tương ứng với giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "CPU có nhiều lõi hơn thì khả năng xử lý đa nhiệm sẽ tốt hơn",
    "re": "Hiệu suất xử lý tăng lên"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn thì thời gian truy cập dữ liệu sẽ nhanh hơn",
    "re": "Tăng tốc độ xử lý của CPU"
  },
  {
    "con": "Sử dụng kiến trúc RISC thay vì CISC thì số lượng lệnh thực thi sẽ giảm",
    "re": "Tăng hiệu quả sử dụng tài nguyên"
  },
  {
    "con": "Khi tần số xung nhịp của CPU tăng lên thì hiệu suất xử lý cũng sẽ tăng",
    "re": "Thời gian thực hiện lệnh giảm"
  },
  {
    "con": "Nếu có nhiều bus dữ liệu hơn thì băng thông truyền tải dữ liệu sẽ cao hơn",
    "re": "Giảm thiểu tắc nghẽn dữ liệu"
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo thì dung lượng bộ nhớ khả dụng sẽ tăng lên",
    "re": "Giúp chạy nhiều ứng dụng hơn cùng lúc"
  },
  {
    "con": "Nếu sử dụng kỹ thuật pipelining trong CPU thì thời gian thực hiện lệnh sẽ giảm",
    "re": "Tăng cường hiệu suất xử lý"
  },
  {
    "con": "Khi sử dụng hệ thống tản nhiệt hiệu quả hơn thì nhiệt độ của CPU sẽ giảm",
    "re": "Tăng tuổi thọ và hiệu suất của CPU"
  },
  {
    "con": "Nếu sử dụng SSD thay vì HDD thì tốc độ truy cập dữ liệu sẽ nhanh hơn",
    "re": "Cải thiện hiệu suất tổng thể của hệ thống"
  },
  {
    "con": "Trong hệ đếm bát phân, số 235.64(8) tương ứng với giá trị thập phân nào trong các giá trị sau đây",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC",
    "re": "Điều này giúp tăng tốc độ thực thi lệnh"
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache",
    "re": "Thời gian truy cập dữ liệu sẽ giảm"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi",
    "re": "Nó có thể thực hiện nhiều tác vụ song song hơn"
  },
  {
    "con": "Khi sử dụng bus dữ liệu rộng hơn",
    "re": "Băng thông truyền tải dữ liệu sẽ tăng lên"
  },
  {
    "con": "Nếu một chương trình sử dụng nhiều biến toàn cục",
    "re": "Thời gian truy cập bộ nhớ có thể tăng lên do xung đột"
  },
  {
    "con": "Khi sử dụng kỹ thuật pipelining trong CPU",
    "re": "Hiệu suất xử lý có thể được cải thiện"
  },
  {
    "con": "Nếu một hệ thống có nhiều tầng bộ nhớ",
    "re": "Thời gian truy cập dữ liệu sẽ phụ thuộc vào vị trí của dữ liệu trong các tầng"
  },
  {
    "con": "Khi sử dụng kiến trúc Harvard",
    "re": "Bộ nhớ cho dữ liệu và lệnh được tách biệt"
  },
  {
    "con": "Nếu một CPU có tốc độ xung nhịp cao hơn",
    "re": "Nó có khả năng thực hiện nhiều phép toán hơn trong một giây"
  },
  {
    "con": "Trong hệ đếm bát phân số 237.64(8) tương ứng với giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "CPU có nhiều lõi hơn thì khả năng xử lý đa nhiệm sẽ tốt hơn",
    "re": "Hiệu suất xử lý tăng lên"
  },
  {
    "con": "Bộ nhớ cache lớn hơn thì thời gian truy cập dữ liệu sẽ nhanh hơn",
    "re": "Tăng tốc độ xử lý của CPU"
  },
  {
    "con": "Sử dụng kiến trúc RISC thay vì CISC thì số lượng lệnh thực thi sẽ giảm",
    "re": "Tăng hiệu quả sử dụng tài nguyên"
  },
  {
    "con": "Tăng băng thông bus dữ liệu thì khả năng truyền tải dữ liệu giữa các thành phần sẽ nhanh hơn",
    "re": "Giảm độ trễ trong hệ thống"
  },
  {
    "con": "Sử dụng bộ điều khiển DMA thì CPU sẽ không cần phải quản lý từng byte dữ liệu",
    "re": "Giải phóng tài nguyên cho các tác vụ khác"
  },
  {
    "con": "Nếu sử dụng bộ nhớ ảo thì hệ thống có thể chạy nhiều ứng dụng hơn so với bộ nhớ vật lý",
    "re": "Tăng khả năng đa nhiệm"
  },
  {
    "con": "Nếu tần số xung nhịp của CPU cao hơn thì tốc độ xử lý sẽ nhanh hơn",
    "re": "Tăng hiệu suất tính toán"
  },
  {
    "con": "Nếu sử dụng kiến trúc đa xử lý thì khả năng xử lý song song sẽ được cải thiện",
    "re": "Tăng hiệu suất tổng thể của hệ thống"
  },
  {
    "con": "Nếu hệ thống có nhiều loại bộ nhớ khác nhau thì khả năng truy cập dữ liệu sẽ linh hoạt hơn",
    "re": "Tối ưu hóa hiệu suất hệ thống"
  },
  {
    "con": "Trong hệ đếm bát phân số 237.04(8) tương ứng với giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "CPU có nhiều lõi hơn thì khả năng xử lý đa nhiệm sẽ tốt hơn",
    "re": "Hiệu suất xử lý tăng lên"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn thì tốc độ truy cập dữ liệu sẽ nhanh hơn",
    "re": "Thời gian truy cập giảm"
  },
  {
    "con": "Sử dụng kiến trúc RISC thay vì CISC thì số lượng lệnh thực thi sẽ giảm",
    "re": "Hiệu suất xử lý tăng lên"
  },
  {
    "con": "Tăng băng thông bus dữ liệu thì khả năng truyền tải dữ liệu giữa các thành phần sẽ nhanh hơn",
    "re": "Hiệu suất hệ thống cải thiện"
  },
  {
    "con": "Sử dụng bộ nhớ DDR4 thay vì DDR3 thì tốc độ truyền dữ liệu sẽ cao hơn",
    "re": "Hiệu suất bộ nhớ tăng"
  },
  {
    "con": "Số lượng transistor trên chip tăng lên thì khả năng xử lý và hiệu suất sẽ cao hơn",
    "re": "Tăng cường khả năng tính toán"
  },
  {
    "con": "Sử dụng công nghệ siêu phân luồng (Hyper-Threading) thì số lượng luồng xử lý sẽ tăng lên",
    "re": "Tăng cường khả năng đa nhiệm"
  },
  {
    "con": "Thiết kế kiến trúc đa lõi thì khả năng xử lý song song sẽ tốt hơn",
    "re": "Tăng cường hiệu suất tổng thể"
  },
  {
    "con": "Sử dụng hệ thống làm mát hiệu quả hơn thì tuổi thọ của phần cứng sẽ được kéo dài",
    "re": "Giảm thiểu hư hỏng phần cứng"
  },
  {
    "con": "Trong hệ đếm bát phân số 235.04(8) tương ứng với giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "CPU có nhiều lõi hơn thì khả năng xử lý đa nhiệm sẽ tốt hơn.",
    "re": "Hiệu suất xử lý tăng lên."
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn thì thời gian truy cập dữ liệu sẽ nhanh hơn.",
    "re": "Tăng tốc độ xử lý của CPU."
  },
  {
    "con": "Sử dụng kiến trúc RISC thay vì CISC thì số lượng lệnh thực thi sẽ giảm.",
    "re": "Tăng hiệu suất và giảm độ phức tạp của bộ điều khiển."
  },
  {
    "con": "Tăng băng thông bus dữ liệu thì khả năng truyền tải dữ liệu giữa các thành phần sẽ nhanh hơn.",
    "re": "Giảm thời gian chờ đợi trong quá trình xử lý."
  },
  {
    "con": "Sử dụng bộ nhớ RAM tốc độ cao hơn thì hiệu suất tổng thể của hệ thống sẽ được cải thiện.",
    "re": "Giảm độ trễ trong việc truy cập dữ liệu."
  },
  {
    "con": "Khi số lượng transistor trên chip tăng lên thì khả năng tích hợp nhiều chức năng hơn sẽ khả thi.",
    "re": "Tăng cường khả năng xử lý và tiết kiệm không gian."
  },
  {
    "con": "Sử dụng kiến trúc đa lõi thì khả năng xử lý song song sẽ được cải thiện.",
    "re": "Tăng hiệu suất cho các ứng dụng đa nhiệm."
  },
  {
    "con": "Khi sử dụng bộ điều khiển trực tiếp thay vì bộ điều khiển gián tiếp thì thời gian phản hồi sẽ nhanh hơn.",
    "re": "Cải thiện hiệu suất của hệ thống."
  },
  {
    "con": "Khi sử dụng công nghệ siêu phân luồng thì số lượng luồng xử lý có thể tăng lên.",
    "re": "Tăng cường khả năng xử lý đồng thời."
  },
  {
    "con": "Trong hệ đếm thập lục phân số 34F5(16) tương ứng với giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "CPU có nhiều lõi xử lý hơn thì khả năng xử lý đa nhiệm sẽ tốt hơn.",
    "re": "Hiệu suất tổng thể của hệ thống sẽ tăng lên."
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn thì thời gian truy cập dữ liệu sẽ giảm.",
    "re": "Hiệu suất của CPU sẽ được cải thiện."
  },
  {
    "con": "Sử dụng kiến trúc RISC thay vì CISC thì số lượng chu kỳ đồng hồ cần thiết để thực hiện một lệnh sẽ giảm.",
    "re": "Tốc độ thực thi chương trình sẽ nhanh hơn."
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng lớn hơn thì lượng dữ liệu truyền tải trong một lần sẽ tăng.",
    "re": "Băng thông của hệ thống sẽ được cải thiện."
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo thì dung lượng bộ nhớ khả dụng cho ứng dụng sẽ tăng lên.",
    "re": "Người dùng có thể chạy nhiều ứng dụng hơn cùng một lúc."
  },
  {
    "con": "Nếu tần số xung nhịp của CPU tăng thì khả năng xử lý của CPU cũng sẽ tăng.",
    "re": "Hiệu suất tính toán của hệ thống sẽ được cải thiện."
  },
  {
    "con": "Khi sử dụng kiến trúc đa xử lý thì khả năng xử lý song song sẽ được tối ưu hóa.",
    "re": "Thời gian hoàn thành tác vụ sẽ giảm."
  },
  {
    "con": "Nếu sử dụng SSD thay vì HDD thì tốc độ truy cập dữ liệu sẽ nhanh hơn.",
    "re": "Thời gian khởi động hệ điều hành sẽ giảm."
  },
  {
    "con": "Khi áp dụng kỹ thuật pipelining trong CPU thì số lượng lệnh có thể thực thi đồng thời sẽ tăng.",
    "re": "Hiệu suất tổng thể của CPU sẽ được cải thiện."
  },
  {
    "con": "Trong hệ đếm thập lục phân số 44C5(16) tương ứng với giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý sử dụng kiến trúc RISC sẽ có số lượng lệnh đơn giản hơn so với kiến trúc CISC.",
    "re": "Hiệu suất thực thi cao hơn trong nhiều trường hợp"
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache, thời gian truy cập dữ liệu sẽ giảm.",
    "re": "Hiệu suất của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi, thì khả năng xử lý đồng thời sẽ tăng lên.",
    "re": "Tăng cường hiệu suất cho các ứng dụng đa nhiệm"
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo, nếu không đủ bộ nhớ vật lý, thì hệ thống sẽ sử dụng ổ đĩa cứng để lưu trữ dữ liệu tạm thời.",
    "re": "Có thể dẫn đến giảm hiệu suất do thời gian truy cập lâu hơn"
  },
  {
    "con": "Nếu một vi xử lý có tốc độ xung nhịp cao hơn, thì khả năng xử lý lệnh trong một giây sẽ tăng lên.",
    "re": "Tuy nhiên, hiệu suất thực tế còn phụ thuộc vào nhiều yếu tố khác"
  },
  {
    "con": "Khi sử dụng bus dữ liệu rộng hơn, thì khả năng truyền tải dữ liệu trong một lần sẽ tăng lên.",
    "re": "Giúp cải thiện băng thông của hệ thống"
  },
  {
    "con": "Nếu một hệ thống có nhiều tầng bộ nhớ, thì việc truy cập dữ liệu sẽ phụ thuộc vào vị trí của dữ liệu trong các tầng bộ nhớ.",
    "re": "Thời gian truy cập sẽ khác nhau tùy thuộc vào tầng bộ nhớ"
  },
  {
    "con": "Khi sử dụng kỹ thuật pipelining trong bộ xử lý, thì thời gian thực thi của các lệnh sẽ được giảm thiểu.",
    "re": "Giúp tăng cường hiệu suất tổng thể của bộ xử lý"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc phân tán, thì khả năng mở rộng sẽ cao hơn so với kiến trúc tập trung.",
    "re": "Giúp đáp ứng tốt hơn với nhu cầu tăng trưởng"
  },
  {
    "con": "Trong hệ đếm thập lục phân số 345F(16) tương ứng với giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "CPU có nhiều lõi hơn thì khả năng xử lý đa nhiệm sẽ tốt hơn",
    "re": "Hiệu suất xử lý tăng lên"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn thì tốc độ truy cập dữ liệu sẽ nhanh hơn",
    "re": "Thời gian truy cập giảm"
  },
  {
    "con": "Sử dụng kiến trúc RISC thay vì CISC thì số lượng lệnh thực thi sẽ giảm",
    "re": "Hiệu suất xử lý tăng lên do đơn giản hóa lệnh"
  },
  {
    "con": "Khi tăng tần số xung nhịp của CPU thì hiệu suất xử lý sẽ tăng lên",
    "re": "Thời gian thực hiện lệnh giảm"
  },
  {
    "con": "Sử dụng bộ điều khiển DMA thì CPU sẽ không phải xử lý từng byte dữ liệu",
    "re": "Tăng hiệu suất tổng thể của hệ thống"
  },
  {
    "con": "Khi sử dụng bus dữ liệu rộng hơn thì băng thông truyền tải dữ liệu sẽ cao hơn",
    "re": "Tốc độ truyền tải dữ liệu tăng"
  },
  {
    "con": "Nếu hệ thống có nhiều bộ nhớ RAM hơn thì khả năng chạy nhiều ứng dụng cùng lúc sẽ tốt hơn",
    "re": "Giảm thiểu tình trạng thiếu bộ nhớ"
  },
  {
    "con": "Khi sử dụng công nghệ siêu phân luồng (Hyper-Threading) thì số lượng luồng xử lý sẽ tăng lên",
    "re": "Tăng cường khả năng xử lý đồng thời"
  },
  {
    "con": "Nếu sử dụng ổ SSD thay vì HDD thì tốc độ truy cập dữ liệu sẽ nhanh hơn",
    "re": "Thời gian khởi động và tải ứng dụng giảm"
  },
  {
    "con": "Trong hệ đếm thập lục phân (Hexa) số 3CF5(16) tương ứng với giá trị thập phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ vi xử lý sử dụng kiến trúc RISC sẽ có số lượng lệnh ít hơn so với kiến trúc CISC.",
    "re": "Điều này giúp tăng tốc độ thực thi lệnh."
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache, thời gian truy cập dữ liệu sẽ giảm.",
    "re": "Điều này cải thiện hiệu suất của hệ thống."
  },
  {
    "con": "Nếu một hệ thống sử dụng bus dữ liệu rộng hơn, thì băng thông truyền tải dữ liệu sẽ tăng.",
    "re": "Điều này cho phép truyền tải nhiều dữ liệu hơn trong một lần."
  },
  {
    "con": "Khi sử dụng kỹ thuật pipelining trong bộ xử lý, thì hiệu suất thực thi các lệnh sẽ được cải thiện.",
    "re": "Điều này giúp tăng tốc độ xử lý tổng thể của CPU."
  },
  {
    "con": "Nếu một hệ thống có nhiều lõi xử lý (multi-core), thì khả năng xử lý đa nhiệm sẽ tốt hơn.",
    "re": "Điều này cho phép chạy nhiều ứng dụng cùng lúc mà không bị chậm."
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo, thì hệ thống có thể sử dụng không gian bộ nhớ lớn hơn so với bộ nhớ vật lý thực tế.",
    "re": "Điều này giúp quản lý bộ nhớ hiệu quả hơn."
  },
  {
    "con": "Nếu một bộ vi xử lý có tốc độ xung nhịp cao hơn, thì khả năng xử lý của nó sẽ tốt hơn.",
    "re": "Điều này cho phép thực hiện nhiều phép toán hơn trong một khoảng thời gian nhất định."
  },
  {
    "con": "Khi sử dụng kiến trúc máy tính song song, thì hiệu suất xử lý sẽ được cải thiện đáng kể.",
    "re": "Điều này cho phép thực hiện nhiều tác vụ đồng thời."
  },
  {
    "con": "Nếu một hệ thống sử dụng SSD thay vì HDD, thì tốc độ truy cập dữ liệu sẽ nhanh hơn.",
    "re": "Điều này cải thiện thời gian khởi động và tải ứng dụng."
  },
  {
    "con": "Số 267(10) tương ứng với giá trị nhị phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn.",
    "re": "Hiệu suất tổng thể của hệ thống sẽ tăng lên."
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn,",
    "re": "thời gian truy cập dữ liệu sẽ giảm."
  },
  {
    "con": "Nếu sử dụng kiến trúc Harvard,",
    "re": "bộ nhớ cho dữ liệu và chương trình sẽ tách biệt."
  },
  {
    "con": "Nếu tần số xung nhịp của bộ xử lý tăng lên,",
    "re": "tốc độ xử lý của bộ xử lý sẽ tăng lên."
  },
  {
    "con": "Nếu sử dụng kỹ thuật pipelining,",
    "re": "các lệnh sẽ được thực hiện song song, tăng hiệu suất."
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng lớn hơn,",
    "re": "lượng dữ liệu truyền tải trong một lần sẽ tăng lên."
  },
  {
    "con": "Nếu sử dụng bộ nhớ ảo,",
    "re": "hệ thống có thể sử dụng nhiều bộ nhớ hơn so với bộ nhớ vật lý."
  },
  {
    "con": "Nếu có nhiều tầng trong kiến trúc máy tính,",
    "re": "khả năng mở rộng và quản lý tài nguyên sẽ tốt hơn."
  },
  {
    "con": "Nếu sử dụng kiến trúc RISC,",
    "re": "các lệnh sẽ có độ phức tạp thấp hơn và thời gian thực thi nhanh hơn."
  },
  {
    "con": "Số 247(10) tương ứng với giá trị nhị phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC.",
    "re": "Bộ xử lý RISC có thể thực hiện lệnh nhanh hơn do đơn giản hóa."
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache, thời gian truy cập dữ liệu sẽ giảm.",
    "re": "Hiệu suất hệ thống sẽ được cải thiện."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi, thì khả năng xử lý đồng thời sẽ tăng lên.",
    "re": "Điều này giúp cải thiện hiệu suất cho các ứng dụng đa nhiệm."
  },
  {
    "con": "Khi sử dụng bus dữ liệu rộng hơn, băng thông truyền tải dữ liệu sẽ tăng.",
    "re": "Điều này cho phép truyền tải nhiều dữ liệu hơn trong cùng một khoảng thời gian."
  },
  {
    "con": "Nếu một bộ xử lý có tốc độ xung nhịp cao hơn, thì khả năng thực hiện lệnh trong một giây sẽ tăng.",
    "re": "Điều này có thể dẫn đến hiệu suất tổng thể cao hơn."
  },
  {
    "con": "Khi sử dụng kỹ thuật pipelining, thời gian thực hiện lệnh sẽ giảm.",
    "re": "Điều này cho phép nhiều lệnh được xử lý đồng thời."
  },
  {
    "con": "Nếu một hệ thống có bộ nhớ ảo, thì nó có thể sử dụng không gian lưu trữ lớn hơn so với bộ nhớ vật lý.",
    "re": "Điều này giúp chạy nhiều ứng dụng hơn mà không gặp phải vấn đề thiếu bộ nhớ."
  },
  {
    "con": "Khi sử dụng kiến trúc Harvard, bộ nhớ chương trình và bộ nhớ dữ liệu được tách biệt.",
    "re": "Điều này cho phép truy cập đồng thời vào cả hai loại bộ nhớ."
  },
  {
    "con": "Nếu một hệ thống sử dụng kỹ thuật phân chia thời gian, thì nhiều người dùng có thể sử dụng tài nguyên hệ thống đồng thời.",
    "re": "Điều này giúp tối ưu hóa việc sử dụng tài nguyên."
  },
  {
    "con": "Số 285(10) tương ứng với giá trị nhị phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn sẽ giảm thiểu thời gian truy cập dữ liệu",
    "re": "Tốc độ xử lý của CPU sẽ tăng lên"
  },
  {
    "con": "Sử dụng kiến trúc RISC thay vì CISC sẽ đơn giản hóa thiết kế bộ xử lý",
    "re": "Thời gian phát triển và chi phí sản xuất sẽ giảm"
  },
  {
    "con": "Tăng băng thông của bus hệ thống sẽ cho phép truyền tải dữ liệu nhanh hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Sử dụng kỹ thuật pipelining trong bộ xử lý sẽ cho phép thực hiện nhiều lệnh đồng thời",
    "re": "Tăng tốc độ xử lý của chương trình"
  },
  {
    "con": "Nếu bộ nhớ RAM có tốc độ cao hơn",
    "re": "Thời gian truy cập dữ liệu sẽ giảm"
  },
  {
    "con": "Sử dụng SSD thay vì HDD sẽ cải thiện tốc độ truy cập dữ liệu",
    "re": "Thời gian khởi động và tải ứng dụng sẽ giảm"
  },
  {
    "con": "Nếu kiến trúc máy tính hỗ trợ đa luồng",
    "re": "Nó sẽ có khả năng xử lý nhiều tác vụ hơn trong cùng một thời điểm"
  },
  {
    "con": "Sử dụng hệ thống làm mát hiệu quả hơn sẽ giúp duy trì nhiệt độ của CPU",
    "re": "Tuổi thọ của bộ xử lý sẽ được kéo dài"
  },
  {
    "con": "Số 277(10) tương ứng với giá trị nhị phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn thì khả năng xử lý đa nhiệm sẽ tốt hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ tăng lên"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn thì thời gian truy cập dữ liệu sẽ nhanh hơn",
    "re": "Hiệu suất của CPU sẽ được cải thiện"
  },
  {
    "con": "Sử dụng kiến trúc RISC thay vì CISC thì số lượng chu kỳ đồng hồ cần thiết để thực hiện một lệnh sẽ giảm",
    "re": "Tốc độ xử lý sẽ nhanh hơn"
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng lớn hơn thì lượng dữ liệu truyền tải trong một lần sẽ tăng",
    "re": "Băng thông của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Nếu sử dụng bộ nhớ RAM tốc độ cao hơn thì thời gian truy cập dữ liệu sẽ giảm",
    "re": "Hiệu suất của ứng dụng sẽ được nâng cao"
  },
  {
    "con": "Nếu có nhiều kênh bộ nhớ thì băng thông bộ nhớ sẽ tăng lên",
    "re": "Hiệu suất tổng thể của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Nếu sử dụng công nghệ siêu phân luồng (Hyper-Threading) thì số lượng luồng xử lý đồng thời sẽ tăng",
    "re": "Khả năng xử lý đa nhiệm sẽ được cải thiện"
  },
  {
    "con": "Nếu sử dụng bộ điều khiển DMA thì CPU sẽ không cần phải quản lý từng truy cập bộ nhớ",
    "re": "Tải trọng công việc của CPU sẽ giảm"
  },
  {
    "con": "Nếu kiến trúc máy tính hỗ trợ 64-bit thì nó có thể xử lý nhiều dữ liệu hơn so với 32-bit",
    "re": "Khả năng xử lý và lưu trữ dữ liệu sẽ được nâng cao"
  },
  {
    "con": "Số 899(10) tương ứng với giá trị bát phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn.",
    "re": "Hiệu suất tổng thể của hệ thống sẽ được cải thiện."
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn sẽ giảm thiểu thời gian truy cập dữ liệu.",
    "re": "Tốc độ xử lý của CPU sẽ tăng lên."
  },
  {
    "con": "Sử dụng kiến trúc RISC thay vì CISC sẽ đơn giản hóa thiết kế bộ xử lý.",
    "re": "Thời gian phát triển và chi phí sản xuất sẽ giảm."
  },
  {
    "con": "Tăng băng thông bus dữ liệu sẽ cho phép truyền tải dữ liệu nhanh hơn giữa các thành phần.",
    "re": "Hiệu suất tổng thể của hệ thống sẽ được cải thiện."
  },
  {
    "con": "Sử dụng kỹ thuật pipelining trong CPU sẽ cho phép thực hiện nhiều lệnh đồng thời.",
    "re": "Tăng tốc độ xử lý của chương trình."
  },
  {
    "con": "Số lượng thanh ghi trong bộ xử lý càng nhiều sẽ giúp giảm thiểu việc truy cập bộ nhớ chính.",
    "re": "Hiệu suất của chương trình sẽ được cải thiện."
  },
  {
    "con": "Sử dụng bộ nhớ ảo sẽ cho phép hệ thống sử dụng nhiều bộ nhớ hơn so với bộ nhớ vật lý có sẵn.",
    "re": "Khả năng chạy nhiều ứng dụng cùng lúc sẽ được nâng cao."
  },
  {
    "con": "Thiết kế kiến trúc đa lõi sẽ cho phép xử lý song song hiệu quả hơn.",
    "re": "Tăng cường khả năng xử lý của hệ thống."
  },
  {
    "con": "Sử dụng công nghệ siêu phân luồng (Hyper-Threading) sẽ cho phép mỗi lõi xử lý nhiều luồng cùng lúc.",
    "re": "Tăng cường hiệu suất xử lý trong các tác vụ đa nhiệm."
  },
  {
    "con": "Số 859(10) tương ứng với giá trị bát phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Sử dụng bộ nhớ cache sẽ giảm thời gian truy cập dữ liệu",
    "re": "Tốc độ xử lý của CPU sẽ tăng lên"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ cho dữ liệu và lệnh",
    "re": "Có thể cải thiện hiệu suất so với kiến trúc Von Neumann"
  },
  {
    "con": "Tăng băng thông bus giữa các thành phần",
    "re": "Giảm thiểu độ trễ trong việc truyền dữ liệu"
  },
  {
    "con": "Sử dụng kỹ thuật pipelining trong CPU",
    "re": "Tăng cường khả năng xử lý lệnh song song"
  },
  {
    "con": "Số lượng transistor trên chip tăng lên",
    "re": "Khả năng xử lý và hiệu suất của chip sẽ được cải thiện"
  },
  {
    "con": "Sử dụng bộ điều khiển DMA",
    "re": "Giải phóng CPU khỏi việc quản lý truyền dữ liệu"
  },
  {
    "con": "Thiết kế kiến trúc đa lõi",
    "re": "Có thể xử lý nhiều luồng dữ liệu cùng một lúc"
  },
  {
    "con": "Sử dụng kỹ thuật phân chia thời gian trong CPU",
    "re": "Tăng cường khả năng xử lý nhiều tác vụ đồng thời"
  },
  {
    "con": "Số 799(10) tương ứng với giá trị bát phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn sẽ giảm thiểu thời gian truy cập dữ liệu",
    "re": "Tốc độ xử lý của CPU sẽ tăng lên"
  },
  {
    "con": "Số lượng đường dẫn dữ liệu trong kiến trúc vi xử lý tăng lên",
    "re": "Khả năng xử lý song song của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Sử dụng kiến trúc Harvard thay vì kiến trúc Von Neumann",
    "re": "Tốc độ truy cập bộ nhớ sẽ được cải thiện do không có xung đột giữa dữ liệu và lệnh"
  },
  {
    "con": "Tăng tần số xung nhịp của bộ xử lý",
    "re": "Hiệu suất xử lý sẽ tăng lên, nhưng có thể dẫn đến tiêu thụ năng lượng cao hơn"
  },
  {
    "con": "Sử dụng kỹ thuật pipelining trong thiết kế CPU",
    "re": "Tăng cường khả năng xử lý lệnh đồng thời và giảm thời gian thực hiện"
  },
  {
    "con": "Số lượng bit trong bus dữ liệu tăng lên",
    "re": "Khả năng truyền tải dữ liệu giữa các thành phần sẽ được cải thiện"
  },
  {
    "con": "Sử dụng bộ điều khiển DMA trong hệ thống",
    "re": "Giảm tải cho CPU và tăng tốc độ truyền dữ liệu giữa các thiết bị ngoại vi"
  },
  {
    "con": "Sử dụng kiến trúc đa lõi trong thiết kế vi xử lý",
    "re": "Tăng cường khả năng xử lý đa nhiệm và hiệu suất tổng thể của hệ thống"
  },
  {
    "con": "Số 785(10) tương ứng với giá trị bát phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn sẽ giảm thiểu thời gian truy cập dữ liệu",
    "re": "Tốc độ xử lý của CPU sẽ tăng lên"
  },
  {
    "con": "Sử dụng kiến trúc RISC thay vì CISC sẽ đơn giản hóa thiết kế bộ xử lý",
    "re": "Thời gian phát triển và chi phí sản xuất sẽ giảm"
  },
  {
    "con": "Tăng băng thông của bus dữ liệu sẽ cho phép truyền tải dữ liệu nhanh hơn",
    "re": "Hiệu suất của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Sử dụng kỹ thuật pipelining trong bộ xử lý sẽ cho phép thực hiện nhiều lệnh cùng lúc",
    "re": "Tăng cường hiệu suất xử lý của CPU"
  },
  {
    "con": "Sử dụng bộ nhớ ảo sẽ cho phép hệ thống sử dụng nhiều bộ nhớ hơn so với bộ nhớ vật lý",
    "re": "Khả năng chạy nhiều ứng dụng cùng lúc sẽ được cải thiện"
  },
  {
    "con": "Thiết kế kiến trúc đa lõi sẽ cho phép xử lý song song hiệu quả hơn",
    "re": "Tăng cường khả năng xử lý của hệ thống"
  },
  {
    "con": "Sử dụng SSD thay vì HDD sẽ giảm thời gian truy cập dữ liệu",
    "re": "Hiệu suất tổng thể của hệ thống sẽ được nâng cao"
  },
  {
    "con": "Sử dụng các kỹ thuật tối ưu hóa năng lượng trong thiết kế vi mạch sẽ giảm tiêu thụ điện năng",
    "re": "Tuổi thọ của thiết bị sẽ được kéo dài"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC.",
    "re": "Điều này giúp tăng tốc độ thực thi lệnh."
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn,",
    "re": "thì khả năng truy cập dữ liệu nhanh hơn sẽ tăng lên."
  },
  {
    "con": "Kiến trúc đa lõi cho phép xử lý nhiều tác vụ đồng thời,",
    "re": "do đó hiệu suất tổng thể của hệ thống sẽ được cải thiện."
  },
  {
    "con": "Nếu một hệ thống sử dụng bus dữ liệu rộng hơn,",
    "re": "thì băng thông truyền tải dữ liệu sẽ cao hơn."
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ xử lý tăng lên,",
    "re": "thì khả năng xử lý lệnh trong một giây cũng sẽ tăng lên."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo,",
    "re": "thì nó có thể chạy các ứng dụng lớn hơn dung lượng bộ nhớ vật lý."
  },
  {
    "con": "Nếu các lệnh được tối ưu hóa để sử dụng các thanh ghi nhiều hơn,",
    "re": "thì hiệu suất thực thi sẽ được cải thiện."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc pipelining,",
    "re": "thì thời gian thực thi trung bình của các lệnh sẽ giảm."
  },
  {
    "con": "Nếu có nhiều cấp độ bộ nhớ cache,",
    "re": "thì thời gian truy cập dữ liệu sẽ được giảm thiểu."
  },
  {
    "con": "Nếu một hệ thống sử dụng công nghệ SIMD,",
    "re": "thì nó có thể xử lý nhiều dữ liệu cùng một lúc, tăng hiệu suất."
  },
  {
    "con": "Số 865(10) tương ứng với giá trị bát phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC.",
    "re": "Kiến trúc RISC thường có hiệu suất cao hơn trong các ứng dụng yêu cầu tốc độ xử lý nhanh."
  },
  {
    "con": "Bộ nhớ cache có kích thước nhỏ hơn bộ nhớ chính.",
    "re": "Bộ nhớ cache giúp tăng tốc độ truy cập dữ liệu cho CPU."
  },
  {
    "con": "Số lượng bit trong bus dữ liệu càng lớn.",
    "re": "Băng thông truyền tải dữ liệu giữa các thành phần của hệ thống càng cao."
  },
  {
    "con": "Kiến trúc đa lõi cho phép nhiều lõi xử lý hoạt động đồng thời.",
    "re": "Hiệu suất xử lý của hệ thống sẽ được cải thiện trong các tác vụ đa nhiệm."
  },
  {
    "con": "Khi sử dụng kỹ thuật pipelining trong CPU.",
    "re": "Thời gian thực hiện lệnh sẽ được giảm thiểu nhờ vào việc xử lý nhiều lệnh cùng lúc."
  },
  {
    "con": "Khi một hệ thống sử dụng bộ nhớ ảo.",
    "re": "Người dùng có thể chạy nhiều ứng dụng hơn so với dung lượng bộ nhớ vật lý thực tế."
  },
  {
    "con": "Khi tần số xung nhịp của CPU tăng.",
    "re": "Tốc độ xử lý của CPU cũng sẽ tăng lên, dẫn đến hiệu suất cao hơn."
  },
  {
    "con": "Khi sử dụng kiến trúc Harvard.",
    "re": "Bộ xử lý có thể truy cập đồng thời cả bộ nhớ lệnh và bộ nhớ dữ liệu."
  },
  {
    "con": "Khi một hệ thống sử dụng RAID.",
    "re": "Độ tin cậy và hiệu suất của hệ thống lưu trữ sẽ được cải thiện."
  },
  {
    "con": "Khi một chương trình sử dụng nhiều biến toàn cục.",
    "re": "Thời gian truy cập và quản lý bộ nhớ sẽ tăng lên do phải quản lý nhiều biến hơn."
  },
  {
    "con": "Số 841(10) tương ứng với giá trị bát phân nào trong các giá trị sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng hai số nhị phân 1010101(2) và 1101011(2) bằng số nhị phân nào trong các số sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có kích thước lớn hơn bộ nhớ chính",
    "re": "Thời gian truy cập dữ liệu sẽ nhanh hơn"
  },
  {
    "con": "Số lượng lõi xử lý trong CPU tăng",
    "re": "Khả năng xử lý đa nhiệm sẽ được cải thiện"
  },
  {
    "con": "Kiến trúc Harvard được sử dụng",
    "re": "Dữ liệu và lệnh sẽ được lưu trữ trong các bộ nhớ riêng biệt"
  },
  {
    "con": "Tốc độ xung nhịp của CPU tăng",
    "re": "Hiệu suất xử lý của CPU sẽ cao hơn"
  },
  {
    "con": "Sử dụng bộ điều khiển DMA",
    "re": "CPU sẽ giảm tải công việc khi truyền dữ liệu giữa bộ nhớ và thiết bị ngoại vi"
  },
  {
    "con": "Số lượng bit trong bus dữ liệu tăng",
    "re": "Khả năng truyền tải dữ liệu trong một lần sẽ lớn hơn"
  },
  {
    "con": "Sử dụng kiến trúc RISC",
    "re": "Số lượng lệnh đơn giản và thời gian thực thi sẽ ngắn hơn"
  },
  {
    "con": "Sử dụng bộ nhớ ảo",
    "re": "Hệ thống có thể chạy nhiều ứng dụng hơn so với dung lượng bộ nhớ vật lý"
  },
  {
    "con": "Tăng kích thước bộ nhớ cache",
    "re": "Tốc độ truy cập dữ liệu sẽ được cải thiện"
  },
  {
    "con": "Tổng hai số nhị phân 1010101(2) và 1100011(2) bằng số nhị phân nào trong các số sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu kích thước bộ nhớ cache tăng lên thì thời gian truy cập dữ liệu có thể giảm xuống.",
    "re": "Thời gian truy cập dữ liệu có thể giảm"
  },
  {
    "con": "Nếu số lượng lõi trong CPU tăng lên thì khả năng xử lý đa nhiệm sẽ được cải thiện.",
    "re": "Khả năng xử lý đa nhiệm sẽ được cải thiện"
  },
  {
    "con": "Nếu kiến trúc máy tính sử dụng pipelining thì hiệu suất thực thi các lệnh sẽ tăng lên.",
    "re": "Hiệu suất thực thi các lệnh sẽ tăng lên"
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng lớn hơn thì lượng dữ liệu truyền tải trong một lần sẽ tăng lên.",
    "re": "Lượng dữ liệu truyền tải trong một lần sẽ tăng lên"
  },
  {
    "con": "Nếu sử dụng bộ nhớ ảo thì dung lượng bộ nhớ khả dụng cho ứng dụng sẽ tăng lên.",
    "re": "Dung lượng bộ nhớ khả dụng cho ứng dụng sẽ tăng lên"
  },
  {
    "con": "Nếu tần số xung nhịp của CPU tăng lên thì tốc độ xử lý của CPU cũng sẽ tăng lên.",
    "re": "Tốc độ xử lý của CPU sẽ tăng lên"
  },
  {
    "con": "Nếu sử dụng kiến trúc RISC thì số lượng lệnh cần thiết để thực hiện một tác vụ sẽ giảm.",
    "re": "Số lượng lệnh cần thiết để thực hiện một tác vụ sẽ giảm"
  },
  {
    "con": "Nếu hệ thống sử dụng RAID thì độ tin cậy của dữ liệu sẽ được cải thiện.",
    "re": "Độ tin cậy của dữ liệu sẽ được cải thiện"
  },
  {
    "con": "Nếu sử dụng bộ xử lý đa luồng thì hiệu suất của ứng dụng có thể được tối ưu hóa.",
    "re": "Hiệu suất của ứng dụng có thể được tối ưu hóa"
  },
  {
    "con": "Tổng hai số nhị phân 1010101(2) và 1101001(2) bằng số nhị phân nào trong các số sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý sử dụng kiến trúc RISC thì nó sẽ có số lượng lệnh đơn giản hơn so với kiến trúc CISC.",
    "re": "Bộ xử lý RISC thường có hiệu suất cao hơn trong một số ứng dụng."
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn thì thời gian truy cập dữ liệu sẽ giảm.",
    "re": "Hiệu suất hệ thống sẽ được cải thiện."
  },
  {
    "con": "Nếu một hệ thống sử dụng nhiều lõi xử lý thì khả năng xử lý đồng thời sẽ tăng lên.",
    "re": "Tốc độ xử lý tổng thể của hệ thống sẽ được cải thiện."
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng lớn hơn thì lượng dữ liệu truyền tải trong một lần sẽ tăng.",
    "re": "Băng thông của hệ thống sẽ được cải thiện."
  },
  {
    "con": "Nếu một chương trình sử dụng nhiều tài nguyên bộ nhớ thì nó có thể gây ra hiện tượng thrashing.",
    "re": "Hiệu suất của hệ thống sẽ giảm sút."
  },
  {
    "con": "Nếu một hệ thống sử dụng kỹ thuật pipelining thì thời gian thực hiện lệnh sẽ giảm.",
    "re": "Tăng cường hiệu suất xử lý của bộ xử lý."
  },
  {
    "con": "Nếu một vi xử lý có tốc độ xung nhịp cao hơn thì khả năng xử lý lệnh sẽ nhanh hơn.",
    "re": "Hiệu suất tổng thể của vi xử lý sẽ được cải thiện."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa xử lý thì khả năng mở rộng sẽ tốt hơn.",
    "re": "Hệ thống có thể xử lý nhiều tác vụ cùng lúc hiệu quả hơn."
  },
  {
    "con": "Nếu một hệ thống có thiết kế modular thì việc nâng cấp phần cứng sẽ dễ dàng hơn.",
    "re": "Giảm thiểu chi phí và thời gian bảo trì hệ thống."
  },
  {
    "con": "Tổng hai số nhị phân 1011101(2) và 1101011(2) bằng số nhị phân nào trong các số sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ tăng lên"
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache, thời gian truy cập dữ liệu sẽ giảm",
    "re": "Hiệu suất của CPU sẽ được cải thiện"
  },
  {
    "con": "Nếu sử dụng kiến trúc Harvard thay vì kiến trúc Von Neumann",
    "re": "Tốc độ xử lý có thể được cải thiện do không có xung đột giữa dữ liệu và lệnh"
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo, hệ thống có thể chạy nhiều ứng dụng hơn so với bộ nhớ vật lý",
    "re": "Tuy nhiên, hiệu suất có thể bị giảm do truy cập đĩa cứng"
  },
  {
    "con": "Nếu tần số xung nhịp của CPU tăng lên",
    "re": "Thời gian thực hiện mỗi chu kỳ lệnh sẽ giảm"
  },
  {
    "con": "Khi sử dụng kỹ thuật pipelining trong CPU",
    "re": "Số lượng lệnh thực hiện trong một khoảng thời gian sẽ tăng lên"
  },
  {
    "con": "Nếu một hệ thống có bus dữ liệu rộng hơn",
    "re": "Khả năng truyền tải dữ liệu trong một lần sẽ cao hơn"
  },
  {
    "con": "Khi sử dụng các kỹ thuật tối ưu hóa như out-of-order execution",
    "re": "Hiệu suất xử lý của CPU sẽ được cải thiện"
  },
  {
    "con": "Nếu một hệ thống có nhiều loại bộ nhớ khác nhau (cache, RAM, disk)",
    "re": "Thời gian truy cập dữ liệu sẽ phụ thuộc vào loại bộ nhớ được sử dụng"
  },
  {
    "con": "Kết quả cộng hai số nhị phân 1010111(2) và 1101011(2) bằng số nhị phân nào trong các số sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý sử dụng kiến trúc RISC sẽ có số lượng lệnh ít hơn kiến trúc CISC",
    "re": "Kiến trúc RISC thường đơn giản hơn và dễ tối ưu hóa"
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache, thời gian truy cập dữ liệu sẽ giảm",
    "re": "Hiệu suất hệ thống sẽ được cải thiện"
  },
  {
    "con": "Nếu một hệ thống có nhiều lõi xử lý, khả năng xử lý đồng thời sẽ tăng lên",
    "re": "Hiệu suất xử lý đa nhiệm sẽ tốt hơn"
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo, hệ thống có thể chạy nhiều chương trình hơn so với bộ nhớ vật lý",
    "re": "Tính linh hoạt và khả năng sử dụng tài nguyên sẽ cao hơn"
  },
  {
    "con": "Nếu tần số xung nhịp của bộ xử lý tăng, thì hiệu suất xử lý có thể tăng",
    "re": "Tuy nhiên, tiêu thụ năng lượng cũng sẽ tăng theo"
  },
  {
    "con": "Khi sử dụng kiến trúc đa xử lý, việc chia sẻ tài nguyên giữa các lõi sẽ cần được quản lý",
    "re": "Để tránh xung đột và tối ưu hóa hiệu suất"
  },
  {
    "con": "Nếu một hệ thống sử dụng bus dữ liệu rộng hơn, băng thông truyền tải sẽ tăng",
    "re": "Điều này cho phép truyền tải dữ liệu nhanh hơn"
  },
  {
    "con": "Khi sử dụng kỹ thuật pipelining, thời gian thực hiện lệnh sẽ giảm",
    "re": "Nhờ vào việc thực hiện nhiều giai đoạn lệnh đồng thời"
  },
  {
    "con": "Nếu một hệ thống có nhiều tầng bộ nhớ, thì hiệu suất truy cập dữ liệu sẽ được cải thiện",
    "re": "Bằng cách giảm độ trễ truy cập dữ liệu"
  },
  {
    "con": "Tổng hai số nhị phân 1001101(2) và 1101001(2) bằng số nhị phân nào trong các số sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có kích thước lớn hơn bộ nhớ chính",
    "re": "Thời gian truy cập dữ liệu sẽ nhanh hơn"
  },
  {
    "con": "Số lượng lõi trong CPU tăng lên",
    "re": "Khả năng xử lý đa nhiệm sẽ được cải thiện"
  },
  {
    "con": "Sử dụng kiến trúc RISC thay vì CISC",
    "re": "Hiệu suất thực thi các lệnh đơn giản sẽ cao hơn"
  },
  {
    "con": "Tăng băng thông của bus dữ liệu",
    "re": "Tốc độ truyền tải dữ liệu giữa các thành phần sẽ nhanh hơn"
  },
  {
    "con": "Sử dụng kỹ thuật pipelining trong CPU",
    "re": "Tăng cường hiệu suất xử lý lệnh đồng thời"
  },
  {
    "con": "Số lượng bit trong từ dữ liệu tăng lên",
    "re": "Khả năng lưu trữ và xử lý dữ liệu lớn hơn"
  },
  {
    "con": "Sử dụng bộ điều khiển DMA",
    "re": "Giảm tải cho CPU trong việc quản lý truyền dữ liệu"
  },
  {
    "con": "Sử dụng kiến trúc đa xử lý",
    "re": "Tăng cường khả năng xử lý song song"
  },
  {
    "con": "Tối ưu hóa thuật toán truy cập bộ nhớ",
    "re": "Giảm thiểu độ trễ khi truy cập dữ liệu"
  },
  {
    "con": "Tích hai số nhị phân 110(2) và 1011(2) bằng số nhị phân nào trong các số sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ thực hiện nhiều tác vụ đồng thời hơn",
    "re": "Hiệu suất xử lý tăng lên"
  },
  {
    "con": "Sử dụng bộ nhớ cache sẽ giảm thời gian truy cập dữ liệu từ bộ nhớ chính",
    "re": "Tăng tốc độ xử lý của CPU"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ cho dữ liệu và lệnh",
    "re": "Cho phép truy cập đồng thời vào lệnh và dữ liệu"
  },
  {
    "con": "Số lượng bit trong bus dữ liệu càng lớn",
    "re": "Khả năng truyền tải dữ liệu càng cao"
  },
  {
    "con": "Sử dụng pipelining trong CPU",
    "re": "Tăng cường hiệu suất xử lý bằng cách thực hiện nhiều giai đoạn xử lý đồng thời"
  },
  {
    "con": "Bộ xử lý sử dụng kiến trúc RISC",
    "re": "Thực hiện các lệnh đơn giản và nhanh chóng hơn"
  },
  {
    "con": "Số lượng thanh ghi trong CPU càng nhiều",
    "re": "Giảm thiểu số lần truy cập bộ nhớ chính"
  },
  {
    "con": "Sử dụng kỹ thuật phân chia thời gian trong hệ thống đa nhiệm",
    "re": "Cho phép nhiều tiến trình chạy đồng thời trên một CPU"
  },
  {
    "con": "Bộ nhớ ảo cho phép hệ thống sử dụng không gian bộ nhớ lớn hơn bộ nhớ vật lý",
    "re": "Tăng cường khả năng chạy nhiều ứng dụng cùng lúc"
  },
  {
    "con": "Tích hai số nhị phân 1110(2) và 1011(2) bằng số nhị phân nào trong các số sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Sử dụng bộ nhớ cache sẽ giảm thời gian truy cập dữ liệu",
    "re": "Tăng tốc độ xử lý của CPU"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ cho dữ liệu và lệnh",
    "re": "Cho phép CPU truy cập đồng thời cả dữ liệu và lệnh"
  },
  {
    "con": "Số lượng bit trong bus dữ liệu càng lớn",
    "re": "Khả năng truyền tải dữ liệu trong một lần truyền sẽ cao hơn"
  },
  {
    "con": "Sử dụng kỹ thuật pipelining trong CPU",
    "re": "Tăng cường khả năng xử lý song song và giảm thời gian thực hiện lệnh"
  },
  {
    "con": "Bộ nhớ RAM có tốc độ truy cập nhanh hơn bộ nhớ HDD",
    "re": "Cải thiện hiệu suất của các ứng dụng đang chạy"
  },
  {
    "con": "Sử dụng kiến trúc RISC thay vì CISC",
    "re": "Giảm độ phức tạp của các lệnh và tăng tốc độ thực thi"
  },
  {
    "con": "Tăng kích thước bộ nhớ chính",
    "re": "Cho phép lưu trữ nhiều dữ liệu hơn và chạy nhiều ứng dụng cùng lúc"
  },
  {
    "con": "Sử dụng công nghệ đa luồng trong CPU",
    "re": "Tăng cường khả năng xử lý đồng thời và tối ưu hóa hiệu suất"
  },
  {
    "con": "Tích hai số nhị phân 1101(2) và 1011(2) bằng số nhị phân nào trong các số sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ tăng lên"
  },
  {
    "con": "Sử dụng bộ nhớ cache sẽ giảm thời gian truy cập dữ liệu",
    "re": "Tăng tốc độ xử lý của CPU"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ cho dữ liệu và lệnh",
    "re": "Cho phép truy cập đồng thời vào cả dữ liệu và lệnh"
  },
  {
    "con": "Số lượng bit trong bus dữ liệu càng lớn",
    "re": "Khả năng truyền tải dữ liệu trong một lần truyền sẽ cao hơn"
  },
  {
    "con": "Sử dụng pipelining trong CPU",
    "re": "Tăng cường khả năng xử lý song song và hiệu suất"
  },
  {
    "con": "Bộ nhớ RAM có tốc độ truy cập nhanh hơn bộ nhớ HDD",
    "re": "Cải thiện hiệu suất của hệ thống khi chạy ứng dụng"
  },
  {
    "con": "Sử dụng kiến trúc RISC thay vì CISC",
    "re": "Giảm độ phức tạp của bộ lệnh và tăng tốc độ thực thi"
  },
  {
    "con": "Tăng kích thước bộ nhớ chính",
    "re": "Cho phép lưu trữ nhiều dữ liệu hơn và giảm thiểu tình trạng swap"
  },
  {
    "con": "Sử dụng công nghệ đa luồng trong CPU",
    "re": "Tăng cường khả năng xử lý đồng thời và hiệu suất tổng thể"
  },
  {
    "con": "Tích hai số nhị phân 1110(2) và 1010(2) bằng số nhị phân nào trong các số sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn",
    "re": "Tăng hiệu suất tổng thể của hệ thống"
  },
  {
    "con": "Sử dụng bộ nhớ cache sẽ giảm thời gian truy cập dữ liệu",
    "re": "Tăng tốc độ xử lý của CPU"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ cho dữ liệu và lệnh",
    "re": "Cho phép truy cập đồng thời vào cả hai loại bộ nhớ"
  },
  {
    "con": "Số lượng bit trong bus dữ liệu càng lớn",
    "re": "Khả năng truyền tải dữ liệu càng cao"
  },
  {
    "con": "Sử dụng pipelining trong CPU",
    "re": "Tăng cường khả năng xử lý song song"
  },
  {
    "con": "Bộ nhớ RAM có tốc độ cao hơn bộ nhớ HDD",
    "re": "Cải thiện hiệu suất truy cập dữ liệu"
  },
  {
    "con": "Sử dụng kiến trúc RISC",
    "re": "Giảm độ phức tạp của lệnh và tăng tốc độ thực thi"
  },
  {
    "con": "Tăng kích thước bộ nhớ chính",
    "re": "Cho phép lưu trữ nhiều dữ liệu hơn cho các ứng dụng"
  },
  {
    "con": "Sử dụng công nghệ đa luồng",
    "re": "Tối ưu hóa việc sử dụng tài nguyên CPU"
  },
  {
    "con": "Tích hai số nhị phân 1101(2) và 1010(2) bằng số nhị phân nào trong các số sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Sử dụng bộ nhớ cache sẽ giảm thời gian truy cập dữ liệu",
    "re": "Hiệu suất của CPU sẽ tăng lên"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ cho dữ liệu và lệnh",
    "re": "Tốc độ xử lý sẽ nhanh hơn so với kiến trúc Von Neumann"
  },
  {
    "con": "Số lượng bit trong bus dữ liệu càng lớn",
    "re": "Khả năng truyền tải dữ liệu trong một lần sẽ cao hơn"
  },
  {
    "con": "Sử dụng pipelining trong xử lý lệnh",
    "re": "Tăng cường khả năng thực thi đồng thời và giảm thời gian hoàn thành"
  },
  {
    "con": "Tăng tốc độ xung nhịp của CPU",
    "re": "Sẽ làm tăng hiệu suất xử lý của CPU"
  },
  {
    "con": "Sử dụng kiến trúc RISC thay vì CISC",
    "re": "Sẽ đơn giản hóa thiết kế và cải thiện tốc độ thực thi lệnh"
  },
  {
    "con": "Số lượng thanh ghi trong CPU càng nhiều",
    "re": "Sẽ giảm thiểu số lần truy cập bộ nhớ chính"
  },
  {
    "con": "Sử dụng công nghệ đa luồng trong CPU",
    "re": "Sẽ cải thiện khả năng xử lý đồng thời và hiệu suất tổng thể"
  },
  {
    "con": "Số dấu chấm động A được lưu trữ trong máy tính dưới dạng 32 bit sau: 11001001110100011110100000000000, hỏi số A nhận giá trị nào sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn so với kiến trúc CISC:",
    "re": "Điều này giúp tăng tốc độ thực thi lệnh"
  },
  {
    "con": "Khi bộ nhớ cache đầy, bộ nhớ cache sẽ sử dụng chính sách thay thế để quyết định dữ liệu nào sẽ bị xóa:",
    "re": "Điều này có thể ảnh hưởng đến hiệu suất của hệ thống"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi, thì khả năng xử lý đồng thời sẽ được cải thiện:",
    "re": "Điều này giúp tăng hiệu suất cho các ứng dụng đa nhiệm"
  },
  {
    "con": "Khi tốc độ xung nhịp của bộ xử lý tăng lên, thì khả năng xử lý của bộ xử lý cũng sẽ tăng lên:",
    "re": "Điều này có thể dẫn đến việc tiêu thụ điện năng cao hơn"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo, thì nó có thể chạy các ứng dụng lớn hơn dung lượng bộ nhớ vật lý:",
    "re": "Điều này giúp tối ưu hóa việc sử dụng tài nguyên hệ thống"
  },
  {
    "con": "Khi sử dụng kiến trúc pipelining, thì thời gian thực thi của một lệnh sẽ được giảm thiểu:",
    "re": "Điều này giúp tăng hiệu suất tổng thể của bộ xử lý"
  },
  {
    "con": "Nếu một hệ thống có băng thông bộ nhớ cao, thì tốc độ truy cập dữ liệu sẽ nhanh hơn:",
    "re": "Điều này giúp cải thiện hiệu suất của các ứng dụng yêu cầu nhiều dữ liệu"
  },
  {
    "con": "Khi sử dụng các kỹ thuật phân chia bộ nhớ, thì việc quản lý bộ nhớ sẽ trở nên hiệu quả hơn:",
    "re": "Điều này giúp giảm thiểu tình trạng phân mảnh bộ nhớ"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc SIMD, thì nó có thể xử lý nhiều dữ liệu cùng một lúc:",
    "re": "Điều này giúp tăng tốc độ xử lý cho các tác vụ tính toán song song"
  },
  {
    "con": "Số dấu chấm động A được lưu trữ trong máy tính dưới dạng 32 bit sau: 11001000110100011110100000000000, hỏi số A nhận giá trị nào sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn so với kiến trúc CISC,",
    "re": "thì hiệu suất thực thi lệnh có thể cao hơn do đơn giản hóa trong thiết kế."
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache,",
    "re": "thì khả năng truy cập dữ liệu nhanh chóng cho CPU sẽ được cải thiện."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi,",
    "re": "thì khả năng xử lý đồng thời nhiều tác vụ sẽ được nâng cao."
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo,",
    "re": "thì hệ thống có thể chạy nhiều ứng dụng hơn so với dung lượng RAM vật lý có sẵn."
  },
  {
    "con": "Nếu một CPU có tốc độ xung nhịp cao hơn,",
    "re": "thì khả năng thực hiện các phép toán trong một đơn vị thời gian sẽ tăng lên."
  },
  {
    "con": "Khi sử dụng kiến trúc pipelining,",
    "re": "thì hiệu suất xử lý có thể được cải thiện bằng cách cho phép nhiều lệnh được thực thi đồng thời."
  },
  {
    "con": "Nếu một hệ thống sử dụng bus dữ liệu rộng hơn,",
    "re": "thì băng thông truyền tải dữ liệu sẽ được cải thiện."
  },
  {
    "con": "Khi một hệ thống có nhiều tầng bộ nhớ (cache levels),",
    "re": "thì hiệu suất truy cập dữ liệu sẽ được tối ưu hóa."
  },
  {
    "con": "Nếu một chương trình có nhiều vòng lặp lồng ghép,",
    "re": "thì hiệu suất có thể bị giảm do vấn đề phụ thuộc dữ liệu."
  },
  {
    "con": "Số dấu chấm động A được lưu trữ trong máy tính dưới dạng 32 bit sau: 01001000110100011110100000000000, hỏi số A nhận giá trị nào sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý có kiến trúc RISC, thì nó sẽ sử dụng một tập lệnh đơn giản hơn so với kiến trúc CISC.",
    "re": "Điều này giúp tăng tốc độ thực thi chương trình."
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn, thì khả năng lưu trữ dữ liệu thường xuyên sử dụng sẽ cao hơn.",
    "re": "Điều này dẫn đến hiệu suất hệ thống tốt hơn."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi, thì nó có thể thực hiện nhiều tác vụ song song hơn.",
    "re": "Điều này cải thiện hiệu suất xử lý tổng thể."
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ xử lý tăng lên, thì khả năng xử lý của bộ xử lý cũng sẽ tăng lên.",
    "re": "Điều này giúp cải thiện hiệu suất của ứng dụng."
  },
  {
    "con": "Nếu một hệ thống sử dụng bus dữ liệu rộng hơn, thì nó có thể truyền tải nhiều dữ liệu hơn trong một lần.",
    "re": "Điều này giúp tăng băng thông của hệ thống."
  },
  {
    "con": "Nếu một chương trình sử dụng nhiều biến toàn cục, thì nó có thể làm giảm hiệu suất do tăng độ phức tạp trong quản lý bộ nhớ.",
    "re": "Điều này có thể dẫn đến thời gian truy cập bộ nhớ lâu hơn."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo, thì nó có thể chạy các ứng dụng lớn hơn so với dung lượng bộ nhớ vật lý.",
    "re": "Điều này giúp tối ưu hóa việc sử dụng tài nguyên hệ thống."
  },
  {
    "con": "Nếu một bộ xử lý hỗ trợ đa luồng, thì nó có thể xử lý nhiều luồng dữ liệu cùng một lúc.",
    "re": "Điều này giúp cải thiện hiệu suất trong các ứng dụng đa nhiệm."
  },
  {
    "con": "Nếu một hệ thống có kiến trúc pipelining, thì nó có thể thực hiện nhiều giai đoạn của một lệnh cùng một lúc.",
    "re": "Điều này giúp tăng tốc độ thực thi lệnh."
  },
  {
    "con": "Số dấu chấm động A được lưu trữ trong máy tính dưới dạng 32 bit sau: 01001000110100010110100000000000, hỏi số A nhận giá trị nào sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý sử dụng kiến trúc RISC, thì số lượng lệnh sẽ thường ít hơn so với kiến trúc CISC.",
    "re": "Điều này giúp tăng tốc độ thực thi lệnh."
  },
  {
    "con": "Nếu một hệ thống máy tính có bộ nhớ cache lớn hơn, thì thời gian truy cập dữ liệu từ bộ nhớ chính sẽ giảm.",
    "re": "Điều này cải thiện hiệu suất tổng thể của hệ thống."
  },
  {
    "con": "Nếu một vi xử lý có nhiều lõi, thì nó có khả năng xử lý nhiều tác vụ đồng thời tốt hơn.",
    "re": "Điều này giúp tăng cường hiệu suất trong các ứng dụng đa nhiệm."
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng lớn hơn, thì nó có thể truyền tải nhiều dữ liệu hơn trong một chu kỳ đồng hồ.",
    "re": "Điều này làm tăng băng thông của hệ thống."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo, thì nó có thể chạy các ứng dụng lớn hơn so với dung lượng bộ nhớ vật lý.",
    "re": "Điều này giúp tối ưu hóa việc sử dụng tài nguyên hệ thống."
  },
  {
    "con": "Nếu một vi xử lý hỗ trợ siêu phân luồng (Hyper-Threading), thì mỗi lõi có thể xử lý hai luồng dữ liệu cùng một lúc.",
    "re": "Điều này cải thiện hiệu suất trong các tác vụ đa luồng."
  },
  {
    "con": "Nếu một hệ thống máy tính sử dụng kiến trúc phân tán, thì nó có thể mở rộng dễ dàng hơn so với kiến trúc tập trung.",
    "re": "Điều này giúp cải thiện khả năng mở rộng và tính linh hoạt."
  },
  {
    "con": "Nếu một vi xử lý có tần số xung nhịp cao hơn, thì nó có khả năng thực hiện nhiều phép toán hơn trong một giây.",
    "re": "Điều này thường dẫn đến hiệu suất cao hơn."
  },
  {
    "con": "Nếu một hệ thống sử dụng công nghệ đa kênh cho bộ nhớ, thì băng thông bộ nhớ sẽ được cải thiện.",
    "re": "Điều này giúp tăng tốc độ truy cập dữ liệu."
  },
  {
    "con": "Số dấu chấm động A được lưu trữ trong máy tính dưới dạng 32 bit sau: 11001011110100011110100000000000, hỏi số A nhận giá trị nào sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý sử dụng kiến trúc RISC có số lượng lệnh ít hơn kiến trúc CISC,",
    "re": "thì hiệu suất thực thi lệnh có thể cao hơn do đơn giản hóa trong thiết kế."
  },
  {
    "con": "Bộ nhớ cache có kích thước nhỏ hơn bộ nhớ chính,",
    "re": "thì tốc độ truy cập dữ liệu từ cache sẽ nhanh hơn nhiều so với truy cập từ bộ nhớ chính."
  },
  {
    "con": "Một hệ thống máy tính có nhiều lõi xử lý (multi-core),",
    "re": "thì khả năng xử lý đa nhiệm và hiệu suất tổng thể sẽ được cải thiện."
  },
  {
    "con": "Khi sử dụng kiến trúc Harvard,",
    "re": "thì bộ nhớ cho dữ liệu và chương trình được tách biệt, giúp tăng tốc độ truy cập."
  },
  {
    "con": "Nếu một hệ thống sử dụng bus dữ liệu rộng hơn,",
    "re": "thì băng thông truyền tải dữ liệu sẽ cao hơn."
  },
  {
    "con": "Khi một CPU có tốc độ xung nhịp cao hơn,",
    "re": "thì khả năng xử lý các lệnh trong một đơn vị thời gian sẽ tăng lên."
  },
  {
    "con": "Nếu một hệ thống máy tính sử dụng kỹ thuật pipelining,",
    "re": "thì thời gian thực thi cho một chu trình lệnh sẽ được giảm thiểu."
  },
  {
    "con": "Khi một hệ thống có nhiều card đồ họa (GPU),",
    "re": "thì khả năng xử lý đồ họa và tính toán song song sẽ được nâng cao."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo,",
    "re": "thì nó có thể chạy các chương trình lớn hơn dung lượng bộ nhớ vật lý."
  },
  {
    "con": "Số dấu chấm động A được lưu trữ trong máy tính dưới dạng 32 bit sau: 11001010110100011010100000000000, hỏi số A nhận giá trị nào sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn so với kiến trúc CISC:",
    "re": "Điều này giúp tăng tốc độ thực thi lệnh."
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache, thời gian truy cập dữ liệu có thể giảm:",
    "re": "Điều này dẫn đến hiệu suất hệ thống cao hơn."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi, thì khả năng xử lý đồng thời sẽ được cải thiện:",
    "re": "Điều này cho phép chạy nhiều tác vụ cùng lúc mà không làm giảm hiệu suất."
  },
  {
    "con": "Nếu một bộ xử lý có tốc độ xung nhịp cao hơn, thì khả năng xử lý các lệnh sẽ nhanh hơn:",
    "re": "Điều này có thể dẫn đến hiệu suất tổng thể tốt hơn cho ứng dụng."
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo, nếu không đủ bộ nhớ vật lý, thì hệ thống sẽ sử dụng ổ đĩa cứng để lưu trữ dữ liệu:",
    "re": "Điều này có thể làm giảm tốc độ truy cập dữ liệu."
  },
  {
    "con": "Nếu một hệ thống có kiến trúc pipelining, thì các giai đoạn thực thi lệnh sẽ được thực hiện song song:",
    "re": "Điều này giúp tăng hiệu suất xử lý lệnh."
  },
  {
    "con": "Khi sử dụng bus dữ liệu rộng hơn, thì khả năng truyền tải dữ liệu giữa các thành phần sẽ tăng lên:",
    "re": "Điều này giúp cải thiện băng thông của hệ thống."
  },
  {
    "con": "Nếu một hệ thống có nhiều loại bộ nhớ (cache, RAM, ổ cứng), thì việc quản lý bộ nhớ sẽ phức tạp hơn:",
    "re": "Điều này yêu cầu các thuật toán quản lý bộ nhớ hiệu quả hơn."
  },
  {
    "con": "Nếu một hệ thống sử dụng công nghệ SIMD (Single Instruction, Multiple Data), thì khả năng xử lý dữ liệu song song sẽ được cải thiện:",
    "re": "Điều này rất hữu ích trong các ứng dụng xử lý hình ảnh và video."
  },
  {
    "con": "Số dấu chấm động A được lưu trữ trong máy tính dưới dạng 32 bit sau: 01001110110100011110100000000000, hỏi số A nhận giá trị nào sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn so với kiến trúc CISC,",
    "re": "thì hiệu suất thực thi lệnh có thể cao hơn do đơn giản hóa trong thiết kế."
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache,",
    "re": "thì khả năng truy cập dữ liệu nhanh chóng sẽ được cải thiện, giảm thiểu thời gian truy cập bộ nhớ chính."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi,",
    "re": "thì khả năng xử lý đồng thời nhiều tác vụ sẽ được nâng cao, cải thiện hiệu suất tổng thể."
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo,",
    "re": "thì hệ thống có thể chạy các ứng dụng lớn hơn kích thước bộ nhớ vật lý hiện có."
  },
  {
    "con": "Nếu một bộ xử lý có tốc độ xung nhịp cao hơn,",
    "re": "thì khả năng thực hiện các phép toán trong một khoảng thời gian ngắn hơn sẽ tăng lên."
  },
  {
    "con": "Khi sử dụng kiến trúc pipelining,",
    "re": "thì hiệu suất xử lý có thể được cải thiện bằng cách cho phép nhiều lệnh được thực thi đồng thời."
  },
  {
    "con": "Nếu một hệ thống có bus dữ liệu rộng hơn,",
    "re": "thì khả năng truyền tải dữ liệu giữa các thành phần sẽ nhanh hơn."
  },
  {
    "con": "Khi sử dụng các kỹ thuật tối ưu hóa như out-of-order execution,",
    "re": "thì hiệu suất xử lý có thể được cải thiện bằng cách giảm thiểu thời gian chờ đợi của các lệnh."
  },
  {
    "con": "Nếu một hệ thống có nhiều loại bộ nhớ (như SRAM và DRAM),",
    "re": "thì hiệu suất tổng thể có thể được tối ưu hóa bằng cách sử dụng từng loại bộ nhớ cho các mục đích khác nhau."
  },
  {
    "con": "Bộ mã ASSCII mở rộng gồm bao nhiêu kí tự?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "CPU có nhiều lõi hơn thì khả năng xử lý đa nhiệm sẽ tốt hơn",
    "re": "Đúng"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn thì tốc độ truy cập dữ liệu sẽ nhanh hơn",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ dữ liệu và bộ nhớ lệnh thì có thể cải thiện hiệu suất xử lý",
    "re": "Đúng"
  },
  {
    "con": "Sử dụng bộ điều khiển pipelining thì có thể tăng tốc độ xử lý của CPU",
    "re": "Đúng"
  },
  {
    "con": "Tốc độ xung nhịp của CPU cao hơn thì khả năng xử lý mỗi giây sẽ tăng lên",
    "re": "Đúng"
  },
  {
    "con": "Sử dụng kiến trúc RISC thì có thể đơn giản hóa thiết kế bộ xử lý",
    "re": "Đúng"
  },
  {
    "con": "Bộ nhớ RAM có dung lượng lớn hơn thì khả năng chạy nhiều ứng dụng cùng lúc sẽ tốt hơn",
    "re": "Đúng"
  },
  {
    "con": "Sử dụng bus dữ liệu rộng hơn thì có thể truyền tải nhiều dữ liệu hơn trong một lần",
    "re": "Đúng"
  },
  {
    "con": "Sử dụng công nghệ siêu phân luồng (Hyper-Threading) thì có thể cải thiện hiệu suất xử lý của CPU",
    "re": "Đúng"
  },
  {
    "con": "Bộ mã ASSCII cơ sở gồm bao nhiêu kí tự?",
    "re": "128 kí tự"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC?",
    "re": "Đúng"
  },
  {
    "con": "Cache memory có tốc độ truy cập nhanh hơn RAM?",
    "re": "Đúng"
  },
  {
    "con": "Nếu số lượng bit trong bus dữ liệu tăng lên, thì băng thông của hệ thống sẽ tăng theo?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc Von Neumann có một bus chung cho cả dữ liệu và lệnh?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo, thì nó có thể chạy các chương trình lớn hơn dung lượng RAM vật lý?",
    "re": "Đúng"
  },
  {
    "con": "Tốc độ xung nhịp của CPU không ảnh hưởng đến hiệu suất xử lý của nó?",
    "re": "Sai"
  },
  {
    "con": "Nếu một hệ thống có nhiều lõi xử lý, thì nó có khả năng xử lý đa nhiệm tốt hơn?",
    "re": "Đúng"
  },
  {
    "con": "Hệ thống máy tính có thể sử dụng cả SSD và HDD cùng một lúc để tối ưu hóa hiệu suất?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một chương trình sử dụng nhiều tài nguyên CPU, thì nó có thể làm giảm hiệu suất của các chương trình khác?",
    "re": "Đúng"
  },
  {
    "con": "Bộ mã ASSCII cơ sở gồm các kí tự được mã hóa bằng bao nhiêu bit?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "CPU có thể thực hiện nhiều lệnh cùng một lúc?",
    "re": "Kết quả là kiến trúc đa lõi cho phép xử lý song song"
  },
  {
    "con": "Bộ nhớ cache có tốc độ truy cập nhanh hơn bộ nhớ RAM?",
    "re": "Kết quả là cache giúp tăng hiệu suất hệ thống"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ dữ liệu và bộ nhớ lệnh?",
    "re": "Kết quả là cho phép truy cập đồng thời vào cả hai loại bộ nhớ"
  },
  {
    "con": "Tốc độ xung nhịp của CPU được đo bằng đơn vị nào?",
    "re": "Kết quả là megahertz (MHz) hoặc gigahertz (GHz)"
  },
  {
    "con": "Bộ điều khiển (Control Unit) có nhiệm vụ gì trong CPU?",
    "re": "Kết quả là điều phối hoạt động của các thành phần khác trong CPU"
  },
  {
    "con": "Hệ thống bus trong máy tính có chức năng gì?",
    "re": "Kết quả là truyền tải dữ liệu giữa các thành phần khác nhau"
  },
  {
    "con": "Kiến trúc RISC có đặc điểm gì nổi bật?",
    "re": "Kết quả là sử dụng tập lệnh đơn giản và số lượng lệnh ít"
  },
  {
    "con": "Bộ nhớ ảo cho phép sử dụng không gian bộ nhớ lớn hơn bộ nhớ vật lý?",
    "re": "Kết quả là giúp chạy nhiều ứng dụng hơn mà không bị giới hạn bởi RAM"
  },
  {
    "con": "Tính toán song song có thể cải thiện hiệu suất xử lý?",
    "re": "Kết quả là cho phép xử lý nhiều tác vụ đồng thời, giảm thời gian hoàn thành"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn sẽ giảm thiểu thời gian truy cập dữ liệu",
    "re": "Tốc độ xử lý của CPU sẽ tăng lên"
  },
  {
    "con": "Sử dụng kiến trúc RISC thay vì CISC sẽ đơn giản hóa thiết kế bộ xử lý",
    "re": "Thời gian phát triển và chi phí sản xuất sẽ giảm"
  },
  {
    "con": "Tăng băng thông của bus dữ liệu sẽ cho phép truyền tải dữ liệu nhanh hơn",
    "re": "Hiệu suất của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Sử dụng kỹ thuật pipelining trong bộ xử lý sẽ cho phép thực hiện nhiều lệnh đồng thời",
    "re": "Tăng tốc độ xử lý của chương trình"
  },
  {
    "con": "Số lượng transistor trên chip tăng lên sẽ cho phép tích hợp nhiều chức năng hơn",
    "re": "Khả năng xử lý và hiệu suất của chip sẽ được nâng cao"
  },
  {
    "con": "Sử dụng bộ nhớ ảo sẽ cho phép hệ thống sử dụng nhiều bộ nhớ hơn so với bộ nhớ vật lý",
    "re": "Khả năng chạy nhiều ứng dụng cùng lúc sẽ được cải thiện"
  },
  {
    "con": "Kiến trúc đa lõi sẽ tiêu tốn nhiều năng lượng hơn so với kiến trúc đơn lõi",
    "re": "Cần có các giải pháp quản lý năng lượng hiệu quả hơn"
  },
  {
    "con": "Sử dụng các kỹ thuật tối ưu hóa như superscalar sẽ cho phép thực hiện nhiều lệnh trong một chu kỳ đồng hồ",
    "re": "Hiệu suất xử lý sẽ được nâng cao"
  },
  {
    "con": "Thiết kế bộ xử lý theo hướng mô hình hóa sẽ giúp cải thiện khả năng mở rộng",
    "re": "Hệ thống sẽ dễ dàng thích ứng với các yêu cầu mới"
  },
  {
    "con": "Mã NBCD biểu diễn mỗi chữ số thập phân bằng bao nhiêu bit?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC?",
    "re": "Đúng"
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ xử lý tăng lên, thì hiệu suất xử lý của nó cũng có khả năng tăng lên?",
    "re": "Đúng"
  },
  {
    "con": "Bộ nhớ cache giúp giảm thời gian truy cập dữ liệu so với bộ nhớ chính?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi, thì nó có thể thực hiện nhiều tác vụ song song hơn?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc Von Neumann có một bus chung cho cả dữ liệu và lệnh?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một bộ xử lý có nhiều thanh ghi hơn, thì nó có thể xử lý nhiều dữ liệu hơn trong một chu kỳ đồng hồ?",
    "re": "Đúng"
  },
  {
    "con": "Bộ nhớ RAM là bộ nhớ tạm thời và mất dữ liệu khi tắt nguồn?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống có tốc độ truy cập bộ nhớ cao hơn, thì nó có thể cải thiện hiệu suất tổng thể?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc máy tính có thể ảnh hưởng đến cách lập trình và tối ưu hóa phần mềm?",
    "re": "Đúng"
  },
  {
    "con": "Mã EBCDIC biểu diễn mỗi kí tự bằng bao nhiêu bit?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có tốc độ truy cập nhanh hơn bộ nhớ chính?",
    "re": "Đúng"
  },
  {
    "con": "Nếu số lượng bit trong một thanh ghi tăng lên, thì khả năng lưu trữ dữ liệu của thanh ghi đó cũng tăng lên?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc Harvard cho phép truy cập đồng thời vào bộ nhớ lệnh và bộ nhớ dữ liệu?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một CPU có nhiều lõi, thì nó có thể thực hiện nhiều tác vụ song song hơn?",
    "re": "Đúng"
  },
  {
    "con": "Tốc độ xung nhịp của CPU ảnh hưởng đến hiệu suất xử lý của nó?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc RISC, thì các lệnh sẽ có độ dài cố định?",
    "re": "Đúng"
  },
  {
    "con": "Bộ điều khiển trong CPU có nhiệm vụ giải mã và thực thi các lệnh?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống có nhiều bus, thì khả năng truyền dữ liệu giữa các thành phần sẽ được cải thiện?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc Von Neumann có một bus chung cho cả dữ liệu và lệnh?",
    "re": "Đúng"
  },
  {
    "con": "Mã NBCD là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "CPU có nhiều lõi hơn một lõi đơn?",
    "re": "Hiệu suất xử lý đa nhiệm cao hơn"
  },
  {
    "con": "Bộ nhớ cache có tốc độ nhanh hơn bộ nhớ RAM?",
    "re": "Giảm thời gian truy cập dữ liệu"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ cho dữ liệu và lệnh?",
    "re": "Tăng tốc độ xử lý do không có xung đột giữa lệnh và dữ liệu"
  },
  {
    "con": "Số lượng bit trong bus dữ liệu lớn hơn?",
    "re": "Có thể truyền tải nhiều dữ liệu hơn trong một lần"
  },
  {
    "con": "Sử dụng pipelining trong CPU?",
    "re": "Tăng cường hiệu suất xử lý bằng cách thực hiện nhiều lệnh đồng thời"
  },
  {
    "con": "Bộ xử lý sử dụng kiến trúc RISC?",
    "re": "Thực hiện các lệnh đơn giản và nhanh chóng hơn"
  },
  {
    "con": "Bộ nhớ ảo được sử dụng trong hệ điều hành?",
    "re": "Cho phép chạy nhiều ứng dụng hơn so với bộ nhớ vật lý có sẵn"
  },
  {
    "con": "Tốc độ xung nhịp của CPU cao hơn?",
    "re": "Thực hiện nhiều phép toán hơn trong một giây"
  },
  {
    "con": "Sử dụng kỹ thuật phân chia thời gian trong hệ thống đa nhiệm?",
    "re": "Cung cấp cảm giác mượt mà cho người dùng khi chạy nhiều ứng dụng"
  },
  {
    "con": "Mã ASSCII của chữ số 0 bằng bao nhiêu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý có nhiều lõi hơn,",
    "re": "thì khả năng xử lý đa nhiệm sẽ tốt hơn."
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ vi xử lý tăng lên,",
    "re": "thì hiệu suất xử lý của nó cũng có khả năng tăng lên."
  },
  {
    "con": "Nếu bộ nhớ cache lớn hơn,",
    "re": "thì thời gian truy cập dữ liệu sẽ nhanh hơn."
  },
  {
    "con": "Nếu kiến trúc máy tính sử dụng pipelining,",
    "re": "thì hiệu suất thực thi các lệnh sẽ được cải thiện."
  },
  {
    "con": "Nếu bus dữ liệu rộng hơn,",
    "re": "thì lượng dữ liệu truyền tải trong một lần sẽ lớn hơn."
  },
  {
    "con": "Nếu sử dụng bộ nhớ RAM tốc độ cao hơn,",
    "re": "thì thời gian truy cập dữ liệu sẽ giảm."
  },
  {
    "con": "Nếu kiến trúc máy tính hỗ trợ đa luồng,",
    "re": "thì khả năng xử lý đồng thời sẽ được nâng cao."
  },
  {
    "con": "Nếu sử dụng bộ điều khiển DMA,",
    "re": "thì CPU sẽ giảm tải công việc khi truyền dữ liệu."
  },
  {
    "con": "Nếu hệ thống sử dụng kiến trúc Harvard,",
    "re": "thì tốc độ truy cập bộ nhớ sẽ nhanh hơn so với kiến trúc Von Neumann."
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn",
    "re": "Hiệu suất xử lý tăng lên"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn sẽ giảm thiểu thời gian truy cập dữ liệu",
    "re": "Tăng tốc độ xử lý của CPU"
  },
  {
    "con": "Sử dụng kiến trúc RISC thay vì CISC sẽ đơn giản hóa thiết kế bộ xử lý",
    "re": "Giảm độ phức tạp trong việc thực hiện lệnh"
  },
  {
    "con": "Tốc độ xung nhịp của CPU cao hơn sẽ dẫn đến khả năng xử lý nhanh hơn",
    "re": "Tăng hiệu suất tổng thể của hệ thống"
  },
  {
    "con": "Sử dụng bus dữ liệu rộng hơn sẽ cho phép truyền tải nhiều dữ liệu hơn cùng một lúc",
    "re": "Tăng băng thông của hệ thống"
  },
  {
    "con": "Sử dụng bộ nhớ RAM nhanh hơn sẽ cải thiện tốc độ truy cập dữ liệu",
    "re": "Tăng hiệu suất của ứng dụng"
  },
  {
    "con": "Kiến trúc đa lõi cho phép xử lý song song hiệu quả hơn",
    "re": "Tăng cường khả năng xử lý đa nhiệm"
  },
  {
    "con": "Sử dụng công nghệ siêu phân luồng (Hyper-Threading) sẽ tối ưu hóa việc sử dụng tài nguyên CPU",
    "re": "Cải thiện hiệu suất trong các tác vụ đa luồng"
  },
  {
    "con": "Bộ điều khiển bộ nhớ (Memory Controller) tích hợp trong CPU sẽ giảm độ trễ truy cập bộ nhớ",
    "re": "Tăng tốc độ truyền dữ liệu giữa CPU và RAM"
  },
  {
    "con": "Sử dụng kiến trúc phân tán sẽ cải thiện khả năng mở rộng của hệ thống",
    "re": "Tăng cường khả năng xử lý cho các ứng dụng lớn"
  },
  {
    "con": "Mã ASSCII của chữ cái A bằng bao nhiêu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu kích thước từ của CPU là 32 bit,",
    "re": "thì nó có thể xử lý tối đa 4GB bộ nhớ trực tiếp."
  },
  {
    "con": "Nếu một CPU có 4 lõi xử lý,",
    "re": "thì nó có thể thực hiện 4 tác vụ song song."
  },
  {
    "con": "Nếu tốc độ xung nhịp của CPU là 3 GHz,",
    "re": "thì nó có thể thực hiện 3 tỷ chu kỳ mỗi giây."
  },
  {
    "con": "Nếu bộ nhớ cache có dung lượng 1MB,",
    "re": "thì nó có thể lưu trữ dữ liệu tạm thời cho CPU để tăng tốc độ truy cập."
  },
  {
    "con": "Nếu kiến trúc máy tính sử dụng bộ nhớ ảo,",
    "re": "thì nó có thể sử dụng không gian lưu trữ trên ổ đĩa cứng như bộ nhớ RAM."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc RISC,",
    "re": "thì nó sẽ có số lượng lệnh đơn giản và thực thi nhanh hơn."
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng 64 bit,",
    "re": "thì nó có thể truyền tải 8 byte dữ liệu cùng một lúc."
  },
  {
    "con": "Nếu một hệ thống có nhiều bộ xử lý,",
    "re": "thì nó có thể cải thiện hiệu suất thông qua xử lý song song."
  },
  {
    "con": "Nếu một chương trình sử dụng nhiều tài nguyên CPU,",
    "re": "thì nó có thể làm giảm hiệu suất của các chương trình khác đang chạy."
  },
  {
    "con": "Bus hệ thống của máy tính bao gồm:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn:",
    "re": "Hiệu suất xử lý đa nhiệm sẽ cao hơn"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn:",
    "re": "Thời gian truy cập dữ liệu sẽ nhanh hơn"
  },
  {
    "con": "Kiến trúc Harvard được sử dụng:",
    "re": "Có thể thực hiện truy cập đồng thời vào bộ nhớ chương trình và bộ nhớ dữ liệu"
  },
  {
    "con": "Tốc độ xung nhịp của CPU tăng:",
    "re": "Hiệu suất xử lý của CPU sẽ tăng lên"
  },
  {
    "con": "Sử dụng kỹ thuật pipelining:",
    "re": "Tăng cường khả năng thực thi lệnh song song"
  },
  {
    "con": "Bộ điều khiển sử dụng kiến trúc RISC:",
    "re": "Sẽ có số lượng lệnh đơn giản và hiệu quả hơn"
  },
  {
    "con": "Số lượng transistor trong vi xử lý tăng:",
    "re": "Khả năng xử lý và hiệu suất tổng thể sẽ được cải thiện"
  },
  {
    "con": "Sử dụng bộ nhớ ảo:",
    "re": "Cho phép chạy nhiều ứng dụng hơn so với dung lượng bộ nhớ vật lý"
  },
  {
    "con": "Hệ thống sử dụng RAID:",
    "re": "Tăng cường độ tin cậy và hiệu suất của lưu trữ dữ liệu"
  },
  {
    "con": "Chức năng của hệ thống Bus trong máy tính là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý sử dụng kiến trúc RISC thì nó sẽ có số lượng lệnh đơn giản hơn so với kiến trúc CISC.",
    "re": "Điều này giúp tăng tốc độ thực thi lệnh."
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn thì hiệu suất truy cập dữ liệu sẽ được cải thiện.",
    "re": "Điều này giảm thiểu thời gian truy cập bộ nhớ chính."
  },
  {
    "con": "Nếu một hệ thống máy tính có nhiều lõi xử lý thì nó có khả năng xử lý đa nhiệm tốt hơn.",
    "re": "Điều này cho phép thực hiện nhiều tác vụ đồng thời."
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ xử lý tăng lên thì khả năng xử lý của nó cũng sẽ tăng lên.",
    "re": "Điều này giúp cải thiện hiệu suất tổng thể của hệ thống."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc phân tán thì nó có thể mở rộng dễ dàng hơn.",
    "re": "Điều này cho phép thêm nhiều nút xử lý mà không làm giảm hiệu suất."
  },
  {
    "con": "Nếu một hệ thống máy tính sử dụng bộ nhớ ảo thì nó có thể chạy các ứng dụng lớn hơn dung lượng bộ nhớ vật lý.",
    "re": "Điều này giúp tối ưu hóa việc sử dụng tài nguyên bộ nhớ."
  },
  {
    "con": "Nếu một bộ xử lý hỗ trợ đa luồng thì nó có thể xử lý nhiều luồng dữ liệu cùng một lúc.",
    "re": "Điều này cải thiện hiệu suất trong các ứng dụng đa nhiệm."
  },
  {
    "con": "Nếu một hệ thống sử dụng công nghệ SIMD thì nó có thể thực hiện các phép toán trên nhiều dữ liệu cùng một lúc.",
    "re": "Điều này giúp tăng tốc độ xử lý cho các tác vụ tính toán lớn."
  },
  {
    "con": "Nếu một hệ thống có kiến trúc pipelining thì nó có thể thực hiện nhiều giai đoạn của lệnh cùng một lúc.",
    "re": "Điều này giúp tăng hiệu suất xử lý lệnh."
  },
  {
    "con": "Bus nào trong máy tính có nhiệm vụ là đường truyền dẫn giữa CPU và các chip hỗ trợ trung gian?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "CPU có nhiều lõi xử lý hơn thì khả năng xử lý đa nhiệm sẽ tốt hơn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn thì tốc độ truy cập dữ liệu sẽ nhanh hơn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ dữ liệu và bộ nhớ lệnh thì hiệu suất xử lý sẽ cao hơn kiến trúc Von Neumann.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sử dụng pipelining trong CPU thì hiệu suất xử lý sẽ được cải thiện nhờ vào việc thực hiện nhiều lệnh đồng thời.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tốc độ xung nhịp của CPU cao hơn thì khả năng xử lý lệnh trong một giây sẽ tăng lên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sử dụng bộ điều khiển DMA thì CPU sẽ giảm tải công việc khi truyền dữ liệu giữa các thiết bị ngoại vi.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Kiến trúc RISC có số lượng lệnh đơn giản hơn thì sẽ dễ dàng tối ưu hóa cho hiệu suất cao hơn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sử dụng bộ nhớ ảo thì hệ thống có thể chạy nhiều ứng dụng hơn so với dung lượng bộ nhớ vật lý thực tế.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Thiết kế hệ thống đa xử lý thì khả năng mở rộng và hiệu suất tổng thể của hệ thống sẽ được cải thiện.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bus nào trong máy tính có nhiệm vụ là đường truyền dẫn giữa các khối của bộ vi xử lý?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có tốc độ truy cập nhanh hơn bộ nhớ chính?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một bộ vi xử lý có nhiều lõi, thì nó có khả năng xử lý nhiều tác vụ đồng thời hơn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Kiến trúc Harvard cho phép bộ vi xử lý truy cập đồng thời vào bộ nhớ dữ liệu và bộ nhớ lệnh?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc RISC, thì các lệnh sẽ có độ dài cố định?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ điều khiển (Control Unit) có nhiệm vụ giải mã và điều phối các lệnh trong bộ vi xử lý?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ vi xử lý tăng, thì hiệu suất xử lý của nó cũng có thể tăng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hệ thống bus có thể bị tắc nghẽn khi có quá nhiều thiết bị cùng truy cập vào nó?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một bộ vi xử lý hỗ trợ đa luồng, thì nó có thể xử lý nhiều luồng dữ liệu cùng lúc?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Kiến trúc Von Neumann có một bộ nhớ chung cho cả dữ liệu và lệnh?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bus nào trong máy tính có nhiệm vụ kết nối bộ vi xử lý với bộ nhớ chính và bộ nhớ Cache?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ vi xử lý có nhiều nhân hơn sẽ xử lý nhiều tác vụ đồng thời hơn.",
    "re": "Hiệu suất xử lý tăng lên"
  },
  {
    "con": "Bộ nhớ Cache có dung lượng lớn hơn sẽ giảm thiểu thời gian truy cập dữ liệu.",
    "re": "Tăng tốc độ xử lý của CPU"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ cho dữ liệu và lệnh.",
    "re": "Cho phép truy cập đồng thời vào lệnh và dữ liệu"
  },
  {
    "con": "Sử dụng bộ nhớ ảo cho phép hệ điều hành quản lý bộ nhớ hiệu quả hơn.",
    "re": "Tăng cường khả năng sử dụng bộ nhớ vật lý"
  },
  {
    "con": "Tốc độ xung nhịp của CPU càng cao thì khả năng xử lý càng nhanh.",
    "re": "Tăng cường hiệu suất tính toán"
  },
  {
    "con": "Sử dụng kiến trúc RISC giúp đơn giản hóa các lệnh và tăng tốc độ thực thi.",
    "re": "Giảm độ phức tạp của bộ vi xử lý"
  },
  {
    "con": "Hệ thống đa lõi cho phép xử lý nhiều luồng dữ liệu cùng lúc.",
    "re": "Cải thiện hiệu suất tổng thể của hệ thống"
  },
  {
    "con": "Sử dụng bus rộng hơn cho phép truyền tải dữ liệu nhanh hơn.",
    "re": "Tăng băng thông của hệ thống"
  },
  {
    "con": "Bộ điều khiển bộ nhớ có vai trò quan trọng trong việc quản lý truy cập bộ nhớ.",
    "re": "Đảm bảo dữ liệu được truy cập chính xác và hiệu quả"
  },
  {
    "con": "Chức năng của Bus hệ thống trong máy tính là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "CPU có bao nhiêu thành phần chính?",
    "re": "Ba thành phần: ALU, bộ điều khiển và thanh ghi"
  },
  {
    "con": "Cache memory có vai trò gì trong kiến trúc máy tính?",
    "re": "Giảm thời gian truy cập dữ liệu cho CPU"
  },
  {
    "con": "Kiến trúc Harvard khác gì so với kiến trúc Von Neumann?",
    "re": "Harvard sử dụng hai bus riêng biệt cho dữ liệu và lệnh"
  },
  {
    "con": "Tốc độ xung nhịp của CPU ảnh hưởng như thế nào đến hiệu suất?",
    "re": "Tăng tốc độ xung nhịp thường dẫn đến hiệu suất cao hơn"
  },
  {
    "con": "Đơn vị xử lý đồ họa (GPU) có vai trò gì trong máy tính?",
    "re": "Xử lý các tác vụ đồ họa và tính toán song song hiệu quả"
  },
  {
    "con": "Hệ thống lưu trữ thứ cấp có vai trò gì?",
    "re": "Lưu trữ dữ liệu lâu dài và lớn hơn bộ nhớ chính"
  },
  {
    "con": "Tại sao việc tối ưu hóa đường dẫn dữ liệu là quan trọng?",
    "re": "Giảm độ trễ và tăng tốc độ xử lý của hệ thống"
  },
  {
    "con": "Kiến trúc đa lõi có lợi ích gì?",
    "re": "Cho phép xử lý nhiều tác vụ đồng thời, cải thiện hiệu suất"
  },
  {
    "con": "Tại sao bộ nhớ RAM lại cần thiết trong máy tính?",
    "re": "Cung cấp không gian lưu trữ tạm thời cho dữ liệu và lệnh đang được xử lý"
  },
  {
    "con": "Đặc điểm quan trọng của Bus đồng bộ là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý có nhiều lõi thì khả năng xử lý song song sẽ được cải thiện.",
    "re": "Hiệu suất tổng thể của hệ thống sẽ tăng lên."
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn thì thời gian truy cập dữ liệu sẽ giảm.",
    "re": "Hiệu suất của CPU sẽ được cải thiện."
  },
  {
    "con": "Nếu kiến trúc Harvard được sử dụng thì dữ liệu và lệnh sẽ được lưu trữ riêng biệt.",
    "re": "Tốc độ xử lý có thể được cải thiện do không có xung đột giữa dữ liệu và lệnh."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo thì nó có thể chạy nhiều ứng dụng hơn so với bộ nhớ vật lý thực tế.",
    "re": "Tính linh hoạt và khả năng sử dụng tài nguyên sẽ tăng lên."
  },
  {
    "con": "Nếu tốc độ xung nhịp của CPU tăng lên thì khả năng xử lý của CPU cũng sẽ tăng.",
    "re": "Hiệu suất của hệ thống sẽ được cải thiện."
  },
  {
    "con": "Nếu kiến trúc RISC được áp dụng thì số lượng lệnh sẽ giảm nhưng mỗi lệnh sẽ thực hiện nhanh hơn.",
    "re": "Hiệu suất xử lý sẽ được tối ưu hóa."
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng lớn hơn thì lượng dữ liệu truyền tải trong một lần sẽ tăng.",
    "re": "Băng thông của hệ thống sẽ được cải thiện."
  },
  {
    "con": "Nếu sử dụng kỹ thuật pipelining thì các giai đoạn xử lý có thể được thực hiện đồng thời.",
    "re": "Tăng cường hiệu suất xử lý của CPU."
  },
  {
    "con": "Nếu hệ thống sử dụng công nghệ đa xử lý thì khả năng xử lý đồng thời sẽ được cải thiện.",
    "re": "Thời gian hoàn thành tác vụ sẽ giảm."
  },
  {
    "con": "Một trong các đặc điểm của Bus đồng bộ là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có tốc độ truy cập nhanh hơn bộ nhớ chính:",
    "re": "Điều này giúp tăng hiệu suất của CPU"
  },
  {
    "con": "Nếu kiến trúc máy tính sử dụng pipelining:",
    "re": "Thời gian thực hiện lệnh sẽ giảm"
  },
  {
    "con": "Một trong các loại kiến trúc máy tính là kiến trúc Von Neumann:",
    "re": "Nó sử dụng một bus chung cho dữ liệu và lệnh"
  },
  {
    "con": "Nếu một hệ thống sử dụng đa lõi:",
    "re": "Nó có thể thực hiện nhiều tác vụ song song"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC:",
    "re": "Điều này giúp đơn giản hóa thiết kế và tăng tốc độ thực thi"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo:",
    "re": "Nó có thể chạy các chương trình lớn hơn dung lượng bộ nhớ vật lý"
  },
  {
    "con": "Một trong các yếu tố ảnh hưởng đến hiệu suất của CPU là tần số xung nhịp:",
    "re": "Tần số cao hơn thường dẫn đến hiệu suất tốt hơn"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc phân tán:",
    "re": "Nó có thể cải thiện khả năng mở rộng và độ tin cậy"
  },
  {
    "con": "Bộ điều khiển trong CPU có nhiệm vụ:",
    "re": "Quản lý và điều phối hoạt động của các thành phần khác trong hệ thống"
  },
  {
    "con": "Đặc điểm quan trọng của Bus không đồng bộ là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn thì hiệu suất của CPU sẽ cải thiện.",
    "re": "Thời gian truy cập dữ liệu sẽ giảm"
  },
  {
    "con": "Nếu kiến trúc máy tính sử dụng pipelining thì khả năng thực thi đồng thời các lệnh sẽ tăng lên.",
    "re": "Tăng hiệu suất xử lý tổng thể"
  },
  {
    "con": "Nếu số lượng lõi trong CPU tăng lên thì khả năng xử lý đa nhiệm sẽ được cải thiện.",
    "re": "Tăng cường khả năng xử lý song song"
  },
  {
    "con": "Nếu sử dụng kiến trúc Harvard thì dữ liệu và lệnh sẽ được lưu trữ riêng biệt.",
    "re": "Giảm thiểu xung đột giữa truy cập dữ liệu và lệnh"
  },
  {
    "con": "Nếu tốc độ xung nhịp của CPU tăng lên thì khả năng xử lý của CPU cũng sẽ tăng.",
    "re": "Tăng số lượng phép toán thực hiện trong một giây"
  },
  {
    "con": "Nếu sử dụng bộ nhớ RAM tốc độ cao thì thời gian truy cập dữ liệu sẽ giảm.",
    "re": "Cải thiện hiệu suất tổng thể của hệ thống"
  },
  {
    "con": "Nếu kiến trúc máy tính sử dụng SIMD thì khả năng xử lý dữ liệu song song sẽ được tối ưu hóa.",
    "re": "Tăng tốc độ xử lý cho các tác vụ tính toán lớn"
  },
  {
    "con": "Nếu hệ thống sử dụng bus rộng hơn thì băng thông truyền tải dữ liệu sẽ tăng.",
    "re": "Giảm thời gian truyền tải dữ liệu giữa các thành phần"
  },
  {
    "con": "Nếu sử dụng kỹ thuật phân chia thời gian (time slicing) trong CPU thì khả năng đáp ứng của hệ thống sẽ cải thiện.",
    "re": "Tăng cường trải nghiệm người dùng trong môi trường đa nhiệm"
  },
  {
    "con": "Trong các đặc điểm sau, đặc điểm nào không phải của Bus đồng bộ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý sử dụng kiến trúc RISC thì nó sẽ có số lượng lệnh đơn giản hơn so với kiến trúc CISC.",
    "re": "Điều này giúp tăng tốc độ thực thi lệnh."
  },
  {
    "con": "Nếu một hệ thống có nhiều lõi xử lý thì nó có khả năng xử lý đa nhiệm tốt hơn.",
    "re": "Điều này dẫn đến hiệu suất cao hơn trong các ứng dụng đa luồng."
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn thì thời gian truy cập dữ liệu có thể giảm.",
    "re": "Điều này giúp cải thiện hiệu suất tổng thể của hệ thống."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Harvard thì nó sẽ có bộ nhớ riêng cho dữ liệu và lệnh.",
    "re": "Điều này cho phép truy cập đồng thời vào lệnh và dữ liệu."
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ xử lý tăng lên thì khả năng xử lý của nó cũng có thể tăng lên.",
    "re": "Tuy nhiên, điều này còn phụ thuộc vào kiến trúc và thiết kế của bộ xử lý."
  },
  {
    "con": "Nếu một hệ thống sử dụng bus dữ liệu rộng hơn thì nó có thể truyền tải nhiều dữ liệu hơn trong một lần.",
    "re": "Điều này giúp tăng băng thông của hệ thống."
  },
  {
    "con": "Nếu một bộ xử lý có nhiều đơn vị thực thi thì nó có thể thực hiện nhiều lệnh cùng một lúc.",
    "re": "Điều này cải thiện khả năng xử lý song song."
  },
  {
    "con": "Nếu một hệ thống có kiến trúc pipelining thì nó có thể thực hiện nhiều giai đoạn của lệnh cùng một lúc.",
    "re": "Điều này giúp tăng hiệu suất xử lý."
  },
  {
    "con": "Nếu một hệ thống sử dụng công nghệ siêu phân luồng (Hyper-Threading) thì nó có thể tối ưu hóa việc sử dụng tài nguyên của bộ xử lý.",
    "re": "Điều này dẫn đến hiệu suất cao hơn trong các tác vụ đa nhiệm."
  },
  {
    "con": "Tại sao trong thực tế Bus đồng bộ được sử dụng rộng rãi hơn Bus không đồng bộ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý có nhiều lõi thì khả năng xử lý song song sẽ tăng lên.",
    "re": "Điều này giúp cải thiện hiệu suất tổng thể của hệ thống."
  },
  {
    "con": "Nếu bộ nhớ cache có dung lượng lớn hơn thì thời gian truy cập dữ liệu sẽ giảm.",
    "re": "Điều này dẫn đến hiệu suất cao hơn cho các ứng dụng."
  },
  {
    "con": "Nếu kiến trúc máy tính sử dụng pipelining thì tốc độ xử lý lệnh sẽ được cải thiện.",
    "re": "Điều này cho phép nhiều lệnh được thực hiện đồng thời."
  },
  {
    "con": "Nếu sử dụng kiến trúc Harvard thì tốc độ truy cập bộ nhớ sẽ nhanh hơn so với kiến trúc Von Neumann.",
    "re": "Điều này là do dữ liệu và lệnh được lưu trữ trong các bộ nhớ riêng biệt."
  },
  {
    "con": "Nếu tần số xung nhịp của bộ xử lý cao hơn thì khả năng xử lý sẽ tăng lên.",
    "re": "Điều này cho phép thực hiện nhiều phép toán hơn trong một khoảng thời gian nhất định."
  },
  {
    "con": "Nếu sử dụng công nghệ đa luồng thì hiệu suất của ứng dụng sẽ được cải thiện.",
    "re": "Điều này cho phép xử lý nhiều tác vụ đồng thời."
  },
  {
    "con": "Nếu bộ nhớ RAM có tốc độ cao hơn thì hiệu suất của hệ thống sẽ được cải thiện.",
    "re": "Điều này giúp giảm thời gian truy cập dữ liệu."
  },
  {
    "con": "Nếu sử dụng kiến trúc RISC thì số lượng lệnh sẽ ít hơn nhưng mỗi lệnh sẽ thực hiện nhanh hơn.",
    "re": "Điều này giúp đơn giản hóa thiết kế bộ xử lý."
  },
  {
    "con": "Nếu hệ thống sử dụng bộ điều khiển DMA thì hiệu suất truyền dữ liệu sẽ cao hơn.",
    "re": "Điều này giảm tải cho CPU trong quá trình truyền dữ liệu."
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời tốt hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ tăng lên"
  },
  {
    "con": "Khi sử dụng bộ nhớ cache, dữ liệu thường xuyên được truy cập sẽ được lưu trữ",
    "re": "Thời gian truy cập dữ liệu sẽ giảm"
  },
  {
    "con": "Khi tăng tốc độ xung nhịp của CPU",
    "re": "Hiệu suất xử lý của CPU sẽ tăng lên"
  },
  {
    "con": "Khi sử dụng kiến trúc RISC thay vì CISC",
    "re": "Số lượng chu kỳ thực hiện một lệnh sẽ giảm"
  },
  {
    "con": "Khi có nhiều bus dữ liệu hơn trong hệ thống",
    "re": "Băng thông truyền tải dữ liệu sẽ tăng lên"
  },
  {
    "con": "Khi sử dụng kỹ thuật pipelining trong CPU",
    "re": "Thời gian thực hiện lệnh sẽ được giảm thiểu"
  },
  {
    "con": "Khi bộ nhớ RAM có dung lượng lớn hơn",
    "re": "Khả năng chạy nhiều ứng dụng cùng lúc sẽ được cải thiện"
  },
  {
    "con": "Khi sử dụng SSD thay vì HDD",
    "re": "Thời gian khởi động và truy cập dữ liệu sẽ nhanh hơn"
  },
  {
    "con": "Khi áp dụng kỹ thuật phân vùng trong bộ nhớ",
    "re": "Quản lý bộ nhớ sẽ trở nên hiệu quả hơn"
  },
  {
    "con": "Khi sử dụng kiến trúc đa tầng trong thiết kế hệ thống",
    "re": "Tính linh hoạt và khả năng mở rộng của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Trong trường hợp nào nên sử dụng Bus đồng bộ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi bộ xử lý cần thực hiện nhiều phép toán đồng thời?",
    "re": "Sử dụng kiến trúc đa lõi sẽ cải thiện hiệu suất"
  },
  {
    "con": "Khi cần tối ưu hóa tốc độ truy cập bộ nhớ?",
    "re": "Sử dụng bộ nhớ cache sẽ giảm độ trễ"
  },
  {
    "con": "Khi thiết kế một hệ thống nhúng với yêu cầu tiết kiệm năng lượng?",
    "re": "Chọn kiến trúc RISC sẽ giúp giảm mức tiêu thụ năng lượng"
  },
  {
    "con": "Khi cần xử lý dữ liệu lớn trong thời gian thực?",
    "re": "Sử dụng kiến trúc SIMD sẽ tăng tốc độ xử lý"
  },
  {
    "con": "Khi cần đảm bảo tính nhất quán dữ liệu trong hệ thống phân tán?",
    "re": "Áp dụng các giao thức đồng bộ hóa sẽ là cần thiết"
  },
  {
    "con": "Khi thiết kế một hệ thống có yêu cầu mở rộng cao?",
    "re": "Sử dụng kiến trúc mô-đun sẽ dễ dàng mở rộng hơn"
  },
  {
    "con": "Khi cần giảm thiểu chi phí sản xuất chip?",
    "re": "Sử dụng quy trình sản xuất công nghệ thấp hơn sẽ tiết kiệm chi phí"
  },
  {
    "con": "Khi cần tối ưu hóa băng thông giữa các thành phần trong hệ thống?",
    "re": "Sử dụng kiến trúc bus song song sẽ cải thiện băng thông"
  },
  {
    "con": "Khi cần tăng cường khả năng xử lý đồ họa?",
    "re": "Sử dụng GPU sẽ mang lại hiệu suất cao hơn cho các tác vụ đồ họa"
  },
  {
    "con": "Bus nào trong máy tính có nhiệm vụ kết nối các thiết bị vào ra với bộ vi xử lý?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có tốc độ truy cập nhanh hơn bộ nhớ chính?",
    "re": "Đúng"
  },
  {
    "con": "Nếu số lượng lõi trong bộ vi xử lý tăng lên, thì khả năng xử lý đa nhiệm sẽ được cải thiện?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc Harvard cho phép bộ vi xử lý truy cập đồng thời vào bộ nhớ chương trình và bộ nhớ dữ liệu?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo, thì nó có thể chạy nhiều chương trình hơn so với dung lượng bộ nhớ vật lý thực tế?",
    "re": "Đúng"
  },
  {
    "con": "Bộ vi xử lý RISC thường có số lượng lệnh ít hơn so với bộ vi xử lý CISC?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một bus dữ liệu có bề rộng 64 bit, thì nó có thể truyền tải 8 byte dữ liệu trong một lần truyền?",
    "re": "Đúng"
  },
  {
    "con": "Tốc độ xung nhịp của bộ vi xử lý ảnh hưởng đến hiệu suất tổng thể của hệ thống?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi, thì nó có thể xử lý nhiều tác vụ đồng thời hơn?",
    "re": "Đúng"
  },
  {
    "con": "Bộ điều khiển (controller) trong một hệ thống máy tính có nhiệm vụ quản lý các thiết bị ngoại vi?",
    "re": "Đúng"
  },
  {
    "con": "Chức năng của Bus ngoại vi trong máy tính là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có vai trò gì trong hiệu suất của CPU?",
    "re": "Giảm thời gian truy cập dữ liệu cho CPU"
  },
  {
    "con": "Kiến trúc Harvard khác với kiến trúc Von Neumann ở điểm nào?",
    "re": "Harvard sử dụng bộ nhớ riêng cho dữ liệu và lệnh"
  },
  {
    "con": "Tốc độ xung nhịp của CPU ảnh hưởng như thế nào đến hiệu suất?",
    "re": "Tăng tốc độ xung nhịp thường dẫn đến hiệu suất cao hơn"
  },
  {
    "con": "Bộ xử lý đa nhân có lợi ích gì so với bộ xử lý đơn nhân?",
    "re": "Có khả năng xử lý nhiều tác vụ đồng thời"
  },
  {
    "con": "Tại sao việc tối ưu hóa đường dẫn dữ liệu là quan trọng?",
    "re": "Giúp tăng tốc độ xử lý và giảm độ trễ"
  },
  {
    "con": "Chức năng của ALU trong CPU là gì?",
    "re": "Thực hiện các phép toán số học và logic"
  },
  {
    "con": "Tại sao bộ nhớ RAM lại cần thiết trong máy tính?",
    "re": "Cung cấp không gian lưu trữ tạm thời cho dữ liệu và lệnh đang sử dụng"
  },
  {
    "con": "Sự khác biệt giữa bộ nhớ SRAM và DRAM là gì?",
    "re": "SRAM nhanh hơn và đắt hơn, trong khi DRAM chậm hơn và rẻ hơn"
  },
  {
    "con": "Tại sao việc sử dụng pipelining trong CPU lại quan trọng?",
    "re": "Tăng cường khả năng xử lý song song và hiệu suất tổng thể"
  },
  {
    "con": "Chức năng của Bus bộ vi xử lý trong máy tính là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ nhớ cache có dung lượng lớn hơn thì tốc độ truy cập dữ liệu sẽ nhanh hơn.",
    "re": "Tăng hiệu suất hệ thống"
  },
  {
    "con": "Nếu số lượng lõi trong bộ vi xử lý tăng lên thì khả năng xử lý đa nhiệm sẽ được cải thiện.",
    "re": "Tăng cường hiệu suất xử lý"
  },
  {
    "con": "Nếu kiến trúc máy tính sử dụng pipelining thì hiệu suất thực thi các lệnh sẽ cao hơn.",
    "re": "Giảm thời gian chờ giữa các lệnh"
  },
  {
    "con": "Nếu sử dụng kiến trúc Harvard thì bộ nhớ cho dữ liệu và lệnh sẽ tách biệt.",
    "re": "Tăng tốc độ truy cập và xử lý"
  },
  {
    "con": "Nếu tần số xung nhịp của bộ vi xử lý cao hơn thì khả năng xử lý sẽ nhanh hơn.",
    "re": "Tăng tốc độ thực thi"
  },
  {
    "con": "Nếu sử dụng kỹ thuật phân chia thời gian (time-sharing) thì nhiều người dùng có thể sử dụng tài nguyên máy tính đồng thời.",
    "re": "Tối ưu hóa sử dụng tài nguyên"
  },
  {
    "con": "Nếu bộ vi xử lý hỗ trợ đa luồng thì khả năng xử lý đồng thời sẽ được cải thiện.",
    "re": "Tăng cường hiệu suất ứng dụng"
  },
  {
    "con": "Nếu sử dụng kiến trúc RISC thì số lượng lệnh đơn giản sẽ nhiều hơn so với kiến trúc CISC.",
    "re": "Giảm độ phức tạp trong thiết kế"
  },
  {
    "con": "Nếu hệ thống sử dụng bộ nhớ ảo thì dung lượng bộ nhớ khả dụng sẽ lớn hơn dung lượng bộ nhớ vật lý.",
    "re": "Tăng khả năng chạy nhiều ứng dụng cùng lúc"
  },
  {
    "con": "Chức năng của Bus trong bộ vi xử lý của máy tính là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ nhớ cache có dung lượng lớn hơn thì tốc độ truy cập dữ liệu sẽ nhanh hơn.",
    "re": "Tăng hiệu suất của hệ thống"
  },
  {
    "con": "Nếu số lượng lõi trong bộ vi xử lý tăng lên thì khả năng xử lý đa nhiệm sẽ được cải thiện.",
    "re": "Tăng cường hiệu suất xử lý"
  },
  {
    "con": "Nếu kiến trúc Harvard được sử dụng thì bộ nhớ chương trình và bộ nhớ dữ liệu sẽ tách biệt.",
    "re": "Giảm thiểu xung đột truy cập bộ nhớ"
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ vi xử lý cao hơn thì khả năng thực hiện lệnh trong một giây sẽ tăng lên.",
    "re": "Cải thiện hiệu suất tổng thể"
  },
  {
    "con": "Nếu sử dụng kỹ thuật pipelining thì thời gian thực hiện lệnh sẽ được giảm thiểu.",
    "re": "Tăng cường hiệu suất xử lý lệnh"
  },
  {
    "con": "Nếu bộ vi xử lý sử dụng kiến trúc RISC thì số lượng lệnh sẽ ít hơn nhưng mỗi lệnh sẽ thực hiện nhanh hơn.",
    "re": "Tối ưu hóa hiệu suất xử lý"
  },
  {
    "con": "Nếu hệ thống sử dụng bộ nhớ ảo thì dung lượng bộ nhớ khả dụng sẽ lớn hơn dung lượng bộ nhớ vật lý.",
    "re": "Tăng cường khả năng chạy ứng dụng"
  },
  {
    "con": "Nếu có nhiều bus dữ liệu thì khả năng truyền tải dữ liệu giữa các thành phần sẽ được cải thiện.",
    "re": "Tăng cường băng thông hệ thống"
  },
  {
    "con": "Nếu sử dụng kỹ thuật đồng bộ hóa trong đa xử lý thì sẽ giảm thiểu tình trạng deadlock.",
    "re": "Cải thiện tính ổn định của hệ thống"
  },
  {
    "con": "So với Bus không đồng bộ, Bus đồng bộ có đặc điểm là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn,",
    "re": "thời gian truy cập dữ liệu sẽ nhanh hơn."
  },
  {
    "con": "Nếu một CPU có nhiều lõi xử lý,",
    "re": "nó có khả năng thực hiện nhiều tác vụ song song hơn."
  },
  {
    "con": "Nếu kiến trúc Harvard được sử dụng,",
    "re": "bộ nhớ cho dữ liệu và chương trình sẽ tách biệt."
  },
  {
    "con": "Nếu tốc độ xung nhịp của CPU tăng,",
    "re": "hiệu suất xử lý của CPU cũng có khả năng tăng theo."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo,",
    "re": "nó có thể chạy các chương trình lớn hơn dung lượng bộ nhớ vật lý."
  },
  {
    "con": "Nếu có nhiều đường dẫn dữ liệu trong một CPU,",
    "re": "nó có thể xử lý nhiều lệnh cùng một lúc."
  },
  {
    "con": "Nếu sử dụng kiến trúc RISC,",
    "re": "các lệnh sẽ được thực hiện nhanh hơn do độ phức tạp thấp."
  },
  {
    "con": "Nếu một hệ thống có bộ điều khiển tốt,",
    "re": "nó sẽ tối ưu hóa việc sử dụng tài nguyên hệ thống."
  },
  {
    "con": "Nếu một CPU có bộ nhớ cache L1 nhanh hơn L2,",
    "re": "thời gian truy cập dữ liệu sẽ được cải thiện."
  },
  {
    "con": "So với Bus đồng bộ, Bus không đồng bộ có đặc điểm là:",
    "re": "Bus không đồng bộ cho phép truyền dữ liệu không theo chu kỳ, giúp tăng tính linh hoạt."
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn:",
    "re": "thời gian truy cập dữ liệu sẽ giảm do khả năng lưu trữ nhiều dữ liệu hơn gần CPU."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Harvard:",
    "re": "thì nó có thể truy cập đồng thời bộ nhớ dữ liệu và bộ nhớ lệnh, cải thiện hiệu suất."
  },
  {
    "con": "Nếu số lượng lõi trong CPU tăng lên:",
    "re": "thì khả năng xử lý đa nhiệm và hiệu suất tổng thể của hệ thống sẽ được cải thiện."
  },
  {
    "con": "Nếu sử dụng kiến trúc RISC:",
    "re": "thì các lệnh sẽ được thực hiện nhanh hơn do thiết kế đơn giản và tối ưu hóa cho tốc độ."
  },
  {
    "con": "Nếu một hệ thống có bus dữ liệu rộng hơn:",
    "re": "thì băng thông truyền tải dữ liệu sẽ cao hơn, cho phép truyền tải nhiều dữ liệu hơn trong một lần."
  },
  {
    "con": "Nếu sử dụng kỹ thuật pipelining trong CPU:",
    "re": "thì hiệu suất xử lý sẽ được cải thiện do các giai đoạn thực hiện lệnh có thể diễn ra song song."
  },
  {
    "con": "Nếu một hệ thống có bộ nhớ ảo:",
    "re": "thì nó có thể sử dụng không gian bộ nhớ lớn hơn so với bộ nhớ vật lý thực tế, giúp chạy nhiều ứng dụng hơn."
  },
  {
    "con": "Nếu một CPU có kiến trúc đa luồng:",
    "re": "thì nó có thể xử lý nhiều luồng dữ liệu đồng thời, cải thiện hiệu suất trong các ứng dụng đa nhiệm."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ điều khiển DMA:",
    "re": "thì CPU sẽ không cần phải can thiệp trong quá trình truyền dữ liệu, giải phóng tài nguyên cho các tác vụ khác."
  },
  {
    "con": "Trong trường hợp sử dụng Bus đồng bộ, nếu một thao tác có thời gian hoàn thành bằng 3,2 chu kỳ thì trong thực tế nó sẽ được thực hiện trong mấy chu kỳ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý sử dụng kiến trúc Harvard, thì nó sẽ có bộ nhớ riêng cho dữ liệu và lệnh.",
    "re": "Điều này giúp tăng tốc độ xử lý do không phải chia sẻ băng thông."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ cache, thì thời gian truy cập dữ liệu sẽ nhanh hơn so với việc truy cập trực tiếp vào bộ nhớ chính.",
    "re": "Điều này giúp cải thiện hiệu suất tổng thể của hệ thống."
  },
  {
    "con": "Nếu một CPU có nhiều lõi xử lý, thì nó có khả năng thực hiện nhiều tác vụ song song hơn.",
    "re": "Điều này dẫn đến hiệu suất cao hơn trong các ứng dụng đa nhiệm."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc RISC, thì các lệnh sẽ có độ dài cố định và được thực hiện trong một chu kỳ đồng hồ.",
    "re": "Điều này giúp đơn giản hóa thiết kế bộ xử lý và tăng tốc độ thực thi."
  },
  {
    "con": "Nếu một hệ thống có băng thông bus cao, thì nó có thể truyền tải nhiều dữ liệu hơn trong cùng một khoảng thời gian.",
    "re": "Điều này cải thiện khả năng xử lý và hiệu suất của hệ thống."
  },
  {
    "con": "Nếu một bộ xử lý sử dụng kỹ thuật pipelining, thì nó có thể thực hiện nhiều giai đoạn của lệnh khác nhau đồng thời.",
    "re": "Điều này giúp tăng tốc độ thực thi của chương trình."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo, thì nó có thể sử dụng không gian bộ nhớ lớn hơn so với bộ nhớ vật lý thực tế.",
    "re": "Điều này cho phép chạy nhiều ứng dụng hơn mà không gặp phải vấn đề thiếu bộ nhớ."
  },
  {
    "con": "Nếu một hệ thống có kiến trúc đa xử lý, thì nó có thể chia sẻ tải công việc giữa nhiều bộ xử lý.",
    "re": "Điều này giúp cải thiện hiệu suất và khả năng mở rộng của hệ thống."
  },
  {
    "con": "Nếu một hệ thống sử dụng công nghệ SIMD, thì nó có thể thực hiện cùng một thao tác trên nhiều dữ liệu cùng một lúc.",
    "re": "Điều này giúp tăng tốc độ xử lý cho các tác vụ tính toán lớn."
  },
  {
    "con": "Trong trường hợp sử dụng Bus không đồng bộ, nếu một thao tác có thời gian hoàn thành bằng 3,2 chu kỳ thì trong thực tế nó sẽ được thực hiện trong mấy chu kỳ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý sử dụng kiến trúc Harvard, thì nó có thể truy cập bộ nhớ lệnh và bộ nhớ dữ liệu đồng thời.",
    "re": "Điều này giúp tăng tốc độ xử lý."
  },
  {
    "con": "Nếu một hệ thống có nhiều lõi xử lý, thì nó có khả năng thực hiện nhiều tác vụ song song hơn.",
    "re": "Điều này cải thiện hiệu suất tổng thể của hệ thống."
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn, thì khả năng lưu trữ dữ liệu thường xuyên sử dụng sẽ cao hơn.",
    "re": "Điều này giúp giảm thời gian truy cập bộ nhớ chính."
  },
  {
    "con": "Nếu một kiến trúc sử dụng pipelining, thì các giai đoạn xử lý có thể được thực hiện đồng thời.",
    "re": "Điều này làm tăng hiệu suất xử lý của bộ xử lý."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo, thì nó có thể chạy các chương trình lớn hơn kích thước bộ nhớ vật lý.",
    "re": "Điều này giúp tối ưu hóa việc sử dụng bộ nhớ."
  },
  {
    "con": "Nếu một bộ xử lý có tốc độ xung nhịp cao hơn, thì nó có khả năng thực hiện nhiều phép toán hơn trong một giây.",
    "re": "Điều này thường dẫn đến hiệu suất cao hơn."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc RISC, thì nó có thể thực hiện các lệnh đơn giản hơn nhưng với tốc độ cao hơn.",
    "re": "Điều này giúp tối ưu hóa hiệu suất xử lý."
  },
  {
    "con": "Nếu một hệ thống có bus dữ liệu rộng hơn, thì nó có thể truyền tải nhiều dữ liệu hơn trong một lần truyền.",
    "re": "Điều này cải thiện băng thông của hệ thống."
  },
  {
    "con": "Nếu một bộ xử lý sử dụng kỹ thuật siêu phân luồng (Hyper-Threading), thì nó có thể xử lý nhiều luồng dữ liệu hơn trên cùng một lõi.",
    "re": "Điều này giúp tăng cường hiệu suất trong các tác vụ đa nhiệm."
  },
  {
    "con": "Độ rộng của Bus được xác định bởi:",
    "re": "băng thông tối đa mà hệ thống có thể truyền tải"
  },
  {
    "con": "Tốc độ xung nhịp của CPU tăng lên:",
    "re": "hiệu suất xử lý của CPU cũng sẽ tăng lên"
  },
  {
    "con": "Số lượng lõi trong CPU tăng lên:",
    "re": "khả năng xử lý đa nhiệm của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Cache L1 có tốc độ truy cập nhanh hơn Cache L2:",
    "re": "thời gian truy cập dữ liệu sẽ giảm"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ dữ liệu và bộ nhớ lệnh:",
    "re": "có thể cải thiện hiệu suất xử lý do giảm thiểu xung đột"
  },
  {
    "con": "Sử dụng bộ nhớ ảo:",
    "re": "cho phép hệ thống sử dụng nhiều bộ nhớ hơn so với bộ nhớ vật lý thực tế"
  },
  {
    "con": "Tăng kích thước bộ nhớ cache:",
    "re": "giúp giảm thiểu thời gian truy cập dữ liệu từ bộ nhớ chính"
  },
  {
    "con": "Sử dụng pipelining trong CPU:",
    "re": "có thể tăng cường hiệu suất xử lý bằng cách thực hiện nhiều lệnh đồng thời"
  },
  {
    "con": "Kiến trúc RISC có số lượng lệnh đơn giản hơn:",
    "re": "giúp tăng tốc độ thực thi lệnh do giảm độ phức tạp"
  },
  {
    "con": "Sử dụng bus song song thay vì bus nối tiếp:",
    "re": "có thể tăng tốc độ truyền dữ liệu giữa các thành phần"
  },
  {
    "con": "Tần số Bus đặc trưng cho:",
    "re": "băng thông tối đa mà bus có thể truyền tải dữ liệu."
  },
  {
    "con": "Số lượng lõi trong CPU tăng lên:",
    "re": "khả năng xử lý đa nhiệm và hiệu suất tổng thể của hệ thống sẽ được cải thiện."
  },
  {
    "con": "Cache L1 có tốc độ truy cập nhanh hơn Cache L2:",
    "re": "thời gian truy cập dữ liệu sẽ giảm, dẫn đến hiệu suất cao hơn cho CPU."
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ dữ liệu và bộ nhớ lệnh:",
    "re": "cho phép CPU truy cập đồng thời cả dữ liệu và lệnh, cải thiện hiệu suất."
  },
  {
    "con": "Sử dụng kỹ thuật pipelining trong CPU:",
    "re": "giúp tăng tốc độ xử lý bằng cách cho phép thực hiện nhiều lệnh cùng một lúc."
  },
  {
    "con": "Tăng kích thước bộ nhớ RAM:",
    "re": "có thể cải thiện khả năng chạy nhiều ứng dụng cùng lúc mà không bị chậm."
  },
  {
    "con": "Sử dụng kiến trúc RISC:",
    "re": "giúp đơn giản hóa thiết kế CPU và tăng tốc độ thực thi lệnh."
  },
  {
    "con": "Tốc độ xung nhịp của CPU cao hơn:",
    "re": "có thể dẫn đến hiệu suất xử lý cao hơn, nhưng cũng có thể tăng nhiệt độ và tiêu thụ điện năng."
  },
  {
    "con": "Sử dụng bộ điều khiển DMA:",
    "re": "giúp giảm tải cho CPU bằng cách cho phép các thiết bị ngoại vi truy cập bộ nhớ trực tiếp."
  },
  {
    "con": "Kiến trúc đa xử lý (Multiprocessing) được áp dụng:",
    "re": "có thể cải thiện hiệu suất tổng thể của hệ thống bằng cách phân chia công việc giữa nhiều CPU."
  },
  {
    "con": "Dải thông Bus được xác định bởi:",
    "re": "băng thông tối đa mà nó có thể truyền tải dữ liệu."
  },
  {
    "con": "Bộ nhớ Cache có kích thước nhỏ hơn bộ nhớ chính:",
    "re": "thời gian truy cập dữ liệu từ Cache nhanh hơn nhiều so với bộ nhớ chính."
  },
  {
    "con": "Số lượng lõi trong CPU tăng lên:",
    "re": "khả năng xử lý đa nhiệm và hiệu suất tổng thể của hệ thống sẽ được cải thiện."
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ dữ liệu và bộ nhớ lệnh:",
    "re": "có thể cải thiện hiệu suất do cho phép truy cập đồng thời vào cả hai loại bộ nhớ."
  },
  {
    "con": "Tốc độ xung nhịp của CPU tăng lên:",
    "re": "sẽ dẫn đến khả năng xử lý nhanh hơn cho các tác vụ đơn luồng."
  },
  {
    "con": "Sử dụng kỹ thuật pipelining trong CPU:",
    "re": "có thể tăng cường hiệu suất bằng cách cho phép nhiều lệnh được xử lý đồng thời."
  },
  {
    "con": "Bộ điều khiển (Control Unit) trong CPU:",
    "re": "chịu trách nhiệm điều phối hoạt động của các thành phần khác trong hệ thống."
  },
  {
    "con": "Kiến trúc RISC (Reduced Instruction Set Computer) sử dụng tập lệnh đơn giản:",
    "re": "có thể đạt được hiệu suất cao hơn nhờ vào việc tối ưu hóa quy trình thực thi lệnh."
  },
  {
    "con": "Sử dụng bộ nhớ ảo trong hệ điều hành:",
    "re": "cho phép hệ thống sử dụng không gian bộ nhớ lớn hơn so với bộ nhớ vật lý thực tế."
  },
  {
    "con": "Tốc độ truy cập của SSD nhanh hơn HDD:",
    "re": "sẽ cải thiện thời gian khởi động và tải ứng dụng trên hệ thống."
  },
  {
    "con": "Tham số nào đặc trưng cho tốc độ truyền dữ liệu trên Bus?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có kích thước lớn hơn bộ nhớ chính?",
    "re": "Câu trả lời sai"
  },
  {
    "con": "Kiến trúc Harvard cho phép truy cập đồng thời vào bộ nhớ lệnh và bộ nhớ dữ liệu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Số lượng bit trong một thanh ghi ảnh hưởng đến khả năng xử lý dữ liệu của CPU?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tốc độ xung nhịp của CPU càng cao thì hiệu suất xử lý càng tốt?",
    "re": "Câu trả lời đúng nhưng không phải lúc nào cũng đúng"
  },
  {
    "con": "Kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý đa nhân có thể thực hiện nhiều tác vụ song song hơn bộ xử lý đơn nhân?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ ảo cho phép hệ thống sử dụng nhiều bộ nhớ hơn so với bộ nhớ vật lý thực tế?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tính năng pipelining giúp tăng tốc độ xử lý của CPU bằng cách thực hiện nhiều giai đoạn của lệnh cùng một lúc?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bus dữ liệu có thể truyền tải dữ liệu theo cả hai chiều cùng một lúc?",
    "re": "Câu trả lời đúng nếu là bus dữ liệu song công"
  },
  {
    "con": "Tham số nào cho biết số lượng Byte chuyển qua Bus trong một đơn vị thời gian?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có tốc độ truy cập nhanh hơn bộ nhớ chính?",
    "re": "Điều này giúp tăng hiệu suất hệ thống"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ cho dữ liệu và lệnh?",
    "re": "Điều này cho phép truy cập đồng thời vào dữ liệu và lệnh"
  },
  {
    "con": "Số lượng bit trong một thanh ghi xác định kích thước dữ liệu mà CPU có thể xử lý?",
    "re": "Điều này ảnh hưởng đến hiệu suất và khả năng xử lý của CPU"
  },
  {
    "con": "Tần số xung nhịp của CPU càng cao thì hiệu suất xử lý càng lớn?",
    "re": "Tuy nhiên, điều này cũng phụ thuộc vào kiến trúc và số lượng lõi"
  },
  {
    "con": "Bộ xử lý đa lõi có thể thực hiện nhiều tác vụ song song?",
    "re": "Điều này giúp cải thiện hiệu suất trong các ứng dụng đa nhiệm"
  },
  {
    "con": "Bus hệ thống có vai trò kết nối các thành phần trong máy tính?",
    "re": "Điều này cho phép truyền tải dữ liệu giữa CPU, bộ nhớ và thiết bị ngoại vi"
  },
  {
    "con": "Kỹ thuật pipelining cho phép CPU xử lý nhiều lệnh cùng một lúc?",
    "re": "Điều này giúp tăng tốc độ xử lý tổng thể của CPU"
  },
  {
    "con": "Bộ nhớ ảo cho phép hệ thống sử dụng không gian bộ nhớ lớn hơn bộ nhớ vật lý?",
    "re": "Điều này giúp chạy nhiều ứng dụng hơn mà không gặp phải giới hạn bộ nhớ"
  },
  {
    "con": "Kiến trúc RISC có số lượng lệnh đơn giản hơn so với kiến trúc CISC?",
    "re": "Điều này giúp tăng tốc độ thực thi lệnh và hiệu quả sử dụng năng lượng"
  },
  {
    "con": "Tham số nào của Bus cho biết đường dây của nó?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "CPU có nhiều lõi hơn thì khả năng xử lý đa nhiệm sẽ tốt hơn.",
    "re": "Hiệu suất xử lý tăng lên"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn thì thời gian truy cập dữ liệu sẽ nhanh hơn.",
    "re": "Tăng tốc độ xử lý"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ dữ liệu và bộ nhớ lệnh thì hiệu suất sẽ cao hơn kiến trúc Von Neumann.",
    "re": "Giảm thiểu xung đột truy cập"
  },
  {
    "con": "Sử dụng pipelining trong CPU thì có thể tăng cường hiệu suất xử lý.",
    "re": "Giảm thời gian thực hiện lệnh"
  },
  {
    "con": "Tăng băng thông của bus thì khả năng truyền tải dữ liệu giữa các thành phần sẽ tốt hơn.",
    "re": "Giảm độ trễ trong truyền dữ liệu"
  },
  {
    "con": "Sử dụng bộ điều khiển DMA thì CPU sẽ không bị chiếm dụng trong quá trình truyền dữ liệu.",
    "re": "Tăng hiệu suất tổng thể của hệ thống"
  },
  {
    "con": "Số lượng thanh ghi trong CPU nhiều hơn thì khả năng xử lý các phép toán sẽ nhanh hơn.",
    "re": "Giảm thiểu số lần truy cập bộ nhớ"
  },
  {
    "con": "Sử dụng kiến trúc RISC thì số lượng lệnh đơn giản sẽ tăng lên.",
    "re": "Tăng tốc độ thực thi lệnh"
  },
  {
    "con": "Tối ưu hóa đường dẫn dữ liệu trong kiến trúc thì hiệu suất tổng thể của hệ thống sẽ được cải thiện.",
    "re": "Giảm thiểu độ trễ trong xử lý"
  },
  {
    "con": "Trong các Bus sau, Bus nào là Bus một chiều?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý sử dụng kiến trúc RISC,",
    "re": "thì nó sẽ có số lượng lệnh đơn giản và thực thi nhanh hơn."
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn,",
    "re": "thì hiệu suất truy cập dữ liệu sẽ được cải thiện."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi,",
    "re": "thì nó có khả năng xử lý nhiều tác vụ đồng thời tốt hơn."
  },
  {
    "con": "Nếu tốc độ xung nhịp của CPU tăng,",
    "re": "thì khả năng xử lý của CPU cũng sẽ tăng lên."
  },
  {
    "con": "Nếu một hệ thống sử dụng bus dữ liệu rộng hơn,",
    "re": "thì nó có thể truyền tải nhiều dữ liệu hơn trong một lần."
  },
  {
    "con": "Nếu một chương trình sử dụng nhiều tài nguyên bộ nhớ,",
    "re": "thì nó có thể gây ra hiện tượng swap, làm giảm hiệu suất."
  },
  {
    "con": "Nếu một hệ thống có kiến trúc Harvard,",
    "re": "thì nó sẽ có bộ nhớ riêng cho dữ liệu và lệnh."
  },
  {
    "con": "Nếu một CPU có nhiều đơn vị thực thi,",
    "re": "thì nó có thể thực hiện nhiều lệnh cùng một lúc."
  },
  {
    "con": "Nếu một hệ thống sử dụng kỹ thuật pipelining,",
    "re": "thì nó có thể tăng tốc độ thực thi lệnh bằng cách chồng chéo các giai đoạn thực thi."
  },
  {
    "con": "Bus dữ liệu trong máy tính là:",
    "re": "kênh truyền tải dữ liệu giữa các thành phần của máy tính."
  },
  {
    "con": "Nếu bộ xử lý có nhiều lõi (multi-core):",
    "re": "thì nó có khả năng xử lý nhiều tác vụ đồng thời hiệu quả hơn."
  },
  {
    "con": "Nếu bộ nhớ cache có dung lượng lớn:",
    "re": "thì hiệu suất truy cập dữ liệu từ bộ nhớ chính sẽ được cải thiện."
  },
  {
    "con": "Nếu kiến trúc máy tính sử dụng pipelining:",
    "re": "thì tốc độ xử lý lệnh sẽ được tăng cường nhờ vào việc thực hiện nhiều giai đoạn xử lý đồng thời."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Harvard:",
    "re": "thì nó có bộ nhớ riêng cho dữ liệu và lệnh, giúp tăng tốc độ truy cập."
  },
  {
    "con": "Nếu bus địa chỉ có độ dài lớn:",
    "re": "thì nó có thể truy cập nhiều địa chỉ bộ nhớ hơn."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo:",
    "re": "thì nó có thể chạy các chương trình lớn hơn dung lượng bộ nhớ vật lý."
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ xử lý cao:",
    "re": "thì khả năng xử lý của bộ xử lý sẽ được cải thiện."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc RISC:",
    "re": "thì nó có thể thực hiện các lệnh đơn giản với tốc độ cao hơn."
  },
  {
    "con": "Nếu hệ thống có nhiều bus:",
    "re": "thì khả năng truyền tải dữ liệu giữa các thành phần sẽ được tối ưu hóa."
  },
  {
    "con": "Bus địa chỉ trong máy tính là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn:",
    "re": "Có khả năng xử lý đa nhiệm tốt hơn"
  },
  {
    "con": "Bộ nhớ cache có dung lượng nhỏ hơn bộ nhớ chính:",
    "re": "Có tốc độ truy cập nhanh hơn"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ dữ liệu và bộ nhớ lệnh:",
    "re": "Cho phép truy cập đồng thời vào cả hai loại bộ nhớ"
  },
  {
    "con": "Tần số xung nhịp của bộ xử lý cao hơn:",
    "re": "Thường dẫn đến hiệu suất xử lý cao hơn"
  },
  {
    "con": "Sử dụng kỹ thuật pipelining trong bộ xử lý:",
    "re": "Tăng cường hiệu suất bằng cách thực hiện nhiều lệnh đồng thời"
  },
  {
    "con": "Bộ điều khiển trong kiến trúc máy tính:",
    "re": "Chịu trách nhiệm điều phối hoạt động của các thành phần khác"
  },
  {
    "con": "Số lượng bit trong bus dữ liệu lớn hơn:",
    "re": "Cho phép truyền tải dữ liệu lớn hơn trong một lần"
  },
  {
    "con": "Kiến trúc RISC có số lượng lệnh đơn giản hơn:",
    "re": "Thường dẫn đến hiệu suất cao hơn trong các ứng dụng nhất định"
  },
  {
    "con": "Sử dụng bộ nhớ ảo trong hệ thống:",
    "re": "Cho phép chạy các ứng dụng lớn hơn dung lượng bộ nhớ vật lý"
  },
  {
    "con": "Bus điều khiển trong máy tính là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có tốc độ nhanh hơn bộ nhớ chính:",
    "re": "Thời gian truy cập dữ liệu sẽ giảm"
  },
  {
    "con": "Số lượng lõi trong CPU tăng lên:",
    "re": "Khả năng xử lý đa nhiệm sẽ được cải thiện"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ dữ liệu và bộ nhớ lệnh:",
    "re": "Hiệu suất xử lý có thể cao hơn so với kiến trúc Von Neumann"
  },
  {
    "con": "Tần số xung nhịp của CPU tăng lên:",
    "re": "Tốc độ xử lý của CPU sẽ tăng"
  },
  {
    "con": "Sử dụng kỹ thuật pipelining trong CPU:",
    "re": "Tăng cường hiệu suất xử lý bằng cách thực hiện nhiều lệnh đồng thời"
  },
  {
    "con": "Bộ điều khiển trong CPU có nhiệm vụ:",
    "re": "Quản lý và điều phối các hoạt động của các thành phần khác"
  },
  {
    "con": "Kiến trúc RISC sử dụng tập lệnh đơn giản hơn:",
    "re": "Thời gian thực thi lệnh sẽ giảm"
  },
  {
    "con": "Sử dụng bộ nhớ ảo trong hệ thống:",
    "re": "Cho phép chạy nhiều ứng dụng hơn so với dung lượng bộ nhớ vật lý"
  },
  {
    "con": "Tốc độ bus dữ liệu cao hơn:",
    "re": "Khả năng truyền tải dữ liệu giữa các thành phần sẽ nhanh hơn"
  },
  {
    "con": "Trong các Bus sau, Bus nào là Bus hai chiều đối với mỗi đường tín hiệu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý sử dụng kiến trúc RISC, thì số lượng lệnh sẽ thường ít hơn so với kiến trúc CISC.",
    "re": "Điều này giúp đơn giản hóa thiết kế và tăng tốc độ thực thi lệnh."
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn, thì khả năng truy cập dữ liệu sẽ nhanh hơn.",
    "re": "Điều này giúp giảm thiểu thời gian truy cập bộ nhớ chính."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi, thì khả năng xử lý song song sẽ được cải thiện.",
    "re": "Điều này cho phép thực hiện nhiều tác vụ đồng thời."
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ xử lý tăng lên, thì hiệu suất xử lý cũng có khả năng tăng theo.",
    "re": "Tuy nhiên, điều này cũng phụ thuộc vào kiến trúc và công nghệ sản xuất."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo, thì dung lượng bộ nhớ khả dụng sẽ lớn hơn dung lượng bộ nhớ vật lý.",
    "re": "Điều này cho phép chạy nhiều ứng dụng hơn mà không bị giới hạn bởi bộ nhớ vật lý."
  },
  {
    "con": "Nếu một bus dữ liệu có bề rộng 64 bit, thì nó có thể truyền tải 8 byte dữ liệu cùng một lúc.",
    "re": "Điều này giúp tăng băng thông truyền tải dữ liệu."
  },
  {
    "con": "Nếu một hệ thống sử dụng kỹ thuật pipelining, thì thời gian thực thi lệnh sẽ được giảm thiểu.",
    "re": "Điều này cho phép nhiều lệnh được xử lý đồng thời trong các giai đoạn khác nhau."
  },
  {
    "con": "Nếu một bộ xử lý có kiến trúc Harvard, thì nó có bộ nhớ riêng cho dữ liệu và lệnh.",
    "re": "Điều này giúp tăng tốc độ truy cập và thực thi lệnh."
  },
  {
    "con": "Nếu một hệ thống sử dụng kỹ thuật phân đoạn bộ nhớ, thì quản lý bộ nhớ sẽ linh hoạt hơn.",
    "re": "Điều này cho phép phân chia bộ nhớ thành các khối có kích thước khác nhau."
  },
  {
    "con": "Bus ISA có tần số là 8MHz, độ rộng Bus bằng 16 bit, thời gian truyền một khối 16 bit cần 2 chu kỳ. Khi đó dải thông của Bus bằng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý có 4 lõi và mỗi lõi có thể thực hiện 2 luồng đồng thời, thì tổng số luồng mà bộ xử lý có thể xử lý là:",
    "re": "8 luồng"
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước 256KB và thời gian truy cập là 2ns, trong khi bộ nhớ chính có kích thước 8GB và thời gian truy cập là 100ns, thì thời gian truy cập trung bình sẽ giảm khi sử dụng cache.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một kiến trúc sử dụng pipelining với 5 giai đoạn và mỗi giai đoạn mất 1 chu kỳ đồng hồ, thì thời gian thực hiện một lệnh sẽ giảm xuống còn 5 chu kỳ cho 5 lệnh liên tiếp.",
    "re": "Sai"
  },
  {
    "con": "Nếu một hệ thống có 2 bộ xử lý và sử dụng kiến trúc SMP (Symmetric Multiprocessing), thì cả hai bộ xử lý đều có quyền truy cập vào bộ nhớ chung.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một lệnh được thực hiện trong 4 chu kỳ đồng hồ và có 10 lệnh cần thực hiện, thì thời gian tối thiểu để thực hiện tất cả các lệnh là:",
    "re": "40 chu kỳ đồng hồ"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Harvard, thì bộ nhớ chương trình và bộ nhớ dữ liệu được tách biệt hoàn toàn.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một vi xử lý có tần số 3GHz và mỗi chu kỳ có thể thực hiện 4 lệnh, thì số lệnh tối đa mà vi xử lý có thể thực hiện trong 1 giây là:",
    "re": "12 tỷ lệnh"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo và có kích thước trang là 4KB, thì số trang tối đa có thể được quản lý trong bộ nhớ 32-bit là:",
    "re": "2^20 trang"
  },
  {
    "con": "Nếu một bus có băng thông 1GB/s và thời gian truyền một khối dữ liệu là 10ms, thì kích thước khối dữ liệu tối đa có thể truyền trong thời gian đó là:",
    "re": "10MB"
  },
  {
    "con": "Bus PCI có tần số là 33MHz, độ rộng Bus bằng 32 bit, thời gian truyền một khối 32 bit cần 2 chu kỳ. Khi đó dải thông của Bus bằng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý có kiến trúc 64 bit, thì nó có thể xử lý dữ liệu lớn hơn 4GB trong một lần.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước 1MB và thời gian truy cập là 2ns, thì thời gian truy cập trung bình sẽ thấp hơn so với truy cập bộ nhớ chính.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Harvard, thì nó có thể truy cập bộ nhớ lệnh và bộ nhớ dữ liệu đồng thời.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tần số xung nhịp của CPU tăng lên 3GHz, thì khả năng xử lý của CPU có thể tăng lên, giả sử số lượng lõi không thay đổi.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kỹ thuật pipelining, thì nó có thể cải thiện hiệu suất xử lý bằng cách thực hiện nhiều lệnh đồng thời.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một bộ xử lý có 4 lõi và mỗi lõi có thể thực hiện 2 luồng, thì tổng số luồng mà bộ xử lý có thể xử lý đồng thời là 8.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hệ thống có bus dữ liệu 64 bit và bus địa chỉ 32 bit, thì nó có thể truy cập tối đa 4GB bộ nhớ.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng RAM DDR4 với tốc độ 2400 MT/s, thì băng thông tối đa có thể đạt được là 19.2 GB/s.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hệ thống có bộ điều khiển DMA, thì nó có thể chuyển dữ liệu giữa bộ nhớ và thiết bị ngoại vi mà không cần CPU can thiệp.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trọng tài Bus có chức năng gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có tốc độ truy cập nhanh hơn bộ nhớ chính?",
    "re": "Đúng"
  },
  {
    "con": "Số lượng lõi trong CPU tăng lên có thể cải thiện hiệu suất xử lý đa nhiệm?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ cho dữ liệu và lệnh?",
    "re": "Đúng"
  },
  {
    "con": "Tốc độ xung nhịp của CPU càng cao thì hiệu suất xử lý càng tốt?",
    "re": "Không hoàn toàn đúng, còn phụ thuộc vào nhiều yếu tố khác"
  },
  {
    "con": "Bộ điều khiển (Control Unit) có nhiệm vụ giải mã lệnh và điều phối hoạt động của các thành phần khác?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc Von Neumann có thể gây ra hiện tượng tắc nghẽn dữ liệu?",
    "re": "Đúng"
  },
  {
    "con": "Hệ thống đa xử lý (Multiprocessing) có thể cải thiện hiệu suất tổng thể của hệ thống?",
    "re": "Đúng"
  },
  {
    "con": "Bộ nhớ ảo cho phép hệ thống sử dụng nhiều bộ nhớ hơn so với bộ nhớ vật lý thực tế?",
    "re": "Đúng"
  },
  {
    "con": "Tính năng pipelining trong CPU giúp tăng tốc độ xử lý bằng cách thực hiện nhiều giai đoạn của lệnh cùng một lúc?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc Von Neumann có một bus chung cho dữ liệu và lệnh",
    "re": "Có thể dẫn đến hiện tượng tắc nghẽn khi CPU và bộ nhớ cùng truy cập"
  },
  {
    "con": "Số lượng bit trong bus dữ liệu tăng lên",
    "re": "Tăng khả năng truyền tải dữ liệu giữa CPU và bộ nhớ"
  },
  {
    "con": "Sử dụng bộ nhớ cache",
    "re": "Giúp giảm thời gian truy cập dữ liệu cho CPU"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ lệnh và bộ nhớ dữ liệu",
    "re": "Cho phép CPU truy cập đồng thời cả lệnh và dữ liệu"
  },
  {
    "con": "Số lượng lõi trong CPU tăng lên",
    "re": "Cải thiện khả năng xử lý đa nhiệm và hiệu suất tổng thể"
  },
  {
    "con": "Sử dụng pipelining trong CPU",
    "re": "Tăng tốc độ thực thi lệnh bằng cách cho phép nhiều lệnh được xử lý đồng thời"
  },
  {
    "con": "Tốc độ xung nhịp của CPU tăng lên",
    "re": "Tăng khả năng xử lý của CPU nhưng cũng có thể làm tăng tiêu thụ năng lượng"
  },
  {
    "con": "Sử dụng kiến trúc RISC",
    "re": "Giúp đơn giản hóa thiết kế CPU và cải thiện hiệu suất thực thi lệnh"
  },
  {
    "con": "Sử dụng kiến trúc CISC",
    "re": "Cho phép thực hiện nhiều lệnh phức tạp trong một chu kỳ đồng hồ"
  },
  {
    "con": "Sử dụng hệ thống đa xử lý",
    "re": "Cải thiện khả năng mở rộng và hiệu suất cho các ứng dụng yêu cầu tính toán cao"
  },
  {
    "con": "Đặc điểm của trọng tài Bus không tập trung với multibus",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có kích thước nhỏ hơn bộ nhớ chính",
    "re": "Thời gian truy cập nhanh hơn"
  },
  {
    "con": "Số lượng lõi xử lý trong CPU tăng lên",
    "re": "Khả năng xử lý đa nhiệm tốt hơn"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ dữ liệu và bộ nhớ lệnh",
    "re": "Tăng tốc độ xử lý do không có xung đột giữa lệnh và dữ liệu"
  },
  {
    "con": "Sử dụng pipelining trong CPU",
    "re": "Tăng hiệu suất xử lý bằng cách thực hiện nhiều lệnh đồng thời"
  },
  {
    "con": "Bộ điều khiển sử dụng kỹ thuật phân tán",
    "re": "Giảm thiểu độ trễ trong việc xử lý lệnh"
  },
  {
    "con": "Sử dụng bộ nhớ ảo",
    "re": "Tăng khả năng sử dụng bộ nhớ vật lý hiệu quả hơn"
  },
  {
    "con": "Kiến trúc RISC có số lượng lệnh đơn giản hơn",
    "re": "Dễ dàng tối ưu hóa và thực hiện trong phần cứng"
  },
  {
    "con": "Sử dụng kỹ thuật đồng bộ hóa trong đa xử lý",
    "re": "Giảm thiểu xung đột dữ liệu giữa các lõi"
  },
  {
    "con": "Tốc độ xung nhịp của CPU tăng lên",
    "re": "Tăng khả năng xử lý nhưng có thể dẫn đến tiêu thụ năng lượng cao hơn"
  },
  {
    "con": "Đặc điểm của trọng tài Bus tập trung một mức:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có kích thước nhỏ hơn bộ nhớ chính:",
    "re": "Thời gian truy cập nhanh hơn"
  },
  {
    "con": "Số lượng lõi trong CPU tăng lên:",
    "re": "Khả năng xử lý đa nhiệm tốt hơn"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ cho dữ liệu và lệnh:",
    "re": "Tăng tốc độ xử lý do không có xung đột giữa lệnh và dữ liệu"
  },
  {
    "con": "Sử dụng pipelining trong CPU:",
    "re": "Tăng hiệu suất xử lý bằng cách thực hiện nhiều lệnh đồng thời"
  },
  {
    "con": "Bộ điều khiển sử dụng phương pháp điều khiển tuần tự:",
    "re": "Dễ dàng thiết kế nhưng có thể chậm hơn so với điều khiển song song"
  },
  {
    "con": "Số lượng bit trong bus dữ liệu tăng lên:",
    "re": "Khả năng truyền tải dữ liệu lớn hơn trong một lần"
  },
  {
    "con": "Sử dụng kiến trúc RISC:",
    "re": "Giảm độ phức tạp của lệnh và tăng tốc độ thực thi"
  },
  {
    "con": "Tốc độ xung nhịp của CPU tăng lên:",
    "re": "Hiệu suất xử lý có thể cải thiện nhưng tiêu tốn nhiều năng lượng hơn"
  },
  {
    "con": "Sử dụng bộ nhớ ảo:",
    "re": "Cho phép chạy nhiều ứng dụng hơn so với dung lượng bộ nhớ vật lý"
  },
  {
    "con": "Kiến trúc von Neumann có một bus chung cho dữ liệu và lệnh:",
    "re": "Có thể dẫn đến hiện tượng tắc nghẽn khi CPU và bộ nhớ truy cập đồng thời"
  },
  {
    "con": "Bộ nhớ cache có nhiều cấp độ (L1, L2, L3):",
    "re": "Giúp cải thiện hiệu suất truy cập dữ liệu cho CPU"
  },
  {
    "con": "Số lượng lõi trong CPU tăng lên:",
    "re": "Cho phép xử lý đa nhiệm hiệu quả hơn"
  },
  {
    "con": "Sử dụng kiến trúc RISC:",
    "re": "Giúp đơn giản hóa thiết kế bộ xử lý và tăng tốc độ thực thi lệnh"
  },
  {
    "con": "Bộ xử lý sử dụng pipelining:",
    "re": "Có thể thực hiện nhiều lệnh đồng thời, tăng hiệu suất"
  },
  {
    "con": "Sử dụng bộ nhớ ảo:",
    "re": "Cho phép chạy các ứng dụng lớn hơn dung lượng bộ nhớ vật lý"
  },
  {
    "con": "Kiến trúc MIPS sử dụng bộ lệnh cố định:",
    "re": "Giúp đơn giản hóa quá trình giải mã lệnh"
  },
  {
    "con": "Số lượng bit trong bus dữ liệu tăng lên:",
    "re": "Tăng khả năng truyền tải dữ liệu giữa các thành phần của hệ thống"
  },
  {
    "con": "Sử dụng kỹ thuật phân chia thời gian (time-sharing):",
    "re": "Cho phép nhiều người dùng truy cập tài nguyên máy tính đồng thời"
  },
  {
    "con": "Sử dụng các kỹ thuật tối ưu hóa như out-of-order execution:",
    "re": "Giúp cải thiện hiệu suất xử lý bằng cách giảm thời gian chờ lệnh"
  },
  {
    "con": "Trong kiểu trọng tài Bus nào thì việc phân chia quyền sử dụng Bus do một đơn vị trọng tài Bus duy nhất đảm nhiệm?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý sử dụng kiến trúc Harvard thì nó có thể truy cập bộ nhớ lệnh và bộ nhớ dữ liệu đồng thời?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hệ thống máy tính có nhiều lõi xử lý thì nó có khả năng thực hiện đa nhiệm tốt hơn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ xử lý tăng lên thì hiệu suất xử lý của nó cũng có khả năng tăng theo?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một kiến trúc máy tính sử dụng bộ nhớ cache thì thời gian truy cập dữ liệu sẽ nhanh hơn so với truy cập trực tiếp vào bộ nhớ chính?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc RISC thì các lệnh sẽ có độ dài cố định và đơn giản hơn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một bộ xử lý có nhiều đường dẫn dữ liệu thì nó có thể thực hiện nhiều phép toán cùng một lúc?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hệ thống máy tính sử dụng kỹ thuật pipelining thì nó có thể cải thiện hiệu suất xử lý bằng cách chia nhỏ các giai đoạn thực hiện lệnh?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một kiến trúc máy tính sử dụng phương pháp phân chia tải (load balancing) thì nó có thể tối ưu hóa hiệu suất của các tài nguyên hệ thống?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hệ thống máy tính có bộ điều khiển DMA thì nó có thể giảm tải cho CPU trong việc truyền dữ liệu giữa các thiết bị ngoại vi và bộ nhớ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong kiểu trọng tài Bus nào thì việc phân chia quyền sử dụng Bus không cần một đơn vị trọng tài Bus riêng biệt",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý sử dụng kiến trúc RISC thì số lượng lệnh sẽ ít hơn so với kiến trúc CISC",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn thì thời gian truy cập dữ liệu sẽ giảm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kỹ thuật pipelining thì hiệu suất xử lý sẽ được cải thiện",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một CPU có nhiều lõi thì khả năng xử lý đa nhiệm sẽ tốt hơn",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng lớn hơn thì lượng dữ liệu truyền tải trong một chu kỳ sẽ tăng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu sử dụng kiến trúc đa cấp thì hiệu suất truy cập bộ nhớ sẽ được cải thiện",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hệ thống có bộ nhớ ảo thì dung lượng bộ nhớ khả dụng sẽ lớn hơn dung lượng bộ nhớ vật lý",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kỹ thuật phân chia thời gian thì nhiều tiến trình có thể chạy đồng thời",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hệ thống có khả năng xử lý song song thì thời gian hoàn thành tác vụ sẽ giảm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong kiểu trọng tài Bus nào thì các thiết bị ngoại vi dùng chung một đường dây yêu cầu Bus?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý sử dụng kiến trúc RISC thì số lượng lệnh sẽ ít hơn so với kiến trúc CISC.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn thì thời gian truy cập dữ liệu có thể tăng lên.",
    "re": "Điều này không đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi thì hiệu suất xử lý sẽ được cải thiện khi thực hiện các tác vụ song song.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng lớn hơn thì băng thông truyền tải dữ liệu sẽ cao hơn.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo thì dung lượng bộ nhớ khả dụng sẽ lớn hơn dung lượng bộ nhớ vật lý.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một CPU có tốc độ xung nhịp cao hơn thì khả năng xử lý sẽ luôn nhanh hơn.",
    "re": "Điều này không đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc pipelining thì thời gian thực hiện lệnh sẽ giảm.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một thiết bị ngoại vi sử dụng giao thức DMA thì CPU sẽ không cần can thiệp trong quá trình truyền dữ liệu.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một hệ thống có nhiều tầng bộ nhớ thì hiệu suất truy cập dữ liệu sẽ được cải thiện.",
    "re": "Điều này đúng"
  },
  {
    "con": "Trong kiểu trọng tài Bus nào thì các thiết bị ngoại vi được nối với các đường dây yêu cầu Bus khác nhau?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý sử dụng kiến trúc Harvard thì dữ liệu và lệnh sẽ được lưu trữ ở hai bộ nhớ khác nhau.",
    "re": "Kiến trúc Harvard cho phép truy cập đồng thời vào dữ liệu và lệnh."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ cache thì thời gian truy cập dữ liệu sẽ nhanh hơn so với việc truy cập trực tiếp vào bộ nhớ chính.",
    "re": "Bộ nhớ cache giúp cải thiện hiệu suất hệ thống."
  },
  {
    "con": "Nếu số lượng bit trong bus dữ liệu tăng lên thì băng thông của hệ thống cũng sẽ tăng theo.",
    "re": "Băng thông cao hơn cho phép truyền tải nhiều dữ liệu hơn trong cùng một khoảng thời gian."
  },
  {
    "con": "Nếu một CPU có nhiều lõi xử lý thì nó có khả năng thực hiện nhiều tác vụ song song hơn.",
    "re": "Nhiều lõi giúp tăng cường hiệu suất xử lý đa nhiệm."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc RISC thì các lệnh sẽ được thiết kế đơn giản và thực hiện trong một chu kỳ đồng hồ.",
    "re": "Kiến trúc RISC tối ưu hóa hiệu suất và tiết kiệm năng lượng."
  },
  {
    "con": "Nếu một hệ thống có bộ điều khiển đa kênh thì nó có thể quản lý nhiều thiết bị ngoại vi cùng một lúc.",
    "re": "Bộ điều khiển đa kênh giúp tăng cường khả năng mở rộng của hệ thống."
  },
  {
    "con": "Nếu một hệ thống sử dụng kỹ thuật pipelining thì nó có thể tăng tốc độ thực thi của các lệnh.",
    "re": "Pipelining cho phép thực hiện nhiều lệnh đồng thời trong các giai đoạn khác nhau."
  },
  {
    "con": "Nếu một hệ thống có bộ nhớ ảo thì nó có thể sử dụng không gian lưu trữ trên đĩa cứng như một phần của bộ nhớ chính.",
    "re": "Bộ nhớ ảo giúp mở rộng không gian bộ nhớ khả dụng cho ứng dụng."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc SIMD thì nó có thể thực hiện cùng một lệnh trên nhiều dữ liệu cùng lúc.",
    "re": "Kiến trúc SIMD tối ưu hóa hiệu suất cho các tác vụ xử lý dữ liệu lớn."
  },
  {
    "con": "Thành phần nào có thể đóng vai trò chủ Bus (Bus Master)?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý có nhiều lõi (multi-core),",
    "re": "thì khả năng xử lý đa nhiệm sẽ được cải thiện."
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn,",
    "re": "thì hiệu suất truy cập dữ liệu sẽ cao hơn."
  },
  {
    "con": "Nếu kiến trúc sử dụng pipelining,",
    "re": "thì tốc độ xử lý lệnh sẽ được tăng cường."
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng lớn hơn,",
    "re": "thì lượng dữ liệu truyền tải trong một chu kỳ sẽ tăng."
  },
  {
    "con": "Nếu sử dụng kiến trúc Harvard,",
    "re": "thì bộ nhớ lệnh và bộ nhớ dữ liệu sẽ tách biệt."
  },
  {
    "con": "Nếu có nhiều tầng trong kiến trúc bộ xử lý,",
    "re": "thì khả năng tối ưu hóa hiệu suất sẽ cao hơn."
  },
  {
    "con": "Nếu sử dụng kỹ thuật phân chia thời gian (time-sharing),",
    "re": "thì nhiều người dùng có thể sử dụng tài nguyên hệ thống đồng thời."
  },
  {
    "con": "Nếu sử dụng bộ nhớ ảo,",
    "re": "thì hệ thống có thể sử dụng nhiều bộ nhớ hơn so với bộ nhớ vật lý thực tế."
  },
  {
    "con": "Nếu kiến trúc sử dụng SIMD (Single Instruction, Multiple Data),",
    "re": "thì có thể xử lý nhiều dữ liệu cùng một lúc."
  },
  {
    "con": "Bus dữ liệu của bộ vi xử lý Intel 8088 có bao nhiêu đường?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ vi xử lý sử dụng kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC?",
    "re": "Đúng"
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn, thì thời gian truy cập dữ liệu sẽ giảm?",
    "re": "Không chắc chắn, vì còn phụ thuộc vào cách tổ chức cache"
  },
  {
    "con": "Kiến trúc Von Neumann có một bus chung cho cả dữ liệu và lệnh?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống có nhiều lõi xử lý, thì khả năng xử lý đa nhiệm sẽ được cải thiện?",
    "re": "Đúng"
  },
  {
    "con": "Bộ nhớ RAM có tốc độ truy cập nhanh hơn bộ nhớ HDD?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một vi xử lý có tốc độ xung nhịp cao hơn, thì hiệu suất xử lý sẽ luôn cao hơn?",
    "re": "Sai, vì còn phụ thuộc vào kiến trúc và số lượng lõi"
  },
  {
    "con": "Hệ thống máy tính sử dụng kiến trúc phân tán có thể cải thiện khả năng mở rộng?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một bộ vi xử lý hỗ trợ đa luồng, thì nó có thể xử lý nhiều tác vụ đồng thời?",
    "re": "Đúng"
  },
  {
    "con": "Bộ nhớ flash có thể ghi và xóa dữ liệu nhiều lần như bộ nhớ RAM?",
    "re": "Sai, vì bộ nhớ flash có giới hạn về số lần ghi/xóa"
  },
  {
    "con": "Các đường dây IOR, IOW trong các máy tính sử dụng bộ vi xử lý 8086/8088 thuộc vào Bus nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có tốc độ nhanh hơn bộ nhớ chính?",
    "re": "Đúng"
  },
  {
    "con": "Nếu số lượng bit trong một thanh ghi tăng lên, thì khả năng lưu trữ dữ liệu của thanh ghi đó sẽ tăng lên?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Harvard, thì bộ nhớ chương trình và bộ nhớ dữ liệu sẽ tách biệt?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một CPU có nhiều lõi, thì nó có khả năng xử lý nhiều tác vụ đồng thời tốt hơn?",
    "re": "Đúng"
  },
  {
    "con": "Nếu tốc độ xung nhịp của CPU tăng lên, thì hiệu suất xử lý của CPU cũng sẽ tăng lên?",
    "re": "Không hoàn toàn đúng, còn phụ thuộc vào nhiều yếu tố khác"
  },
  {
    "con": "Nếu một hệ thống sử dụng bus dữ liệu rộng hơn, thì băng thông truyền tải dữ liệu sẽ cao hơn?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống có nhiều bộ nhớ cache, thì thời gian truy cập dữ liệu sẽ giảm?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một kiến trúc máy tính sử dụng pipelining, thì hiệu suất xử lý sẽ được cải thiện?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ điều khiển DMA, thì CPU sẽ không cần phải quản lý từng thao tác truyền dữ liệu?",
    "re": "Đúng"
  },
  {
    "con": "Các đường dây D0-D7 trong các máy tính sử dụng bộ vi xử lý Intel 8086/8088 thuộc vào Bus nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có tốc độ nhanh hơn bộ nhớ chính?",
    "re": "Đúng"
  },
  {
    "con": "Nếu số lượng bit trong một thanh ghi tăng lên, thì khả năng lưu trữ dữ liệu của thanh ghi đó cũng tăng lên?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc Harvard cho phép truy cập đồng thời vào bộ nhớ lệnh và bộ nhớ dữ liệu?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một CPU có nhiều lõi, thì nó có thể thực hiện nhiều tác vụ song song hơn?",
    "re": "Đúng"
  },
  {
    "con": "Bộ vi xử lý RISC thường có số lượng lệnh ít hơn so với bộ vi xử lý CISC?",
    "re": "Đúng"
  },
  {
    "con": "Nếu tốc độ xung nhịp của CPU tăng lên, thì hiệu suất xử lý của CPU cũng có thể tăng lên?",
    "re": "Đúng"
  },
  {
    "con": "Hệ thống bus trong máy tính có thể ảnh hưởng đến băng thông dữ liệu?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo, thì nó có thể sử dụng không gian bộ nhớ lớn hơn bộ nhớ vật lý có sẵn?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc máy tính có thể ảnh hưởng đến hiệu suất của phần mềm chạy trên nó?",
    "re": "Đúng"
  },
  {
    "con": "Các đường dây IOCHCHK, IOCHRDY trong các máy tính sử dụng bộ vi xử lý 8086/8088 thuộc vào Bus nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có thể giảm thiểu thời gian truy cập bộ nhớ chính như thế nào?",
    "re": "Bằng cách lưu trữ các dữ liệu thường xuyên được truy cập gần CPU"
  },
  {
    "con": "Nếu một bộ vi xử lý có nhiều lõi, thì hiệu suất xử lý đa nhiệm sẽ như thế nào?",
    "re": "Tăng lên do có thể xử lý nhiều tác vụ song song"
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ vi xử lý tăng lên, thì hiệu suất xử lý sẽ ra sao?",
    "re": "Có khả năng tăng lên, nhưng còn phụ thuộc vào kiến trúc và hiệu suất IPC"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Harvard, thì dữ liệu và lệnh sẽ được xử lý như thế nào?",
    "re": "Chúng sẽ được lưu trữ trong các bộ nhớ riêng biệt"
  },
  {
    "con": "Nếu một bộ vi xử lý sử dụng kỹ thuật pipelining, thì điều gì sẽ xảy ra với hiệu suất xử lý?",
    "re": "Hiệu suất xử lý sẽ được cải thiện do các giai đoạn thực thi có thể diễn ra đồng thời"
  },
  {
    "con": "Nếu một hệ thống có bus dữ liệu rộng hơn, thì băng thông sẽ như thế nào?",
    "re": "Băng thông sẽ tăng lên, cho phép truyền tải nhiều dữ liệu hơn cùng một lúc"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo, thì điều gì sẽ xảy ra khi bộ nhớ vật lý đầy?",
    "re": "Hệ thống sẽ sử dụng không gian trên ổ đĩa cứng để lưu trữ dữ liệu tạm thời"
  },
  {
    "con": "Nếu một bộ vi xử lý hỗ trợ SIMD, thì điều gì sẽ xảy ra với các phép toán trên mảng dữ liệu?",
    "re": "Các phép toán có thể được thực hiện đồng thời trên nhiều phần tử của mảng"
  },
  {
    "con": "Nếu một hệ thống có kiến trúc RISC, thì các lệnh sẽ được thiết kế như thế nào?",
    "re": "Các lệnh sẽ được thiết kế đơn giản và thực hiện trong một chu kỳ đồng hồ"
  },
  {
    "con": "Các đường dây A0-A19 trong các máy tính sử dụng bộ vi xử lý 8086/8088 thuộc vào Bus nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ vi xử lý có kiến trúc 32-bit thì kích thước địa chỉ tối đa có thể là bao nhiêu?",
    "re": "4GB"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ cache thì tốc độ truy cập dữ liệu sẽ như thế nào so với truy cập trực tiếp vào RAM?",
    "re": "Nhanh hơn"
  },
  {
    "con": "Nếu một CPU có nhiều lõi thì khả năng xử lý đa nhiệm sẽ như thế nào?",
    "re": "Tốt hơn"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc RISC thì số lượng lệnh sẽ như thế nào so với kiến trúc CISC?",
    "re": "Ít hơn"
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng 64-bit thì nó có thể truyền tải bao nhiêu bit dữ liệu cùng một lúc?",
    "re": "64 bit"
  },
  {
    "con": "Nếu một hệ thống có bộ nhớ ảo thì nó có thể sử dụng không gian lưu trữ trên ổ cứng như thế nào?",
    "re": "Như một phần mở rộng của RAM"
  },
  {
    "con": "Nếu tốc độ xung nhịp của CPU tăng lên thì hiệu suất xử lý sẽ như thế nào?",
    "re": "Có thể tăng lên"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa xử lý thì khả năng mở rộng sẽ như thế nào?",
    "re": "Tốt hơn"
  },
  {
    "con": "Nếu một bộ vi xử lý hỗ trợ công nghệ siêu phân luồng (Hyper-Threading) thì số lượng luồng xử lý tối đa sẽ như thế nào?",
    "re": "Gấp đôi số lõi vật lý"
  },
  {
    "con": "Các đường dây DACK0-DACK3 trong các máy tính sử dụng bộ vi xử lý 8086/8088 thuộc vào Bus nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ vi xử lý có kiến trúc 32-bit thì nó có thể xử lý dữ liệu tối đa là bao nhiêu bit trong một lần?",
    "re": "4 GB"
  },
  {
    "con": "Nếu một bộ nhớ cache có kích thước 256 KB và kích thước block là 64 bytes thì nó có thể chứa bao nhiêu block?",
    "re": "4096 block"
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ vi xử lý tăng lên thì hiệu suất xử lý của nó thường sẽ như thế nào?",
    "re": "Tăng lên"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Harvard thì nó sẽ có bao nhiêu bus cho dữ liệu và lệnh?",
    "re": "Hai bus"
  },
  {
    "con": "Nếu một bộ vi xử lý sử dụng kỹ thuật pipelining thì nó sẽ cải thiện hiệu suất như thế nào?",
    "re": "Giảm thời gian thực hiện lệnh"
  },
  {
    "con": "Nếu một hệ thống có nhiều lõi xử lý thì nó có thể thực hiện bao nhiêu tác vụ đồng thời?",
    "re": "Nhiều tác vụ đồng thời"
  },
  {
    "con": "Nếu một bus dữ liệu có bề rộng 64 bit thì nó có thể truyền tải bao nhiêu bit dữ liệu trong một lần?",
    "re": "64 bit"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo thì nó sẽ cho phép sử dụng bao nhiêu bộ nhớ hơn so với bộ nhớ vật lý?",
    "re": "Nhiều hơn"
  },
  {
    "con": "Nếu một bộ vi xử lý có kiến trúc RISC thì nó sẽ có số lượng lệnh như thế nào so với kiến trúc CISC?",
    "re": "Ít hơn"
  },
  {
    "con": "Tín hiệu ALE trong Bus IBM PC có chức năng gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý sử dụng kiến trúc RISC thì nó sẽ có số lượng lệnh đơn giản hơn so với kiến trúc CISC.",
    "re": "Bộ xử lý RISC thường có hiệu suất cao hơn trong các tác vụ đơn giản."
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn thì thời gian truy cập dữ liệu có thể tăng lên.",
    "re": "Thời gian truy cập dữ liệu có thể không tăng lên nếu cache được tối ưu hóa."
  },
  {
    "con": "Nếu một hệ thống sử dụng bus song song thì băng thông truyền tải dữ liệu sẽ cao hơn so với bus nối tiếp.",
    "re": "Bus song song cho phép truyền tải nhiều bit dữ liệu cùng một lúc."
  },
  {
    "con": "Nếu một CPU có nhiều lõi thì nó có khả năng xử lý đa nhiệm tốt hơn.",
    "re": "Nhiều lõi cho phép thực hiện nhiều tác vụ song song."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Von Neumann thì dữ liệu và chương trình được lưu trữ trong cùng một bộ nhớ.",
    "re": "Điều này có thể dẫn đến hiện tượng 'Von Neumann bottleneck'."
  },
  {
    "con": "Nếu tốc độ xung nhịp của CPU tăng lên thì hiệu suất xử lý có thể cải thiện.",
    "re": "Tuy nhiên, hiệu suất thực tế còn phụ thuộc vào nhiều yếu tố khác."
  },
  {
    "con": "Nếu một hệ thống có bộ nhớ ảo thì nó có thể sử dụng không gian lưu trữ trên ổ đĩa cứng như bộ nhớ bổ sung.",
    "re": "Điều này giúp mở rộng dung lượng bộ nhớ cho các ứng dụng lớn."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa xử lý thì nó có thể chia sẻ tải công việc giữa các CPU.",
    "re": "Điều này giúp cải thiện hiệu suất tổng thể của hệ thống."
  },
  {
    "con": "Nếu một hệ thống có bus dữ liệu rộng hơn thì nó có thể truyền tải nhiều dữ liệu hơn trong một chu kỳ đồng hồ.",
    "re": "Điều này làm tăng băng thông của hệ thống."
  },
  {
    "con": "Tín hiệu AEN trong Bus IBM PC thuộc vào Bus nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý sử dụng kiến trúc RISC thì số lượng lệnh sẽ ít hơn so với kiến trúc CISC.",
    "re": "Kiến trúc RISC thường có lệnh đơn giản và ít lệnh hơn."
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn thì thời gian truy cập dữ liệu sẽ giảm.",
    "re": "Bộ nhớ cache lớn hơn giúp tăng khả năng lưu trữ và giảm độ trễ."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi thì hiệu suất xử lý sẽ cao hơn so với hệ thống đơn lõi.",
    "re": "Kiến trúc đa lõi cho phép xử lý song song nhiều tác vụ."
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng lớn hơn thì băng thông truyền tải dữ liệu sẽ cao hơn.",
    "re": "Băng thông cao hơn giúp tăng tốc độ truyền tải dữ liệu giữa các thành phần."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo thì dung lượng bộ nhớ khả dụng sẽ lớn hơn dung lượng bộ nhớ vật lý.",
    "re": "Bộ nhớ ảo cho phép sử dụng không gian lưu trữ trên ổ đĩa như bộ nhớ RAM."
  },
  {
    "con": "Nếu một CPU có tốc độ xung nhịp cao hơn thì khả năng xử lý sẽ nhanh hơn.",
    "re": "Tốc độ xung nhịp cao hơn cho phép CPU thực hiện nhiều phép toán hơn trong một giây."
  },
  {
    "con": "Nếu một hệ thống sử dụng công nghệ pipelining thì hiệu suất xử lý sẽ được cải thiện.",
    "re": "Pipelining cho phép thực hiện nhiều giai đoạn của lệnh đồng thời."
  },
  {
    "con": "Nếu một hệ thống có nhiều loại bộ nhớ thì việc quản lý bộ nhớ sẽ phức tạp hơn.",
    "re": "Nhiều loại bộ nhớ yêu cầu các chiến lược quản lý khác nhau để tối ưu hóa hiệu suất."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Harvard thì bộ nhớ lệnh và bộ nhớ dữ liệu sẽ tách biệt.",
    "re": "Kiến trúc Harvard cho phép truy cập đồng thời vào lệnh và dữ liệu."
  },
  {
    "con": "Các đường IRQ trong các Bus máy tính IBM PC có chức năng gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có tốc độ nhanh hơn bộ nhớ chính?",
    "re": "Đúng"
  },
  {
    "con": "Nếu số lượng bit trong một thanh ghi tăng lên, thì khả năng lưu trữ dữ liệu của thanh ghi đó cũng tăng lên?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc Harvard cho phép truy cập đồng thời vào bộ nhớ chương trình và bộ nhớ dữ liệu?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một CPU có nhiều lõi, thì nó có khả năng xử lý nhiều tác vụ song song hơn?",
    "re": "Đúng"
  },
  {
    "con": "Bộ điều khiển (Control Unit) có nhiệm vụ giải mã các lệnh trong CPU?",
    "re": "Đúng"
  },
  {
    "con": "Nếu tốc độ xung nhịp của CPU tăng lên, thì hiệu suất xử lý của CPU cũng có thể tăng lên?",
    "re": "Đúng"
  },
  {
    "con": "Bộ nhớ ảo cho phép hệ thống sử dụng nhiều bộ nhớ hơn so với bộ nhớ vật lý thực tế?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc RISC, thì các lệnh sẽ có độ dài cố định?",
    "re": "Đúng"
  },
  {
    "con": "Các bus dữ liệu có vai trò truyền tải dữ liệu giữa các thành phần trong máy tính?",
    "re": "Đúng"
  },
  {
    "con": "Các đường DRQ trong các Bus máy tính IBM PC có chức năng gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có tốc độ nhanh hơn bộ nhớ chính?",
    "re": "Đúng"
  },
  {
    "con": "Nếu số lượng bit trong một thanh ghi tăng lên, thì khả năng lưu trữ dữ liệu của thanh ghi đó cũng tăng lên.",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc Harvard cho phép truy cập đồng thời vào bộ nhớ lệnh và bộ nhớ dữ liệu?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một CPU có nhiều lõi, thì nó có khả năng xử lý nhiều tác vụ song song hơn.",
    "re": "Đúng"
  },
  {
    "con": "Tốc độ xung nhịp của CPU ảnh hưởng đến hiệu suất xử lý của nó?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo, thì nó có thể sử dụng không gian bộ nhớ lớn hơn dung lượng bộ nhớ vật lý.",
    "re": "Đúng"
  },
  {
    "con": "Các bus dữ liệu có thể truyền tải nhiều bit cùng một lúc?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống có kiến trúc RISC, thì nó thường sử dụng các lệnh đơn giản và thực hiện chúng trong một chu kỳ đồng hồ.",
    "re": "Đúng"
  },
  {
    "con": "Bộ điều khiển (Control Unit) có nhiệm vụ giải mã và điều phối các lệnh trong CPU?",
    "re": "Đúng"
  },
  {
    "con": "Bus EISA có tần số là 8MHz, độ rộng Bus bằng 32 bit, thời gian truyền một khối 32 bit cần 2 chu kỳ. Khi đó dải thông của Bus bằng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý có 4 lõi và mỗi lõi có khả năng xử lý 2 luồng đồng thời, thì tổng số luồng mà bộ xử lý có thể xử lý là:",
    "re": "8 luồng"
  },
  {
    "con": "Nếu bộ nhớ cache có dung lượng 256KB và kích thước khối là 64B, thì số lượng khối trong cache là:",
    "re": "4096 khối"
  },
  {
    "con": "Nếu tần số xung nhịp của CPU là 3GHz và mỗi chu kỳ thực hiện 4 phép toán, thì số phép toán tối đa mà CPU có thể thực hiện trong 1 giây là:",
    "re": "12 tỷ phép toán"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Harvard, thì dữ liệu và lệnh sẽ được lưu trữ ở:",
    "re": "hai bộ nhớ khác nhau"
  },
  {
    "con": "Nếu một bộ xử lý sử dụng kỹ thuật pipelining với 5 giai đoạn, thì thời gian thực hiện một lệnh sẽ được giảm xuống còn:",
    "re": "1 chu kỳ sau khi lấp đầy pipeline"
  },
  {
    "con": "Nếu một hệ thống có 8GB RAM và sử dụng kiến trúc 32-bit, thì dung lượng bộ nhớ tối đa mà hệ thống có thể sử dụng là:",
    "re": "4GB"
  },
  {
    "con": "Nếu một bus có độ rộng 64 bit và tần số 100MHz, thì dải thông tối đa của bus là:",
    "re": "800MB/s"
  },
  {
    "con": "Nếu một bộ xử lý sử dụng bộ nhớ ảo với kích thước trang là 4KB và không gian địa chỉ 32-bit, thì số lượng trang tối đa có thể được quản lý là:",
    "re": "2^20 trang"
  },
  {
    "con": "Nếu một hệ thống sử dụng RAID 5 với 4 đĩa, thì dung lượng khả dụng của hệ thống sẽ là:",
    "re": "Tổng dung lượng của 3 đĩa"
  },
  {
    "con": "Bus MCA có tần số là 10MHz, độ rộng Bus bằng 32 bit, thời gian truyền một khối 32 bit cần 2 chu kỳ. Khi đó dải thông của Bus bằng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý có 4 lõi và mỗi lõi có thể thực hiện 2 luồng đồng thời, thì tổng số luồng mà bộ xử lý có thể xử lý là:",
    "re": "8 luồng"
  },
  {
    "con": "Nếu bộ nhớ cache có dung lượng 256KB và kích thước khối là 64B, thì số lượng khối trong cache là:",
    "re": "4096 khối"
  },
  {
    "con": "Nếu tần số xung nhịp của CPU là 3GHz và mỗi chu kỳ có thể thực hiện 4 phép toán, thì số phép toán tối đa mà CPU có thể thực hiện trong 1 giây là:",
    "re": "12 tỷ phép toán"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Harvard, thì dữ liệu và lệnh sẽ được lưu trữ ở:",
    "re": "hai bộ nhớ khác nhau"
  },
  {
    "con": "Nếu một bus có độ rộng 64 bit và tần số 100MHz, thì băng thông tối đa của bus là:",
    "re": "800MB/s"
  },
  {
    "con": "Nếu một bộ xử lý sử dụng kiến trúc RISC, thì số lượng lệnh thường sẽ:",
    "re": "ít hơn so với kiến trúc CISC"
  },
  {
    "con": "Nếu một hệ thống có 8GB RAM và sử dụng 32-bit địa chỉ, thì số lượng địa chỉ mà hệ thống có thể truy cập là:",
    "re": "4GB"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo và có kích thước trang là 4KB, thì số lượng trang tối đa có thể được quản lý trong 1GB bộ nhớ ảo là:",
    "re": "256,000 trang"
  },
  {
    "con": "Nếu một CPU có 2 bộ xử lý và mỗi bộ xử lý có 2 lõi, thì tổng số lõi của hệ thống là:",
    "re": "4 lõi"
  },
  {
    "con": "CPU là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có vai trò gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Kiến trúc Harvard khác gì so với kiến trúc Von Neumann?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tốc độ xung nhịp của CPU ảnh hưởng như thế nào đến hiệu suất?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hệ thống bus là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Parallel processing là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Pipeline trong CPU hoạt động như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ điều khiển (Control Unit) có chức năng gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Độ rộng bus ảnh hưởng đến băng thông như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Kiến trúc đa lõi (Multi-core architecture) là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có bao nhiêu lõi?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có tác dụng gì?",
    "re": "Giảm thời gian truy cập dữ liệu"
  },
  {
    "con": "Kiến trúc Harvard có gì khác biệt so với kiến trúc Von Neumann?",
    "re": "Có bộ nhớ riêng cho dữ liệu và lệnh"
  },
  {
    "con": "Tốc độ xung nhịp của CPU ảnh hưởng như thế nào đến hiệu suất?",
    "re": "Tăng tốc độ xử lý của CPU"
  },
  {
    "con": "Bộ điều khiển trong CPU có nhiệm vụ gì?",
    "re": "Quản lý và điều phối hoạt động của các thành phần khác"
  },
  {
    "con": "Giao thức DMA có ưu điểm gì?",
    "re": "Giảm tải cho CPU trong việc truyền dữ liệu"
  },
  {
    "con": "Bộ nhớ RAM và ROM khác nhau ở điểm nào?",
    "re": "RAM là bộ nhớ tạm thời, còn ROM là bộ nhớ vĩnh viễn"
  },
  {
    "con": "Kiến trúc đa lõi có lợi ích gì?",
    "re": "Tăng khả năng xử lý song song"
  },
  {
    "con": "Tính năng pipelining trong CPU giúp gì cho hiệu suất?",
    "re": "Tăng cường khả năng xử lý đồng thời nhiều lệnh"
  },
  {
    "con": "Hệ thống bus có vai trò gì trong kiến trúc máy tính?",
    "re": "Kết nối và truyền dữ liệu giữa các thành phần"
  },
  {
    "con": "Bus USB có bao nhiêu dây truyền dữ liệu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "CPU có bao nhiêu loại kiến trúc chính?",
    "re": "Có ba loại kiến trúc chính: RISC, CISC và VLIW"
  },
  {
    "con": "Cache memory có tác dụng gì?",
    "re": "Giúp tăng tốc độ truy cập dữ liệu cho CPU"
  },
  {
    "con": "Hệ thống máy tính có bao nhiêu thành phần chính?",
    "re": "Có năm thành phần chính: CPU, bộ nhớ, thiết bị nhập/xuất, bus và nguồn điện"
  },
  {
    "con": "Kiến trúc Von Neumann có đặc điểm gì?",
    "re": "Sử dụng một bus chung cho cả dữ liệu và lệnh"
  },
  {
    "con": "Tốc độ xung nhịp của CPU được đo bằng gì?",
    "re": "Được đo bằng Hertz (Hz)"
  },
  {
    "con": "Hệ thống đa lõi có ưu điểm gì?",
    "re": "Cải thiện hiệu suất xử lý và khả năng đa nhiệm"
  },
  {
    "con": "Bộ nhớ RAM có tính chất gì?",
    "re": "Là bộ nhớ tạm thời và có thể thay đổi dữ liệu"
  },
  {
    "con": "Hệ thống máy tính sử dụng kiến trúc Harvard có gì khác biệt?",
    "re": "Có hai bus riêng biệt cho dữ liệu và lệnh"
  },
  {
    "con": "GPU được sử dụng chủ yếu cho mục đích gì?",
    "re": "Xử lý đồ họa và tính toán song song"
  },
  {
    "con": "Kiến trúc Von Neumann",
    "re": "Sử dụng một bộ nhớ chung cho cả dữ liệu và chương trình"
  },
  {
    "con": "Kiến trúc Harvard",
    "re": "Có bộ nhớ riêng biệt cho dữ liệu và chương trình"
  },
  {
    "con": "Tốc độ xung nhịp của CPU",
    "re": "Tăng tốc độ xử lý của CPU"
  },
  {
    "con": "Cache Memory",
    "re": "Giảm thời gian truy cập dữ liệu cho CPU"
  },
  {
    "con": "Pipeline trong CPU",
    "re": "Tăng hiệu suất xử lý bằng cách thực hiện nhiều lệnh đồng thời"
  },
  {
    "con": "Hệ thống Bus",
    "re": "Cho phép các thành phần trong máy tính giao tiếp với nhau"
  },
  {
    "con": "Độ rộng bus dữ liệu",
    "re": "Quyết định lượng dữ liệu có thể truyền tải cùng một lúc"
  },
  {
    "con": "Đơn vị điều khiển (Control Unit)",
    "re": "Quản lý và điều phối hoạt động của các thành phần trong CPU"
  },
  {
    "con": "RAM động (DRAM)",
    "re": "Cần được làm mới thường xuyên để duy trì dữ liệu"
  },
  {
    "con": "ROM",
    "re": "Lưu trữ dữ liệu không thay đổi và khởi động hệ thống"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn",
    "re": "Hiệu suất xử lý tăng lên"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn sẽ giảm thiểu thời gian truy cập dữ liệu",
    "re": "Tăng tốc độ xử lý của CPU"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ chương trình và bộ nhớ dữ liệu",
    "re": "Cho phép truy cập đồng thời vào cả hai loại bộ nhớ"
  },
  {
    "con": "Sử dụng bus dữ liệu rộng hơn sẽ cho phép truyền tải nhiều bit hơn cùng một lúc",
    "re": "Tăng băng thông truyền tải dữ liệu"
  },
  {
    "con": "Tần số xung nhịp của CPU cao hơn sẽ dẫn đến tốc độ xử lý nhanh hơn",
    "re": "Tăng khả năng thực hiện lệnh trong một khoảng thời gian"
  },
  {
    "con": "Sử dụng kiến trúc RISC sẽ đơn giản hóa thiết kế bộ xử lý",
    "re": "Giảm độ phức tạp và tăng hiệu suất thực thi lệnh"
  },
  {
    "con": "Bộ nhớ RAM có tốc độ truy cập nhanh hơn sẽ cải thiện hiệu suất hệ thống",
    "re": "Giảm thời gian chờ cho các tác vụ"
  },
  {
    "con": "Sử dụng kỹ thuật pipelining trong CPU sẽ cho phép thực hiện nhiều lệnh đồng thời",
    "re": "Tăng hiệu suất xử lý tổng thể"
  },
  {
    "con": "Kiến trúc Von Neumann có một bus chung cho cả dữ liệu và chương trình",
    "re": "Có thể gây ra hiện tượng tắc nghẽn khi truy cập"
  },
  {
    "con": "Sử dụng SSD thay vì HDD sẽ cải thiện tốc độ truy cập dữ liệu",
    "re": "Giảm thời gian khởi động và tải ứng dụng"
  },
  {
    "con": "Có thể có tối đa bao nhiêu thiết bị USB nối tới một USB Hub?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có tốc độ nhanh hơn bộ nhớ RAM?",
    "re": "Đúng"
  },
  {
    "con": "Một kiến trúc máy tính sử dụng nhiều lõi xử lý sẽ có hiệu suất cao hơn trong các tác vụ đa luồng?",
    "re": "Đúng"
  },
  {
    "con": "Bộ xử lý sử dụng kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC?",
    "re": "Đúng"
  },
  {
    "con": "Khi tăng kích thước bus dữ liệu, băng thông của hệ thống sẽ tăng lên?",
    "re": "Đúng"
  },
  {
    "con": "Việc sử dụng kỹ thuật pipelining có thể làm tăng hiệu suất xử lý của CPU?",
    "re": "Đúng"
  },
  {
    "con": "Bộ nhớ ảo cho phép hệ thống sử dụng nhiều bộ nhớ hơn so với bộ nhớ vật lý thực tế?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc von Neumann có thể gây ra hiện tượng bottleneck do việc chia sẻ bus giữa CPU và bộ nhớ?",
    "re": "Đúng"
  },
  {
    "con": "Hệ thống máy tính có thể sử dụng nhiều loại bộ nhớ khác nhau như SRAM và DRAM?",
    "re": "Đúng"
  },
  {
    "con": "Việc tối ưu hóa đường dẫn dữ liệu trong kiến trúc máy tính có thể cải thiện hiệu suất tổng thể?",
    "re": "Đúng"
  },
  {
    "con": "Bus IBM PC cho máy tính IBM PC/AT sử dụng bộ vi xử lý nào sau đây của Intel?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có tốc độ nhanh hơn bộ nhớ chính?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ cho dữ liệu và lệnh?",
    "re": "Đúng"
  },
  {
    "con": "Bộ vi xử lý đa nhân có khả năng xử lý nhiều luồng đồng thời?",
    "re": "Đúng"
  },
  {
    "con": "Tốc độ xung nhịp của bộ vi xử lý càng cao thì hiệu suất xử lý càng tốt?",
    "re": "Không hoàn toàn đúng"
  },
  {
    "con": "Bộ nhớ RAM là bộ nhớ tạm thời và mất dữ liệu khi tắt nguồn?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc RISC sử dụng nhiều lệnh đơn giản hơn kiến trúc CISC?",
    "re": "Đúng"
  },
  {
    "con": "Bộ điều khiển (Control Unit) có nhiệm vụ điều phối hoạt động của các thành phần trong CPU?",
    "re": "Đúng"
  },
  {
    "con": "Bus dữ liệu có thể truyền tải dữ liệu giữa các thành phần của máy tính?",
    "re": "Đúng"
  },
  {
    "con": "Bộ nhớ ảo cho phép máy tính sử dụng không gian bộ nhớ lớn hơn bộ nhớ vật lý?",
    "re": "Đúng"
  },
  {
    "con": "Các đường dây MEMR, MEMW trong các máy tính sử dụng bộ vi xử lý 8086/8088 thuộc vào Bus nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý có kiến trúc RISC thì nó sẽ có số lượng lệnh ít hơn so với kiến trúc CISC.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ cache thì thời gian truy cập dữ liệu sẽ nhanh hơn so với việc truy cập trực tiếp vào bộ nhớ chính.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một CPU có nhiều lõi thì nó có khả năng xử lý đa nhiệm tốt hơn so với CPU đơn lõi.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng 64 bit thì nó có thể truyền tải dữ liệu gấp đôi so với bus 32 bit trong cùng một chu kỳ đồng hồ.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Harvard thì nó sẽ có bộ nhớ riêng cho dữ liệu và lệnh.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một vi xử lý hỗ trợ công nghệ siêu phân luồng (Hyper-Threading) thì nó có thể xử lý nhiều luồng dữ liệu hơn trong cùng một lõi.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một hệ thống có bộ nhớ ảo thì nó có thể sử dụng không gian lưu trữ lớn hơn so với bộ nhớ vật lý thực tế.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một vi xử lý có tốc độ xung nhịp cao hơn thì nó có khả năng thực hiện nhiều phép toán hơn trong một giây.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc pipelining thì nó có thể tăng hiệu suất xử lý bằng cách thực hiện nhiều giai đoạn của lệnh đồng thời.",
    "re": "Điều này đúng"
  },
  {
    "con": "Bus địa chỉ của bộ vi xử lý 8088 có bao nhiêu đường?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ vi xử lý sử dụng kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC?",
    "re": "Đúng"
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn, thì thời gian truy cập dữ liệu sẽ giảm?",
    "re": "Không đúng"
  },
  {
    "con": "Kiến trúc Von Neumann có một bus chung cho cả dữ liệu và lệnh?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một bộ vi xử lý có nhiều nhân, thì khả năng xử lý đa nhiệm sẽ được cải thiện?",
    "re": "Đúng"
  },
  {
    "con": "Bộ nhớ RAM là bộ nhớ không bay hơi?",
    "re": "Không đúng"
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ vi xử lý tăng, thì hiệu suất xử lý thường cũng sẽ tăng?",
    "re": "Đúng"
  },
  {
    "con": "Hệ thống máy tính sử dụng kiến trúc Harvard có bus riêng cho dữ liệu và lệnh?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống có nhiều bus, thì băng thông tổng thể của hệ thống sẽ tăng?",
    "re": "Đúng"
  },
  {
    "con": "Bộ vi xử lý 32-bit có thể truy cập tối đa bao nhiêu bộ nhớ?",
    "re": "4GB"
  },
  {
    "con": "Chức năng của tín hiệu RESET trong Bus IBM PC là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý sử dụng kiến trúc RISC thì nó sẽ có số lượng lệnh đơn giản hơn so với kiến trúc CISC.",
    "re": "Điều này giúp tăng tốc độ thực thi lệnh."
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn thì tốc độ truy cập dữ liệu sẽ nhanh hơn.",
    "re": "Điều này giúp giảm thời gian truy cập bộ nhớ chính."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi thì nó có khả năng xử lý nhiều tác vụ đồng thời.",
    "re": "Điều này cải thiện hiệu suất tổng thể của hệ thống."
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng lớn hơn thì nó có thể truyền tải nhiều dữ liệu hơn trong một chu kỳ đồng hồ.",
    "re": "Điều này làm tăng băng thông của hệ thống."
  },
  {
    "con": "Nếu một CPU có tốc độ xung nhịp cao hơn thì nó có khả năng thực hiện nhiều phép toán hơn trong một giây.",
    "re": "Điều này dẫn đến hiệu suất xử lý cao hơn."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo thì nó có thể chạy các ứng dụng lớn hơn so với dung lượng bộ nhớ vật lý.",
    "re": "Điều này giúp tối ưu hóa việc sử dụng bộ nhớ."
  },
  {
    "con": "Nếu một kiến trúc máy tính sử dụng pipelining thì nó có thể thực hiện nhiều giai đoạn của lệnh cùng một lúc.",
    "re": "Điều này làm tăng hiệu suất xử lý."
  },
  {
    "con": "Nếu một hệ thống có khả năng xử lý song song thì nó có thể giảm thời gian hoàn thành tác vụ lớn.",
    "re": "Điều này cải thiện hiệu suất tổng thể của ứng dụng."
  },
  {
    "con": "Nếu một bộ xử lý sử dụng kỹ thuật siêu phân luồng (Hyper-Threading) thì nó có thể tối ưu hóa việc sử dụng tài nguyên CPU.",
    "re": "Điều này giúp tăng cường hiệu suất trong các tác vụ đa nhiệm."
  },
  {
    "con": "Các chip 74LS373 trong Bus IBM PC có chức năng gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có tốc độ nhanh hơn bộ nhớ chính?",
    "re": "Đúng"
  },
  {
    "con": "Nếu số lượng bit trong bus dữ liệu tăng lên, thì băng thông của hệ thống sẽ tăng lên?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc Harvard cho phép truy cập đồng thời vào bộ nhớ lệnh và bộ nhớ dữ liệu?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một CPU có nhiều lõi, thì nó có khả năng xử lý nhiều tác vụ song song hơn?",
    "re": "Đúng"
  },
  {
    "con": "Bộ điều khiển (Control Unit) có nhiệm vụ giải mã lệnh và điều phối hoạt động của các thành phần khác trong CPU?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc RISC, thì các lệnh sẽ có độ dài cố định?",
    "re": "Đúng"
  },
  {
    "con": "Tốc độ xung nhịp (clock speed) của CPU ảnh hưởng đến hiệu suất xử lý của nó?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống có nhiều bus, thì khả năng truyền dữ liệu giữa các thành phần sẽ được cải thiện?",
    "re": "Đúng"
  },
  {
    "con": "Bộ nhớ ảo cho phép hệ thống sử dụng nhiều bộ nhớ hơn so với bộ nhớ vật lý có sẵn?",
    "re": "Đúng"
  },
  {
    "con": "Chip 74LS245 trong Bus IBM PC có chức năng gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có tốc độ nhanh hơn bộ nhớ chính?",
    "re": "Đúng"
  },
  {
    "con": "Nếu số lượng lõi trong CPU tăng lên thì khả năng xử lý đa nhiệm sẽ cải thiện?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ cho dữ liệu và lệnh?",
    "re": "Đúng"
  },
  {
    "con": "Nếu sử dụng bộ xử lý 64-bit thì có thể truy cập nhiều bộ nhớ hơn so với bộ xử lý 32-bit?",
    "re": "Đúng"
  },
  {
    "con": "Bộ điều khiển (Control Unit) có nhiệm vụ giải mã lệnh và điều phối hoạt động của CPU?",
    "re": "Đúng"
  },
  {
    "con": "Nếu tốc độ xung nhịp của CPU tăng lên thì hiệu suất xử lý cũng sẽ tăng lên?",
    "re": "Không hoàn toàn đúng, còn phụ thuộc vào nhiều yếu tố khác"
  },
  {
    "con": "Bộ nhớ RAM là bộ nhớ tạm thời và mất dữ liệu khi tắt nguồn?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc RISC thì các lệnh sẽ có độ dài cố định?",
    "re": "Đúng"
  },
  {
    "con": "Bộ xử lý đa luồng (Multithreading) cho phép thực hiện nhiều luồng xử lý đồng thời?",
    "re": "Đúng"
  },
  {
    "con": "Chip 8259A trong Bus IBM PC có chức năng gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ nhớ cache có tốc độ nhanh hơn bộ nhớ chính?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ dữ liệu và bộ nhớ lệnh?",
    "re": "Đúng"
  },
  {
    "con": "Số lượng bit trong bus dữ liệu ảnh hưởng đến băng thông của hệ thống?",
    "re": "Đúng"
  },
  {
    "con": "Bộ xử lý đa nhân có thể thực hiện nhiều tác vụ song song?",
    "re": "Đúng"
  },
  {
    "con": "Tốc độ xung nhịp của CPU ảnh hưởng đến hiệu suất xử lý?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc RISC sử dụng ít lệnh hơn kiến trúc CISC?",
    "re": "Đúng"
  },
  {
    "con": "Bộ điều khiển (Control Unit) có nhiệm vụ giải mã lệnh trong CPU?",
    "re": "Đúng"
  },
  {
    "con": "Bộ nhớ ảo cho phép hệ thống sử dụng nhiều bộ nhớ hơn bộ nhớ vật lý?",
    "re": "Đúng"
  },
  {
    "con": "Hệ thống bus có thể kết nối nhiều thiết bị ngoại vi với CPU?",
    "re": "Đúng"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC",
    "re": "Điều này giúp tăng tốc độ thực thi lệnh"
  },
  {
    "con": "Khi sử dụng bộ nhớ cache, nếu kích thước cache tăng lên",
    "re": "Thì tỷ lệ hit cache thường cũng sẽ tăng"
  },
  {
    "con": "Trong kiến trúc máy tính, nếu có nhiều lõi xử lý",
    "re": "Thì khả năng xử lý song song sẽ được cải thiện"
  },
  {
    "con": "Nếu một hệ thống sử dụng bus để truyền dữ liệu giữa các thành phần",
    "re": "Thì băng thông của bus sẽ ảnh hưởng đến hiệu suất tổng thể"
  },
  {
    "con": "Khi sử dụng kỹ thuật pipelining trong CPU",
    "re": "Thì thời gian thực thi trung bình của các lệnh sẽ giảm"
  },
  {
    "con": "Nếu một chương trình có nhiều vòng lặp lồng ghép",
    "re": "Thì hiệu suất có thể bị giảm do xung đột tài nguyên"
  },
  {
    "con": "Khi sử dụng kiến trúc đa xử lý",
    "re": "Thì việc chia sẻ bộ nhớ giữa các bộ xử lý cần được quản lý cẩn thận"
  },
  {
    "con": "Nếu một hệ thống sử dụng SSD thay vì HDD",
    "re": "Thì tốc độ truy cập dữ liệu sẽ nhanh hơn đáng kể"
  },
  {
    "con": "Khi thiết kế một hệ thống máy tính, nếu chọn kiến trúc Harvard",
    "re": "Thì bộ nhớ cho dữ liệu và lệnh sẽ được tách biệt"
  },
  {
    "con": "Nếu một CPU có nhiều mức cache",
    "re": "Thì thời gian truy cập dữ liệu sẽ được tối ưu hóa"
  },
  {
    "con": "Khái niệm truy xuất ngẫu nhiên đối với bộ nhớ có ý nghĩa như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý đa nhân có thể xử lý nhiều luồng dữ liệu đồng thời như thế nào?",
    "re": "Tăng hiệu suất xử lý và giảm thời gian hoàn thành tác vụ"
  },
  {
    "con": "Cache memory hoạt động như thế nào trong việc cải thiện hiệu suất hệ thống?",
    "re": "Giảm thời gian truy xuất dữ liệu bằng cách lưu trữ dữ liệu thường xuyên sử dụng"
  },
  {
    "con": "Kiến trúc Harvard khác với kiến trúc Von Neumann ở điểm nào?",
    "re": "Harvard sử dụng bộ nhớ riêng cho dữ liệu và lệnh, trong khi Von Neumann sử dụng bộ nhớ chung"
  },
  {
    "con": "Tốc độ xung nhịp của bộ xử lý ảnh hưởng đến hiệu suất như thế nào?",
    "re": "Tốc độ xung nhịp cao hơn thường dẫn đến khả năng xử lý nhanh hơn"
  },
  {
    "con": "Hệ thống bus trong kiến trúc máy tính có vai trò gì?",
    "re": "Kết nối các thành phần khác nhau của hệ thống để truyền dữ liệu và tín hiệu"
  },
  {
    "con": "Kỹ thuật pipelining trong bộ xử lý giúp cải thiện hiệu suất như thế nào?",
    "re": "Cho phép thực hiện nhiều giai đoạn của lệnh đồng thời, giảm thời gian chờ"
  },
  {
    "con": "Sự khác biệt giữa RAM và ROM là gì?",
    "re": "RAM là bộ nhớ tạm thời có thể ghi và xóa, trong khi ROM là bộ nhớ cố định không thể thay đổi"
  },
  {
    "con": "Kiến trúc RISC và CISC có điểm khác biệt nào trong thiết kế lệnh?",
    "re": "RISC sử dụng số lượng lệnh ít hơn nhưng đơn giản hơn, trong khi CISC có nhiều lệnh phức tạp hơn"
  },
  {
    "con": "Tính năng bảo mật trong kiến trúc máy tính có thể được cải thiện bằng cách nào?",
    "re": "Sử dụng các cơ chế như mã hóa và phân quyền truy cập để bảo vệ dữ liệu"
  },
  {
    "con": "Trong bộ nhớ ROM, thời gian truy nhập đối với ngăn nhớ có địa chỉ 00000H so với thời gian truy nhập đối với ngăn nhớ có địa chỉ 00FFFH như thếnào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn so với kiến trúc CISC?",
    "re": "Đúng"
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache, thời gian truy cập dữ liệu có thể giảm?",
    "re": "Đúng"
  },
  {
    "con": "Nếu sử dụng kiến trúc đa lõi, hiệu suất xử lý của hệ thống sẽ tăng lên khi chạy các tác vụ song song?",
    "re": "Đúng"
  },
  {
    "con": "Khi sử dụng bus dữ liệu rộng hơn, băng thông truyền tải dữ liệu sẽ tăng lên?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo, dung lượng bộ nhớ khả dụng cho ứng dụng sẽ lớn hơn dung lượng bộ nhớ vật lý?",
    "re": "Đúng"
  },
  {
    "con": "Khi tần số xung nhịp của bộ xử lý tăng, hiệu suất xử lý của nó cũng sẽ tăng?",
    "re": "Không hẳn, còn phụ thuộc vào nhiều yếu tố khác"
  },
  {
    "con": "Nếu một hệ thống có nhiều đơn vị xử lý, khả năng xử lý đồng thời sẽ được cải thiện?",
    "re": "Đúng"
  },
  {
    "con": "Khi sử dụng kỹ thuật pipelining, thời gian thực hiện một lệnh sẽ giảm xuống?",
    "re": "Không hẳn, nhưng thông lượng sẽ tăng"
  },
  {
    "con": "Nếu một hệ thống có kiến trúc Harvard, bộ nhớ chương trình và bộ nhớ dữ liệu sẽ tách biệt?",
    "re": "Đúng"
  },
  {
    "con": "Trong bộ nhớ RAM, thời gian truy nhập đối với ngăn nhớ có địa chỉ 00000H so với thời gian truy nhập đối với ngăn nhớ có địa chỉ FFFFFH như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi số lượng lõi xử lý trong CPU tăng lên, hiệu suất xử lý đa nhiệm sẽ như thế nào?",
    "re": "Hiệu suất xử lý đa nhiệm sẽ tăng lên"
  },
  {
    "con": "Nếu bộ nhớ cache có dung lượng lớn hơn, thì tốc độ truy cập dữ liệu từ bộ nhớ chính sẽ như thế nào?",
    "re": "Tốc độ truy cập dữ liệu từ bộ nhớ chính sẽ nhanh hơn"
  },
  {
    "con": "Khi sử dụng kiến trúc Harvard thay vì kiến trúc Von Neumann, thì khả năng xử lý song song sẽ như thế nào?",
    "re": "Khả năng xử lý song song sẽ được cải thiện"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ điều khiển DMA, thì CPU sẽ có thể làm gì?",
    "re": "CPU sẽ có thể thực hiện các tác vụ khác trong khi dữ liệu được truyền"
  },
  {
    "con": "Khi tần số xung nhịp của CPU tăng lên, thì mức tiêu thụ điện năng sẽ như thế nào?",
    "re": "Mức tiêu thụ điện năng sẽ tăng lên"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo, thì dung lượng bộ nhớ khả dụng cho ứng dụng sẽ như thế nào?",
    "re": "Dung lượng bộ nhớ khả dụng cho ứng dụng sẽ lớn hơn dung lượng RAM vật lý"
  },
  {
    "con": "Khi sử dụng kiến trúc RISC, thì số lượng lệnh trong tập lệnh sẽ như thế nào?",
    "re": "Số lượng lệnh trong tập lệnh sẽ ít hơn so với kiến trúc CISC"
  },
  {
    "con": "Nếu một hệ thống có bus dữ liệu rộng hơn, thì băng thông truyền tải dữ liệu sẽ như thế nào?",
    "re": "Băng thông truyền tải dữ liệu sẽ cao hơn"
  },
  {
    "con": "Khi sử dụng kỹ thuật pipelining trong CPU, thì hiệu suất xử lý sẽ như thế nào?",
    "re": "Hiệu suất xử lý sẽ được cải thiện do giảm thời gian chờ"
  },
  {
    "con": "Các bộ nhớ nào sau đây cho phép truy nhập ngẫu nhiên?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ vi xử lý nào có kiến trúc RISC thường có số lượng lệnh ít hơn?",
    "re": "Kiến trúc RISC tối ưu cho hiệu suất cao"
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn,",
    "re": "thời gian truy cập dữ liệu sẽ nhanh hơn"
  },
  {
    "con": "Nếu sử dụng kiến trúc đa lõi,",
    "re": "hiệu suất xử lý sẽ tăng lên nhờ khả năng xử lý song song"
  },
  {
    "con": "Nếu một hệ thống sử dụng bus dữ liệu rộng hơn,",
    "re": "băng thông truyền tải dữ liệu sẽ cao hơn"
  },
  {
    "con": "Nếu một bộ vi xử lý có tốc độ xung nhịp cao hơn,",
    "re": "thì khả năng xử lý lệnh sẽ nhanh hơn"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo,",
    "re": "thì nó có thể chạy nhiều ứng dụng hơn so với bộ nhớ vật lý"
  },
  {
    "con": "Nếu một kiến trúc sử dụng pipelining,",
    "re": "thì hiệu suất xử lý sẽ được cải thiện nhờ giảm thời gian chờ"
  },
  {
    "con": "Nếu một hệ thống có nhiều cấp độ bộ nhớ cache,",
    "re": "thì hiệu suất truy cập dữ liệu sẽ được tối ưu hóa"
  },
  {
    "con": "Nếu một bộ vi xử lý hỗ trợ đa luồng,",
    "re": "thì nó có thể xử lý nhiều tác vụ đồng thời hiệu quả hơn"
  },
  {
    "con": "Đặc điểm của bộ nhớ Cache là:",
    "re": "Nó giúp tăng tốc độ truy cập dữ liệu cho CPU."
  },
  {
    "con": "Nếu kiến trúc máy tính sử dụng pipelining:",
    "re": "Thời gian thực hiện lệnh sẽ được giảm thiểu nhờ vào việc thực hiện nhiều lệnh đồng thời."
  },
  {
    "con": "Nếu một bộ xử lý có nhiều lõi:",
    "re": "Nó có khả năng thực hiện nhiều tác vụ song song, cải thiện hiệu suất tổng thể."
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng lớn hơn:",
    "re": "Tốc độ truyền tải dữ liệu giữa các thành phần sẽ cao hơn."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Harvard:",
    "re": "Nó có thể truy cập bộ nhớ lệnh và bộ nhớ dữ liệu đồng thời, tăng hiệu suất."
  },
  {
    "con": "Nếu tần số xung nhịp của CPU tăng:",
    "re": "Hiệu suất xử lý của CPU cũng sẽ tăng, nhưng có thể dẫn đến tiêu thụ năng lượng cao hơn."
  },
  {
    "con": "Nếu một hệ thống có bộ nhớ ảo:",
    "re": "Nó có thể sử dụng không gian bộ nhớ lớn hơn so với bộ nhớ vật lý thực tế."
  },
  {
    "con": "Nếu một kiến trúc máy tính sử dụng SIMD (Single Instruction, Multiple Data):",
    "re": "Nó có thể xử lý nhiều dữ liệu cùng một lúc, tối ưu hóa hiệu suất cho các tác vụ tính toán song song."
  },
  {
    "con": "Nếu một hệ thống có bộ điều khiển DMA (Direct Memory Access):",
    "re": "Nó cho phép các thiết bị ngoại vi truy cập bộ nhớ mà không cần CPU, giảm tải cho CPU."
  },
  {
    "con": "Nếu một kiến trúc máy tính sử dụng kỹ thuật phân đoạn bộ nhớ:",
    "re": "Nó cho phép quản lý bộ nhớ hiệu quả hơn và cải thiện khả năng bảo mật."
  },
  {
    "con": "Đặc điểm của bộ nhớ Cache là:",
    "re": "Nó giúp tăng tốc độ truy cập dữ liệu cho CPU."
  },
  {
    "con": "Nếu kiến trúc máy tính sử dụng pipelining:",
    "re": "Thời gian thực hiện lệnh sẽ được giảm thiểu nhờ vào việc thực hiện nhiều lệnh đồng thời."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ xử lý đa lõi:",
    "re": "Nó có khả năng xử lý nhiều tác vụ song song, cải thiện hiệu suất tổng thể."
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng lớn hơn:",
    "re": "Tốc độ truyền tải dữ liệu giữa các thành phần sẽ được cải thiện."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo:",
    "re": "Nó có thể chạy các chương trình lớn hơn dung lượng bộ nhớ vật lý."
  },
  {
    "con": "Nếu kiến trúc Harvard được sử dụng:",
    "re": "Dữ liệu và lệnh sẽ được lưu trữ trong các bộ nhớ riêng biệt, giúp tăng tốc độ truy cập."
  },
  {
    "con": "Nếu một CPU có tốc độ xung nhịp cao:",
    "re": "Nó có khả năng thực hiện nhiều phép toán hơn trong một khoảng thời gian nhất định."
  },
  {
    "con": "Nếu hệ thống sử dụng kỹ thuật phân chia thời gian:",
    "re": "Nó cho phép nhiều người dùng hoặc tác vụ chia sẻ tài nguyên hệ thống một cách hiệu quả."
  },
  {
    "con": "Nếu một hệ thống có bộ nhớ Cache lớn hơn:",
    "re": "Tỷ lệ hit cache sẽ tăng, dẫn đến hiệu suất cao hơn."
  },
  {
    "con": "Nếu kiến trúc RISC được áp dụng:",
    "re": "Các lệnh sẽ được thiết kế đơn giản hơn, giúp tăng tốc độ thực thi."
  },
  {
    "con": "Chức năng của tín hiệu Chip Enable trong IC bộ nhớ là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý sử dụng kiến trúc RISC thì số lượng lệnh sẽ ít hơn so với kiến trúc CISC.",
    "re": "Điều này giúp tăng tốc độ thực thi lệnh."
  },
  {
    "con": "Nếu bộ nhớ cache có kích thước lớn hơn thì thời gian truy cập dữ liệu sẽ giảm.",
    "re": "Điều này cải thiện hiệu suất của hệ thống."
  },
  {
    "con": "Nếu một hệ thống sử dụng đa lõi thì khả năng xử lý đồng thời sẽ tăng lên.",
    "re": "Điều này cho phép thực hiện nhiều tác vụ cùng lúc."
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng lớn hơn thì lượng dữ liệu truyền tải trong một chu kỳ sẽ tăng.",
    "re": "Điều này cải thiện băng thông của hệ thống."
  },
  {
    "con": "Nếu sử dụng kỹ thuật pipelining trong bộ xử lý thì hiệu suất sẽ được cải thiện.",
    "re": "Điều này cho phép thực hiện nhiều giai đoạn của lệnh cùng lúc."
  },
  {
    "con": "Nếu một hệ thống có bộ nhớ ảo thì nó có thể chạy các chương trình lớn hơn dung lượng bộ nhớ vật lý.",
    "re": "Điều này giúp tối ưu hóa việc sử dụng bộ nhớ."
  },
  {
    "con": "Nếu kiến trúc máy tính hỗ trợ SIMD thì nó có thể thực hiện các phép toán trên nhiều dữ liệu cùng lúc.",
    "re": "Điều này tăng tốc độ xử lý cho các ứng dụng đa phương tiện."
  },
  {
    "con": "Nếu một hệ thống sử dụng kỹ thuật phân chia thời gian thì nhiều người dùng có thể chia sẻ tài nguyên hệ thống.",
    "re": "Điều này cải thiện khả năng sử dụng tài nguyên."
  },
  {
    "con": "Nếu một bộ xử lý có tốc độ xung nhịp cao hơn thì khả năng xử lý sẽ tăng lên.",
    "re": "Điều này giúp cải thiện hiệu suất tổng thể của hệ thống."
  },
  {
    "con": "Đặc điểm của bộ nhớ ROM:",
    "re": "Không thể thay đổi dữ liệu sau khi đã được ghi"
  },
  {
    "con": "Bộ xử lý có nhiều lõi:",
    "re": "Có khả năng thực hiện nhiều tác vụ song song"
  },
  {
    "con": "Tốc độ bus hệ thống cao:",
    "re": "Giúp tăng cường hiệu suất truyền dữ liệu giữa các thành phần"
  },
  {
    "con": "Sử dụng bộ nhớ cache:",
    "re": "Giảm thiểu thời gian truy cập dữ liệu từ bộ nhớ chính"
  },
  {
    "con": "Kiến trúc Harvard:",
    "re": "Cho phép truy cập đồng thời vào bộ nhớ lệnh và bộ nhớ dữ liệu"
  },
  {
    "con": "Bộ điều khiển (Control Unit) hoạt động hiệu quả:",
    "re": "Giúp điều phối các hoạt động của CPU và các thiết bị ngoại vi"
  },
  {
    "con": "Sử dụng kỹ thuật pipelining:",
    "re": "Tăng cường hiệu suất xử lý bằng cách chia nhỏ các giai đoạn thực thi lệnh"
  },
  {
    "con": "Kiến trúc RISC:",
    "re": "Sử dụng tập lệnh đơn giản để tối ưu hóa tốc độ thực thi"
  },
  {
    "con": "Số lượng bit của bus dữ liệu lớn:",
    "re": "Cho phép truyền tải nhiều dữ liệu hơn trong một lần"
  },
  {
    "con": "Sử dụng hệ thống đa xử lý:",
    "re": "Tăng cường khả năng xử lý và hiệu suất tổng thể của hệ thống"
  },
  {
    "con": "Đặc điểm của bộ nhớ RAM nói chung",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi",
    "re": "Có khả năng xử lý đa nhiệm tốt hơn"
  },
  {
    "con": "Tốc độ xung nhịp của bộ vi xử lý cao",
    "re": "Hiệu suất xử lý tăng lên"
  },
  {
    "con": "Sử dụng bộ nhớ cache",
    "re": "Giảm thời gian truy cập dữ liệu từ bộ nhớ chính"
  },
  {
    "con": "Kiến trúc Harvard",
    "re": "Cho phép truy cập đồng thời vào bộ nhớ lệnh và bộ nhớ dữ liệu"
  },
  {
    "con": "Sử dụng bus dữ liệu rộng hơn",
    "re": "Tăng băng thông truyền tải dữ liệu"
  },
  {
    "con": "Sử dụng kỹ thuật pipelining",
    "re": "Tăng cường hiệu suất xử lý bằng cách thực hiện nhiều lệnh cùng lúc"
  },
  {
    "con": "Sử dụng kiến trúc RISC",
    "re": "Giảm độ phức tạp của lệnh và tăng tốc độ thực thi"
  },
  {
    "con": "Sử dụng bộ điều khiển DMA",
    "re": "Giải phóng CPU khỏi việc quản lý truyền dữ liệu"
  },
  {
    "con": "Sử dụng hệ thống tản nhiệt hiệu quả",
    "re": "Giúp duy trì hiệu suất hoạt động của bộ xử lý"
  },
  {
    "con": "Đặc điểm của bộ nhớ SRAM",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ vi xử lý có nhiều lõi",
    "re": "Có khả năng xử lý đa nhiệm tốt hơn"
  },
  {
    "con": "Băng thông của bus dữ liệu lớn",
    "re": "Tăng tốc độ truyền tải dữ liệu giữa các thành phần"
  },
  {
    "con": "Sử dụng bộ nhớ cache",
    "re": "Giảm thời gian truy cập dữ liệu từ bộ nhớ chính"
  },
  {
    "con": "Kiến trúc Harvard",
    "re": "Cho phép truy cập đồng thời vào bộ nhớ lệnh và bộ nhớ dữ liệu"
  },
  {
    "con": "Số lượng transistor trong vi xử lý tăng",
    "re": "Tăng khả năng xử lý và hiệu suất của vi xử lý"
  },
  {
    "con": "Sử dụng pipelining trong xử lý lệnh",
    "re": "Tăng cường hiệu suất bằng cách thực hiện nhiều giai đoạn xử lý đồng thời"
  },
  {
    "con": "Kiến trúc RISC",
    "re": "Sử dụng tập lệnh đơn giản và số lượng lệnh ít hơn"
  },
  {
    "con": "Sử dụng kỹ thuật phân tán",
    "re": "Tăng cường khả năng mở rộng và hiệu suất hệ thống"
  },
  {
    "con": "Tốc độ xung nhịp của vi xử lý cao",
    "re": "Cải thiện tốc độ thực hiện lệnh"
  },
  {
    "con": "Đặc điểm của bộ nhớ DRAM",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi",
    "re": "Có khả năng xử lý đa nhiệm tốt hơn"
  },
  {
    "con": "Sử dụng bộ nhớ cache",
    "re": "Giúp tăng tốc độ truy cập dữ liệu"
  },
  {
    "con": "Kiến trúc Harvard",
    "re": "Cho phép truy cập đồng thời vào bộ nhớ lệnh và bộ nhớ dữ liệu"
  },
  {
    "con": "Tần số xung nhịp cao",
    "re": "Tăng khả năng xử lý của bộ vi xử lý"
  },
  {
    "con": "Sử dụng pipelining",
    "re": "Tăng hiệu suất xử lý bằng cách thực hiện nhiều lệnh cùng lúc"
  },
  {
    "con": "Kiến trúc RISC",
    "re": "Có số lượng lệnh đơn giản và thực thi nhanh hơn"
  },
  {
    "con": "Sử dụng bus dữ liệu rộng",
    "re": "Tăng băng thông truyền tải dữ liệu"
  },
  {
    "con": "Sử dụng công nghệ siêu phân luồng",
    "re": "Tăng cường khả năng sử dụng tài nguyên của bộ xử lý"
  },
  {
    "con": "Thiết kế hệ thống đa xử lý",
    "re": "Cải thiện hiệu suất và khả năng mở rộng của hệ thống"
  },
  {
    "con": "Bộ nhớ Cache được cấu trúc từ loại bộ nhớ nào trong số các bộ nhớ sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một CPU có nhiều lõi xử lý,",
    "re": "thì nó có khả năng thực hiện nhiều tác vụ song song hơn."
  },
  {
    "con": "Nếu tốc độ xung nhịp của CPU tăng lên,",
    "re": "thì hiệu suất xử lý của CPU cũng có khả năng tăng lên."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Harvard,",
    "re": "thì nó có bộ nhớ riêng cho dữ liệu và lệnh."
  },
  {
    "con": "Nếu bộ nhớ RAM có dung lượng lớn hơn,",
    "re": "thì khả năng chạy nhiều ứng dụng cùng lúc sẽ tốt hơn."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ điều khiển DMA,",
    "re": "thì CPU sẽ giảm tải công việc khi truyền dữ liệu giữa các thiết bị."
  },
  {
    "con": "Nếu một vi xử lý sử dụng kiến trúc RISC,",
    "re": "thì nó sẽ có số lượng lệnh đơn giản hơn và thời gian thực thi ngắn hơn."
  },
  {
    "con": "Nếu một hệ thống có nhiều bus dữ liệu,",
    "re": "thì băng thông truyền tải dữ liệu sẽ cao hơn."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ ảo,",
    "re": "thì nó có thể sử dụng không gian lưu trữ lớn hơn dung lượng RAM vật lý."
  },
  {
    "con": "Nếu một vi xử lý có kiến trúc đa lõi,",
    "re": "thì nó có thể xử lý nhiều luồng dữ liệu đồng thời."
  },
  {
    "con": "Chức năng của bộ nhớ Cache trong máy tính là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý trung tâm (CPU) có vai trò gì trong hệ thống máy tính?",
    "re": "CPU thực hiện các phép toán và điều khiển các hoạt động của máy tính"
  },
  {
    "con": "Kiến trúc Harvard khác gì so với kiến trúc Von Neumann?",
    "re": "Kiến trúc Harvard có bộ nhớ riêng cho dữ liệu và lệnh, trong khi kiến trúc Von Neumann sử dụng chung một bộ nhớ"
  },
  {
    "con": "Tốc độ xung nhịp của CPU ảnh hưởng như thế nào đến hiệu suất của máy tính?",
    "re": "Tốc độ xung nhịp cao hơn thường dẫn đến hiệu suất xử lý tốt hơn"
  },
  {
    "con": "Bộ nhớ RAM có chức năng gì trong máy tính?",
    "re": "RAM lưu trữ tạm thời dữ liệu và chương trình đang được sử dụng"
  },
  {
    "con": "Bộ điều khiển (Control Unit) trong CPU có nhiệm vụ gì?",
    "re": "Bộ điều khiển điều phối hoạt động của các thành phần khác trong CPU và hệ thống máy tính"
  },
  {
    "con": "Tại sao việc tối ưu hóa bộ nhớ Cache lại quan trọng?",
    "re": "Tối ưu hóa bộ nhớ Cache giúp giảm thời gian truy cập dữ liệu và tăng tốc độ xử lý"
  },
  {
    "con": "Khả năng song song trong kiến trúc máy tính có lợi ích gì?",
    "re": "Khả năng song song cho phép thực hiện nhiều phép toán đồng thời, tăng hiệu suất tổng thể"
  },
  {
    "con": "Bộ nhớ ảo là gì và tại sao nó quan trọng?",
    "re": "Bộ nhớ ảo cho phép máy tính sử dụng không gian lưu trữ trên đĩa cứng như bộ nhớ RAM, mở rộng khả năng lưu trữ"
  },
  {
    "con": "Các loại bus trong máy tính có vai trò gì?",
    "re": "Bus truyền tải dữ liệu giữa các thành phần của máy tính, bao gồm CPU, bộ nhớ và thiết bị ngoại vi"
  },
  {
    "con": "Đường dây Read/Write trong IC bộ nhớ có chức năng là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn thì khả năng xử lý đa nhiệm sẽ tốt hơn.",
    "re": "Hiệu suất xử lý tăng lên"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn thì thời gian truy cập dữ liệu sẽ giảm.",
    "re": "Tăng tốc độ truy cập dữ liệu"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ dữ liệu và bộ nhớ lệnh thì hiệu suất xử lý sẽ cao hơn kiến trúc Von Neumann.",
    "re": "Giảm thiểu xung đột truy cập bộ nhớ"
  },
  {
    "con": "Sử dụng pipelining trong bộ xử lý thì có thể tăng cường hiệu suất thực thi lệnh.",
    "re": "Giảm thời gian thực thi trung bình"
  },
  {
    "con": "Tốc độ xung nhịp của bộ xử lý cao hơn thì khả năng xử lý lệnh trong một giây sẽ tăng.",
    "re": "Tăng số lượng lệnh thực thi mỗi giây"
  },
  {
    "con": "Sử dụng bộ nhớ ảo thì có thể mở rộng không gian địa chỉ cho chương trình.",
    "re": "Giúp chạy nhiều ứng dụng hơn trên bộ nhớ hạn chế"
  },
  {
    "con": "Bộ điều khiển (Control Unit) trong CPU có nhiệm vụ gì?",
    "re": "Quản lý và điều phối hoạt động của các thành phần trong CPU"
  },
  {
    "con": "Sử dụng kiến trúc RISC thì có thể đơn giản hóa thiết kế bộ xử lý.",
    "re": "Tăng tốc độ thực thi lệnh đơn giản"
  },
  {
    "con": "Số lượng đường dẫn dữ liệu trong một hệ thống thì ảnh hưởng đến băng thông tổng thể.",
    "re": "Tăng khả năng truyền tải dữ liệu đồng thời"
  },
  {
    "con": "Trong các bộ nhớ sau, bộ nhớ nào yêu cầu làm tươi theo chu kỳ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một bộ xử lý có kiến trúc RISC,",
    "re": "thì nó sẽ có số lượng lệnh đơn giản và thực hiện nhanh hơn."
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ xử lý tăng lên,",
    "re": "thì hiệu suất xử lý của nó cũng có khả năng tăng lên."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ cache,",
    "re": "thì thời gian truy cập dữ liệu sẽ giảm đáng kể."
  },
  {
    "con": "Nếu một kiến trúc máy tính sử dụng pipelining,",
    "re": "thì nó có thể thực hiện nhiều lệnh đồng thời."
  },
  {
    "con": "Nếu một bộ xử lý có nhiều lõi,",
    "re": "thì nó có thể xử lý nhiều tác vụ song song hơn."
  },
  {
    "con": "Nếu một hệ thống sử dụng bus rộng hơn,",
    "re": "thì băng thông truyền tải dữ liệu sẽ tăng lên."
  },
  {
    "con": "Nếu một kiến trúc máy tính sử dụng kỹ thuật phân chia bộ nhớ ảo,",
    "re": "thì nó có thể sử dụng bộ nhớ vật lý hiệu quả hơn."
  },
  {
    "con": "Nếu một bộ xử lý hỗ trợ đa luồng,",
    "re": "thì nó có thể cải thiện hiệu suất trong các ứng dụng đa nhiệm."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Harvard,",
    "re": "thì nó có thể truy cập đồng thời bộ nhớ lệnh và bộ nhớ dữ liệu."
  },
  {
    "con": "Trong các bộ nhớ SRAM và DRAM, loại nào tiêu thụ nguồn nuôi lớn hơn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một bộ vi xử lý có nhiều lõi, thì khả năng xử lý đa nhiệm của nó sẽ được cải thiện.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ vi xử lý tăng lên, thì hiệu suất xử lý của nó cũng có khả năng tăng theo.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu bộ nhớ cache có dung lượng lớn hơn, thì khả năng giảm thiểu độ trễ truy cập bộ nhớ chính sẽ cao hơn.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu kiến trúc Harvard được sử dụng, thì bộ nhớ cho dữ liệu và lệnh sẽ được tách biệt.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng bus dữ liệu rộng hơn, thì băng thông truyền tải dữ liệu sẽ cao hơn.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một bộ vi xử lý hỗ trợ công nghệ siêu phân luồng (Hyper-Threading), thì nó có thể xử lý nhiều luồng đồng thời hơn.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc RISC, thì các lệnh sẽ có độ dài cố định và đơn giản hơn.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu bộ nhớ ảo được sử dụng, thì hệ thống có thể chạy nhiều ứng dụng hơn so với dung lượng bộ nhớ vật lý.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hệ thống có nhiều card đồ họa (GPU), thì khả năng xử lý đồ họa và tính toán song song sẽ được cải thiện.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Đặc điểm của bộ nhớ ROM là:",
    "re": "Nó không thể thay đổi dữ liệu sau khi được lập trình."
  },
  {
    "con": "Nếu tốc độ xung nhịp của CPU tăng lên:",
    "re": "Hiệu suất xử lý của CPU cũng có khả năng tăng lên."
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ nhớ cache:",
    "re": "Thời gian truy cập dữ liệu sẽ nhanh hơn so với việc truy cập trực tiếp vào bộ nhớ chính."
  },
  {
    "con": "Nếu kiến trúc máy tính sử dụng pipelining:",
    "re": "Nó có thể thực hiện nhiều lệnh đồng thời, tăng cường hiệu suất."
  },
  {
    "con": "Nếu một CPU có nhiều lõi xử lý:",
    "re": "Nó có khả năng xử lý nhiều tác vụ song song hiệu quả hơn."
  },
  {
    "con": "Nếu bus dữ liệu có băng thông lớn:",
    "re": "Tốc độ truyền tải dữ liệu giữa các thành phần trong hệ thống sẽ nhanh hơn."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Harvard:",
    "re": "Nó có thể truy cập bộ nhớ lệnh và bộ nhớ dữ liệu đồng thời."
  },
  {
    "con": "Nếu một chương trình sử dụng nhiều tài nguyên hệ thống:",
    "re": "Nó có thể dẫn đến tình trạng nghẽn cổ chai trong hiệu suất."
  },
  {
    "con": "Nếu một hệ thống có nhiều loại bộ nhớ:",
    "re": "Nó có thể tối ưu hóa hiệu suất và chi phí lưu trữ."
  },
  {
    "con": "Nếu một CPU sử dụng công nghệ siêu phân luồng (Hyper-Threading):",
    "re": "Nó có thể cải thiện hiệu suất xử lý bằng cách cho phép nhiều luồng thực thi trên mỗi lõi."
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn",
    "re": "có khả năng xử lý nhiều tác vụ đồng thời tốt hơn"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn",
    "re": "giúp giảm thời gian truy cập dữ liệu từ bộ nhớ chính"
  },
  {
    "con": "Kiến trúc Harvard",
    "re": "tách biệt bộ nhớ cho dữ liệu và lệnh, giúp tăng tốc độ xử lý"
  },
  {
    "con": "Sử dụng pipelining trong CPU",
    "re": "tăng hiệu suất xử lý bằng cách cho phép nhiều lệnh được thực hiện đồng thời"
  },
  {
    "con": "Tốc độ xung nhịp của CPU cao hơn",
    "re": "có thể dẫn đến hiệu suất xử lý cao hơn trong cùng một kiến trúc"
  },
  {
    "con": "Sử dụng kiến trúc RISC",
    "re": "giúp đơn giản hóa thiết kế bộ xử lý và tăng tốc độ thực thi lệnh"
  },
  {
    "con": "Số lượng thanh ghi trong CPU tăng",
    "re": "giúp giảm số lần truy cập bộ nhớ, từ đó cải thiện hiệu suất"
  },
  {
    "con": "Sử dụng bộ điều khiển đa kênh",
    "re": "có thể cải thiện băng thông và hiệu suất truyền dữ liệu"
  },
  {
    "con": "Sử dụng công nghệ siêu phân luồng (Hyper-Threading)",
    "re": "tăng cường khả năng xử lý đồng thời của CPU"
  },
  {
    "con": "Sử dụng bộ nhớ ảo",
    "re": "cho phép hệ thống sử dụng nhiều bộ nhớ hơn so với bộ nhớ vật lý có sẵn"
  },
  {
    "con": "Mạch chọn địa chỉ hàng và mạch chọn địa chỉ cột tạo thành mạch gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý có nhiều lõi thì khả năng xử lý đa nhiệm sẽ được cải thiện.",
    "re": "Hiệu suất xử lý cao hơn"
  },
  {
    "con": "Nếu bộ nhớ cache có dung lượng lớn hơn thì thời gian truy cập dữ liệu sẽ giảm.",
    "re": "Tăng tốc độ xử lý"
  },
  {
    "con": "Nếu kiến trúc máy tính sử dụng pipelining thì hiệu suất thực thi lệnh sẽ được cải thiện.",
    "re": "Giảm thời gian thực thi tổng thể"
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng lớn hơn thì lượng dữ liệu truyền tải trong một lần sẽ tăng.",
    "re": "Tăng băng thông"
  },
  {
    "con": "Nếu sử dụng bộ nhớ ảo thì hệ thống có thể chạy nhiều ứng dụng hơn so với dung lượng RAM thực tế.",
    "re": "Tăng khả năng đa nhiệm"
  },
  {
    "con": "Nếu kiến trúc Harvard được sử dụng thì bộ nhớ chương trình và bộ nhớ dữ liệu sẽ tách biệt.",
    "re": "Tăng tốc độ truy cập dữ liệu"
  },
  {
    "con": "Nếu sử dụng kỹ thuật phân chia thời gian (time-sharing) thì nhiều người dùng có thể sử dụng tài nguyên máy tính đồng thời.",
    "re": "Tăng tính khả dụng"
  },
  {
    "con": "Nếu sử dụng kiến trúc RISC thì số lượng lệnh đơn giản sẽ tăng lên.",
    "re": "Giảm độ phức tạp của bộ xử lý"
  },
  {
    "con": "Nếu sử dụng bộ điều khiển tuần tự thì việc điều khiển các thiết bị ngoại vi sẽ dễ dàng hơn.",
    "re": "Tăng tính linh hoạt trong quản lý thiết bị"
  },
  {
    "con": "Cấu tạo của một ô nhớ DRAM như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn có thể xử lý nhiều tác vụ đồng thời hơn?",
    "re": "Đúng"
  },
  {
    "con": "Tốc độ xung nhịp của CPU càng cao thì hiệu suất xử lý càng tốt?",
    "re": "Không hoàn toàn đúng, vì còn phụ thuộc vào kiến trúc và số lượng lõi"
  },
  {
    "con": "Bộ nhớ cache giúp giảm thời gian truy cập dữ liệu từ bộ nhớ chính?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc Harvard tách biệt bộ nhớ dữ liệu và bộ nhớ lệnh?",
    "re": "Đúng"
  },
  {
    "con": "Số lượng bit trong bus dữ liệu ảnh hưởng đến lượng dữ liệu có thể truyền tải cùng lúc?",
    "re": "Đúng"
  },
  {
    "con": "Việc sử dụng pipelining trong CPU giúp tăng tốc độ xử lý?",
    "re": "Đúng"
  },
  {
    "con": "Bộ điều khiển (Control Unit) có nhiệm vụ điều phối hoạt động của các thành phần trong CPU?",
    "re": "Đúng"
  },
  {
    "con": "Hệ thống máy tính sử dụng kiến trúc Von Neumann có thể gặp phải nút thắt cổ chai do bộ nhớ chung?",
    "re": "Đúng"
  },
  {
    "con": "Việc tối ưu hóa mã lệnh có thể cải thiện hiệu suất của chương trình?",
    "re": "Đúng"
  },
  {
    "con": "Cấu tạo của một ô nhớ SRAM như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có kiến trúc RISC thường có số lượng lệnh ít hơn kiến trúc CISC?",
    "re": "Đúng"
  },
  {
    "con": "Tốc độ xử lý của CPU phụ thuộc vào tần số xung nhịp và số lượng lõi?",
    "re": "Đúng"
  },
  {
    "con": "Bộ nhớ cache giúp tăng tốc độ truy cập dữ liệu so với bộ nhớ chính?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc Von Neumann có thể gây ra hiện tượng 'bottle-neck' giữa CPU và bộ nhớ?",
    "re": "Đúng"
  },
  {
    "con": "Hệ thống đa lõi có thể xử lý nhiều tác vụ đồng thời hiệu quả hơn hệ thống đơn lõi?",
    "re": "Đúng"
  },
  {
    "con": "Bộ điều khiển trong CPU có nhiệm vụ giải mã lệnh và điều phối hoạt động của các thành phần khác?",
    "re": "Đúng"
  },
  {
    "con": "Tốc độ truyền dữ liệu giữa các thành phần trong máy tính phụ thuộc vào băng thông của bus?",
    "re": "Đúng"
  },
  {
    "con": "Hệ thống lưu trữ SSD nhanh hơn HDD do không có bộ phận cơ khí?",
    "re": "Đúng"
  },
  {
    "con": "Kiến trúc máy tính có thể ảnh hưởng đến hiệu suất của phần mềm chạy trên nó?",
    "re": "Đúng"
  },
  {
    "con": "Tốc độ truy nhập của bộ nhớ SRAM so với bộ nhớ DRAM như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Số lượng bit trong một từ dữ liệu của kiến trúc máy tính ảnh hưởng đến khả năng xử lý dữ liệu như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Kiến trúc Harvard có gì khác biệt so với kiến trúc Von Neumann?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý đa lõi có thể cải thiện hiệu suất xử lý như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cache memory có vai trò gì trong việc tăng tốc độ truy cập dữ liệu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tốc độ xung nhịp của CPU ảnh hưởng đến hiệu suất xử lý như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Kiến trúc RISC có ưu điểm gì so với kiến trúc CISC?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hệ thống bus trong máy tính có vai trò gì trong việc truyền dữ liệu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ điều khiển (Control Unit) có nhiệm vụ gì trong kiến trúc máy tính?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tính năng pipelining trong CPU giúp cải thiện hiệu suất như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ xử lý nhiều tác vụ đồng thời hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ tăng lên"
  },
  {
    "con": "Khi tăng kích thước bộ nhớ cache",
    "re": "Thời gian truy cập dữ liệu sẽ giảm"
  },
  {
    "con": "Nếu sử dụng kiến trúc Harvard thay vì kiến trúc Von Neumann",
    "re": "Tốc độ xử lý có thể được cải thiện do truy cập đồng thời vào bộ nhớ lệnh và dữ liệu"
  },
  {
    "con": "Khi sử dụng pipelining trong bộ xử lý",
    "re": "Thời gian thực hiện các lệnh sẽ giảm"
  },
  {
    "con": "Nếu tần số xung nhịp của bộ xử lý tăng",
    "re": "Hiệu suất xử lý có thể tăng lên, nhưng tiêu thụ năng lượng cũng sẽ tăng"
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo",
    "re": "Hệ thống có thể chạy nhiều ứng dụng hơn so với dung lượng bộ nhớ vật lý"
  },
  {
    "con": "Nếu một hệ thống có bus dữ liệu rộng hơn",
    "re": "Tốc độ truyền dữ liệu giữa các thành phần sẽ cao hơn"
  },
  {
    "con": "Khi sử dụng kỹ thuật phân chia thời gian (time-sharing)",
    "re": "Nhiều người dùng có thể sử dụng tài nguyên hệ thống đồng thời"
  },
  {
    "con": "Nếu một hệ thống sử dụng RAID để lưu trữ dữ liệu",
    "re": "Độ tin cậy và hiệu suất của hệ thống lưu trữ sẽ được cải thiện"
  },
  {
    "con": "Khi sử dụng kiến trúc đa xử lý",
    "re": "Khả năng mở rộng và hiệu suất của hệ thống sẽ được nâng cao"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn sẽ thực hiện đa nhiệm tốt hơn",
    "re": "Hiệu suất tổng thể của hệ thống sẽ tăng lên"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn sẽ giảm thiểu thời gian truy cập dữ liệu",
    "re": "Tốc độ xử lý của CPU sẽ được cải thiện"
  },
  {
    "con": "Sử dụng kiến trúc RISC thay vì CISC sẽ đơn giản hóa thiết kế bộ xử lý",
    "re": "Thời gian phát triển và chi phí sản xuất sẽ giảm"
  },
  {
    "con": "Tăng tốc độ xung nhịp của CPU sẽ làm tăng hiệu suất xử lý",
    "re": "Nhiệt độ hoạt động của CPU sẽ tăng lên"
  },
  {
    "con": "Sử dụng bộ nhớ ảo cho phép hệ thống sử dụng nhiều bộ nhớ hơn so với bộ nhớ vật lý",
    "re": "Khả năng chạy nhiều ứng dụng đồng thời sẽ được cải thiện"
  },
  {
    "con": "Kiến trúc máy tính song song cho phép xử lý nhiều tác vụ cùng một lúc",
    "re": "Thời gian hoàn thành công việc sẽ giảm"
  },
  {
    "con": "Sử dụng bus dữ liệu rộng hơn sẽ cho phép truyền tải nhiều dữ liệu hơn trong một lần",
    "re": "Băng thông của hệ thống sẽ được cải thiện"
  },
  {
    "con": "Sử dụng kỹ thuật pipelining trong CPU sẽ làm tăng hiệu suất xử lý",
    "re": "Thời gian thực hiện các lệnh sẽ giảm"
  },
  {
    "con": "Bộ nhớ RAM có tốc độ cao hơn sẽ cải thiện hiệu suất của ứng dụng",
    "re": "Thời gian truy cập dữ liệu sẽ giảm"
  },
  {
    "con": "Sử dụng kiến trúc phân tán cho phép mở rộng hệ thống dễ dàng hơn",
    "re": "Khả năng mở rộng và tính linh hoạt của hệ thống sẽ tăng lên"
  },
  {
    "con": "Đối với bộ nhớ truy nhập ngẫu nhiên, điều nào sau đây không đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Đối với bộ nhớ SRAM, điều nào sau đây đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi số lượng bit trong bus dữ liệu tăng lên, điều này sẽ dẫn đến",
    "re": "tăng băng thông của hệ thống"
  },
  {
    "con": "Nếu một bộ xử lý có kiến trúc RISC, điều này có nghĩa là",
    "re": "các lệnh được thiết kế để thực hiện trong một chu kỳ đồng hồ"
  },
  {
    "con": "Khi sử dụng bộ nhớ cache, nếu tỷ lệ hit tăng lên, điều này sẽ",
    "re": "giảm thời gian truy cập bộ nhớ tổng thể"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc đa lõi, điều này sẽ",
    "re": "cải thiện khả năng xử lý song song"
  },
  {
    "con": "Khi một CPU có tốc độ xung nhịp cao hơn, điều này thường dẫn đến",
    "re": "tăng hiệu suất xử lý"
  },
  {
    "con": "Nếu một hệ thống sử dụng bộ điều khiển DMA, điều này sẽ",
    "re": "giảm tải cho CPU trong việc quản lý truyền dữ liệu"
  },
  {
    "con": "Khi một hệ thống có nhiều tầng bộ nhớ, điều này sẽ",
    "re": "tối ưu hóa hiệu suất truy cập dữ liệu"
  },
  {
    "con": "Nếu một kiến trúc máy tính sử dụng pipelining, điều này sẽ",
    "re": "tăng cường khả năng thực thi lệnh đồng thời"
  },
  {
    "con": "Khi một hệ thống sử dụng bộ nhớ ảo, điều này cho phép",
    "re": "mở rộng không gian địa chỉ cho các ứng dụng"
  },
  {
    "con": "Đối với bộ nhớ SRAM, điều nào sau đây không đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi số lượng lõi xử lý tăng lên trong một CPU, hiệu suất xử lý đa nhiệm sẽ cải thiện.",
    "re": "Hiệu suất xử lý đa nhiệm sẽ tăng lên"
  },
  {
    "con": "Nếu bộ nhớ cache có dung lượng lớn hơn, thì thời gian truy cập dữ liệu sẽ giảm.",
    "re": "Thời gian truy cập dữ liệu sẽ nhanh hơn"
  },
  {
    "con": "Khi sử dụng kiến trúc RISC, số lượng lệnh sẽ ít hơn so với kiến trúc CISC.",
    "re": "Số lượng lệnh sẽ giảm"
  },
  {
    "con": "Nếu một hệ thống sử dụng bus dữ liệu rộng hơn, thì băng thông truyền tải dữ liệu sẽ tăng.",
    "re": "Băng thông truyền tải dữ liệu sẽ cao hơn"
  },
  {
    "con": "Khi sử dụng kỹ thuật pipelining, thời gian thực hiện một lệnh sẽ giảm.",
    "re": "Thời gian thực hiện lệnh sẽ được cải thiện"
  },
  {
    "con": "Nếu một CPU có tốc độ xung nhịp cao hơn, thì khả năng xử lý sẽ tăng.",
    "re": "Khả năng xử lý sẽ được cải thiện"
  },
  {
    "con": "Khi sử dụng bộ nhớ ảo, dung lượng bộ nhớ khả dụng cho ứng dụng sẽ tăng.",
    "re": "Dung lượng bộ nhớ khả dụng sẽ lớn hơn"
  },
  {
    "con": "Nếu một hệ thống có nhiều bộ xử lý, thì khả năng xử lý song song sẽ tăng.",
    "re": "Khả năng xử lý song song sẽ được cải thiện"
  },
  {
    "con": "Khi sử dụng kiến trúc đa lõi, hiệu suất năng lượng sẽ tốt hơn so với kiến trúc đơn lõi.",
    "re": "Hiệu suất năng lượng sẽ cao hơn"
  },
  {
    "con": "Đối với bộ nhớ ROM, điều nào sau đây đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một bộ vi xử lý có nhiều lõi,",
    "re": "thì nó có khả năng xử lý nhiều tác vụ đồng thời tốt hơn."
  },
  {
    "con": "Nếu tốc độ xung nhịp của bộ vi xử lý tăng lên,",
    "re": "thì hiệu suất xử lý của nó cũng có khả năng tăng lên."
  },
  {
    "con": "Nếu bộ nhớ cache có dung lượng lớn hơn,",
    "re": "thì khả năng truy cập dữ liệu nhanh hơn sẽ tăng lên."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc Harvard,",
    "re": "thì nó có thể truy cập bộ nhớ dữ liệu và bộ nhớ lệnh đồng thời."
  },
  {
    "con": "Nếu một bộ vi xử lý sử dụng pipelining,",
    "re": "thì nó có thể thực hiện nhiều giai đoạn của lệnh cùng một lúc."
  },
  {
    "con": "Nếu một hệ thống có bus dữ liệu rộng hơn,",
    "re": "thì nó có thể truyền tải nhiều dữ liệu hơn trong một lần."
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc RISC,",
    "re": "thì nó có thể thực hiện các lệnh đơn giản và nhanh chóng hơn."
  },
  {
    "con": "Nếu một bộ nhớ sử dụng công nghệ DRAM,",
    "re": "thì nó cần phải được làm tươi thường xuyên để giữ dữ liệu."
  },
  {
    "con": "Nếu một hệ thống có nhiều card đồ họa,",
    "re": "thì nó có thể xử lý đồ họa phức tạp hơn và cải thiện hiệu suất chơi game."
  },
  {
    "con": "Đối với bộ nhớ ROM, điều nào sau đây không đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi tốc độ xung nhịp của CPU tăng lên, hiệu suất xử lý thường cải thiện.",
    "re": "Hiệu suất xử lý tăng lên"
  },
  {
    "con": "Nếu bộ nhớ cache có dung lượng lớn hơn, thì thời gian truy cập dữ liệu sẽ giảm.",
    "re": "Thời gian truy cập dữ liệu giảm"
  },
  {
    "con": "Khi sử dụng kiến trúc đa lõi, nếu số lượng lõi tăng lên, thì khả năng xử lý song song sẽ cải thiện.",
    "re": "Khả năng xử lý song song cải thiện"
  },
  {
    "con": "Nếu một hệ thống sử dụng bus dữ liệu rộng hơn, thì băng thông truyền tải dữ liệu sẽ tăng.",
    "re": "Băng thông truyền tải dữ liệu tăng"
  },
  {
    "con": "Khi sử dụng kỹ thuật pipelining, nếu số lượng giai đoạn trong pipeline tăng lên, thì hiệu suất xử lý có thể cải thiện.",
    "re": "Hiệu suất xử lý có thể cải thiện"
  },
  {
    "con": "Nếu một hệ thống có bộ nhớ ảo, thì dung lượng bộ nhớ khả dụng cho ứng dụng sẽ lớn hơn dung lượng bộ nhớ vật lý.",
    "re": "Dung lượng bộ nhớ khả dụng lớn hơn"
  },
  {
    "con": "Khi sử dụng kiến trúc RISC, nếu số lượng lệnh đơn giản tăng lên, thì thời gian thực thi mỗi lệnh có thể giảm.",
    "re": "Thời gian thực thi mỗi lệnh có thể giảm"
  },
  {
    "con": "Nếu một hệ thống sử dụng công nghệ SIMD, thì khả năng xử lý dữ liệu song song sẽ được cải thiện.",
    "re": "Khả năng xử lý dữ liệu song song cải thiện"
  },
  {
    "con": "Khi một CPU có nhiều bộ xử lý, nếu các bộ xử lý này chia sẻ bộ nhớ, thì có thể xảy ra tình trạng tranh chấp tài nguyên.",
    "re": "Có thể xảy ra tình trạng tranh chấp tài nguyên"
  },
  {
    "con": "Bộ xử lý có nhiều lõi hơn",
    "re": "Hiệu suất xử lý đa nhiệm sẽ cao hơn"
  },
  {
    "con": "Bộ nhớ cache có dung lượng lớn hơn",
    "re": "Thời gian truy cập dữ liệu sẽ nhanh hơn"
  },
  {
    "con": "Sử dụng kiến trúc RISC",
    "re": "Sẽ có số lượng lệnh đơn giản hơn và hiệu suất cao hơn trong một số ứng dụng"
  },
  {
    "con": "Tăng tốc độ xung nhịp của bộ xử lý",
    "re": "Hiệu suất xử lý sẽ được cải thiện, nhưng có thể dẫn đến tiêu thụ năng lượng cao hơn"
  },
  {
    "con": "Sử dụng bộ nhớ ảo",
    "re": "Có thể chạy nhiều ứng dụng hơn so với dung lượng bộ nhớ vật lý"
  },
  {
    "con": "Sử dụng bus dữ liệu rộng hơn",
    "re": "Tăng băng thông truyền tải dữ liệu giữa các thành phần"
  },
  {
    "con": "Sử dụng kiến trúc đa xử lý",
    "re": "Có thể cải thiện hiệu suất cho các ứng dụng song song"
  },
  {
    "con": "Sử dụng kỹ thuật pipelining",
    "re": "Tăng cường hiệu suất xử lý bằng cách cho phép nhiều lệnh được thực hiện đồng thời"
  },
  {
    "con": "Sử dụng bộ điều khiển DMA",
    "re": "Giảm tải cho CPU khi truyền dữ liệu giữa bộ nhớ và thiết bị ngoại vi"
  },
  {
    "con": "Sử dụng hệ thống tản nhiệt hiệu quả",
    "re": "Giúp duy trì hiệu suất ổn định cho bộ xử lý trong thời gian dài"
  },
  {
    "con": "Trong các phát biểu sau, phát biểu nào đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chương trình BIOS được lưu trữ trong bộ nhớ thuộc loại nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bộ xử lý có nhiều lõi thì nó có khả năng xử lý nhiều tác vụ đồng thời hơn.",
    "re": "Tăng hiệu suất xử lý"
  },
  {
    "con": "Nếu bộ nhớ cache có dung lượng lớn hơn thì thời gian truy cập dữ liệu sẽ giảm.",
    "re": "Cải thiện hiệu suất hệ thống"
  },
  {
    "con": "Nếu kiến trúc máy tính sử dụng pipelining thì tốc độ thực thi lệnh sẽ tăng lên.",
    "re": "Giảm thời gian thực thi trung bình"
  },
  {
    "con": "Nếu bus dữ liệu có bề rộng lớn hơn thì lượng dữ liệu truyền tải trong một lần sẽ tăng.",
    "re": "Tăng băng thông truyền tải"
  },
  {
    "con": "Nếu sử dụng bộ nhớ ảo thì hệ thống có thể chạy nhiều ứng dụng hơn so với bộ nhớ vật lý.",
    "re": "Tăng khả năng đa nhiệm"
  },
  {
    "con": "Nếu một hệ thống sử dụng kiến trúc RISC thì các lệnh sẽ có độ dài cố định.",
    "re": "Đơn giản hóa quy trình giải mã lệnh"
  },
  {
    "con": "Nếu một CPU có tần số xung nhịp cao hơn thì khả năng xử lý sẽ nhanh hơn.",
    "re": "Tăng tốc độ xử lý"
  },
  {
    "con": "Nếu hệ thống sử dụng RAID thì khả năng bảo vệ dữ liệu sẽ được cải thiện.",
    "re": "Giảm nguy cơ mất dữ liệu"
  },
  {
    "con": "Nếu một hệ thống có nhiều card đồ họa thì khả năng xử lý đồ họa sẽ được nâng cao.",
    "re": "Cải thiện hiệu suất đồ họa"
  },
  {
    "con": "Dung lượng của bộ nhớ được xác định bởi:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tốc độ xử lý của CPU tăng lên khi số lượng lõi xử lý tăng lên:",
    "re": "Hiệu suất xử lý cao hơn"
  },
  {
    "con": "Băng thông của bus dữ liệu ảnh hưởng đến tốc độ truyền tải dữ liệu giữa các thành phần:",
    "re": "Tốc độ truyền tải dữ liệu cao hơn"
  },
  {
    "con": "Số lượng cache levels (L1, L2, L3) trong CPU ảnh hưởng đến hiệu suất truy cập dữ liệu:",
    "re": "Thời gian truy cập dữ liệu nhanh hơn"
  },
  {
    "con": "Kiến trúc Harvard cho phép truy cập đồng thời vào bộ nhớ chương trình và bộ nhớ dữ liệu:",
    "re": "Tăng hiệu suất xử lý"
  },
  {
    "con": "Sử dụng kỹ thuật pipelining trong CPU giúp tăng cường khả năng xử lý song song:",
    "re": "Tăng tốc độ thực thi lệnh"
  },
  {
    "con": "Việc sử dụng bộ nhớ ảo cho phép hệ thống sử dụng nhiều bộ nhớ hơn so với bộ nhớ vật lý có sẵn:",
    "re": "Cải thiện khả năng chạy nhiều ứng dụng đồng thời"
  },
  {
    "con": "Kiến trúc RISC (Reduced Instruction Set Computer) có số lượng lệnh ít hơn so với CISC (Complex Instruction Set Computer):",
    "re": "Giảm độ phức tạp trong thiết kế CPU"
  },
  {
    "con": "Sự phân chia giữa phần cứng và phần mềm trong kiến trúc máy tính giúp tối ưu hóa hiệu suất:",
    "re": "Tăng cường khả năng mở rộng và bảo trì"
  },
  {
    "con": "Sử dụng các kỹ thuật tối ưu hóa như superscalar cho phép thực thi nhiều lệnh trong một chu kỳ đồng hồ:",
    "re": "Tăng hiệu suất tổng thể của CPU"
  }
]