[
  {
    "con": "Tầng liên kết dữ liệu được chia ra làm bao nhiêu tầng con?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng LAN thường sử dụng giao thức nào để truyền tải dữ liệu?",
    "re": "Giao thức Ethernet"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì điều gì sẽ xảy ra?",
    "re": "Gói tin sẽ bị mất và không được nhận"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng địa chỉ IP tĩnh, thì điều gì sẽ xảy ra?",
    "re": "Thiết bị đó sẽ giữ nguyên địa chỉ IP ngay cả khi khởi động lại"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì điều gì sẽ xảy ra với địa chỉ IP riêng?",
    "re": "Địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một gói tin bị lỗi trong quá trình truyền tải, thì điều gì sẽ xảy ra?",
    "re": "Gói tin sẽ được phát hiện và yêu cầu gửi lại"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì điều gì sẽ xảy ra với việc truyền tải dữ liệu?",
    "re": "Dữ liệu sẽ được truyền tải một cách đáng tin cậy và theo thứ tự"
  },
  {
    "con": "Nếu một thiết bị trong mạng không có địa chỉ IP, thì điều gì sẽ xảy ra?",
    "re": "Thiết bị đó sẽ không thể giao tiếp với các thiết bị khác trong mạng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP, thì điều gì sẽ xảy ra với việc truyền tải dữ liệu?",
    "re": "Dữ liệu sẽ được truyền tải nhanh nhưng không đảm bảo độ tin cậy"
  },
  {
    "con": "Nếu một mạng có nhiều thiết bị kết nối cùng một lúc, thì điều gì sẽ xảy ra?",
    "re": "Có thể xảy ra tình trạng tắc nghẽn mạng"
  },
  {
    "con": "Hệ điều hành nào sau đây là hệ điều hành mạng peer-to-peer ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích trong mạng,",
    "re": "thì có thể xảy ra mất gói tin."
  },
  {
    "con": "Nếu một địa chỉ IP không hợp lệ được sử dụng trong mạng,",
    "re": "thì thiết bị sẽ không thể kết nối với mạng."
  },
  {
    "con": "Nếu một router không có bảng định tuyến,",
    "re": "thì nó sẽ không biết cách chuyển tiếp gói tin."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP,",
    "re": "thì nó sẽ đảm bảo độ tin cậy trong việc truyền dữ liệu."
  },
  {
    "con": "Nếu một thiết bị trong mạng bị tấn công DDoS,",
    "re": "thì nó có thể bị ngừng hoạt động do quá tải."
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch,",
    "re": "thì nó sẽ cải thiện hiệu suất truyền dữ liệu so với hub."
  },
  {
    "con": "Nếu một địa chỉ MAC bị thay đổi,",
    "re": "thì thiết bị sẽ có thể bị nhận diện khác trong mạng."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP,",
    "re": "thì nó sẽ không đảm bảo độ tin cậy trong việc truyền dữ liệu."
  },
  {
    "con": "Nếu một firewall được cấu hình sai,",
    "re": "thì nó có thể cho phép các kết nối không an toàn vào mạng."
  },
  {
    "con": "Hệ điều hành nào sau đây thuộc hệ điều hành mạng Server-based ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một địa chỉ IP nào đó thuộc lớp A?",
    "re": "Địa chỉ IP có giá trị từ 1.0.0.0 đến 126.255.255.255"
  },
  {
    "con": "Gói tin được gửi từ máy tính A đến máy tính B qua mạng?",
    "re": "Gói tin sẽ đi qua các router và switch trong mạng"
  },
  {
    "con": "Một mạng LAN sử dụng giao thức Ethernet?",
    "re": "Mạng LAN sẽ có tốc độ truyền tải cao và độ trễ thấp"
  },
  {
    "con": "Một thiết bị mạng nào đó được cấu hình làm DHCP server?",
    "re": "Thiết bị đó sẽ tự động cấp phát địa chỉ IP cho các thiết bị trong mạng"
  },
  {
    "con": "Một kết nối VPN được thiết lập?",
    "re": "Kết nối này sẽ mã hóa dữ liệu giữa hai điểm để bảo mật thông tin"
  },
  {
    "con": "Một mạng sử dụng giao thức TCP?",
    "re": "Mạng đó sẽ đảm bảo tính toàn vẹn và thứ tự của dữ liệu truyền tải"
  },
  {
    "con": "Một địa chỉ MAC là gì?",
    "re": "Địa chỉ MAC là một định danh duy nhất cho mỗi thiết bị trong mạng"
  },
  {
    "con": "Một mạng WAN có đặc điểm gì?",
    "re": "Mạng WAN kết nối các mạng LAN ở khoảng cách xa và thường sử dụng các công nghệ như MPLS hoặc Frame Relay"
  },
  {
    "con": "Một firewall được cấu hình đúng?",
    "re": "Firewall sẽ bảo vệ mạng khỏi các truy cập trái phép và các mối đe dọa từ bên ngoài"
  },
  {
    "con": "Mạng nào sử dụng giao thức TCP/IP để truyền tải dữ liệu ?",
    "re": "Mạng Internet"
  },
  {
    "con": "Thiết bị nào có chức năng kết nối các mạng khác nhau và chuyển tiếp dữ liệu giữa chúng ?",
    "re": "Router"
  },
  {
    "con": "Nếu một máy tính không thể truy cập Internet, thì vấn đề có thể nằm ở đâu ?",
    "re": "Cấu hình địa chỉ IP hoặc kết nối vật lý"
  },
  {
    "con": "Loại giao thức nào đảm bảo dữ liệu được truyền tải một cách đáng tin cậy ?",
    "re": "Giao thức TCP"
  },
  {
    "con": "Nếu một mạng LAN sử dụng địa chỉ IP tĩnh, thì điều gì sẽ xảy ra khi một thiết bị mới được thêm vào ?",
    "re": "Thiết bị mới cần được cấu hình địa chỉ IP tĩnh khác để tránh xung đột"
  },
  {
    "con": "Thiết bị nào có chức năng chuyển tiếp dữ liệu trong cùng một mạng LAN ?",
    "re": "Switch"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải, thì giao thức nào sẽ yêu cầu gửi lại gói tin đó ?",
    "re": "Giao thức TCP"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì điều gì sẽ xảy ra với địa chỉ IP riêng ?",
    "re": "Địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng"
  },
  {
    "con": "Loại mạng nào cho phép kết nối không dây giữa các thiết bị ?",
    "re": "Mạng Wi-Fi"
  },
  {
    "con": "Nếu một máy chủ DNS không phản hồi, thì điều gì có thể xảy ra ?",
    "re": "Người dùng không thể truy cập các trang web bằng tên miền"
  },
  {
    "con": "Tầng nào của mô hình OSI sử dụng PDUs gọi là Segments?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải,",
    "re": "thì giao thức TCP sẽ yêu cầu gửi lại gói tin đó."
  },
  {
    "con": "Nếu một địa chỉ IP thuộc lớp A,",
    "re": "thì nó có thể có từ 1 đến 126 trong phần đầu của địa chỉ."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP,",
    "re": "thì các thiết bị trong mạng sẽ tự động nhận địa chỉ IP."
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng NAT,",
    "re": "thì nó có thể chia sẻ một địa chỉ IP công cộng cho nhiều thiết bị nội bộ."
  },
  {
    "con": "Nếu một gói tin được mã hóa bằng SSL/TLS,",
    "re": "thì dữ liệu truyền tải giữa máy khách và máy chủ sẽ được bảo mật."
  },
  {
    "con": "Nếu một mạng sử dụng mô hình client-server,",
    "re": "thì các máy khách sẽ gửi yêu cầu đến máy chủ để nhận dịch vụ."
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức ICMP,",
    "re": "thì nó có thể gửi thông báo lỗi và kiểm tra kết nối mạng."
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch,",
    "re": "thì nó sẽ giảm thiểu va chạm dữ liệu so với việc sử dụng hub."
  },
  {
    "con": "Nếu một địa chỉ MAC là duy nhất trong một mạng,",
    "re": "thì nó sẽ giúp xác định thiết bị trong mạng đó."
  },
  {
    "con": "Phương thức trao đổi thông tin nào mà trong đó máy phát và máy thu có thể truyền thông tin hai chiều, nhưng tại mỗi thời điểm chỉ có một máy được phép truyền ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích trong một mạng, thì nó có thể bị mất hoặc bị lỗi trong quá trình truyền tải.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì nó đảm bảo rằng dữ liệu được truyền đi một cách đáng tin cậy và theo thứ tự.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị trong mạng không có địa chỉ IP hợp lệ, thì nó sẽ không thể giao tiếp với các thiết bị khác trong mạng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch, thì nó có thể giảm thiểu va chạm dữ liệu so với việc sử dụng hub.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin được mã hóa, thì chỉ những người có khóa giải mã mới có thể đọc nội dung của nó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP, thì nó không đảm bảo việc truyền dữ liệu đáng tin cậy.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một router không có bảng định tuyến, thì nó sẽ không biết cách chuyển tiếp gói tin đến đích.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation), thì nó cho phép nhiều thiết bị trong mạng nội bộ chia sẻ một địa chỉ IP công cộng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng không có bảo mật, thì nó dễ bị tấn công từ bên ngoài và có nguy cơ mất dữ liệu.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Báo nhận (ACK), trình tự (sequence) và điều khiển luồng dữ liệu là những đặc tính của tầng thứ mấy trong mô hình OSI ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu địa chỉ IP của một thiết bị trong mạng là 192.168.1.1, thì thiết bị đó thuộc về lớp mạng nào ?",
    "re": "Lớp mạng riêng (Private Network)"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì nó sẽ được gửi lại bao nhiêu lần theo giao thức TCP ?",
    "re": "Không giới hạn, nhưng có thể bị giới hạn bởi các tham số cấu hình"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức DHCP, thì nó sẽ nhận địa chỉ IP từ đâu ?",
    "re": "Từ máy chủ DHCP"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì địa chỉ IP công cộng sẽ được ánh xạ đến địa chỉ IP nào ?",
    "re": "Địa chỉ IP riêng trong mạng nội bộ"
  },
  {
    "con": "Nếu một gói tin bị rơi trong quá trình truyền tải, thì giao thức nào sẽ đảm bảo rằng gói tin đó được gửi lại ?",
    "re": "Giao thức TCP"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức ICMP, thì nó chủ yếu được sử dụng để làm gì ?",
    "re": "Để kiểm tra kết nối mạng và gửi thông báo lỗi"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch, thì dữ liệu sẽ được chuyển tiếp như thế nào ?",
    "re": "Dữ liệu sẽ được chuyển tiếp đến thiết bị đích dựa trên địa chỉ MAC"
  },
  {
    "con": "Nếu một mạng sử dụng mô hình client-server, thì vai trò của server là gì ?",
    "re": "Cung cấp dịch vụ và tài nguyên cho client"
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ MAC, thì nó có thể được nhận diện trong mạng như thế nào ?",
    "re": "Bằng cách sử dụng địa chỉ MAC để định danh thiết bị trong mạng"
  },
  {
    "con": "Trên mạng Server based , loại máy chủ nào chuyên nhận và xử lý những yêu cầu về dữ liệu và trả kết quả cho các máy trạm ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ IP tĩnh, thì nó sẽ không thay đổi địa chỉ IP sau mỗi lần khởi động lại.",
    "re": "Địa chỉ IP của thiết bị sẽ luôn giữ nguyên."
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì nó sẽ bị mất và không được gửi lại trừ khi giao thức hỗ trợ việc này.",
    "re": "Giao thức TCP sẽ đảm bảo gói tin được gửi lại."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP, thì các thiết bị trong mạng sẽ tự động nhận địa chỉ IP từ máy chủ DHCP.",
    "re": "Quá trình cấu hình mạng sẽ trở nên dễ dàng hơn."
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch, thì băng thông sẽ được phân bổ hiệu quả hơn so với việc sử dụng hub.",
    "re": "Tốc độ truyền tải dữ liệu sẽ cao hơn."
  },
  {
    "con": "Nếu một thiết bị mạng bị tấn công từ chối dịch vụ (DoS), thì nó sẽ không thể phục vụ các yêu cầu hợp lệ từ người dùng.",
    "re": "Dịch vụ mạng sẽ bị gián đoạn."
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation), thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng.",
    "re": "Điều này giúp bảo mật và tiết kiệm địa chỉ IP công cộng."
  },
  {
    "con": "Nếu một giao thức sử dụng mã hóa, thì dữ liệu truyền tải sẽ được bảo vệ khỏi việc bị nghe lén.",
    "re": "Bảo mật thông tin sẽ được nâng cao."
  },
  {
    "con": "Nếu một mạng không dây sử dụng WPA2, thì nó sẽ cung cấp mức độ bảo mật cao hơn so với WEP.",
    "re": "Nguy cơ bị tấn công sẽ giảm đi."
  },
  {
    "con": "Nếu một thiết bị mạng không được cập nhật phần mềm thường xuyên, thì nó có thể trở thành mục tiêu dễ dàng cho các cuộc tấn công.",
    "re": "Rủi ro bảo mật sẽ tăng lên."
  },
  {
    "con": "Mạng nào cho phép kết nối nhiều thiết bị mà không cần dây cáp?",
    "re": "Mạng không dây (Wi-Fi)"
  },
  {
    "con": "Giao thức nào được sử dụng để truyền tải dữ liệu trên Internet?",
    "re": "Giao thức TCP/IP"
  },
  {
    "con": "Nếu một thiết bị trong mạng bị lỗi, nhưng các thiết bị khác vẫn hoạt động bình thường, thì mạng đó được gọi là gì?",
    "re": "Mạng có tính khả dụng cao"
  },
  {
    "con": "Nếu một gói dữ liệu không đến đích, thì giao thức nào sẽ đảm bảo rằng gói đó được gửi lại?",
    "re": "Giao thức TCP"
  },
  {
    "con": "Nếu một mạng sử dụng địa chỉ IP tĩnh, thì địa chỉ IP của thiết bị đó sẽ như thế nào?",
    "re": "Địa chỉ IP không thay đổi theo thời gian"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch, thì dữ liệu sẽ được chuyển tiếp như thế nào?",
    "re": "Dữ liệu sẽ được chuyển tiếp đến thiết bị đích dựa trên địa chỉ MAC"
  },
  {
    "con": "Nếu một thiết bị mạng không thể truy cập Internet, thì nguyên nhân có thể là gì?",
    "re": "Cấu hình DNS không chính xác"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì địa chỉ IP công cộng sẽ được sử dụng như thế nào?",
    "re": "Địa chỉ IP công cộng sẽ được ánh xạ đến nhiều địa chỉ IP riêng"
  },
  {
    "con": "Nếu một giao thức mạng không đảm bảo tính bảo mật, thì dữ liệu có thể bị làm gì?",
    "re": "Dữ liệu có thể bị nghe lén hoặc giả mạo"
  },
  {
    "con": "Nếu một mạng sử dụng VPN, thì dữ liệu sẽ được truyền tải như thế nào?",
    "re": "Dữ liệu sẽ được mã hóa và bảo mật khi truyền qua Internet"
  },
  {
    "con": "Lớp nào cung cấp phương tiện để truyền thông tin qua liên kết vật lý đảm bảo tin cậy ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến đích trong thời gian quy định,",
    "re": "thì nó sẽ bị coi là mất mát và có thể được yêu cầu gửi lại."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP,",
    "re": "thì nó sẽ đảm bảo tính toàn vẹn và thứ tự của dữ liệu."
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ IP tĩnh,",
    "re": "thì nó sẽ không thay đổi địa chỉ IP sau mỗi lần khởi động."
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation),",
    "re": "thì nhiều thiết bị có thể chia sẻ một địa chỉ IP công cộng."
  },
  {
    "con": "Nếu một gói tin được mã hóa,",
    "re": "thì chỉ những người có khóa giải mã mới có thể đọc nội dung của nó."
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch,",
    "re": "thì nó sẽ giảm thiểu va chạm dữ liệu so với việc sử dụng hub."
  },
  {
    "con": "Nếu một giao thức sử dụng mô hình OSI,",
    "re": "thì nó sẽ phân chia quá trình truyền thông thành 7 lớp khác nhau."
  },
  {
    "con": "Nếu một thiết bị mạng bị lỗi,",
    "re": "thì nó có thể gây ra sự gián đoạn trong kết nối mạng."
  },
  {
    "con": "Nếu một mạng không dây sử dụng WPA2,",
    "re": "thì nó sẽ cung cấp mức độ bảo mật cao hơn so với WEP."
  },
  {
    "con": "Các máy trạm hoạt động trong một mạng, vừa có chức năng như máy phục vụ (server), vừa như máy khách (client) có thể tìm thấy trong mạng nào ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng LAN sử dụng giao thức Ethernet để truyền dữ liệu giữa các thiết bị trong cùng một khu vực địa lý thì tốc độ truyền tải thường cao hơn mạng WAN.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một thiết bị trong mạng không nhận được địa chỉ IP hợp lệ từ máy chủ DHCP thì thiết bị đó sẽ không thể kết nối vào mạng.",
    "re": "Đúng"
  },
  {
    "con": "Khi một gói tin được gửi qua mạng, nếu nó không đến đích do lỗi mạng thì gói tin đó sẽ bị mất.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation) thì các thiết bị trong mạng nội bộ sẽ có địa chỉ IP riêng và không thể truy cập trực tiếp từ Internet.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP thì dữ liệu sẽ được truyền theo cách có kiểm soát và đảm bảo độ tin cậy.",
    "re": "Đúng"
  },
  {
    "con": "Khi một thiết bị trong mạng sử dụng giao thức UDP để truyền dữ liệu thì tốc độ truyền tải sẽ nhanh hơn nhưng không đảm bảo độ tin cậy.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mạng không có bảo mật thì dữ liệu có thể bị nghe lén hoặc bị tấn công dễ dàng.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một router không có bảng định tuyến thì nó sẽ không thể chuyển tiếp gói tin đến đích.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mạng sử dụng VLAN (Virtual Local Area Network) thì các thiết bị trong cùng một VLAN có thể giao tiếp với nhau mà không cần qua router.",
    "re": "Đúng"
  },
  {
    "con": "Thông số nào cần biết khi trao đổi dữ liệu, NIC phải tiến hành cơ chế bắt tay (Hand Shaking) để đàm phán với NIC ở đầu nhận ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải, giao thức TCP sẽ tự động yêu cầu gửi lại gói tin đó ?",
    "re": "Giao thức TCP đảm bảo tính toàn vẹn của dữ liệu"
  },
  {
    "con": "Nếu một thiết bị mạng không có địa chỉ IP hợp lệ, nó sẽ không thể giao tiếp với các thiết bị khác trên mạng ?",
    "re": "Địa chỉ IP là cần thiết cho việc định danh thiết bị trong mạng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP, các thiết bị sẽ tự động nhận địa chỉ IP từ máy chủ DHCP ?",
    "re": "Giao thức DHCP giúp quản lý địa chỉ IP hiệu quả"
  },
  {
    "con": "Nếu một gói tin được gửi từ một thiết bị đến một thiết bị khác trên mạng, nó sẽ đi qua nhiều router và switch ?",
    "re": "Quá trình chuyển tiếp gói tin là cần thiết để đến đích"
  },
  {
    "con": "Nếu một mạng LAN sử dụng công nghệ Ethernet, nó sẽ sử dụng khung dữ liệu để truyền tải thông tin ?",
    "re": "Khung dữ liệu là đơn vị cơ bản trong truyền tải dữ liệu Ethernet"
  },
  {
    "con": "Nếu một thiết bị mạng bị tấn công từ chối dịch vụ (DoS), nó có thể làm giảm hiệu suất của mạng ?",
    "re": "Tấn công DoS có thể gây ra gián đoạn dịch vụ mạng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức IP phiên bản 6 (IPv6), nó sẽ có khả năng hỗ trợ nhiều địa chỉ IP hơn so với IPv4 ?",
    "re": "IPv6 giải quyết vấn đề cạn kiệt địa chỉ IP"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng NAT (Network Address Translation), nó có thể chia sẻ một địa chỉ IP công cộng cho nhiều thiết bị trong mạng riêng ?",
    "re": "NAT giúp tiết kiệm địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một mạng không được bảo mật, nó có thể dễ dàng bị xâm nhập và đánh cắp dữ liệu ?",
    "re": "Bảo mật mạng là cần thiết để bảo vệ thông tin nhạy cảm"
  },
  {
    "con": "Loại mạng nào mà tất cả các tài nguyên được tập trung tại các Server và các tài nguyên được quản lý chia sẻ một cách có tổ chức ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị trong mạng không thể giao tiếp với thiết bị khác do cấu hình sai địa chỉ IP ?",
    "re": "Thì thiết bị đó sẽ không thể truy cập vào tài nguyên mạng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP/IP ?",
    "re": "Thì nó có khả năng truyền tải dữ liệu một cách đáng tin cậy"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch để kết nối các thiết bị ?",
    "re": "Thì nó sẽ cải thiện hiệu suất mạng bằng cách giảm thiểu va chạm dữ liệu"
  },
  {
    "con": "Nếu một router được cấu hình với bảng định tuyến chính xác ?",
    "re": "Thì nó có thể chuyển tiếp gói tin đến đúng đích một cách hiệu quả"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP ?",
    "re": "Thì các thiết bị trong mạng có thể tự động nhận địa chỉ IP mà không cần cấu hình thủ công"
  },
  {
    "con": "Nếu một mạng không dây sử dụng mã hóa WPA2 ?",
    "re": "Thì nó sẽ cung cấp mức độ bảo mật cao hơn so với các giao thức mã hóa cũ hơn"
  },
  {
    "con": "Nếu một thiết bị mạng bị lỗi phần cứng ?",
    "re": "Thì nó có thể gây ra sự gián đoạn trong kết nối mạng"
  },
  {
    "con": "Nếu một mạng sử dụng VPN ?",
    "re": "Thì nó có thể bảo vệ dữ liệu truyền tải qua Internet bằng cách mã hóa"
  },
  {
    "con": "Nếu một mạng có nhiều thiết bị kết nối cùng một lúc ?",
    "re": "Thì nó có thể gặp phải vấn đề về băng thông và hiệu suất"
  },
  {
    "con": "Hãy xác định đâu là mạng cục bộ LAN trong các trường hợp sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một thiết bị router được cấu hình đúng để kết nối nhiều mạng khác nhau:",
    "re": "Thiết bị đó có khả năng định tuyến gói tin giữa các mạng"
  },
  {
    "con": "Khi một gói tin được gửi từ máy tính A đến máy tính B trong cùng một mạng LAN:",
    "re": "Gói tin sẽ không cần phải đi qua router"
  },
  {
    "con": "Nếu một địa chỉ IP không hợp lệ được sử dụng trong một mạng:",
    "re": "Thiết bị sẽ không thể kết nối với mạng đó"
  },
  {
    "con": "Khi một thiết bị trong mạng sử dụng giao thức TCP:",
    "re": "Dữ liệu sẽ được truyền tải một cách đáng tin cậy và có thứ tự"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP:",
    "re": "Dữ liệu có thể được truyền tải nhanh hơn nhưng không đảm bảo độ tin cậy"
  },
  {
    "con": "Khi một thiết bị nhận được gói tin với địa chỉ MAC không khớp:",
    "re": "Thiết bị đó sẽ bỏ qua gói tin đó"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation):",
    "re": "Nó cho phép nhiều thiết bị trong mạng nội bộ chia sẻ một địa chỉ IP công cộng"
  },
  {
    "con": "Khi một máy chủ DNS không thể phân giải tên miền:",
    "re": "Người dùng sẽ không thể truy cập vào trang web tương ứng với tên miền đó"
  },
  {
    "con": "Nếu một mạng không có bảo mật thích hợp:",
    "re": "Nó sẽ dễ bị tấn công và xâm nhập từ bên ngoài"
  },
  {
    "con": "Lược đồ mạng nào mà khi cáp bị đứt tại một trạm nào đó, thì mạng vẫn có thể còn hoạt động đối với các trạm khác?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến đích trong một khoảng thời gian nhất định, thì nó sẽ được gửi lại?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một địa chỉ IP không hợp lệ được sử dụng trong mạng, thì thiết bị sẽ không thể kết nối với mạng đó?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một router không có bảng định tuyến, thì nó sẽ không biết cách chuyển tiếp gói tin đến đích?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì nó sẽ đảm bảo việc truyền tải dữ liệu đáng tin cậy?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một thiết bị trong mạng bị tấn công từ chối dịch vụ (DoS), thì nó có thể làm giảm hiệu suất của toàn bộ mạng?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch, thì nó sẽ giảm thiểu va chạm gói tin so với việc sử dụng hub?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mạng không có bảo mật, thì dữ liệu có thể bị nghe lén hoặc bị thay đổi bởi kẻ tấn công?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng NAT (Network Address Translation), thì nó có thể cho phép nhiều thiết bị trong mạng nội bộ chia sẻ một địa chỉ IP công cộng?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một giao thức mạng sử dụng UDP, thì nó sẽ không đảm bảo việc truyền tải dữ liệu đáng tin cậy như TCP?",
    "re": "Đúng"
  },
  {
    "con": "Lược đồ mạng nào mà khi cáp bi đứt tại một điểm nào đó thì toàn bộ hệ thống mạng ngưng hoạt động ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị trong mạng không có địa chỉ IP hợp lệ thì thiết bị đó sẽ không thể giao tiếp với các thiết bị khác trong mạng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không được gửi đến địa chỉ MAC đúng thì gói tin đó sẽ không đến được đích.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP thì nó sẽ đảm bảo việc truyền tải dữ liệu đáng tin cậy.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một router không có bảng định tuyến thì nó sẽ không biết cách chuyển tiếp gói tin đến đích.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch thì nó sẽ giảm thiểu va chạm dữ liệu so với việc sử dụng hub.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị mạng bị tắt nguồn thì nó sẽ không thể tham gia vào quá trình truyền tải dữ liệu.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP thì nó sẽ không đảm bảo việc truyền tải dữ liệu đáng tin cậy.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một firewall không được cấu hình đúng thì nó có thể chặn lưu lượng hợp lệ hoặc cho phép lưu lượng không hợp lệ.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng không có bảo mật thì nó sẽ dễ bị tấn công từ các mối đe dọa bên ngoài.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng LAN sử dụng công nghệ nào để kết nối các thiết bị trong cùng một khu vực địa lý?",
    "re": "Câu trả lời đúng là Ethernet"
  },
  {
    "con": "Giao thức nào được sử dụng để truyền tải dữ liệu trên Internet?",
    "re": "Câu trả lời đúng là TCP/IP"
  },
  {
    "con": "Nếu một thiết bị trong mạng không thể kết nối với Internet, thì vấn đề có thể nằm ở đâu?",
    "re": "Câu trả lời đúng là cấu hình IP hoặc kết nối vật lý"
  },
  {
    "con": "Mạng không dây sử dụng tần số nào để truyền dữ liệu?",
    "re": "Câu trả lời đúng là tần số 2.4GHz hoặc 5GHz"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải, thì giao thức nào sẽ đảm bảo gói tin đó được gửi lại?",
    "re": "Câu trả lời đúng là TCP"
  },
  {
    "con": "Mạng WAN thường được sử dụng để kết nối các mạng LAN ở khoảng cách nào?",
    "re": "Câu trả lời đúng là khoảng cách lớn, thường là giữa các thành phố hoặc quốc gia"
  },
  {
    "con": "Nếu một máy chủ DNS không phản hồi, thì điều gì có thể xảy ra?",
    "re": "Câu trả lời đúng là không thể phân giải tên miền thành địa chỉ IP"
  },
  {
    "con": "Mạng VPN được sử dụng để làm gì?",
    "re": "Câu trả lời đúng là tạo ra một kết nối an toàn qua Internet"
  },
  {
    "con": "Nếu một thiết bị trong mạng bị tấn công từ chối dịch vụ (DoS), thì điều gì sẽ xảy ra?",
    "re": "Câu trả lời đúng là thiết bị đó sẽ không thể cung cấp dịch vụ cho người dùng hợp lệ"
  },
  {
    "con": "Giao thức nào được sử dụng để gửi email?",
    "re": "Câu trả lời đúng là SMTP"
  },
  {
    "con": "Loại cáp nào mà thông lượng 10 Mbps, chế độ truyền based band và khoảng cách truyền tối đa là 200 m ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng LAN sử dụng giao thức Ethernet và có tốc độ truyền dữ liệu 100 Mbps ?",
    "re": "Mạng này có thể sử dụng cáp UTP Cat 5"
  },
  {
    "con": "Một thiết bị router có chức năng định tuyến và chuyển tiếp gói tin ?",
    "re": "Thiết bị này có thể kết nối nhiều mạng khác nhau"
  },
  {
    "con": "Mạng sử dụng giao thức TCP/IP để truyền tải dữ liệu ?",
    "re": "Mạng này có khả năng đảm bảo độ tin cậy trong việc truyền tải"
  },
  {
    "con": "Một địa chỉ IP tĩnh được cấu hình cho một thiết bị trong mạng ?",
    "re": "Thiết bị đó sẽ luôn có cùng một địa chỉ IP mỗi khi kết nối"
  },
  {
    "con": "Mạng không dây sử dụng chuẩn 802.11ac ?",
    "re": "Mạng này có thể đạt tốc độ truyền dữ liệu lên đến 1.3 Gbps"
  },
  {
    "con": "Một switch hoạt động ở lớp 2 của mô hình OSI ?",
    "re": "Switch này sẽ sử dụng địa chỉ MAC để chuyển tiếp gói tin"
  },
  {
    "con": "Mạng sử dụng NAT (Network Address Translation) ?",
    "re": "Mạng này có thể sử dụng một địa chỉ IP công cộng cho nhiều thiết bị nội bộ"
  },
  {
    "con": "Một VPN (Virtual Private Network) được thiết lập ?",
    "re": "Người dùng có thể truy cập mạng riêng một cách an toàn qua Internet"
  },
  {
    "con": "Mạng sử dụng giao thức UDP ?",
    "re": "Mạng này có thể truyền tải dữ liệu nhanh hơn nhưng không đảm bảo độ tin cậy"
  },
  {
    "con": "Lược đồ mạng nào mà các máy trạm nối cáp với một thiết bị đấu nối trung tâm là Hub ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích do lỗi mạng ?",
    "re": "Gói tin sẽ bị mất và không được chuyển tiếp"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức TCP ?",
    "re": "Dữ liệu sẽ được truyền tải một cách đáng tin cậy và có kiểm soát"
  },
  {
    "con": "Nếu một mạng sử dụng địa chỉ IP tĩnh ?",
    "re": "Các thiết bị trong mạng sẽ có địa chỉ IP không thay đổi theo thời gian"
  },
  {
    "con": "Nếu một router không có bảng định tuyến ?",
    "re": "Router sẽ không thể chuyển tiếp gói tin đến đích"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch ?",
    "re": "Dữ liệu sẽ được chuyển tiếp đến đúng thiết bị đích mà không làm tắc nghẽn mạng"
  },
  {
    "con": "Nếu một thiết bị mạng bị tấn công từ chối dịch vụ (DoS) ?",
    "re": "Thiết bị sẽ không thể cung cấp dịch vụ cho người dùng hợp lệ"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP ?",
    "re": "Dữ liệu sẽ được truyền tải nhanh hơn nhưng không đảm bảo độ tin cậy"
  },
  {
    "con": "Nếu một địa chỉ IP là địa chỉ riêng (private IP) ?",
    "re": "Địa chỉ này sẽ không thể truy cập trực tiếp từ Internet"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation) ?",
    "re": "NAT sẽ cho phép nhiều thiết bị trong mạng nội bộ chia sẻ một địa chỉ IP công cộng"
  },
  {
    "con": "Loại cáp nào mà thông lượng 100 Mbps, chế độ truyền Based band và có cấu trúc xoắn đôi dây ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ IP tĩnh, không thay đổi theo thời gian ?",
    "re": "Thiết bị đó sẽ dễ dàng được quản lý và truy cập từ xa"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP/IP ?",
    "re": "Mạng đó sẽ có khả năng truyền tải dữ liệu đáng tin cậy hơn"
  },
  {
    "con": "Nếu một router không có bảng định tuyến ?",
    "re": "Router đó sẽ không thể chuyển tiếp gói tin đến đích"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch ?",
    "re": "Mạng đó sẽ có hiệu suất cao hơn so với việc sử dụng hub"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức DHCP ?",
    "re": "Thiết bị đó sẽ tự động nhận địa chỉ IP từ máy chủ DHCP"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation) ?",
    "re": "Mạng đó có thể sử dụng một địa chỉ IP công cộng cho nhiều thiết bị nội bộ"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải ?",
    "re": "Giao thức TCP sẽ yêu cầu gửi lại gói tin đó"
  },
  {
    "con": "Nếu một mạng không có bảo mật ?",
    "re": "Mạng đó sẽ dễ bị tấn công và xâm nhập từ bên ngoài"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức HTTPS ?",
    "re": "Dữ liệu truyền tải giữa client và server sẽ được mã hóa"
  },
  {
    "con": "Phương thức truyền nào mà dữ liệu được chia ra làm nhiều gói tin nhỏ và bổ sung thông tin header như địa chỉ máy phát, địa chỉ máy nhận , chỉ số các gói và mã dò lỗi CRC?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng máy tính sử dụng giao thức TCP để đảm bảo dữ liệu được truyền tải một cách đáng tin cậy và theo thứ tự?",
    "re": "Dữ liệu sẽ được đảm bảo không bị mất mát và đến đúng thứ tự"
  },
  {
    "con": "Khi một thiết bị trong mạng sử dụng địa chỉ IP tĩnh thay vì địa chỉ IP động?",
    "re": "Thiết bị đó sẽ luôn có cùng một địa chỉ IP mỗi khi nó kết nối vào mạng"
  },
  {
    "con": "Khi một router nhận được gói tin mà không có địa chỉ đích hợp lệ?",
    "re": "Gói tin đó sẽ bị loại bỏ và không được chuyển tiếp"
  },
  {
    "con": "Khi một mạng sử dụng mô hình OSI để phân tích các giao thức?",
    "re": "Mạng sẽ được chia thành 7 lớp, mỗi lớp có chức năng riêng biệt"
  },
  {
    "con": "Khi một thiết bị trong mạng sử dụng NAT (Network Address Translation)?",
    "re": "NAT sẽ cho phép nhiều thiết bị trong mạng nội bộ chia sẻ một địa chỉ IP công cộng"
  },
  {
    "con": "Khi một mạng sử dụng giao thức UDP để truyền tải dữ liệu?",
    "re": "Dữ liệu có thể bị mất mát hoặc đến không theo thứ tự, nhưng tốc độ truyền tải sẽ nhanh hơn"
  },
  {
    "con": "Khi một mạng sử dụng VLAN (Virtual Local Area Network)?",
    "re": "Các thiết bị trong cùng một VLAN sẽ có thể giao tiếp với nhau như thể chúng nằm trong cùng một mạng vật lý"
  },
  {
    "con": "Khi một thiết bị mạng sử dụng phương thức truyền không dây (Wi-Fi)?",
    "re": "Thiết bị đó có thể kết nối vào mạng mà không cần dây cáp vật lý"
  },
  {
    "con": "Khi một mạng sử dụng giao thức HTTPS thay vì HTTP?",
    "re": "Dữ liệu được truyền tải sẽ được mã hóa, giúp bảo mật thông tin hơn"
  },
  {
    "con": "Từ “Base” được ám chỉ điều gì trong 100 Base T ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một mạng LAN sử dụng giao thức Ethernet thì tốc độ truyền dữ liệu thường đạt 100 Mbps hoặc cao hơn.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một thiết bị trong mạng không nhận được địa chỉ IP thì nó sẽ không thể giao tiếp với các thiết bị khác trong mạng.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải thì giao thức TCP sẽ yêu cầu gửi lại gói tin đó.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một router không có bảng định tuyến thì nó sẽ không biết cách chuyển tiếp gói tin đến đích.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation) thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức DHCP thì nó sẽ tự động nhận địa chỉ IP từ máy chủ DHCP.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP thì nó sẽ không đảm bảo độ tin cậy trong việc truyền tải dữ liệu.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một mạng có nhiều thiết bị kết nối thì việc sử dụng switch sẽ giúp giảm thiểu va chạm dữ liệu.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một mạng không được bảo mật thì nó có nguy cơ bị tấn công từ bên ngoài.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Ký tự đặc biệt nào được giao thức Basic Mode sử dụng để chỉ nơi bắt đầu phần dữ liệu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến đích trong thời gian quy định,",
    "re": "thì nó sẽ bị loại bỏ và có thể được gửi lại nếu có cơ chế retransmission."
  },
  {
    "con": "Nếu một địa chỉ IP không hợp lệ được sử dụng trong mạng,",
    "re": "thì thiết bị sẽ không thể kết nối với các thiết bị khác trong mạng."
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức TCP,",
    "re": "thì nó sẽ đảm bảo tính toàn vẹn của dữ liệu thông qua việc xác nhận và retransmission."
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation),",
    "re": "thì nhiều thiết bị có thể chia sẻ một địa chỉ IP công cộng."
  },
  {
    "con": "Nếu một gói tin được mã hóa bằng giao thức SSL/TLS,",
    "re": "thì dữ liệu sẽ được bảo mật trong quá trình truyền tải."
  },
  {
    "con": "Nếu một thiết bị không nhận được tín hiệu từ router trong một khoảng thời gian dài,",
    "re": "thì nó có thể tự động chuyển sang chế độ dự phòng hoặc thông báo lỗi."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP,",
    "re": "thì các thiết bị sẽ tự động nhận địa chỉ IP và thông tin cấu hình mạng."
  },
  {
    "con": "Nếu một thiết bị trong mạng bị tấn công DDoS,",
    "re": "thì nó có thể bị quá tải và không thể phục vụ các yêu cầu hợp lệ."
  },
  {
    "con": "Nếu một mạng sử dụng VLAN (Virtual Local Area Network),",
    "re": "thì nó có thể phân chia mạng vật lý thành nhiều mạng logic để cải thiện hiệu suất và bảo mật."
  },
  {
    "con": "Tầng nào được sử dụng trong cả hai mô hình OSI và TCP/IP ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một địa chỉ IP có dạng gì ?",
    "re": "Địa chỉ IP có dạng x.x.x.x, trong đó x là số nguyên từ 0 đến 255"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì điều gì xảy ra ?",
    "re": "Gói tin sẽ bị mất và không được gửi lại trừ khi có cơ chế khôi phục"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì điều gì xảy ra ?",
    "re": "Dữ liệu sẽ được truyền theo cách kết nối và đảm bảo độ tin cậy"
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ MAC, thì điều gì xảy ra ?",
    "re": "Thiết bị đó có thể được xác định duy nhất trong mạng LAN"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì điều gì xảy ra ?",
    "re": "Địa chỉ IP riêng sẽ được ánh xạ thành địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một gói tin được mã hóa, thì điều gì xảy ra ?",
    "re": "Nội dung của gói tin sẽ không thể đọc được nếu không có khóa giải mã"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP, thì điều gì xảy ra ?",
    "re": "Dữ liệu sẽ được truyền mà không cần thiết lập kết nối và không đảm bảo độ tin cậy"
  },
  {
    "con": "Nếu một router không có bảng định tuyến, thì điều gì xảy ra ?",
    "re": "Router sẽ không biết cách chuyển tiếp gói tin đến đích"
  },
  {
    "con": "Nếu một mạng có nhiều VLAN, thì điều gì xảy ra ?",
    "re": "Các VLAN sẽ phân tách lưu lượng mạng và cải thiện bảo mật"
  },
  {
    "con": "Giao thức nào dùng để phân giải một địa chỉ Ethernet đến địa chỉ IP ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một địa chỉ IP tĩnh được cấu hình cho một thiết bị mạng ?",
    "re": "Thiết bị đó sẽ luôn có cùng một địa chỉ IP mỗi khi khởi động"
  },
  {
    "con": "Giao thức TCP được sử dụng để truyền tải dữ liệu ?",
    "re": "Dữ liệu sẽ được truyền tải một cách đáng tin cậy và theo thứ tự"
  },
  {
    "con": "Giao thức UDP được sử dụng để truyền tải dữ liệu ?",
    "re": "Dữ liệu có thể được truyền tải nhanh hơn nhưng không đảm bảo độ tin cậy"
  },
  {
    "con": "Một router được cấu hình với nhiều địa chỉ IP ?",
    "re": "Router có thể kết nối và định tuyến lưu lượng giữa nhiều mạng khác nhau"
  },
  {
    "con": "Sử dụng NAT (Network Address Translation) trong mạng ?",
    "re": "Có thể tiết kiệm địa chỉ IP công cộng và bảo mật mạng nội bộ"
  },
  {
    "con": "Một mạng LAN sử dụng switch để kết nối các thiết bị ?",
    "re": "Dữ liệu sẽ được chuyển tiếp chỉ đến thiết bị đích, giảm thiểu tắc nghẽn"
  },
  {
    "con": "Giao thức DHCP được sử dụng trong mạng ?",
    "re": "Thiết bị sẽ tự động nhận địa chỉ IP và thông tin cấu hình mạng"
  },
  {
    "con": "Mạng sử dụng VPN (Virtual Private Network) ?",
    "re": "Người dùng có thể truy cập mạng riêng một cách an toàn qua Internet"
  },
  {
    "con": "Một firewall được cấu hình đúng cách ?",
    "re": "Nó sẽ bảo vệ mạng khỏi các truy cập trái phép và các mối đe dọa"
  },
  {
    "con": "Giao thức nào là một giao thức kết nối song công, đáng tin cậy và chịu trách nhiệm trong việc điều khiển truyền dữ liệu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng nào sử dụng địa chỉ IP để định danh các thiết bị trong mạng?",
    "re": "Mạng Internet"
  },
  {
    "con": "Nếu một gói tin không đến đích trong một khoảng thời gian nhất định, thì",
    "re": "gói tin đó sẽ bị mất và cần phải được gửi lại"
  },
  {
    "con": "Nếu một thiết bị trong mạng không có địa chỉ IP hợp lệ, thì",
    "re": "thiết bị đó sẽ không thể giao tiếp với các thiết bị khác trong mạng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì",
    "re": "nó sẽ đảm bảo tính toàn vẹn và thứ tự của dữ liệu truyền"
  },
  {
    "con": "Nếu một gói tin được mã hóa, thì",
    "re": "nó sẽ chỉ có thể được giải mã bởi thiết bị có khóa phù hợp"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch, thì",
    "re": "nó sẽ cải thiện hiệu suất mạng bằng cách giảm thiểu va chạm"
  },
  {
    "con": "Nếu một thiết bị sử dụng NAT, thì",
    "re": "nó sẽ có thể chia sẻ một địa chỉ IP công cộng cho nhiều thiết bị trong mạng nội bộ"
  },
  {
    "con": "Nếu một giao thức sử dụng mô hình OSI, thì",
    "re": "nó sẽ có 7 lớp để xử lý dữ liệu"
  },
  {
    "con": "Nếu một mạng không dây sử dụng WPA2, thì",
    "re": "nó sẽ cung cấp mức độ bảo mật cao hơn cho kết nối không dây"
  },
  {
    "con": "Công nghệ truyền tín hiệu nào được sử dụng trong mạng cục bộ vô tuyến ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng sử dụng giao thức TCP/IP để truyền dữ liệu ?",
    "re": "Dữ liệu sẽ được truyền một cách đáng tin cậy"
  },
  {
    "con": "Thiết bị nào được sử dụng để kết nối các mạng khác nhau ?",
    "re": "Router sẽ thực hiện chức năng này"
  },
  {
    "con": "Mạng LAN có phạm vi địa lý nhỏ hơn mạng WAN ?",
    "re": "Đúng, mạng LAN thường chỉ bao gồm một tòa nhà hoặc một khu vực nhỏ"
  },
  {
    "con": "Nếu một máy tính không thể kết nối với mạng, thì có thể do vấn đề gì ?",
    "re": "Có thể do cấu hình IP sai hoặc cáp mạng bị hỏng"
  },
  {
    "con": "Giao thức nào được sử dụng để gửi email ?",
    "re": "SMTP là giao thức chính để gửi email"
  },
  {
    "con": "Nếu một mạng sử dụng địa chỉ IP tĩnh, thì điều gì xảy ra khi khởi động lại thiết bị ?",
    "re": "Thiết bị sẽ giữ nguyên địa chỉ IP đã được cấu hình"
  },
  {
    "con": "Mạng sử dụng công nghệ mạng riêng ảo (VPN) ?",
    "re": "Dữ liệu sẽ được mã hóa và bảo mật khi truyền qua Internet"
  },
  {
    "con": "Nếu một thiết bị trong mạng bị tấn công từ chối dịch vụ (DoS), thì điều gì xảy ra ?",
    "re": "Thiết bị đó sẽ không thể cung cấp dịch vụ cho người dùng hợp pháp"
  },
  {
    "con": "Mạng sử dụng giao thức DHCP để cấp phát địa chỉ IP ?",
    "re": "Các thiết bị trong mạng sẽ tự động nhận địa chỉ IP mà không cần cấu hình thủ công"
  },
  {
    "con": "Loại cáp nào mà IEEE đặt tên là 100 Base T?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một mạng LAN sử dụng giao thức Ethernet?",
    "re": "Mạng có tốc độ truyền dữ liệu cao và chi phí thấp"
  },
  {
    "con": "Địa chỉ IP nào thuộc lớp A?",
    "re": "Địa chỉ có dải từ 1.0.0.0 đến 126.255.255.255"
  },
  {
    "con": "Một router có chức năng gì trong mạng?",
    "re": "Chuyển tiếp gói dữ liệu giữa các mạng khác nhau"
  },
  {
    "con": "Giao thức TCP có đặc điểm gì?",
    "re": "Đảm bảo truyền dữ liệu tin cậy và theo thứ tự"
  },
  {
    "con": "Mạng WAN thường được sử dụng để làm gì?",
    "re": "Kết nối các mạng LAN ở khoảng cách xa"
  },
  {
    "con": "Địa chỉ MAC có vai trò gì trong mạng?",
    "re": "Xác định duy nhất thiết bị trong cùng một mạng LAN"
  },
  {
    "con": "Giao thức DHCP có chức năng gì?",
    "re": "Cấp phát địa chỉ IP tự động cho các thiết bị trong mạng"
  },
  {
    "con": "Mạng không dây sử dụng chuẩn 802.11?",
    "re": "Cung cấp kết nối mạng không dây cho các thiết bị di động"
  },
  {
    "con": "Firewall có tác dụng gì trong mạng?",
    "re": "Bảo vệ mạng khỏi các truy cập trái phép và tấn công"
  },
  {
    "con": "Ký tự đặc biệt nào được giao thức Basic Mode sử dụng để báo cho trạm phát rằng việc nhận đã xảy ra lỗi?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không được xác nhận trong khoảng thời gian quy định,",
    "re": "thì nó sẽ được gửi lại theo giao thức TCP."
  },
  {
    "con": "Nếu một mạng sử dụng địa chỉ IP tĩnh,",
    "re": "thì địa chỉ IP của thiết bị sẽ không thay đổi theo thời gian."
  },
  {
    "con": "Nếu một thiết bị trong mạng gặp sự cố và không thể kết nối,",
    "re": "thì các thiết bị khác vẫn có thể hoạt động bình thường nếu mạng được thiết kế đúng cách."
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải,",
    "re": "thì giao thức TCP sẽ phát hiện và yêu cầu gửi lại gói tin đó."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP,",
    "re": "thì các thiết bị sẽ tự động nhận địa chỉ IP từ máy chủ DHCP."
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch,",
    "re": "thì băng thông sẽ được phân bổ hiệu quả hơn so với việc sử dụng hub."
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức HTTPS,",
    "re": "thì dữ liệu truyền tải giữa máy khách và máy chủ sẽ được mã hóa."
  },
  {
    "con": "Nếu một mạng không dây sử dụng chuẩn WPA2,",
    "re": "thì nó sẽ cung cấp mức độ bảo mật cao hơn so với chuẩn WEP."
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation),",
    "re": "thì nhiều thiết bị có thể chia sẻ một địa chỉ IP công cộng."
  },
  {
    "con": "Giao thức nào sau đây là giao thức không kết nối trong tầng Transport của mô hình OSI?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì nó sẽ được gửi lại nếu giao thức sử dụng cơ chế xác nhận.",
    "re": "Giao thức TCP sẽ thực hiện việc gửi lại gói tin."
  },
  {
    "con": "Nếu một mạng sử dụng địa chỉ IP tĩnh, thì địa chỉ IP của thiết bị sẽ không thay đổi theo thời gian.",
    "re": "Địa chỉ IP tĩnh giúp dễ dàng quản lý và truy cập vào thiết bị."
  },
  {
    "con": "Nếu một thiết bị trong mạng không có địa chỉ MAC, thì nó sẽ không thể tham gia vào mạng LAN.",
    "re": "Địa chỉ MAC là cần thiết để nhận diện thiết bị trong mạng."
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải, thì giao thức UDP sẽ không thực hiện việc gửi lại gói tin đó.",
    "re": "Giao thức UDP không có cơ chế xác nhận."
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation), thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng.",
    "re": "NAT giúp tiết kiệm địa chỉ IP công cộng và bảo mật mạng."
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức DHCP, thì nó sẽ tự động nhận địa chỉ IP từ máy chủ DHCP.",
    "re": "Giao thức DHCP giúp quản lý địa chỉ IP một cách tự động."
  },
  {
    "con": "Nếu một mạng có nhiều thiết bị kết nối, thì việc sử dụng switch sẽ giúp giảm thiểu va chạm dữ liệu.",
    "re": "Switch hoạt động ở tầng 2 của mô hình OSI và giúp tối ưu hóa băng thông."
  },
  {
    "con": "Nếu một giao thức sử dụng mã hóa, thì dữ liệu sẽ được bảo vệ khỏi việc bị nghe lén.",
    "re": "Mã hóa giúp bảo mật thông tin trong quá trình truyền tải."
  },
  {
    "con": "Nếu một thiết bị không được cấu hình đúng, thì nó có thể không kết nối được với mạng.",
    "re": "Cấu hình sai có thể dẫn đến lỗi kết nối mạng."
  },
  {
    "con": "Giao thức nào của mô hình DoD được sử dụng tại tầng Host-to-Host ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một địa chỉ IP có dạng A.B.C.D với A, B, C, D là các số nguyên từ 0 đến 255 ?",
    "re": "Địa chỉ IP hợp lệ"
  },
  {
    "con": "Giao thức TCP có tính năng đảm bảo truyền tải dữ liệu chính xác ?",
    "re": "TCP là giao thức kết nối đáng tin cậy"
  },
  {
    "con": "Mạng LAN thường sử dụng công nghệ Ethernet để kết nối các thiết bị ?",
    "re": "Đúng, Ethernet là công nghệ phổ biến cho mạng LAN"
  },
  {
    "con": "Mô hình OSI có tổng cộng 7 tầng ?",
    "re": "Đúng, mô hình OSI bao gồm 7 tầng"
  },
  {
    "con": "Giao thức UDP không đảm bảo thứ tự và độ tin cậy của dữ liệu ?",
    "re": "Đúng, UDP là giao thức không kết nối"
  },
  {
    "con": "Router được sử dụng để kết nối các mạng khác nhau và định tuyến lưu lượng ?",
    "re": "Đúng, router có chức năng định tuyến"
  },
  {
    "con": "Mạng WAN thường có phạm vi rộng hơn so với mạng LAN ?",
    "re": "Đúng, WAN kết nối các mạng ở khoảng cách xa"
  },
  {
    "con": "Mạng không dây sử dụng sóng radio để truyền tải dữ liệu ?",
    "re": "Đúng, mạng không dây sử dụng sóng radio"
  },
  {
    "con": "Mô hình TCP/IP có 4 tầng ?",
    "re": "Đúng, mô hình TCP/IP bao gồm 4 tầng"
  },
  {
    "con": "Để giải quyết vấn đề tắc nghẽn trong mạng Ethernet, ta dùng giải pháp:",
    "re": "Sử dụng switch thay vì hub để giảm thiểu xung đột"
  },
  {
    "con": "Khi một gói tin không đến đích trong mạng, ta cần:",
    "re": "Kiểm tra lại cấu hình địa chỉ IP và subnet mask"
  },
  {
    "con": "Nếu một thiết bị trong mạng không thể kết nối Internet, ta nên:",
    "re": "Kiểm tra kết nối vật lý và trạng thái của router"
  },
  {
    "con": "Khi sử dụng mạng không dây, nếu tín hiệu yếu, ta có thể:",
    "re": "Di chuyển gần hơn đến điểm phát sóng hoặc sử dụng bộ khuếch đại tín hiệu"
  },
  {
    "con": "Nếu muốn bảo mật thông tin trong mạng, ta cần:",
    "re": "Sử dụng mã hóa dữ liệu và thiết lập tường lửa"
  },
  {
    "con": "Khi một máy chủ bị tấn công từ chối dịch vụ (DoS), ta nên:",
    "re": "Triển khai các biện pháp bảo vệ như lọc lưu lượng và giới hạn băng thông"
  },
  {
    "con": "Nếu muốn tăng tốc độ truyền tải dữ liệu trong mạng LAN, ta có thể:",
    "re": "Sử dụng công nghệ VLAN để phân chia lưu lượng"
  },
  {
    "con": "Khi thiết lập VPN, nếu không thể kết nối, ta cần:",
    "re": "Kiểm tra chứng chỉ và cấu hình bảo mật"
  },
  {
    "con": "Nếu muốn theo dõi hiệu suất mạng, ta nên:",
    "re": "Sử dụng công cụ giám sát mạng để phân tích lưu lượng và phát hiện sự cố"
  },
  {
    "con": "Khi cấu hình NAT, nếu không thể truy cập Internet, ta cần:",
    "re": "Kiểm tra bảng NAT và đảm bảo các quy tắc được thiết lập đúng"
  },
  {
    "con": "Chức năng chính của NIC ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng LAN thường được sử dụng trong môi trường nào ?",
    "re": "Môi trường văn phòng hoặc trường học"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì ?",
    "re": "Gói tin sẽ bị mất hoặc bị trả lại"
  },
  {
    "con": "Địa chỉ IP tĩnh được sử dụng khi nào ?",
    "re": "Khi cần một địa chỉ không thay đổi cho thiết bị mạng"
  },
  {
    "con": "Nếu một thiết bị không thể kết nối với mạng, thì ?",
    "re": "Có thể do cấu hình sai hoặc lỗi phần cứng"
  },
  {
    "con": "Chức năng của router là gì ?",
    "re": "Định tuyến gói tin giữa các mạng khác nhau"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì ?",
    "re": "Dữ liệu sẽ được truyền theo cách đáng tin cậy và có kiểm soát"
  },
  {
    "con": "Mạng WAN thường được sử dụng để kết nối ?",
    "re": "Các văn phòng ở nhiều địa điểm khác nhau"
  },
  {
    "con": "Nếu một thiết bị mạng bị tấn công DDoS, thì ?",
    "re": "Thiết bị đó có thể bị quá tải và không hoạt động bình thường"
  },
  {
    "con": "Chức năng của firewall là gì ?",
    "re": "Bảo vệ mạng khỏi các truy cập trái phép"
  },
  {
    "con": "Mạng máy tính là gì?",
    "re": "Một hệ thống kết nối các máy tính và thiết bị để chia sẻ tài nguyên và thông tin."
  },
  {
    "con": "IP Address là gì?",
    "re": "Một địa chỉ duy nhất được gán cho mỗi thiết bị trong mạng để xác định vị trí của nó."
  },
  {
    "con": "Subnetting là gì?",
    "re": "Quá trình chia một mạng lớn thành các mạng con nhỏ hơn để quản lý và tối ưu hóa tài nguyên."
  },
  {
    "con": "Router hoạt động như thế nào?",
    "re": "Thiết bị định tuyến dữ liệu giữa các mạng khác nhau dựa trên địa chỉ IP."
  },
  {
    "con": "Firewall là gì?",
    "re": "Một hệ thống bảo mật mạng kiểm soát lưu lượng truy cập vào và ra khỏi mạng."
  },
  {
    "con": "TCP/IP là gì?",
    "re": "Một bộ giao thức mạng cho phép các thiết bị giao tiếp qua Internet."
  },
  {
    "con": "DNS là gì?",
    "re": "Hệ thống phân giải tên miền giúp chuyển đổi tên miền thành địa chỉ IP."
  },
  {
    "con": "Bandwidth là gì?",
    "re": "Khả năng tối đa của một kết nối mạng để truyền tải dữ liệu trong một khoảng thời gian nhất định."
  },
  {
    "con": "Latency là gì?",
    "re": "Thời gian trễ giữa việc gửi và nhận dữ liệu qua mạng."
  },
  {
    "con": "VPN là gì?",
    "re": "Mạng riêng ảo cho phép kết nối an toàn qua Internet bằng cách mã hóa dữ liệu."
  },
  {
    "con": "Băng thông (bandwidth) là gì ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Địa chỉ IP tĩnh được cấu hình thủ công ?",
    "re": "Địa chỉ IP sẽ không thay đổi theo thời gian"
  },
  {
    "con": "Mạng LAN thường được sử dụng trong một khu vực địa lý nhỏ ?",
    "re": "Mạng LAN cho phép kết nối các thiết bị trong cùng một khu vực"
  },
  {
    "con": "Giao thức TCP đảm bảo truyền tải dữ liệu đáng tin cậy ?",
    "re": "Dữ liệu sẽ được gửi và nhận mà không bị mất mát"
  },
  {
    "con": "Mạng WAN kết nối các mạng LAN ở khoảng cách xa ?",
    "re": "Mạng WAN cho phép truyền tải dữ liệu giữa các thành phố hoặc quốc gia"
  },
  {
    "con": "Router có chức năng định tuyến dữ liệu giữa các mạng khác nhau ?",
    "re": "Router giúp kết nối và chuyển tiếp dữ liệu giữa các mạng"
  },
  {
    "con": "Mạng không dây (Wi-Fi) sử dụng sóng radio để truyền dữ liệu ?",
    "re": "Người dùng có thể kết nối internet mà không cần dây cáp"
  },
  {
    "con": "Firewall giúp bảo vệ mạng khỏi các mối đe dọa bên ngoài ?",
    "re": "Firewall kiểm soát lưu lượng truy cập vào và ra khỏi mạng"
  },
  {
    "con": "Mạng Peer-to-Peer (P2P) cho phép các thiết bị chia sẻ tài nguyên trực tiếp ?",
    "re": "Mỗi thiết bị trong mạng có thể hoạt động như một máy chủ và máy khách"
  },
  {
    "con": "Giao thức HTTP được sử dụng để truyền tải dữ liệu trên web ?",
    "re": "HTTP cho phép trình duyệt truy cập và tải trang web"
  },
  {
    "con": "Mạng máy tính sử dụng giao thức TCP/IP để truyền dữ liệu",
    "re": "Dữ liệu sẽ được chia thành các gói và gửi đến đích một cách đáng tin cậy"
  },
  {
    "con": "Một địa chỉ IP được cấu trúc theo định dạng IPv4",
    "re": "Địa chỉ này sẽ có 4 octet, mỗi octet có giá trị từ 0 đến 255"
  },
  {
    "con": "Sử dụng NAT (Network Address Translation) trong mạng",
    "re": "Các địa chỉ IP riêng sẽ được ánh xạ thành địa chỉ IP công cộng để truy cập Internet"
  },
  {
    "con": "Khi một thiết bị trong mạng gửi một gói tin đến một thiết bị khác",
    "re": "Gói tin sẽ được gửi qua các router và switch để đến đích"
  },
  {
    "con": "Khi một mạng sử dụng giao thức DHCP",
    "re": "Thiết bị sẽ tự động nhận địa chỉ IP và thông tin cấu hình mạng từ máy chủ DHCP"
  },
  {
    "con": "Khi một mạng không dây sử dụng WPA2 để bảo mật",
    "re": "Dữ liệu truyền qua mạng sẽ được mã hóa để ngăn chặn truy cập trái phép"
  },
  {
    "con": "Khi một thiết bị trong mạng gặp sự cố và không thể kết nối",
    "re": "Thiết bị đó có thể không nhận được địa chỉ IP hoặc không thể truy cập vào gateway"
  },
  {
    "con": "Khi một mạng sử dụng mô hình OSI",
    "re": "Các giao thức sẽ được phân chia thành 7 lớp, từ lớp vật lý đến lớp ứng dụng"
  },
  {
    "con": "Khi một gói tin bị mất trong quá trình truyền",
    "re": "Giao thức TCP sẽ yêu cầu gửi lại gói tin đó để đảm bảo tính toàn vẹn của dữ liệu"
  },
  {
    "con": "Khi một mạng sử dụng VLAN (Virtual Local Area Network)",
    "re": "Các thiết bị trong cùng một VLAN sẽ có thể giao tiếp với nhau mà không cần qua router"
  },
  {
    "con": "Cho đa thức D\\left ( x \\right )= X9 + X8 + X6+ X4 + 1, chuỗi bit nào tương đương với D\\left ( x \\right )?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cho chuỗi bit gốc D\\left ( x \\right )= 110010 và đa thức sinh P\\left ( x \\right )=1001. Chuỗi bit nào là FCS (Frame Check Sequence) ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải, thì giao thức TCP sẽ thực hiện việc truyền lại gói tin đó.",
    "re": "Gói tin sẽ được truyền lại"
  },
  {
    "con": "Nếu một địa chỉ IP không hợp lệ được sử dụng trong mạng, thì thiết bị sẽ không thể kết nối với mạng đó.",
    "re": "Thiết bị không thể kết nối"
  },
  {
    "con": "Nếu một router nhận được gói tin với địa chỉ đích không nằm trong bảng định tuyến, thì nó sẽ gửi gói tin đó đến địa chỉ mặc định.",
    "re": "Gói tin sẽ được gửi đến địa chỉ mặc định"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP, thì các thiết bị trong mạng sẽ tự động nhận địa chỉ IP từ máy chủ DHCP.",
    "re": "Thiết bị sẽ nhận địa chỉ IP tự động"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức ARP để tìm địa chỉ MAC tương ứng với địa chỉ IP, thì nó sẽ gửi một yêu cầu ARP đến tất cả các thiết bị trong mạng.",
    "re": "Yêu cầu ARP sẽ được gửi đến tất cả thiết bị"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch, thì dữ liệu sẽ được chuyển tiếp chỉ đến thiết bị đích thay vì tất cả các thiết bị trong mạng.",
    "re": "Dữ liệu sẽ được chuyển tiếp đến thiết bị đích"
  },
  {
    "con": "Nếu một gói tin được mã hóa bằng giao thức SSL/TLS, thì dữ liệu trong gói tin đó sẽ được bảo vệ khỏi việc bị nghe lén.",
    "re": "Dữ liệu sẽ được bảo vệ khỏi nghe lén"
  },
  {
    "con": "Nếu một thiết bị trong mạng bị tấn công từ chối dịch vụ (DoS), thì nó sẽ không thể cung cấp dịch vụ cho người dùng.",
    "re": "Thiết bị sẽ không cung cấp dịch vụ"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức IPv6, thì số lượng địa chỉ IP khả dụng sẽ lớn hơn rất nhiều so với IPv4.",
    "re": "Số lượng địa chỉ IP khả dụng sẽ lớn hơn"
  },
  {
    "con": "Một mạng LAN sử dụng giao thức Ethernet, tốc độ truyền dữ liệu tối đa là bao nhiêu ?",
    "re": "Tốc độ tối đa là 1 Gbps cho Ethernet tiêu chuẩn."
  },
  {
    "con": "Một địa chỉ IP phiên bản 4 (IPv4) có bao nhiêu bit ?",
    "re": "Địa chỉ IPv4 có 32 bit."
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì điều gì xảy ra ?",
    "re": "Gói tin sẽ bị mất và không được gửi lại trừ khi có cơ chế khôi phục."
  },
  {
    "con": "Khi một thiết bị trong mạng sử dụng DHCP, nó nhận được gì ?",
    "re": "Thiết bị nhận được địa chỉ IP tự động và các thông tin cấu hình mạng khác."
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì điều gì xảy ra với địa chỉ IP riêng ?",
    "re": "Địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng để truy cập Internet."
  },
  {
    "con": "Một giao thức mạng không kết nối là gì ?",
    "re": "UDP (User Datagram Protocol) là một giao thức không kết nối."
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng VLAN, thì điều gì xảy ra ?",
    "re": "Thiết bị sẽ được phân chia thành các mạng ảo khác nhau, tách biệt lưu lượng mạng."
  },
  {
    "con": "Khi một gói tin được gửi qua Internet, nó sẽ đi qua bao nhiêu router ?",
    "re": "Gói tin có thể đi qua nhiều router tùy thuộc vào đường đi và cấu trúc mạng."
  },
  {
    "con": "Nếu một mạng sử dụng SSL/TLS, thì điều gì xảy ra với dữ liệu ?",
    "re": "Dữ liệu sẽ được mã hóa để bảo mật trong quá trình truyền tải."
  },
  {
    "con": "Một địa chỉ MAC có bao nhiêu bit ?",
    "re": "Địa chỉ MAC có 48 bit."
  },
  {
    "con": "Mạng LAN sử dụng giao thức nào để truyền dữ liệu giữa các thiết bị trong cùng một mạng?",
    "re": "Câu trả lời đúng là Ethernet"
  },
  {
    "con": "Nếu một thiết bị trong mạng không thể kết nối với Internet, thì vấn đề có thể nằm ở đâu?",
    "re": "Câu trả lời đúng là cấu hình IP hoặc kết nối vật lý"
  },
  {
    "con": "Giao thức nào được sử dụng để truyền tải email qua Internet?",
    "re": "Câu trả lời đúng là SMTP"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải, thì giao thức nào sẽ đảm bảo gói tin đó được gửi lại?",
    "re": "Câu trả lời đúng là TCP"
  },
  {
    "con": "Mạng WAN thường sử dụng công nghệ nào để kết nối các mạng LAN ở khoảng cách xa?",
    "re": "Câu trả lời đúng là MPLS hoặc VPN"
  },
  {
    "con": "Nếu một máy chủ DNS không phản hồi, thì điều gì có thể xảy ra với việc truy cập website?",
    "re": "Câu trả lời đúng là không thể phân giải tên miền thành địa chỉ IP"
  },
  {
    "con": "Giao thức nào được sử dụng để truyền tải dữ liệu không tin cậy nhưng nhanh chóng?",
    "re": "Câu trả lời đúng là UDP"
  },
  {
    "con": "Nếu một thiết bị mạng bị tấn công từ chối dịch vụ (DoS), thì điều gì sẽ xảy ra?",
    "re": "Câu trả lời đúng là thiết bị sẽ không thể phục vụ yêu cầu từ người dùng"
  },
  {
    "con": "Mạng không dây sử dụng tần số nào để truyền tải dữ liệu?",
    "re": "Câu trả lời đúng là tần số 2.4GHz hoặc 5GHz"
  },
  {
    "con": "Nếu một router không có địa chỉ IP, thì nó có thể thực hiện chức năng gì?",
    "re": "Câu trả lời đúng là nó không thể định tuyến gói tin giữa các mạng"
  },
  {
    "con": "Tầng Data Link sử dụng cái gì để tìm ra những hosts trên mạng cục bộ ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì nó sẽ được gửi lại bởi giao thức nào?",
    "re": "Giao thức TCP"
  },
  {
    "con": "Nếu một địa chỉ IP không hợp lệ, thì thiết bị sẽ không thể kết nối với mạng nào?",
    "re": "Mạng Internet"
  },
  {
    "con": "Nếu một router không có bảng định tuyến, thì nó sẽ xử lý gói tin như thế nào?",
    "re": "Gói tin sẽ bị bỏ qua"
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức DHCP, thì nó sẽ nhận được gì khi kết nối vào mạng?",
    "re": "Địa chỉ IP tự động"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì địa chỉ IP công cộng sẽ được ánh xạ như thế nào?",
    "re": "Ánh xạ đến địa chỉ IP riêng"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải, thì giao thức nào sẽ đảm bảo tính toàn vẹn của dữ liệu?",
    "re": "Giao thức TCP"
  },
  {
    "con": "Nếu một thiết bị không có địa chỉ MAC, thì nó có thể tham gia vào mạng LAN không?",
    "re": "Không thể tham gia"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức IPv6, thì kích thước địa chỉ IP sẽ là bao nhiêu bit?",
    "re": "128 bit"
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức SSL/TLS, thì nó đang thực hiện chức năng gì?",
    "re": "Bảo mật kết nối"
  },
  {
    "con": "Phương thức truyền nào đòi hỏi trạm thu và trạm phát phải có máy thu phát radio sử dụng hai ăngten định hướng về phía nhau ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì dữ liệu sẽ được truyền theo cách có kiểm soát và đảm bảo độ tin cậy.",
    "re": "Dữ liệu sẽ được truyền theo cách có kiểm soát và đảm bảo độ tin cậy."
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ IP tĩnh, thì địa chỉ này sẽ không thay đổi theo thời gian.",
    "re": "Địa chỉ này sẽ không thay đổi theo thời gian."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP, thì dữ liệu có thể bị mất mà không có thông báo lỗi.",
    "re": "Dữ liệu có thể bị mất mà không có thông báo lỗi."
  },
  {
    "con": "Nếu một router không có bảng định tuyến, thì nó sẽ không biết cách chuyển tiếp gói tin đến đích.",
    "re": "Nó sẽ không biết cách chuyển tiếp gói tin đến đích."
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch, thì băng thông sẽ được phân chia giữa các thiết bị kết nối.",
    "re": "Băng thông sẽ được phân chia giữa các thiết bị kết nối."
  },
  {
    "con": "Nếu một thiết bị mạng bị tấn công DDoS, thì nó có thể bị quá tải và không thể phục vụ người dùng.",
    "re": "Nó có thể bị quá tải và không thể phục vụ người dùng."
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng.",
    "re": "Địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng."
  },
  {
    "con": "Nếu một giao thức mạng sử dụng mã hóa, thì dữ liệu sẽ được bảo vệ khỏi việc bị nghe lén.",
    "re": "Dữ liệu sẽ được bảo vệ khỏi việc bị nghe lén."
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức DHCP, thì nó sẽ tự động nhận địa chỉ IP từ máy chủ DHCP.",
    "re": "Nó sẽ tự động nhận địa chỉ IP từ máy chủ DHCP."
  },
  {
    "con": "Mạng LAN sử dụng giao thức Ethernet để truyền dữ liệu?",
    "re": "Đúng"
  },
  {
    "con": "Một địa chỉ IP tĩnh được cấu hình cho một thiết bị trong mạng?",
    "re": "Thiết bị đó sẽ luôn có cùng một địa chỉ IP"
  },
  {
    "con": "Giao thức TCP đảm bảo việc truyền dữ liệu đáng tin cậy?",
    "re": "Dữ liệu sẽ được truyền mà không bị mất mát"
  },
  {
    "con": "Router sử dụng bảng định tuyến để xác định đường đi của gói tin?",
    "re": "Gói tin sẽ được chuyển đến đúng đích"
  },
  {
    "con": "Mạng WAN có thể kết nối các mạng LAN ở khoảng cách xa?",
    "re": "Các thiết bị trong mạng LAN có thể giao tiếp với nhau"
  },
  {
    "con": "Giao thức UDP không đảm bảo việc truyền dữ liệu đáng tin cậy?",
    "re": "Dữ liệu có thể bị mất trong quá trình truyền"
  },
  {
    "con": "Mạng không dây sử dụng sóng radio để truyền dữ liệu?",
    "re": "Thiết bị có thể kết nối mà không cần dây cáp"
  },
  {
    "con": "Mạng VPN cho phép kết nối an toàn qua Internet?",
    "re": "Dữ liệu sẽ được mã hóa khi truyền qua mạng"
  },
  {
    "con": "Giao thức HTTP được sử dụng để truyền tải nội dung web?",
    "re": "Trình duyệt sẽ hiển thị trang web cho người dùng"
  },
  {
    "con": "Mạng peer-to-peer cho phép các thiết bị chia sẻ tài nguyên trực tiếp với nhau?",
    "re": "Người dùng có thể truy cập và chia sẻ dữ liệu mà không cần máy chủ trung gian"
  },
  {
    "con": "Trong các mô hình sau, mô hình nào là mô hình mạng được dùng phổ biến hiện nay:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một địa chỉ IP tĩnh được cấu hình cho một thiết bị mạng:",
    "re": "Thiết bị đó sẽ luôn có cùng một địa chỉ IP mỗi khi nó kết nối vào mạng"
  },
  {
    "con": "Khi một gói tin bị mất trong quá trình truyền tải:",
    "re": "Giao thức TCP sẽ yêu cầu gửi lại gói tin đó"
  },
  {
    "con": "Khi sử dụng NAT (Network Address Translation):",
    "re": "Nhiều thiết bị trong mạng nội bộ có thể chia sẻ một địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một thiết bị mạng không nhận được phản hồi từ thiết bị khác:",
    "re": "Thiết bị đó có thể không thể kết nối với thiết bị kia hoặc có thể có sự cố mạng"
  },
  {
    "con": "Khi một mạng sử dụng giao thức DHCP:",
    "re": "Các thiết bị trong mạng sẽ tự động nhận địa chỉ IP từ máy chủ DHCP"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch:",
    "re": "Switch sẽ chuyển tiếp gói tin chỉ đến thiết bị đích dựa trên địa chỉ MAC"
  },
  {
    "con": "Khi một mạng sử dụng giao thức HTTPS:",
    "re": "Dữ liệu được truyền tải giữa máy khách và máy chủ sẽ được mã hóa"
  },
  {
    "con": "Nếu một thiết bị mạng bị tấn công DDoS (Distributed Denial of Service):",
    "re": "Thiết bị đó có thể bị quá tải và không thể cung cấp dịch vụ cho người dùng"
  },
  {
    "con": "Khi một mạng sử dụng mô hình OSI:",
    "re": "Mỗi lớp trong mô hình sẽ thực hiện các chức năng riêng biệt và tương tác với các lớp liền kề"
  },
  {
    "con": "Dịch vụ mạng DNS dùng để:",
    "re": "Chuyển đổi tên miền thành địa chỉ IP"
  },
  {
    "con": "Mạng LAN thường được sử dụng trong:",
    "re": "Các văn phòng hoặc khu vực nhỏ để kết nối các thiết bị gần nhau"
  },
  {
    "con": "Giao thức TCP đảm bảo:",
    "re": "Dữ liệu được truyền tải một cách đáng tin cậy và theo thứ tự"
  },
  {
    "con": "Giao thức UDP thường được sử dụng cho:",
    "re": "Các ứng dụng yêu cầu tốc độ cao hơn và không cần độ tin cậy tuyệt đối"
  },
  {
    "con": "Mạng WAN thường được sử dụng để:",
    "re": "Kết nối các mạng LAN ở khoảng cách xa"
  },
  {
    "con": "Địa chỉ IP tĩnh được sử dụng khi:",
    "re": "Cần một địa chỉ IP không thay đổi cho một thiết bị trong mạng"
  },
  {
    "con": "Mạng không dây (Wi-Fi) có thể bị ảnh hưởng bởi:",
    "re": "Các yếu tố như khoảng cách, vật cản và nhiễu sóng"
  },
  {
    "con": "Firewall được sử dụng để:",
    "re": "Kiểm soát lưu lượng mạng và bảo vệ hệ thống khỏi các mối đe dọa"
  },
  {
    "con": "Mạng VPN cho phép:",
    "re": "Kết nối an toàn và riêng tư qua Internet"
  },
  {
    "con": "Mô hình OSI có 7 lớp, bao gồm:",
    "re": "Các lớp vật lý, liên kết dữ liệu, mạng, giao vận, phiên, trình bày và ứng dụng"
  },
  {
    "con": "Giao thức DHCP có thể cấp được các thông số sau cho máy trạm client:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng LAN sử dụng giao thức Ethernet để truyền dữ liệu:",
    "re": "Tốc độ truyền tải cao và độ trễ thấp"
  },
  {
    "con": "Giao thức TCP đảm bảo việc truyền dữ liệu đáng tin cậy:",
    "re": "Dữ liệu sẽ được nhận đúng thứ tự và không bị mất mát"
  },
  {
    "con": "Mạng WAN thường sử dụng các công nghệ như MPLS hoặc Frame Relay:",
    "re": "Có khả năng kết nối các mạng ở khoảng cách xa"
  },
  {
    "con": "Giao thức IP có hai phiên bản chính là IPv4 và IPv6:",
    "re": "IPv6 có không gian địa chỉ lớn hơn nhiều so với IPv4"
  },
  {
    "con": "Router có chức năng định tuyến dữ liệu giữa các mạng khác nhau:",
    "re": "Giúp tối ưu hóa đường truyền và giảm thiểu độ trễ"
  },
  {
    "con": "Firewall được sử dụng để kiểm soát lưu lượng mạng:",
    "re": "Bảo vệ mạng khỏi các mối đe dọa từ bên ngoài"
  },
  {
    "con": "Mạng không dây sử dụng sóng radio để truyền dữ liệu:",
    "re": "Cung cấp tính linh hoạt và di động cho người dùng"
  },
  {
    "con": "Giao thức HTTPS là phiên bản bảo mật của HTTP:",
    "re": "Bảo vệ thông tin nhạy cảm trong quá trình truyền tải"
  },
  {
    "con": "Mạng peer-to-peer cho phép các máy tính kết nối trực tiếp với nhau:",
    "re": "Tạo ra một môi trường chia sẻ tài nguyên hiệu quả"
  },
  {
    "con": "Một mạng con lớp C mượn 2 bit để chia Subnet",
    "re": "Subnet Mask sẽ là 255.255.255.252"
  },
  {
    "con": "Một địa chỉ IP thuộc lớp A",
    "re": "Có thể có tối đa 16 triệu địa chỉ trong cùng một mạng"
  },
  {
    "con": "Một gói tin IP có TTL bằng 0",
    "re": "Gói tin sẽ bị loại bỏ và không được chuyển tiếp"
  },
  {
    "con": "Một router nhận được gói tin với địa chỉ đích không thuộc mạng của nó",
    "re": "Router sẽ chuyển tiếp gói tin đến gateway mặc định"
  },
  {
    "con": "Một mạng sử dụng giao thức TCP",
    "re": "Sẽ đảm bảo độ tin cậy trong việc truyền tải dữ liệu"
  },
  {
    "con": "Một địa chỉ IP tĩnh được cấu hình cho một thiết bị",
    "re": "Thiết bị đó sẽ luôn có cùng một địa chỉ IP mỗi khi khởi động"
  },
  {
    "con": "Một mạng LAN sử dụng switch",
    "re": "Sẽ có khả năng truyền tải dữ liệu nhanh hơn so với mạng sử dụng hub"
  },
  {
    "con": "Một gói tin UDP được gửi đi",
    "re": "Không đảm bảo rằng gói tin sẽ đến đích"
  },
  {
    "con": "Một mạng sử dụng NAT (Network Address Translation)",
    "re": "Có thể cho phép nhiều thiết bị trong mạng nội bộ sử dụng một địa chỉ IP công cộng"
  },
  {
    "con": "Một thiết bị mạng sử dụng DHCP",
    "re": "Sẽ tự động nhận địa chỉ IP và thông tin cấu hình từ máy chủ DHCP"
  },
  {
    "con": "Địa chỉ IPv6 gồm bao nhiêu bit?",
    "re": "128 bit"
  },
  {
    "con": "Mạng LAN thường sử dụng giao thức nào để truyền dữ liệu?",
    "re": "Ethernet"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì nó sẽ được xử lý như thế nào?",
    "re": "Gói tin sẽ bị loại bỏ hoặc gửi lại tùy thuộc vào giao thức"
  },
  {
    "con": "Địa chỉ IP phiên bản 4 (IPv4) có bao nhiêu bit?",
    "re": "32 bit"
  },
  {
    "con": "Nếu một thiết bị trong mạng không có địa chỉ IP, thì nó sẽ không thể giao tiếp với các thiết bị khác trong mạng đó.",
    "re": "Đúng"
  },
  {
    "con": "Giao thức nào được sử dụng để truyền tải email?",
    "re": "SMTP"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng.",
    "re": "Đúng"
  },
  {
    "con": "Mạng WAN thường kết nối các mạng LAN ở khoảng cách nào?",
    "re": "Khoảng cách lớn, thường là giữa các thành phố hoặc quốc gia"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải, thì giao thức nào sẽ đảm bảo gói tin đó được gửi lại?",
    "re": "TCP"
  },
  {
    "con": "Mạng không dây thường sử dụng giao thức nào để kết nối?",
    "re": "Wi-Fi (802.11)"
  },
  {
    "con": "Thiết bị mạng nào làm giảm bớt sự va chạm (collisions)?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến đích trong thời gian quy định,",
    "re": "thì nó sẽ bị loại bỏ hoặc yêu cầu gửi lại."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP,",
    "re": "thì nó sẽ đảm bảo tính toàn vẹn của dữ liệu."
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ IP tĩnh,",
    "re": "thì nó sẽ không thay đổi địa chỉ IP sau mỗi lần khởi động."
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation),",
    "re": "thì nhiều thiết bị có thể chia sẻ một địa chỉ IP công cộng."
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền,",
    "re": "thì giao thức sẽ yêu cầu gửi lại gói tin đó."
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch,",
    "re": "thì nó sẽ giảm thiểu va chạm giữa các gói tin."
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức UDP,",
    "re": "thì nó sẽ không đảm bảo tính toàn vẹn của dữ liệu."
  },
  {
    "con": "Nếu một mạng sử dụng VLAN (Virtual Local Area Network),",
    "re": "thì nó sẽ phân chia mạng thành các mạng con độc lập."
  },
  {
    "con": "Nếu một thiết bị mạng không có địa chỉ IP hợp lệ,",
    "re": "thì nó sẽ không thể giao tiếp với các thiết bị khác trên mạng."
  },
  {
    "con": "Địa chỉ MAC là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một gói tin IP có kích thước lớn hơn MTU của mạng:",
    "re": "Gói tin sẽ bị phân mảnh"
  },
  {
    "con": "Một thiết bị mạng không có địa chỉ IP:",
    "re": "Thiết bị đó không thể giao tiếp trên mạng IP"
  },
  {
    "con": "Sử dụng giao thức TCP:",
    "re": "Dữ liệu sẽ được truyền tải một cách đáng tin cậy"
  },
  {
    "con": "Sử dụng giao thức UDP:",
    "re": "Dữ liệu có thể bị mất mà không có thông báo"
  },
  {
    "con": "Một địa chỉ IP là:",
    "re": "Địa chỉ duy nhất xác định một thiết bị trên mạng"
  },
  {
    "con": "Một router nhận được gói tin:",
    "re": "Router sẽ kiểm tra bảng định tuyến để xác định hướng đi"
  },
  {
    "con": "Sử dụng NAT (Network Address Translation):",
    "re": "Nhiều thiết bị có thể chia sẻ một địa chỉ IP công cộng"
  },
  {
    "con": "Một mạng LAN có tốc độ cao:",
    "re": "Thích hợp cho việc chia sẻ tài nguyên trong một khu vực nhỏ"
  },
  {
    "con": "Sử dụng VPN (Virtual Private Network):",
    "re": "Người dùng có thể truy cập mạng riêng một cách an toàn qua Internet"
  },
  {
    "con": "Trong số các Hệ điều hành sau, Hệ điều hành mạng là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ IP tĩnh,",
    "re": "thì địa chỉ IP của nó sẽ không thay đổi theo thời gian."
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải,",
    "re": "thì giao thức TCP sẽ yêu cầu gửi lại gói tin đó."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP,",
    "re": "thì các thiết bị trong mạng sẽ tự động nhận địa chỉ IP từ máy chủ DHCP."
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng NAT (Network Address Translation),",
    "re": "thì địa chỉ IP riêng tư sẽ được chuyển đổi thành địa chỉ IP công cộng khi ra ngoài Internet."
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch,",
    "re": "thì dữ liệu sẽ được chuyển tiếp chỉ đến thiết bị đích thay vì tất cả các thiết bị trong mạng."
  },
  {
    "con": "Nếu một giao thức sử dụng mã hóa,",
    "re": "thì dữ liệu truyền tải sẽ được bảo mật hơn trước các cuộc tấn công."
  },
  {
    "con": "Nếu một mạng sử dụng mô hình OSI,",
    "re": "thì các tầng sẽ tương tác với nhau theo thứ tự từ tầng vật lý đến tầng ứng dụng."
  },
  {
    "con": "Nếu một thiết bị mạng bị lỗi,",
    "re": "thì nó có thể gây ra sự gián đoạn trong kết nối mạng."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức IPv6,",
    "re": "thì nó có khả năng cung cấp nhiều địa chỉ IP hơn so với IPv4."
  },
  {
    "con": "Dịch vụ mạng SMTP dùng để:",
    "re": "gửi email từ máy khách đến máy chủ email."
  },
  {
    "con": "Mạng LAN thường được sử dụng trong:",
    "re": "các văn phòng hoặc tòa nhà để kết nối các thiết bị trong một khu vực nhỏ."
  },
  {
    "con": "Giao thức TCP đảm bảo:",
    "re": "dữ liệu được truyền tải một cách đáng tin cậy và theo thứ tự."
  },
  {
    "con": "Mạng WAN thường được sử dụng để:",
    "re": "kết nối các mạng LAN ở khoảng cách xa, như giữa các thành phố hoặc quốc gia."
  },
  {
    "con": "Địa chỉ IP tĩnh được sử dụng khi:",
    "re": "cần một địa chỉ không thay đổi cho các thiết bị như máy chủ hoặc máy in."
  },
  {
    "con": "Giao thức HTTP được sử dụng để:",
    "re": "truyền tải dữ liệu web giữa máy chủ và trình duyệt."
  },
  {
    "con": "Mạng không dây (Wi-Fi) thường sử dụng:",
    "re": "tần số radio để truyền tải dữ liệu mà không cần dây cáp."
  },
  {
    "con": "Firewall được sử dụng để:",
    "re": "bảo vệ mạng khỏi các truy cập trái phép và các mối đe dọa từ bên ngoài."
  },
  {
    "con": "Mạng peer-to-peer cho phép:",
    "re": "các thiết bị kết nối trực tiếp với nhau mà không cần máy chủ trung gian."
  },
  {
    "con": "Giao thức DNS có chức năng:",
    "re": "chuyển đổi tên miền thành địa chỉ IP để máy tính có thể truy cập."
  },
  {
    "con": "Định tuyến tĩnh là loại định tuyến:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng LAN thường sử dụng giao thức Ethernet:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không thể đến đích, thì nó sẽ bị loại bỏ hoặc gửi lại:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mô hình OSI có 7 lớp:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng địa chỉ IP tĩnh, thì địa chỉ đó sẽ không thay đổi:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Giao thức TCP đảm bảo truyền tải dữ liệu tin cậy:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng WAN thường kết nối các mạng LAN ở khoảng cách xa:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị mạng bị lỗi, thì nó có thể gây ra sự cố cho toàn bộ mạng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Giao thức UDP không đảm bảo độ tin cậy trong truyền tải dữ liệu:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong số các cặp giao thức và cổng dịch vụ sau, cặp nào là đúng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một địa chỉ IP thuộc lớp A có giá trị bắt đầu từ 1 đến 126:",
    "re": "Địa chỉ IP đó có thể được sử dụng cho mạng lớn"
  },
  {
    "con": "Nếu một gói tin không đến được đích do lỗi mạng:",
    "re": "Gói tin đó sẽ bị mất và không được gửi lại trừ khi có cơ chế phục hồi"
  },
  {
    "con": "Khi một thiết bị trong mạng sử dụng giao thức TCP:",
    "re": "Nó sẽ thiết lập một kết nối đáng tin cậy trước khi truyền dữ liệu"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation):",
    "re": "Nó có thể cho phép nhiều thiết bị trong mạng nội bộ chia sẻ một địa chỉ IP công cộng"
  },
  {
    "con": "Khi một gói tin được gửi qua mạng sử dụng giao thức UDP:",
    "re": "Gói tin đó sẽ không được đảm bảo đến nơi và không có cơ chế kiểm tra lỗi"
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ MAC:",
    "re": "Nó có thể được xác định duy nhất trong mạng LAN"
  },
  {
    "con": "Khi một mạng sử dụng mô hình OSI:",
    "re": "Nó sẽ phân chia các chức năng mạng thành 7 lớp riêng biệt"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP:",
    "re": "Các thiết bị trong mạng sẽ tự động nhận địa chỉ IP và thông tin cấu hình khác"
  },
  {
    "con": "Khi một mạng có nhiều router kết nối với nhau:",
    "re": "Nó có thể tạo ra một mạng lớn hơn và phức tạp hơn với khả năng định tuyến dữ liệu"
  },
  {
    "con": "Để phân giải địa chỉ IP thành địa chỉ MAC, sử dụng giao thức:",
    "re": "ARP"
  },
  {
    "con": "Khi một gói tin được gửi từ một máy tính đến một máy chủ, nó sẽ được chia thành các đoạn nhỏ hơn, gọi là:",
    "re": "Packet"
  },
  {
    "con": "Nếu một thiết bị trong mạng không nhận được gói tin trong thời gian quy định, nó sẽ:",
    "re": "Gửi lại gói tin đó"
  },
  {
    "con": "Khi sử dụng giao thức TCP, nếu một gói tin bị mất, giao thức sẽ:",
    "re": "Tự động yêu cầu gửi lại gói tin đó"
  },
  {
    "con": "Nếu một mạng sử dụng địa chỉ IP tĩnh, thì địa chỉ IP của thiết bị sẽ:",
    "re": "Không thay đổi theo thời gian"
  },
  {
    "con": "Khi một router nhận được gói tin, nó sẽ kiểm tra địa chỉ đích và:",
    "re": "Chuyển tiếp gói tin đến mạng phù hợp"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation), thì địa chỉ IP riêng sẽ:",
    "re": "Được ánh xạ sang địa chỉ IP công cộng"
  },
  {
    "con": "Khi một thiết bị trong mạng sử dụng DHCP, nó sẽ:",
    "re": "Nhận địa chỉ IP tự động từ máy chủ DHCP"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP, thì nó sẽ:",
    "re": "Không đảm bảo việc truyền tải gói tin"
  },
  {
    "con": "Khi một thiết bị gửi dữ liệu qua mạng, nó sẽ sử dụng mô hình OSI, và mỗi lớp sẽ:",
    "re": "Thực hiện các chức năng riêng biệt để đảm bảo dữ liệu được truyền tải thành công"
  },
  {
    "con": "Khả năng định tuyến được thực hiện bởi thiết bị:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng LAN sử dụng giao thức Ethernet:",
    "re": "Tốc độ truyền tải cao và độ trễ thấp"
  },
  {
    "con": "Địa chỉ IP được phân chia thành hai phần: mạng và máy:",
    "re": "Giúp xác định vị trí của thiết bị trong mạng"
  },
  {
    "con": "Giao thức TCP đảm bảo độ tin cậy trong truyền tải dữ liệu:",
    "re": "Dữ liệu sẽ được gửi và nhận chính xác"
  },
  {
    "con": "Mạng WAN thường sử dụng công nghệ truyền dẫn qua vệ tinh hoặc cáp quang:",
    "re": "Có khả năng kết nối các khu vực địa lý rộng lớn"
  },
  {
    "con": "Firewall được sử dụng để kiểm soát lưu lượng mạng:",
    "re": "Bảo vệ mạng khỏi các mối đe dọa bên ngoài"
  },
  {
    "con": "Giao thức DHCP tự động cấp phát địa chỉ IP cho thiết bị:",
    "re": "Giảm thiểu sự can thiệp của người dùng trong việc cấu hình mạng"
  },
  {
    "con": "Mạng không dây sử dụng sóng radio để truyền dữ liệu:",
    "re": "Cung cấp tính linh hoạt và di động cho người dùng"
  },
  {
    "con": "Mô hình OSI có 7 lớp:",
    "re": "Giúp chuẩn hóa giao tiếp giữa các hệ thống mạng khác nhau"
  },
  {
    "con": "VPN mã hóa dữ liệu trước khi truyền qua Internet:",
    "re": "Bảo vệ thông tin nhạy cảm khỏi sự xâm nhập"
  },
  {
    "con": "Các dịch vụ quay số tương tự (Dial-up) sử dụng thiết bị nào để chuyển đổi tín hiệu số sang tín hiệu tương tự?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng LAN thường sử dụng loại cáp nào để kết nối các thiết bị?",
    "re": "Cáp Ethernet"
  },
  {
    "con": "Nếu một gói dữ liệu bị mất trong quá trình truyền tải, thì",
    "re": "gói dữ liệu đó sẽ được yêu cầu gửi lại nếu giao thức sử dụng là TCP."
  },
  {
    "con": "Nếu một địa chỉ IP không hợp lệ được sử dụng trong mạng, thì",
    "re": "thiết bị sẽ không thể kết nối với mạng."
  },
  {
    "con": "Nếu một router không có bảng định tuyến, thì",
    "re": "nó sẽ không biết cách chuyển tiếp gói dữ liệu đến đích."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP, thì",
    "re": "các thiết bị trong mạng sẽ tự động nhận địa chỉ IP."
  },
  {
    "con": "Nếu một firewall được cấu hình sai, thì",
    "re": "nó có thể chặn lưu lượng hợp lệ hoặc cho phép lưu lượng độc hại."
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì",
    "re": "các địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng."
  },
  {
    "con": "Nếu một thiết bị trong mạng bị nhiễm virus, thì",
    "re": "nó có thể lây lan virus sang các thiết bị khác trong mạng."
  },
  {
    "con": "Nếu một giao thức sử dụng mã hóa, thì",
    "re": "dữ liệu truyền tải sẽ được bảo mật hơn."
  },
  {
    "con": "Dịch vụ nào cho phép tham chiếu host bằng tên thay cho việc dùng địa chỉ IP khi duyệt Internet?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng LAN sử dụng giao thức Ethernet để truyền dữ liệu?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích, nó sẽ bị mất?",
    "re": "Đúng"
  },
  {
    "con": "Mỗi thiết bị trong mạng cần có một địa chỉ IP duy nhất để giao tiếp?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một router không có bảng định tuyến, nó sẽ không biết cách chuyển tiếp gói tin?",
    "re": "Đúng"
  },
  {
    "con": "Giao thức TCP đảm bảo truyền dữ liệu tin cậy giữa các thiết bị?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, địa chỉ IP riêng sẽ không thể truy cập trực tiếp từ Internet?",
    "re": "Đúng"
  },
  {
    "con": "Mạng WAN thường kết nối các mạng LAN ở khoảng cách xa?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một thiết bị trong mạng bị tắt, các thiết bị khác vẫn có thể giao tiếp với nhau?",
    "re": "Đúng"
  },
  {
    "con": "Giao thức UDP không đảm bảo thứ tự và độ tin cậy của gói tin?",
    "re": "Đúng"
  },
  {
    "con": "Giao thức được sử dụng phổ biến trên Internet là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng LAN thường được sử dụng trong một khu vực địa lý nhỏ như văn phòng hoặc trường học",
    "re": "Mạng LAN có tốc độ truyền tải cao và độ trễ thấp"
  },
  {
    "con": "Mạng WAN kết nối các mạng LAN ở khoảng cách xa",
    "re": "Mạng WAN thường có tốc độ truyền tải thấp hơn so với mạng LAN"
  },
  {
    "con": "Giao thức TCP đảm bảo việc truyền dữ liệu đáng tin cậy",
    "re": "Dữ liệu sẽ được gửi và nhận theo thứ tự đúng"
  },
  {
    "con": "Giao thức UDP không đảm bảo việc truyền dữ liệu đáng tin cậy",
    "re": "Dữ liệu có thể bị mất hoặc nhận không theo thứ tự"
  },
  {
    "con": "Mạng không dây sử dụng sóng radio để truyền dữ liệu",
    "re": "Mạng không dây có thể dễ bị can thiệp và có phạm vi hạn chế"
  },
  {
    "con": "Địa chỉ IP phiên bản 4 (IPv4) có định dạng 32 bit",
    "re": "IPv4 cho phép tối đa 4.3 tỷ địa chỉ khác nhau"
  },
  {
    "con": "Địa chỉ IP phiên bản 6 (IPv6) có định dạng 128 bit",
    "re": "IPv6 cho phép một số lượng địa chỉ gần như vô hạn"
  },
  {
    "con": "Mạng sử dụng NAT (Network Address Translation)",
    "re": "Có thể tiết kiệm địa chỉ IP và bảo mật mạng nội bộ"
  },
  {
    "con": "Mạng sử dụng VPN (Virtual Private Network)",
    "re": "Có thể tạo ra một kết nối an toàn qua Internet"
  },
  {
    "con": "Hub là thiết bị hoạt động ở tầng nào của mô hình OSI:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì nó sẽ được gửi lại theo cơ chế retransmission:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì nó sẽ đảm bảo tính toàn vẹn của dữ liệu:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng địa chỉ IP tĩnh, thì địa chỉ đó sẽ không thay đổi theo thời gian:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch, thì nó sẽ giảm thiểu va chạm dữ liệu:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin được mã hóa, thì chỉ những người có khóa giải mã mới có thể đọc nội dung của nó:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị mạng bị lỗi, thì nó có thể gây ra sự gián đoạn trong kết nối mạng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP, thì nó sẽ không đảm bảo việc truyền tải dữ liệu thành công:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một router nhận được gói tin, thì nó sẽ kiểm tra địa chỉ đích để quyết định đường đi tiếp theo:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation), thì nó cho phép nhiều thiết bị trong mạng nội bộ chia sẻ một địa chỉ IP công cộng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một Hub tốc độ 100Mbps có 12 cổng thì tốc độ của mỗi cổng sẽ là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng LAN sử dụng giao thức Ethernet, thì tốc độ truyền dữ liệu tối đa có thể đạt được là:",
    "re": "10Gbps với chuẩn Ethernet mới nhất"
  },
  {
    "con": "Nếu một router có 4 cổng Ethernet, thì nó có thể kết nối tối đa với:",
    "re": "4 mạng khác nhau"
  },
  {
    "con": "Nếu một địa chỉ IP là 192.168.1.1, thì nó thuộc về:",
    "re": "dải địa chỉ IP riêng tư"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì dữ liệu sẽ được truyền:",
    "re": "đảm bảo độ tin cậy và thứ tự"
  },
  {
    "con": "Nếu một switch hoạt động ở lớp 2 của mô hình OSI, thì nó sẽ:",
    "re": "dựa vào địa chỉ MAC để chuyển tiếp dữ liệu"
  },
  {
    "con": "Nếu một máy chủ DNS không thể phân giải tên miền, thì:",
    "re": "người dùng sẽ không thể truy cập vào trang web tương ứng"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation), thì:",
    "re": "nó có thể cho phép nhiều thiết bị sử dụng một địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một mạng không dây sử dụng chuẩn 802.11ac, thì tốc độ tối đa có thể đạt được là:",
    "re": "1.3Gbps"
  },
  {
    "con": "Nếu một firewall được cấu hình đúng, thì nó sẽ:",
    "re": "bảo vệ mạng khỏi các truy cập trái phép"
  },
  {
    "con": "NIC là thiết bị hoạt động ở lớp nào của mô hình OSI:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích do lỗi mạng:",
    "re": "Gói tin sẽ được gửi lại hoặc thông báo lỗi sẽ được gửi về nguồn"
  },
  {
    "con": "Nếu một địa chỉ IP không hợp lệ được sử dụng trong mạng:",
    "re": "Thiết bị sẽ không thể kết nối với các thiết bị khác trong mạng"
  },
  {
    "con": "Nếu một router không có bảng định tuyến:",
    "re": "Router sẽ không biết cách chuyển tiếp gói tin đến đích"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP:",
    "re": "Dữ liệu sẽ được truyền tải một cách đáng tin cậy và có kiểm soát"
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức UDP:",
    "re": "Dữ liệu sẽ được truyền tải nhanh hơn nhưng không đảm bảo độ tin cậy"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch:",
    "re": "Dữ liệu sẽ được chuyển tiếp đến đúng thiết bị đích mà không làm tắc nghẽn mạng"
  },
  {
    "con": "Nếu một firewall được cấu hình đúng:",
    "re": "Nó sẽ bảo vệ mạng khỏi các truy cập trái phép và các mối đe dọa"
  },
  {
    "con": "Nếu một thiết bị không có địa chỉ MAC:",
    "re": "Thiết bị đó sẽ không thể tham gia vào mạng Ethernet"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation):",
    "re": "Nó sẽ cho phép nhiều thiết bị trong mạng nội bộ sử dụng một địa chỉ IP công cộng"
  },
  {
    "con": "Switch là thiết bị hoạt động ở lớp nào của mô hình OSI:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Router là thiết bị dùng để kết nối các mạng khác nhau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì nó sẽ bị mất:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu địa chỉ IP không hợp lệ, thì thiết bị sẽ không thể kết nối với mạng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì nó sẽ đảm bảo độ tin cậy trong việc truyền tải dữ liệu:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị trong mạng bị tắt, thì các thiết bị khác vẫn có thể hoạt động bình thường nếu không phụ thuộc vào thiết bị đó:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin bị phân mảnh, thì nó sẽ được tái hợp nhất tại đích:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP, thì nó sẽ không đảm bảo độ tin cậy trong việc truyền tải dữ liệu:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị mạng không có địa chỉ MAC, thì nó sẽ không thể tham gia vào mạng LAN:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Địa chỉ nào sau đây là địa chỉ quảng bá của mạng 192.168.25.128/28:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không thể đến đích do lỗi mạng,",
    "re": "thì nó sẽ bị loại bỏ hoặc gửi lại tùy thuộc vào giao thức sử dụng."
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng địa chỉ IP tĩnh,",
    "re": "thì địa chỉ IP đó sẽ không thay đổi trừ khi được cấu hình lại."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP,",
    "re": "thì nó sẽ đảm bảo tính toàn vẹn và thứ tự của dữ liệu."
  },
  {
    "con": "Nếu một thiết bị trong mạng không nhận được gói tin ARP,",
    "re": "thì nó sẽ không biết địa chỉ MAC tương ứng với địa chỉ IP đó."
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation),",
    "re": "thì nhiều thiết bị có thể chia sẻ một địa chỉ IP công cộng."
  },
  {
    "con": "Nếu một gói tin được gửi qua mạng không có địa chỉ đích hợp lệ,",
    "re": "thì nó sẽ không đến được nơi mong muốn."
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch,",
    "re": "thì nó sẽ giảm thiểu va chạm dữ liệu so với việc sử dụng hub."
  },
  {
    "con": "Nếu một giao thức sử dụng UDP,",
    "re": "thì nó sẽ không đảm bảo tính toàn vẹn của dữ liệu."
  },
  {
    "con": "Nếu một thiết bị trong mạng bị tấn công từ chối dịch vụ (DoS),",
    "re": "thì nó có thể không thể phục vụ các yêu cầu hợp lệ từ người dùng."
  },
  {
    "con": "Topo thường dùng hiện nay trong các mạng LAN:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng sử dụng giao thức TCP/IP:",
    "re": "Có khả năng truyền tải dữ liệu đáng tin cậy"
  },
  {
    "con": "Một địa chỉ IP tĩnh được cấu hình:",
    "re": "Sẽ không thay đổi theo thời gian"
  },
  {
    "con": "Sử dụng NAT trong mạng nội bộ:",
    "re": "Giúp tiết kiệm địa chỉ IP công cộng"
  },
  {
    "con": "Mạng sử dụng giao thức UDP:",
    "re": "Có độ trễ thấp nhưng không đảm bảo độ tin cậy"
  },
  {
    "con": "Sử dụng VLAN trong mạng:",
    "re": "Giúp phân chia mạng thành các miền broadcast khác nhau"
  },
  {
    "con": "Mạng không dây sử dụng chuẩn 802.11:",
    "re": "Có thể bị ảnh hưởng bởi nhiễu từ các thiết bị khác"
  },
  {
    "con": "Sử dụng VPN trong kết nối mạng:",
    "re": "Giúp bảo mật dữ liệu khi truyền qua Internet"
  },
  {
    "con": "Mạng sử dụng giao thức HTTP/2:",
    "re": "Có hiệu suất tốt hơn so với HTTP/1.1"
  },
  {
    "con": "Sử dụng firewall trong mạng:",
    "re": "Giúp bảo vệ mạng khỏi các cuộc tấn công từ bên ngoài"
  },
  {
    "con": "Để kết nối trực tiếp hai máy tính với nhau ta có thể dùng:",
    "re": "Cáp mạng chéo (crossover cable)"
  },
  {
    "con": "Nếu một máy tính không thể truy cập Internet nhưng vẫn có thể kết nối với mạng nội bộ:",
    "re": "Có thể có vấn đề với cấu hình DNS hoặc gateway"
  },
  {
    "con": "Nếu một gói tin không đến được đích trong mạng:",
    "re": "Có thể bị chặn bởi tường lửa hoặc không có đường dẫn hợp lệ"
  },
  {
    "con": "Nếu sử dụng giao thức TCP để truyền dữ liệu:",
    "re": "Dữ liệu sẽ được đảm bảo đến đích một cách chính xác và theo thứ tự"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng địa chỉ IP tĩnh:",
    "re": "Địa chỉ IP của thiết bị đó sẽ không thay đổi theo thời gian"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation):",
    "re": "Nhiều thiết bị có thể chia sẻ một địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một máy chủ DNS không phản hồi:",
    "re": "Máy khách sẽ không thể phân giải tên miền thành địa chỉ IP"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch:",
    "re": "Dữ liệu sẽ được chuyển tiếp chỉ đến thiết bị đích, giảm thiểu tắc nghẽn"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức UDP:",
    "re": "Dữ liệu có thể bị mất mà không có thông báo lỗi"
  },
  {
    "con": "Nếu một mạng không dây sử dụng WPA2 để bảo mật:",
    "re": "Mạng sẽ an toàn hơn so với các phương thức bảo mật yếu hơn như WEP"
  },
  {
    "con": "Mô hình phân lớp OSI có bao nhiêu lớp:",
    "re": "7 lớp"
  },
  {
    "con": "Giao thức TCP là giao thức kết nối hay không kết nối:",
    "re": "Kết nối"
  },
  {
    "con": "Địa chỉ IP phiên bản 4 (IPv4) có bao nhiêu bit:",
    "re": "32 bit"
  },
  {
    "con": "Mạng LAN thường sử dụng loại cáp nào:",
    "re": "Cáp Ethernet"
  },
  {
    "con": "Giao thức HTTP sử dụng cổng nào mặc định:",
    "re": "Cổng 80"
  },
  {
    "con": "Mô hình TCP/IP có bao nhiêu lớp:",
    "re": "4 lớp"
  },
  {
    "con": "Địa chỉ MAC là địa chỉ của thiết bị ở lớp nào:",
    "re": "Lớp liên kết dữ liệu"
  },
  {
    "con": "Giao thức DNS được sử dụng để làm gì:",
    "re": "Phân giải tên miền thành địa chỉ IP"
  },
  {
    "con": "Mạng WAN thường kết nối các mạng nào:",
    "re": "Các mạng LAN ở khoảng cách xa"
  },
  {
    "con": "Giao thức FTP sử dụng cổng nào mặc định:",
    "re": "Cổng 21"
  },
  {
    "con": "Các đơn vị dữ liệu giao thức trong mô hình OSI được gọi là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích trong mạng,",
    "re": "thì nó có thể bị mất hoặc bị lỗi trong quá trình truyền tải."
  },
  {
    "con": "Nếu một địa chỉ IP không hợp lệ được sử dụng trong mạng,",
    "re": "thì thiết bị sẽ không thể kết nối với các thiết bị khác."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP,",
    "re": "thì nó đảm bảo tính toàn vẹn của dữ liệu thông qua việc kiểm tra lỗi."
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng NAT (Network Address Translation),",
    "re": "thì nó có thể chia sẻ một địa chỉ IP công cộng cho nhiều thiết bị nội bộ."
  },
  {
    "con": "Nếu một mạng sử dụng mô hình client-server,",
    "re": "thì client sẽ gửi yêu cầu và server sẽ xử lý và trả về kết quả."
  },
  {
    "con": "Nếu một mạng không dây sử dụng chuẩn 802.11,",
    "re": "thì nó có thể cung cấp kết nối Internet cho các thiết bị di động."
  },
  {
    "con": "Nếu một gói tin được mã hóa,",
    "re": "thì chỉ những người có khóa giải mã mới có thể đọc nội dung của nó."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP,",
    "re": "thì nó không đảm bảo tính toàn vẹn của dữ liệu và không có cơ chế kiểm tra lỗi."
  },
  {
    "con": "Nếu một thiết bị mạng bị tắt,",
    "re": "thì tất cả các kết nối đến thiết bị đó sẽ bị gián đoạn."
  },
  {
    "con": "Thứ tự đóng gói dữ liệu khi truyền qua mô hình OSI:",
    "re": "Dữ liệu được đóng gói từ lớp ứng dụng xuống lớp vật lý."
  },
  {
    "con": "Địa chỉ IP của một thiết bị trong mạng phải duy nhất:",
    "re": "Thiết bị sẽ không thể giao tiếp với các thiết bị khác nếu địa chỉ IP trùng lặp."
  },
  {
    "con": "Sử dụng giao thức TCP cho các ứng dụng yêu cầu độ tin cậy cao:",
    "re": "Dữ liệu sẽ được truyền tải một cách chính xác và đầy đủ."
  },
  {
    "con": "Sử dụng giao thức UDP cho các ứng dụng yêu cầu tốc độ cao:",
    "re": "Dữ liệu có thể bị mất nhưng tốc độ truyền tải sẽ nhanh hơn."
  },
  {
    "con": "Mạng LAN thường sử dụng công nghệ Ethernet:",
    "re": "Tốc độ truyền tải dữ liệu trong mạng LAN sẽ cao hơn so với mạng WAN."
  },
  {
    "con": "Sử dụng NAT (Network Address Translation) trong mạng nội bộ:",
    "re": "Nhiều thiết bị có thể chia sẻ một địa chỉ IP công cộng."
  },
  {
    "con": "Mô hình TCP/IP có 4 lớp:",
    "re": "Mỗi lớp có chức năng riêng biệt và tương tác với các lớp khác."
  },
  {
    "con": "Sử dụng VLAN (Virtual Local Area Network):",
    "re": "Có thể phân chia mạng vật lý thành nhiều mạng logic khác nhau."
  },
  {
    "con": "Sử dụng giao thức DHCP (Dynamic Host Configuration Protocol):",
    "re": "Thiết bị sẽ tự động nhận địa chỉ IP và thông tin cấu hình mạng."
  },
  {
    "con": "Mạng không dây sử dụng chuẩn 802.11:",
    "re": "Cho phép các thiết bị kết nối mà không cần dây cáp."
  },
  {
    "con": "Lớp địa chỉ IP A có thể chứa tối đa bao nhiêu host?",
    "re": "Câu trả lời đúng là 16,777,214 host."
  },
  {
    "con": "Nếu một router không có bảng định tuyến thì nó sẽ không thể chuyển tiếp gói tin đến đích.",
    "re": "Gói tin sẽ không được chuyển tiếp."
  },
  {
    "con": "Nếu sử dụng giao thức TCP, thì dữ liệu sẽ được truyền theo cách kết nối và đảm bảo độ tin cậy.",
    "re": "Dữ liệu sẽ được đảm bảo không bị mất mát."
  },
  {
    "con": "Nếu một địa chỉ IP thuộc lớp C với Netmask là 255.255.255.0 thì có bao nhiêu Subnets có thể tạo ra?",
    "re": "Có thể tạo ra 256 Subnets."
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải qua mạng, thì giao thức TCP sẽ yêu cầu gửi lại gói tin đó.",
    "re": "Gói tin sẽ được gửi lại."
  },
  {
    "con": "Nếu một máy tính không có địa chỉ IP, thì nó sẽ không thể kết nối với mạng.",
    "re": "Máy tính sẽ không thể truy cập Internet."
  },
  {
    "con": "Nếu sử dụng giao thức UDP, thì dữ liệu sẽ được truyền mà không cần thiết lập kết nối trước.",
    "re": "Dữ liệu có thể bị mất mà không có thông báo."
  },
  {
    "con": "Nếu một địa chỉ IP có dạng 192.168.1.1, thì nó thuộc lớp C.",
    "re": "Địa chỉ này là một địa chỉ IP riêng."
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng.",
    "re": "Các thiết bị trong mạng riêng có thể truy cập Internet."
  },
  {
    "con": "Nếu một switch hoạt động ở lớp 2 của mô hình OSI, thì nó sẽ sử dụng địa chỉ MAC để chuyển tiếp gói tin.",
    "re": "Gói tin sẽ được chuyển tiếp dựa trên địa chỉ MAC."
  },
  {
    "con": "Thiết bị mạng nào dùng để nối các mạng và kiểm soát được broadcast?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một địa chỉ IP nào đó có dạng 192.168.1.1 có phải là địa chỉ IP riêng không?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích trong một khoảng thời gian nhất định, thì nó sẽ bị loại bỏ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì nó sẽ đảm bảo độ tin cậy trong việc truyền tải dữ liệu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng NAT, thì nó có thể ẩn địa chỉ IP thật của các thiết bị trong mạng nội bộ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP, thì nó sẽ tự động cấp phát địa chỉ IP cho các thiết bị trong mạng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin được gửi qua mạng mà không có địa chỉ MAC đích, thì nó sẽ không thể đến được thiết bị nhận?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP, thì nó sẽ không đảm bảo thứ tự gói tin khi truyền tải?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị mạng bị tấn công từ chối dịch vụ (DoS), thì nó sẽ không thể phục vụ các yêu cầu hợp lệ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng có nhiều thiết bị kết nối cùng một lúc, thì nó cần có một phương thức để tránh xung đột dữ liệu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Địa chỉ nào là địa chỉ broadcast của lớp 2?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một gói tin được gửi đến địa chỉ IP không hợp lệ?",
    "re": "Gói tin sẽ bị loại bỏ và không đến đích"
  },
  {
    "con": "Một thiết bị trong mạng sử dụng DHCP?",
    "re": "Thiết bị sẽ tự động nhận địa chỉ IP từ máy chủ DHCP"
  },
  {
    "con": "Một mạng LAN sử dụng switch?",
    "re": "Switch sẽ tạo ra các vùng mạng riêng biệt cho từng thiết bị"
  },
  {
    "con": "Một gói tin TCP bị mất trong quá trình truyền?",
    "re": "Gói tin sẽ được gửi lại bởi thiết bị gửi"
  },
  {
    "con": "Một địa chỉ IP thuộc lớp A?",
    "re": "Địa chỉ này có thể chứa nhiều mạng con và nhiều địa chỉ host"
  },
  {
    "con": "Một thiết bị sử dụng NAT?",
    "re": "Thiết bị sẽ chuyển đổi địa chỉ IP riêng thành địa chỉ IP công cộng"
  },
  {
    "con": "Một mạng sử dụng giao thức ICMP?",
    "re": "Mạng có thể gửi thông báo lỗi và thông tin điều khiển"
  },
  {
    "con": "Một gói tin UDP được gửi đến một cổng không mở?",
    "re": "Gói tin sẽ bị loại bỏ mà không có thông báo lỗi"
  },
  {
    "con": "Một mạng sử dụng VLAN?",
    "re": "Mạng sẽ được phân chia thành các mạng ảo độc lập"
  },
  {
    "con": "Địa chỉ nào được SWITCH sử dụng khi quyết định gửi data sang cổng (port) nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì nó sẽ được gửi lại theo cơ chế nào?",
    "re": "Cơ chế retransmission"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức TCP, thì nó sẽ đảm bảo điều gì?",
    "re": "Đảm bảo độ tin cậy trong việc truyền tải dữ liệu"
  },
  {
    "con": "Nếu một địa chỉ IP thuộc lớp A, thì nó sẽ có bao nhiêu bit cho phần mạng?",
    "re": "8 bit cho phần mạng"
  },
  {
    "con": "Nếu một gói tin được gửi từ một máy tính đến một máy chủ, thì nó sẽ đi qua thiết bị nào đầu tiên?",
    "re": "Router hoặc Switch"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP, thì điều gì sẽ không được đảm bảo?",
    "re": "Độ tin cậy và thứ tự của gói tin"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng NAT, thì nó sẽ làm gì?",
    "re": "Chuyển đổi địa chỉ IP riêng thành địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một mạng LAN sử dụng giao thức Ethernet, thì tốc độ truyền tải tối đa có thể đạt được là bao nhiêu?",
    "re": "10 Gbps (với chuẩn Ethernet hiện đại)"
  },
  {
    "con": "Nếu một gói tin bị rơi trong quá trình truyền tải, thì điều gì sẽ xảy ra trong giao thức TCP?",
    "re": "Gói tin sẽ được retransmit"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức ICMP, thì nó thường được sử dụng cho mục đích gì?",
    "re": "Kiểm tra kết nối và báo lỗi"
  },
  {
    "con": "Một mạng con lớp C mượn 5 bit để chia Subnet",
    "re": "Subnet Mask sẽ là 255.255.255.248"
  },
  {
    "con": "Một địa chỉ IP thuộc lớp A",
    "re": "Có thể có tối đa 16 triệu địa chỉ host"
  },
  {
    "con": "Một địa chỉ IP thuộc lớp B",
    "re": "Có thể có tối đa 65,536 địa chỉ host"
  },
  {
    "con": "Một địa chỉ IP thuộc lớp C",
    "re": "Có thể có tối đa 254 địa chỉ host"
  },
  {
    "con": "Khi sử dụng giao thức TCP",
    "re": "Dữ liệu sẽ được truyền theo cách kết nối và đảm bảo độ tin cậy"
  },
  {
    "con": "Khi sử dụng giao thức UDP",
    "re": "Dữ liệu sẽ được truyền theo cách không kết nối và không đảm bảo độ tin cậy"
  },
  {
    "con": "Một router hoạt động ở lớp 3 của mô hình OSI",
    "re": "Có khả năng định tuyến các gói dữ liệu giữa các mạng khác nhau"
  },
  {
    "con": "Một switch hoạt động ở lớp 2 của mô hình OSI",
    "re": "Có khả năng chuyển tiếp các khung dữ liệu trong cùng một mạng"
  },
  {
    "con": "Khi một gói dữ liệu bị mất trong mạng",
    "re": "Giao thức TCP sẽ yêu cầu gửi lại gói dữ liệu đó"
  },
  {
    "con": "Khi một mạng sử dụng NAT (Network Address Translation)",
    "re": "Địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng"
  },
  {
    "con": "Thẻ giao tiếp mạng (NIC) thuộc lớp nào trong mô hình OSI?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì nó có thể bị mất trong quá trình truyền tải.",
    "re": "Gói tin có thể không được nhận bởi thiết bị đích"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì nó đảm bảo việc truyền tải dữ liệu đáng tin cậy.",
    "re": "Dữ liệu sẽ được truyền tải mà không bị mất mát"
  },
  {
    "con": "Nếu một địa chỉ IP thuộc lớp A, thì nó có thể chứa từ 1 đến 126 trong phần đầu của địa chỉ.",
    "re": "Địa chỉ IP lớp A có thể có nhiều thiết bị kết nối"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng NAT, thì nó có thể chia sẻ một địa chỉ IP công cộng cho nhiều thiết bị trong mạng nội bộ.",
    "re": "NAT giúp tiết kiệm địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP, thì nó không đảm bảo việc truyền tải dữ liệu đáng tin cậy.",
    "re": "Dữ liệu có thể bị mất hoặc nhận không đúng thứ tự"
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ MAC, thì nó có thể được xác định duy nhất trong mạng LAN.",
    "re": "Địa chỉ MAC giúp phân biệt các thiết bị trong mạng"
  },
  {
    "con": "Nếu một mạng sử dụng VLAN, thì nó có thể phân chia mạng vật lý thành nhiều mạng logic.",
    "re": "VLAN giúp quản lý và bảo mật mạng hiệu quả hơn"
  },
  {
    "con": "Nếu một gói tin được mã hóa, thì nội dung của nó sẽ không thể bị đọc bởi những người không có khóa giải mã.",
    "re": "Bảo mật thông tin trong quá trình truyền tải"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức ICMP, thì nó có thể gửi thông báo lỗi và thông tin điều khiển.",
    "re": "ICMP giúp quản lý và giám sát mạng hiệu quả"
  },
  {
    "con": "4 PCs kết nối với nhau thông qua HUB thì cần bao nhiêu địa chỉ IP cho 5 trang thiết bị mạng này?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một router được cấu hình với NAT thì các thiết bị trong mạng nội bộ có thể truy cập Internet mà không cần địa chỉ IP công cộng.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP thì dữ liệu sẽ được truyền tải một cách đáng tin cậy và theo thứ tự.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng địa chỉ MAC thì nó có thể được xác định duy nhất trong mạng LAN.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP thì dữ liệu có thể bị mất mà không có thông báo lỗi.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một switch hoạt động ở lớp 2 của mô hình OSI thì nó sẽ chuyển tiếp dữ liệu dựa trên địa chỉ MAC.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mạng sử dụng subnetting thì có thể chia nhỏ mạng lớn thành các mạng con nhỏ hơn để quản lý tốt hơn.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một thiết bị mạng bị tắt thì tất cả các thiết bị kết nối với nó sẽ không thể giao tiếp với nhau.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP thì địa chỉ IP sẽ được cấp phát tự động cho các thiết bị kết nối.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mạng có nhiều VLAN thì có thể phân chia lưu lượng mạng để tăng cường bảo mật và hiệu suất.",
    "re": "Đúng"
  },
  {
    "con": "Routers làm việc ở lớp nào trong mô hình OSI?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì nó sẽ bị mất và không được gửi lại.",
    "re": "Câu trả lời sai, vì có thể sử dụng giao thức TCP để đảm bảo gói tin được gửi lại."
  },
  {
    "con": "Nếu một địa chỉ IP thuộc lớp A, thì nó sẽ có mặt nạ mạng mặc định là 255.0.0.0.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức UDP, thì nó sẽ không đảm bảo độ tin cậy trong việc truyền tải dữ liệu.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì địa chỉ IP riêng sẽ không thể truy cập trực tiếp từ Internet.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin được mã hóa bằng SSL, thì nó sẽ được bảo vệ khỏi việc bị nghe lén trong quá trình truyền tải.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ MAC, thì nó sẽ không thể thay đổi địa chỉ này trong suốt vòng đời của thiết bị.",
    "re": "Câu trả lời sai, vì địa chỉ MAC có thể được thay đổi bằng phần mềm."
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch, thì nó sẽ hoạt động ở lớp 2 của mô hình OSI.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một giao thức sử dụng port 80, thì nó thường được sử dụng cho giao thức HTTP.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức ICMP, thì nó sẽ không được sử dụng để truyền tải dữ liệu người dùng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Độ dài tối đa cho phép khi sử dụng dây cáp mạng UTP là bao nhiêu mét?",
    "re": "100 mét"
  },
  {
    "con": "Nếu một gói tin không đến đích trong một khoảng thời gian nhất định, thì nó sẽ bị loại bỏ.",
    "re": "Gói tin sẽ bị loại bỏ"
  },
  {
    "con": "Nếu một thiết bị mạng không có địa chỉ IP, thì nó sẽ không thể giao tiếp trên mạng Internet.",
    "re": "Thiết bị không thể giao tiếp"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì nó sẽ đảm bảo độ tin cậy trong việc truyền tải dữ liệu.",
    "re": "Đảm bảo độ tin cậy"
  },
  {
    "con": "Nếu một router không có bảng định tuyến, thì nó sẽ không biết cách chuyển tiếp gói tin.",
    "re": "Không biết cách chuyển tiếp"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch, thì nó sẽ giảm thiểu va chạm dữ liệu.",
    "re": "Giảm thiểu va chạm dữ liệu"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải, thì giao thức UDP sẽ không thực hiện việc truyền lại.",
    "re": "Không thực hiện việc truyền lại"
  },
  {
    "con": "Nếu một máy chủ DNS không phản hồi, thì người dùng sẽ không thể truy cập vào tên miền tương ứng.",
    "re": "Không thể truy cập vào tên miền"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng.",
    "re": "Địa chỉ IP riêng được ánh xạ"
  },
  {
    "con": "Nếu một thiết bị mạng bị tấn công DDoS, thì nó có thể bị quá tải và không thể phục vụ người dùng.",
    "re": "Có thể bị quá tải"
  },
  {
    "con": "Có bao nhiêu vùng va chạm (collision domains) trong mạng gồm 88 máy tính, 10 HUB và 2 REPEATER?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng switch thay vì hub, thì số lượng vùng va chạm sẽ giảm xuống?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một máy tính trong mạng không nhận được địa chỉ IP, thì nó sẽ không thể giao tiếp với các máy tính khác trong mạng?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một router không có bảng định tuyến, thì nó sẽ không thể chuyển tiếp gói tin đến đích?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mạng LAN sử dụng giao thức TCP/IP, thì nó có thể kết nối với Internet?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải, thì giao thức TCP sẽ yêu cầu gửi lại gói tin đó?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation), thì địa chỉ IP riêng sẽ không thể truy cập trực tiếp từ Internet?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một máy chủ DNS không thể phân giải tên miền, thì người dùng sẽ không thể truy cập vào trang web tương ứng?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mạng không có bảo mật, thì nó dễ bị tấn công từ bên ngoài?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức DHCP, thì nó sẽ tự động cấp phát địa chỉ IP cho các thiết bị trong mạng?",
    "re": "Đúng"
  },
  {
    "con": "Vai trò của tầng vật lý trong mô hình OSI là:",
    "re": "Cung cấp phương tiện truyền dẫn dữ liệu giữa các thiết bị mạng."
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải:",
    "re": "Giao thức TCP sẽ yêu cầu gửi lại gói tin đó."
  },
  {
    "con": "Nếu một địa chỉ IP không hợp lệ được sử dụng:",
    "re": "Thiết bị sẽ không thể kết nối với mạng."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP:",
    "re": "Các thiết bị sẽ tự động nhận địa chỉ IP từ máy chủ DHCP."
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng NAT:",
    "re": "Nó có thể chia sẻ một địa chỉ IP công cộng cho nhiều thiết bị trong mạng nội bộ."
  },
  {
    "con": "Nếu một gói tin được mã hóa:",
    "re": "Nó sẽ chỉ có thể được giải mã bởi thiết bị có khóa mã hóa tương ứng."
  },
  {
    "con": "Nếu một mạng sử dụng mô hình client-server:",
    "re": "Các client sẽ gửi yêu cầu đến server để nhận dịch vụ hoặc tài nguyên."
  },
  {
    "con": "Nếu một thiết bị mạng bị tấn công DDoS:",
    "re": "Nó sẽ bị quá tải bởi lưu lượng truy cập từ nhiều nguồn khác nhau."
  },
  {
    "con": "Nếu một giao thức sử dụng port 80:",
    "re": "Nó thường được sử dụng cho giao thức HTTP."
  },
  {
    "con": "Nếu một mạng sử dụng VLAN:",
    "re": "Nó có thể phân chia mạng vật lý thành nhiều mạng logic khác nhau."
  },
  {
    "con": "Trong mô hình TCP/IP thì giao thức IP nằm ở:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích thì giao thức TCP sẽ:",
    "re": "Gửi lại gói tin đó"
  },
  {
    "con": "Nếu một mạng sử dụng địa chỉ IP tĩnh thì:",
    "re": "Địa chỉ IP của thiết bị sẽ không thay đổi theo thời gian"
  },
  {
    "con": "Nếu một thiết bị trong mạng không có địa chỉ MAC thì:",
    "re": "Thiết bị đó sẽ không thể giao tiếp trong mạng LAN"
  },
  {
    "con": "Nếu một gói tin được gửi qua mạng mà không có địa chỉ đích thì:",
    "re": "Gói tin sẽ không đến được nơi cần đến"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP thì:",
    "re": "Các thiết bị sẽ tự động nhận địa chỉ IP từ máy chủ DHCP"
  },
  {
    "con": "Nếu một mạng có nhiều thiết bị kết nối thì:",
    "re": "Cần có một thiết bị định tuyến để quản lý lưu lượng"
  },
  {
    "con": "Nếu một giao thức sử dụng phương thức xác thực thì:",
    "re": "Chỉ những người dùng đã được xác thực mới có thể truy cập tài nguyên"
  },
  {
    "con": "Nếu một mạng không có bảo mật thì:",
    "re": "Dữ liệu có thể bị đánh cắp hoặc bị tấn công"
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức UDP thì:",
    "re": "Nó sẽ không đảm bảo việc truyền tải gói tin thành công"
  },
  {
    "con": "Lớp nào thực hiện việc chuyển đổi cú pháp dữ liệu để đáp ứng yêu cầu truyền dữ liệu của các ứng dụng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng nào sử dụng giao thức IP để định danh các thiết bị trong mạng:",
    "re": "Mạng Internet"
  },
  {
    "con": "Thiết bị nào có chức năng chuyển tiếp gói dữ liệu giữa các mạng khác nhau:",
    "re": "Router"
  },
  {
    "con": "Giao thức nào đảm bảo dữ liệu được truyền tải một cách đáng tin cậy giữa hai thiết bị:",
    "re": "TCP"
  },
  {
    "con": "Mô hình nào chia mạng thành bảy lớp để quản lý và phát triển các giao thức mạng:",
    "re": "Mô hình OSI"
  },
  {
    "con": "Nếu một thiết bị trong mạng không thể nhận được địa chỉ IP từ DHCP:",
    "re": "Thiết bị đó sẽ không thể kết nối với mạng"
  },
  {
    "con": "Nếu một gói dữ liệu bị mất trong quá trình truyền tải:",
    "re": "Giao thức TCP sẽ yêu cầu gửi lại gói dữ liệu đó"
  },
  {
    "con": "Mạng nào cho phép các thiết bị kết nối với nhau mà không cần thông qua một thiết bị trung gian:",
    "re": "Mạng ngang hàng (Peer-to-Peer)"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation):",
    "re": "Nó có thể cho phép nhiều thiết bị sử dụng một địa chỉ IP công cộng"
  },
  {
    "con": "Giao thức nào được sử dụng để truyền tải dữ liệu không đáng tin cậy nhưng nhanh chóng:",
    "re": "UDP"
  },
  {
    "con": "Trong mô hình mạng 7 tầng do ISO công bố, tầng nào làm nhiệm vụ truyền dữ liệu giữa hai điểm cuối, thực hiện kiểm soát lỗi/luồng, có thể thực hiện ghép kênh, cắt/hợp dữ liệu:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một gói tin được gửi từ nguồn đến đích qua mạng, nếu gói tin đó không bị mất mát hoặc hỏng hóc, thì dữ liệu sẽ được truyền tải thành công.",
    "re": "Dữ liệu được truyền tải thành công"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng địa chỉ IP tĩnh, thì địa chỉ IP của thiết bị đó sẽ không thay đổi theo thời gian.",
    "re": "Địa chỉ IP không thay đổi"
  },
  {
    "con": "Khi một router nhận được gói tin, nếu nó không có thông tin về địa chỉ đích trong bảng định tuyến, thì gói tin sẽ bị bỏ qua.",
    "re": "Gói tin sẽ bị bỏ qua"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì nó sẽ đảm bảo rằng dữ liệu được truyền tải một cách đáng tin cậy và theo thứ tự.",
    "re": "Dữ liệu được truyền tải đáng tin cậy và theo thứ tự"
  },
  {
    "con": "Khi một thiết bị trong mạng gửi một yêu cầu ARP, nếu thiết bị đó nhận được phản hồi từ thiết bị khác, thì nó sẽ biết địa chỉ MAC tương ứng với địa chỉ IP đã yêu cầu.",
    "re": "Biết địa chỉ MAC tương ứng"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation), thì địa chỉ IP riêng trong mạng nội bộ sẽ được ánh xạ sang địa chỉ IP công cộng khi truy cập Internet.",
    "re": "Địa chỉ IP riêng được ánh xạ sang địa chỉ IP công cộng"
  },
  {
    "con": "Khi một thiết bị mạng sử dụng giao thức UDP, nếu gói tin bị mất, thì nó sẽ không có cơ chế để phát hiện và sửa chữa lỗi.",
    "re": "Không có cơ chế phát hiện và sửa chữa lỗi"
  },
  {
    "con": "Nếu một mạng sử dụng VLAN (Virtual Local Area Network), thì các thiết bị trong cùng một VLAN có thể giao tiếp với nhau mà không cần thông qua router.",
    "re": "Có thể giao tiếp mà không cần router"
  },
  {
    "con": "Khi một mạng sử dụng giao thức DHCP, nếu một thiết bị mới tham gia vào mạng, thì nó sẽ tự động nhận được địa chỉ IP từ máy chủ DHCP.",
    "re": "Nhận được địa chỉ IP tự động"
  },
  {
    "con": "Đơn vị đo thông lượng là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng LAN thường được sử dụng trong một khu vực địa lý nhỏ như:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải,",
    "re": "giao thức TCP sẽ yêu cầu gửi lại gói tin đó"
  },
  {
    "con": "Địa chỉ IP phiên bản 4 (IPv4) có độ dài là:",
    "re": "32 bit"
  },
  {
    "con": "Nếu một thiết bị trong mạng không nhận được địa chỉ IP,",
    "re": "nó sẽ không thể giao tiếp với các thiết bị khác trong mạng"
  },
  {
    "con": "Giao thức DHCP được sử dụng để:",
    "re": "cấp phát địa chỉ IP tự động cho các thiết bị trong mạng"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation),",
    "re": "các địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng"
  },
  {
    "con": "Mạng WAN thường được sử dụng để kết nối:",
    "re": "các mạng LAN ở khoảng cách xa"
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức UDP,",
    "re": "nó sẽ không đảm bảo việc truyền tải gói tin"
  },
  {
    "con": "Mô hình OSI có tổng cộng:",
    "re": "7 lớp"
  },
  {
    "con": "Công nghệ mạng LAN nào được sử dụng rộng rãi nhất hiện nay?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng TCP/IP có bao nhiêu lớp?",
    "re": "Có 4 lớp: Lớp ứng dụng, lớp giao vận, lớp mạng, lớp liên kết dữ liệu"
  },
  {
    "con": "Địa chỉ IP nào được sử dụng để xác định một thiết bị trong mạng?",
    "re": "Địa chỉ IP tĩnh hoặc động"
  },
  {
    "con": "Giao thức nào được sử dụng để truyền tải dữ liệu không tin cậy?",
    "re": "Giao thức UDP"
  },
  {
    "con": "Mạng LAN có thể kết nối tối đa bao nhiêu thiết bị?",
    "re": "Tối đa 254 thiết bị cho mỗi mạng con với địa chỉ IPv4"
  },
  {
    "con": "Mạng WAN thường được sử dụng để kết nối các mạng nào?",
    "re": "Kết nối các mạng LAN ở khoảng cách xa"
  },
  {
    "con": "Giao thức nào đảm bảo dữ liệu được truyền tải một cách tin cậy?",
    "re": "Giao thức TCP"
  },
  {
    "con": "Mạng không dây sử dụng công nghệ nào để truyền tải dữ liệu?",
    "re": "Công nghệ sóng radio"
  },
  {
    "con": "Địa chỉ MAC có vai trò gì trong mạng?",
    "re": "Xác định duy nhất thiết bị trong mạng cục bộ"
  },
  {
    "con": "Router có chức năng gì trong mạng?",
    "re": "Chuyển tiếp dữ liệu giữa các mạng khác nhau"
  },
  {
    "con": "Phần nào trong địa chỉ IP được ROUTER sử dụng khi tìm đường đi?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một địa chỉ IP tĩnh được cấu hình cho một thiết bị mạng?",
    "re": "Địa chỉ IP của thiết bị sẽ không thay đổi theo thời gian"
  },
  {
    "con": "Khi một gói tin không thể đến đích do lỗi mạng?",
    "re": "Gói tin sẽ bị mất và không được gửi lại"
  },
  {
    "con": "Khi một thiết bị mạng sử dụng giao thức TCP?",
    "re": "Dữ liệu sẽ được truyền tải một cách đáng tin cậy và theo thứ tự"
  },
  {
    "con": "Khi một mạng sử dụng NAT (Network Address Translation)?",
    "re": "Địa chỉ IP riêng sẽ được ánh xạ thành địa chỉ IP công cộng"
  },
  {
    "con": "Khi một thiết bị mạng nhận được một gói tin không hợp lệ?",
    "re": "Thiết bị sẽ loại bỏ gói tin đó và không xử lý nó"
  },
  {
    "con": "Khi một mạng sử dụng giao thức DHCP?",
    "re": "Thiết bị sẽ tự động nhận địa chỉ IP từ máy chủ DHCP"
  },
  {
    "con": "Khi một mạng LAN sử dụng switch?",
    "re": "Dữ liệu sẽ được chuyển tiếp chỉ đến thiết bị đích mà không làm tắc nghẽn mạng"
  },
  {
    "con": "Khi một thiết bị mạng sử dụng giao thức UDP?",
    "re": "Dữ liệu sẽ được truyền tải nhanh nhưng không đảm bảo độ tin cậy"
  },
  {
    "con": "Khi một mạng sử dụng mô hình OSI?",
    "re": "Các giao thức sẽ được phân chia thành 7 lớp khác nhau để dễ quản lý"
  },
  {
    "con": "Một mạng con lớp A mượn 21 bit để chia Subnet",
    "re": "Subnet Mask sẽ là 255.255.248.0"
  },
  {
    "con": "Một địa chỉ IP thuộc lớp B",
    "re": "Có thể có tối đa 65,534 host trong mạng"
  },
  {
    "con": "Một địa chỉ IP thuộc lớp C",
    "re": "Có thể có tối đa 254 host trong mạng"
  },
  {
    "con": "Nếu một gói tin không thể đến đích do lỗi mạng",
    "re": "Gói tin sẽ bị loại bỏ và không được gửi lại"
  },
  {
    "con": "Nếu một router nhận được gói tin với địa chỉ đích không thuộc mạng của nó",
    "re": "Router sẽ chuyển tiếp gói tin đến gateway mặc định"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP",
    "re": "Dữ liệu sẽ được truyền theo cách kết nối và đảm bảo độ tin cậy"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP",
    "re": "Dữ liệu sẽ được truyền mà không cần đảm bảo độ tin cậy"
  },
  {
    "con": "Nếu một thiết bị trong mạng có địa chỉ IP tĩnh",
    "re": "Địa chỉ IP của thiết bị đó sẽ không thay đổi theo thời gian"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation)",
    "re": "NAT cho phép nhiều thiết bị trong mạng nội bộ sử dụng một địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một mạng sử dụng VLAN (Virtual Local Area Network)",
    "re": "Các thiết bị trong VLAN sẽ được phân tách logic mặc dù có thể nằm trên cùng một switch"
  },
  {
    "con": "Địa chỉ nào trong số những địa chỉ dưới đây là địa chỉ Broadcast của lớp C?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một gói tin được gửi từ máy A đến máy B qua mạng có địa chỉ IP khác nhau,",
    "re": "gói tin đó sẽ được định tuyến qua các router nếu cần thiết"
  },
  {
    "con": "Nếu một thiết bị trong mạng không nhận được địa chỉ IP từ DHCP server,",
    "re": "thiết bị đó sẽ không thể kết nối với mạng"
  },
  {
    "con": "Khi một gói tin bị mất trong quá trình truyền tải,",
    "re": "giao thức TCP sẽ yêu cầu gửi lại gói tin đó"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation),",
    "re": "các địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng"
  },
  {
    "con": "Khi một thiết bị gửi một gói tin đến một địa chỉ IP không tồn tại,",
    "re": "gói tin sẽ bị loại bỏ và không đến được đích"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch,",
    "re": "các gói tin sẽ được chuyển tiếp chỉ đến thiết bị đích mà không làm tắc nghẽn mạng"
  },
  {
    "con": "Khi một thiết bị trong mạng sử dụng giao thức ICMP để gửi thông điệp lỗi,",
    "re": "thiết bị nhận sẽ biết được có vấn đề xảy ra trong quá trình truyền tải"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức HTTPS thay vì HTTP,",
    "re": "dữ liệu sẽ được mã hóa để bảo mật hơn trong quá trình truyền tải"
  },
  {
    "con": "Khi một thiết bị trong mạng không thể tìm thấy DNS server,",
    "re": "nó sẽ không thể phân giải tên miền thành địa chỉ IP"
  },
  {
    "con": "Số lượng bit nhiều nhất có thể mượn để chia Subnet của địa chỉ IP lớp C là?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Địa chỉ IP lớp A có thể chứa tối đa bao nhiêu mạng con?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì có thể xảy ra lỗi trong quá trình truyền tải.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức TCP, thì nó sẽ đảm bảo tính toàn vẹn của dữ liệu.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một địa chỉ IP không hợp lệ được sử dụng trong mạng, thì thiết bị sẽ không thể kết nối.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức UDP, thì nó sẽ không đảm bảo việc truyền tải dữ liệu.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng có nhiều thiết bị, thì cần có một thiết bị định tuyến để quản lý lưu lượng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng VLAN, thì nó sẽ cho phép phân chia mạng thành các mạng con logic.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin bị mất trong mạng, thì giao thức TCP sẽ yêu cầu gửi lại gói tin đó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong HEADER của IP PACKET có chứa:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một thiết bị mạng được cấu hình với địa chỉ IP tĩnh:",
    "re": "Thiết bị đó sẽ luôn có cùng một địa chỉ IP mỗi khi khởi động"
  },
  {
    "con": "Một gói tin được gửi qua mạng mà không có địa chỉ MAC đích:",
    "re": "Gói tin đó sẽ không thể đến được thiết bị đích"
  },
  {
    "con": "Một router nhận được gói tin với địa chỉ đích không thuộc mạng của nó:",
    "re": "Router sẽ chuyển tiếp gói tin đó đến router khác"
  },
  {
    "con": "Khi một thiết bị gửi một gói tin ARP request:",
    "re": "Thiết bị đó đang tìm kiếm địa chỉ MAC tương ứng với địa chỉ IP"
  },
  {
    "con": "Một mạng LAN sử dụng switch để kết nối các thiết bị:",
    "re": "Switch sẽ gửi gói tin chỉ đến thiết bị đích thay vì tất cả các thiết bị trong mạng"
  },
  {
    "con": "Khi một gói tin TCP được gửi đi mà không có flag SYN:",
    "re": "Gói tin đó không thể thiết lập một kết nối mới"
  },
  {
    "con": "Một firewall được cấu hình để chặn tất cả lưu lượng đến cổng 80:",
    "re": "Tất cả các yêu cầu HTTP sẽ bị từ chối"
  },
  {
    "con": "Khi một thiết bị mạng sử dụng NAT:",
    "re": "Địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng"
  },
  {
    "con": "Khi một gói tin ICMP được gửi đi với loại 8:",
    "re": "Gói tin đó là một yêu cầu ping"
  },
  {
    "con": "Lớp nào trong mô hình OSI đóng gói dữ liệu kèm theo IP HEADER?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến đích, thì nó có thể bị mất trong quá trình truyền tải.",
    "re": "Gói tin có thể không được nhận bởi thiết bị đích"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì nó đảm bảo việc truyền tải dữ liệu đáng tin cậy.",
    "re": "Dữ liệu sẽ được truyền tải mà không bị mất mát"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng địa chỉ IP tĩnh, thì địa chỉ đó sẽ không thay đổi theo thời gian.",
    "re": "Thiết bị sẽ luôn có cùng một địa chỉ IP"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation), thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng.",
    "re": "Thiết bị trong mạng nội bộ có thể truy cập Internet"
  },
  {
    "con": "Nếu một gói tin được mã hóa, thì nội dung của nó sẽ không thể bị đọc bởi những người không có khóa giải mã.",
    "re": "Bảo mật thông tin được đảm bảo"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP, thì nó không đảm bảo việc truyền tải dữ liệu đáng tin cậy.",
    "re": "Dữ liệu có thể bị mất hoặc nhận không đúng thứ tự"
  },
  {
    "con": "Nếu một thiết bị mạng bị tắt, thì tất cả các kết nối đến thiết bị đó sẽ bị ngắt.",
    "re": "Không thể truy cập vào dịch vụ của thiết bị đó"
  },
  {
    "con": "Nếu một mạng có nhiều thiết bị kết nối, thì cần có một thiết bị chuyển mạch (switch) để quản lý lưu lượng dữ liệu.",
    "re": "Lưu lượng dữ liệu sẽ được phân phối hiệu quả hơn"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP, thì địa chỉ IP sẽ được cấp phát tự động cho các thiết bị kết nối.",
    "re": "Quá trình cấu hình mạng trở nên dễ dàng hơn"
  },
  {
    "con": "Địa chỉ 139.219.255.255 là địa chỉ gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một gói tin được gửi đi mà không có địa chỉ IP đích sẽ như thế nào?",
    "re": "Gói tin sẽ không đến được đích"
  },
  {
    "con": "Nếu một thiết bị trong mạng không có địa chỉ MAC, thì nó sẽ không thể tham gia vào mạng LAN.",
    "re": "Thiết bị sẽ không thể giao tiếp trong mạng LAN"
  },
  {
    "con": "Nếu một router không có bảng định tuyến, thì nó sẽ xử lý các gói tin như thế nào?",
    "re": "Router sẽ không biết cách chuyển tiếp gói tin"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì dữ liệu sẽ được truyền tải như thế nào?",
    "re": "Dữ liệu sẽ được truyền tải một cách đáng tin cậy và theo thứ tự"
  },
  {
    "con": "Nếu một địa chỉ IP là tĩnh, thì nó sẽ như thế nào?",
    "re": "Địa chỉ IP sẽ không thay đổi theo thời gian"
  },
  {
    "con": "Nếu một thiết bị sử dụng NAT, thì nó sẽ làm gì?",
    "re": "Thiết bị sẽ chuyển đổi địa chỉ IP riêng thành địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP, thì dữ liệu sẽ được truyền tải như thế nào?",
    "re": "Dữ liệu sẽ được truyền tải nhanh nhưng không đảm bảo độ tin cậy"
  },
  {
    "con": "Nếu một firewall không được cấu hình đúng, thì nó sẽ ảnh hưởng đến điều gì?",
    "re": "Firewall có thể cho phép hoặc chặn lưu lượng không mong muốn"
  },
  {
    "con": "Nếu một mạng không có bảo mật, thì nó sẽ dễ bị tấn công như thế nào?",
    "re": "Mạng sẽ dễ bị xâm nhập và đánh cắp dữ liệu"
  },
  {
    "con": "Mạng máy tính nào sử dụng giao thức TCP/IP?",
    "re": "Mạng Internet"
  },
  {
    "con": "Thiết bị nào được sử dụng để kết nối các mạng khác nhau?",
    "re": "Router"
  },
  {
    "con": "Mạng LAN có tốc độ truyền dữ liệu cao hơn mạng WAN?",
    "re": "Đúng"
  },
  {
    "con": "Giao thức nào được sử dụng để truyền tải email?",
    "re": "SMTP"
  },
  {
    "con": "Địa chỉ IP nào được sử dụng cho mạng cục bộ?",
    "re": "Địa chỉ IP riêng"
  },
  {
    "con": "Mạng nào có thể sử dụng công nghệ không dây?",
    "re": "Mạng WLAN"
  },
  {
    "con": "Giao thức nào đảm bảo dữ liệu được truyền tải một cách an toàn?",
    "re": "HTTPS"
  },
  {
    "con": "Thiết bị nào có chức năng chuyển tiếp dữ liệu giữa các thiết bị trong cùng một mạng?",
    "re": "Switch"
  },
  {
    "con": "Mạng nào có thể mở rộng dễ dàng hơn, mạng LAN hay mạng WAN?",
    "re": "Mạng WAN"
  },
  {
    "con": "Mạng nào sử dụng công nghệ Fiber Optic để truyền dữ liệu?",
    "re": "Mạng cáp quang"
  },
  {
    "con": "Địa chỉ lớp nào cho phép mượn 15 bits để chia Subnet?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích sau một khoảng thời gian nhất định,",
    "re": "thì nó sẽ bị loại bỏ và có thể gây ra mất dữ liệu."
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức TCP,",
    "re": "thì nó sẽ đảm bảo tính toàn vẹn của dữ liệu thông qua cơ chế xác nhận."
  },
  {
    "con": "Nếu một địa chỉ IP thuộc lớp A,",
    "re": "thì nó có thể có tối đa 16 triệu địa chỉ host."
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation),",
    "re": "thì nhiều thiết bị có thể chia sẻ một địa chỉ IP công cộng."
  },
  {
    "con": "Nếu một gói tin được gửi qua mạng mà không có địa chỉ đích hợp lệ,",
    "re": "thì nó sẽ không thể đến được đích."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP,",
    "re": "thì nó sẽ không đảm bảo tính toàn vẹn của dữ liệu."
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ MAC,",
    "re": "thì nó có thể được nhận diện duy nhất trong mạng LAN."
  },
  {
    "con": "Nếu một mạng sử dụng VLAN (Virtual Local Area Network),",
    "re": "thì nó có thể phân chia mạng vật lý thành nhiều mạng logic."
  },
  {
    "con": "Nếu một gói tin bị rơi trong quá trình truyền tải,",
    "re": "thì nó có thể được yêu cầu gửi lại nếu sử dụng giao thức TCP."
  },
  {
    "con": "Giao thức nào dùng để tìm địa chỉ IP khi biết địa chỉ MAC của máy tính?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì nó sẽ bị loại bỏ hoặc gửi lại tùy thuộc vào giao thức.",
    "re": "Giao thức TCP sẽ gửi lại gói tin bị mất."
  },
  {
    "con": "Nếu một máy tính muốn gửi dữ liệu đến một máy tính khác trong cùng một mạng LAN, thì nó sẽ sử dụng địa chỉ MAC của máy tính đích.",
    "re": "Gói tin sẽ được gửi trực tiếp đến máy tính đích mà không cần qua router."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP, thì địa chỉ IP sẽ được cấp phát tự động cho các thiết bị kết nối vào mạng.",
    "re": "Thiết bị sẽ nhận được địa chỉ IP tạm thời từ máy chủ DHCP."
  },
  {
    "con": "Nếu một gói tin được gửi từ một mạng khác, thì nó sẽ đi qua router để đến đích.",
    "re": "Router sẽ xác định đường đi tốt nhất cho gói tin."
  },
  {
    "con": "Nếu một máy tính sử dụng giao thức HTTPS, thì dữ liệu được truyền đi sẽ được mã hóa.",
    "re": "Bảo mật thông tin được cải thiện khi truyền tải dữ liệu."
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation), thì địa chỉ IP riêng sẽ được chuyển đổi thành địa chỉ IP công cộng.",
    "re": "NAT cho phép nhiều thiết bị trong mạng nội bộ chia sẻ một địa chỉ IP công cộng."
  },
  {
    "con": "Nếu một thiết bị trong mạng không thể kết nối Internet, thì có thể do cấu hình DNS không chính xác.",
    "re": "Thiết bị sẽ không thể phân giải tên miền thành địa chỉ IP."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức IPv6, thì số lượng địa chỉ IP khả dụng sẽ tăng lên đáng kể.",
    "re": "IPv6 hỗ trợ 340 undecillion địa chỉ IP."
  },
  {
    "con": "Nếu một gói tin bị lỗi trong quá trình truyền tải, thì giao thức sẽ yêu cầu gửi lại gói tin đó.",
    "re": "Giao thức TCP sẽ phát hiện lỗi và yêu cầu truyền lại."
  },
  {
    "con": "TCP làm việc ở lớp nào của mô hình OSI?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải,",
    "re": "TCP sẽ yêu cầu gửi lại gói tin đó"
  },
  {
    "con": "Nếu một địa chỉ IP không hợp lệ được sử dụng trong mạng,",
    "re": "gói tin sẽ không được gửi đi"
  },
  {
    "con": "Nếu một thiết bị trong mạng không có địa chỉ MAC,",
    "re": "nó sẽ không thể giao tiếp trên mạng LAN"
  },
  {
    "con": "Nếu một router không có bảng định tuyến,",
    "re": "nó sẽ không biết cách chuyển tiếp gói tin"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP,",
    "re": "các thiết bị sẽ tự động nhận địa chỉ IP"
  },
  {
    "con": "Nếu một gói tin được mã hóa,",
    "re": "nó sẽ chỉ có thể được giải mã bởi thiết bị có khóa phù hợp"
  },
  {
    "con": "Nếu một mạng sử dụng NAT,",
    "re": "các địa chỉ IP riêng sẽ được ánh xạ tới một địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức HTTPS,",
    "re": "dữ liệu truyền tải sẽ được mã hóa để bảo mật"
  },
  {
    "con": "Nếu một mạng có nhiều thiết bị kết nối,",
    "re": "cần có một switch hoặc hub để quản lý lưu lượng"
  },
  {
    "con": "Giao thức nào dưới đây không đảm bảo dữ liệu gửi đi có tới máy nhận hoàn chỉnh hay không?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng sử dụng địa chỉ IP tĩnh cho các thiết bị thì việc quản lý địa chỉ IP sẽ dễ dàng hơn.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải thì giao thức TCP sẽ tự động yêu cầu gửi lại gói tin đó.",
    "re": "Điều này đúng"
  },
  {
    "con": "Khi sử dụng NAT (Network Address Translation) thì nhiều thiết bị có thể chia sẻ một địa chỉ IP công cộng.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một mạng sử dụng mô hình OSI thì các tầng sẽ tương tác với nhau theo cách quy định.",
    "re": "Điều này đúng"
  },
  {
    "con": "Khi một thiết bị trong mạng bị tấn công từ chối dịch vụ (DoS) thì khả năng truy cập của các thiết bị khác có thể bị ảnh hưởng.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch thì băng thông sẽ được phân bổ hiệu quả hơn so với việc sử dụng hub.",
    "re": "Điều này đúng"
  },
  {
    "con": "Khi sử dụng giao thức UDP thì không có cơ chế kiểm tra lỗi, dẫn đến khả năng mất dữ liệu.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một mạng không có bảo mật thì dữ liệu truyền tải có thể bị nghe lén hoặc thay đổi.",
    "re": "Điều này đúng"
  },
  {
    "con": "Khi sử dụng VPN (Virtual Private Network) thì dữ liệu sẽ được mã hóa, giúp bảo vệ thông tin cá nhân.",
    "re": "Điều này đúng"
  },
  {
    "con": "Độ dài của địa chỉ MAC là?",
    "re": "48 bit"
  },
  {
    "con": "Địa chỉ IP phiên bản 4 (IPv4) có bao nhiêu bit?",
    "re": "32 bit"
  },
  {
    "con": "Giao thức TCP là giao thức gì?",
    "re": "Giao thức kết nối hướng"
  },
  {
    "con": "Giao thức UDP là giao thức gì?",
    "re": "Giao thức không kết nối"
  },
  {
    "con": "Mạng LAN thường sử dụng loại địa chỉ IP nào?",
    "re": "Địa chỉ IP riêng"
  },
  {
    "con": "Để truyền dữ liệu qua mạng, dữ liệu được chia thành các đơn vị gọi là gì?",
    "re": "Gói tin"
  },
  {
    "con": "Mỗi thiết bị trong mạng cần có gì để có thể giao tiếp?",
    "re": "Địa chỉ IP duy nhất"
  },
  {
    "con": "Mạng WAN thường kết nối các mạng LAN ở khoảng cách nào?",
    "re": "Khoảng cách lớn, thường là giữa các thành phố hoặc quốc gia"
  },
  {
    "con": "Giao thức HTTP là gì?",
    "re": "Giao thức truyền tải siêu văn bản"
  },
  {
    "con": "Mạng không dây thường sử dụng giao thức nào để kết nối?",
    "re": "Giao thức Wi-Fi (802.11)"
  },
  {
    "con": "Trang thiết bị mạng trung tâm dùng để kết nối các máy tính trong mạng hình sao (STAR) là:",
    "re": "Switch"
  },
  {
    "con": "Mạng LAN thường sử dụng giao thức nào để truyền tải dữ liệu giữa các thiết bị?",
    "re": "Ethernet"
  },
  {
    "con": "Nếu một thiết bị trong mạng không thể giao tiếp với các thiết bị khác, thì nguyên nhân có thể là:",
    "re": "Cáp mạng bị hỏng hoặc cấu hình IP sai"
  },
  {
    "con": "Khi sử dụng NAT (Network Address Translation), địa chỉ IP riêng sẽ được chuyển đổi thành:",
    "re": "Địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì dữ liệu sẽ được truyền tải:",
    "re": "Đảm bảo độ tin cậy và thứ tự"
  },
  {
    "con": "Khi một gói tin bị mất trong mạng, giao thức nào sẽ yêu cầu gửi lại gói tin đó?",
    "re": "TCP"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng địa chỉ MAC để xác định danh tính, thì nó hoạt động ở:",
    "re": "Lớp liên kết dữ liệu (Data Link Layer)"
  },
  {
    "con": "Khi một mạng sử dụng mô hình OSI, lớp nào chịu trách nhiệm về định tuyến?",
    "re": "Lớp mạng (Network Layer)"
  },
  {
    "con": "Nếu một mạng không dây sử dụng chuẩn 802.11, thì nó có thể hoạt động ở:",
    "re": "Tần số 2.4 GHz hoặc 5 GHz"
  },
  {
    "con": "Khi một thiết bị mạng được cấu hình với địa chỉ IP tĩnh, thì nó sẽ:",
    "re": "Giữ nguyên địa chỉ IP đó ngay cả khi khởi động lại"
  },
  {
    "con": "Giao thức mạng nào dưới đây được sử dụng trong mạng cục bộ LAN:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một địa chỉ IP tĩnh được cấu hình cho một thiết bị trong mạng:",
    "re": "Thiết bị đó sẽ luôn có cùng một địa chỉ IP mỗi khi khởi động"
  },
  {
    "con": "Khi một gói tin bị mất trong quá trình truyền tải:",
    "re": "Giao thức TCP sẽ yêu cầu gửi lại gói tin đó"
  },
  {
    "con": "Nếu một thiết bị trong mạng không thể kết nối với router:",
    "re": "Thiết bị đó sẽ không thể truy cập Internet"
  },
  {
    "con": "Khi sử dụng NAT (Network Address Translation):",
    "re": "Nhiều thiết bị trong mạng nội bộ có thể chia sẻ một địa chỉ IP công cộng"
  },
  {
    "con": "Khi một mạng sử dụng giao thức DHCP:",
    "re": "Các thiết bị trong mạng sẽ tự động nhận địa chỉ IP từ máy chủ DHCP"
  },
  {
    "con": "Nếu một mạng sử dụng VLAN (Virtual Local Area Network):",
    "re": "Các thiết bị trong cùng một VLAN có thể giao tiếp với nhau mà không cần router"
  },
  {
    "con": "Khi một gói tin được mã hóa:",
    "re": "Nội dung của gói tin đó sẽ không thể đọc được nếu không có khóa giải mã"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức HTTPS:",
    "re": "Dữ liệu truyền tải giữa trình duyệt và máy chủ sẽ được mã hóa"
  },
  {
    "con": "Khi một thiết bị trong mạng bị tấn công DDoS (Distributed Denial of Service):",
    "re": "Thiết bị đó có thể bị ngừng hoạt động do quá tải lưu lượng truy cập"
  },
  {
    "con": "Địa chỉ IP nào sau đây không được dùng để kết nối trực tiếp trong mạng Internet (không tồn tại trong mạng Internet):",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích trong mạng,",
    "re": "thì có thể có vấn đề về cấu hình router hoặc firewall."
  },
  {
    "con": "Nếu một máy tính trong mạng sử dụng địa chỉ IP tĩnh,",
    "re": "thì nó sẽ không thay đổi địa chỉ IP sau mỗi lần khởi động."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP,",
    "re": "thì nó sẽ đảm bảo tính toàn vẹn của dữ liệu thông qua việc kiểm tra và xác nhận."
  },
  {
    "con": "Nếu một thiết bị mạng không có địa chỉ MAC,",
    "re": "thì nó sẽ không thể giao tiếp trong mạng LAN."
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation),",
    "re": "thì nhiều thiết bị có thể chia sẻ một địa chỉ IP công cộng."
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải,",
    "re": "thì giao thức UDP sẽ không cố gắng gửi lại gói tin đó."
  },
  {
    "con": "Nếu một mạng sử dụng VLAN (Virtual Local Area Network),",
    "re": "thì nó có thể phân chia mạng vật lý thành nhiều mạng logic khác nhau."
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức DHCP,",
    "re": "thì nó sẽ tự động cấp phát địa chỉ IP cho các thiết bị trong mạng."
  },
  {
    "con": "Nếu một máy chủ DNS không thể phân giải tên miền,",
    "re": "thì người dùng sẽ không thể truy cập vào trang web tương ứng."
  },
  {
    "con": "Địa chỉ IP nào sau đây thuộc lớp C:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một gói tin được gửi từ máy A đến máy B mà không có router nào giữa chúng:",
    "re": "Gói tin sẽ được truyền trực tiếp"
  },
  {
    "con": "Nếu một máy tính không nhận được gói tin ACK từ máy gửi:",
    "re": "Gói tin sẽ được gửi lại"
  },
  {
    "con": "Khi một thiết bị trong mạng sử dụng địa chỉ IP tĩnh:",
    "re": "Địa chỉ IP của thiết bị đó sẽ không thay đổi"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP:",
    "re": "Dữ liệu sẽ được truyền theo cách kết nối và đảm bảo độ tin cậy"
  },
  {
    "con": "Khi một thiết bị trong mạng sử dụng NAT:",
    "re": "Địa chỉ IP riêng sẽ được ánh xạ thành địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một gói tin bị rơi trong quá trình truyền tải:",
    "re": "Gói tin đó sẽ không đến đích"
  },
  {
    "con": "Khi một mạng sử dụng giao thức UDP:",
    "re": "Dữ liệu sẽ được truyền mà không cần đảm bảo độ tin cậy"
  },
  {
    "con": "Nếu một thiết bị trong mạng không có địa chỉ IP hợp lệ:",
    "re": "Thiết bị đó sẽ không thể giao tiếp với các thiết bị khác trong mạng"
  },
  {
    "con": "Khi một mạng sử dụng VLAN:",
    "re": "Các thiết bị trong cùng một VLAN có thể giao tiếp với nhau mà không cần router"
  },
  {
    "con": "Lệnh PING dùng để:",
    "re": "kiểm tra kết nối mạng giữa hai thiết bị"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải:",
    "re": "thời gian phản hồi sẽ tăng lên do cần phải gửi lại gói tin"
  },
  {
    "con": "Nếu một địa chỉ IP không hợp lệ được sử dụng:",
    "re": "thiết bị sẽ không thể kết nối với mạng"
  },
  {
    "con": "Nếu một router không có bảng định tuyến:",
    "re": "nó sẽ không biết cách chuyển tiếp gói tin đến đích"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP:",
    "re": "nó sẽ đảm bảo tính toàn vẹn của dữ liệu thông qua việc kiểm tra và xác nhận"
  },
  {
    "con": "Nếu một thiết bị trong mạng bị tắt:",
    "re": "các thiết bị khác sẽ không thể giao tiếp với thiết bị đó"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch:",
    "re": "nó sẽ cải thiện hiệu suất mạng bằng cách giảm thiểu va chạm"
  },
  {
    "con": "Nếu một địa chỉ MAC bị thay đổi:",
    "re": "thiết bị sẽ được nhận diện như một thiết bị mới trên mạng"
  },
  {
    "con": "Nếu một firewall được cấu hình sai:",
    "re": "nó có thể chặn lưu lượng hợp lệ hoặc cho phép lưu lượng độc hại"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP:",
    "re": "nó sẽ không đảm bảo tính toàn vẹn của dữ liệu nhưng có tốc độ truyền tải nhanh hơn"
  },
  {
    "con": "Lệnh nào sau đây cho biết địa chỉ IP của máy tính:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một máy tính không thể kết nối với mạng nếu không có địa chỉ IP hợp lệ:",
    "re": "Kết nối mạng sẽ thất bại"
  },
  {
    "con": "Nếu một gói tin không đến được đích do lỗi mạng:",
    "re": "Gói tin sẽ bị mất và không được chuyển tiếp"
  },
  {
    "con": "Nếu một router không có bảng định tuyến:",
    "re": "Nó sẽ không thể chuyển tiếp gói tin đến đích"
  },
  {
    "con": "Nếu một máy chủ DNS không phản hồi:",
    "re": "Máy khách sẽ không thể phân giải tên miền thành địa chỉ IP"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP:",
    "re": "Dữ liệu sẽ được truyền tải một cách đáng tin cậy và có thứ tự"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP:",
    "re": "Dữ liệu sẽ được truyền tải nhanh nhưng không đảm bảo độ tin cậy"
  },
  {
    "con": "Nếu một thiết bị mạng bị tắt nguồn:",
    "re": "Tất cả các kết nối qua thiết bị đó sẽ bị ngắt"
  },
  {
    "con": "Nếu một firewall chặn một cổng mạng:",
    "re": "Các kết nối đến cổng đó sẽ không được thiết lập"
  },
  {
    "con": "Nếu một mạng LAN sử dụng địa chỉ IP tĩnh:",
    "re": "Các thiết bị trong mạng sẽ có địa chỉ IP không thay đổi"
  },
  {
    "con": "Trong mạng máy tính dùng giao thức TCP/IP và đều dùng Subnet Mask là 255.255.255.0 thì cặp máy tính nào sau đây liên thông:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một máy tính trong mạng có địa chỉ IP là 192.168.1.10 và Subnet Mask là 255.255.255.0 thì địa chỉ mạng của nó là:",
    "re": "192.168.1.0"
  },
  {
    "con": "Nếu một gói tin được gửi từ máy A đến máy B qua mạng LAN và không có lỗi xảy ra thì gói tin sẽ đến đích mà không bị mất mát:",
    "re": "Gói tin sẽ được nhận đầy đủ tại máy B"
  },
  {
    "con": "Nếu một máy chủ DNS không thể phân giải tên miền thì người dùng sẽ không thể truy cập vào trang web tương ứng:",
    "re": "Lỗi truy cập trang web sẽ xảy ra"
  },
  {
    "con": "Nếu một router không có bảng định tuyến thì nó sẽ không biết cách chuyển tiếp gói tin đến đích:",
    "re": "Gói tin sẽ không được chuyển tiếp"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP thì các máy tính trong mạng sẽ tự động nhận địa chỉ IP từ máy chủ DHCP:",
    "re": "Quá trình cấu hình mạng sẽ trở nên dễ dàng hơn"
  },
  {
    "con": "Nếu một máy tính trong mạng bị tấn công DDoS thì khả năng truy cập của nó sẽ bị ảnh hưởng nghiêm trọng:",
    "re": "Máy tính có thể bị ngừng hoạt động hoặc chậm lại"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức HTTPS thay vì HTTP thì dữ liệu truyền tải sẽ được mã hóa:",
    "re": "Bảo mật thông tin sẽ được nâng cao"
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ MAC trùng lặp với thiết bị khác trong cùng một mạng thì sẽ xảy ra xung đột địa chỉ:",
    "re": "Kết nối mạng sẽ bị gián đoạn"
  },
  {
    "con": "Nếu một mạng sử dụng VLAN thì các thiết bị trong cùng một VLAN có thể giao tiếp với nhau mà không cần đi qua router:",
    "re": "Tăng hiệu suất và bảo mật trong mạng"
  },
  {
    "con": "Trong mạng máy tính dùng giao thức TCP/IP và Subnet Mask là 255.255.255.224, hãy xác định địa chỉ broadcast của mạng nếu biết rằng một máy tính trong mạng có địa chỉ 192.168.1.1:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một máy tính trong mạng có địa chỉ IP là 192.168.0.10 và Subnet Mask là 255.255.255.0, thì địa chỉ mạng của máy tính đó là:",
    "re": "192.168.0.0"
  },
  {
    "con": "Nếu một gói tin được gửi từ máy A đến máy B qua mạng sử dụng giao thức UDP, thì gói tin đó sẽ không được đảm bảo về độ tin cậy:",
    "re": "Gói tin có thể bị mất hoặc không đến được"
  },
  {
    "con": "Nếu một router nhận được gói tin với địa chỉ đích không nằm trong bảng định tuyến của nó, thì router sẽ:",
    "re": "Gửi gói tin đến địa chỉ mặc định (default gateway)"
  },
  {
    "con": "Nếu một máy chủ DNS không thể phân giải tên miền, thì máy khách sẽ không thể truy cập vào tài nguyên mạng bằng tên miền đó:",
    "re": "Máy khách sẽ nhận được thông báo lỗi"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP, thì địa chỉ IP của các thiết bị trong mạng sẽ được cấp phát tự động:",
    "re": "Thiết bị sẽ nhận địa chỉ IP từ máy chủ DHCP"
  },
  {
    "con": "Nếu một máy tính trong mạng LAN sử dụng địa chỉ IP tĩnh, thì địa chỉ IP đó sẽ không thay đổi trừ khi được cấu hình lại:",
    "re": "Máy tính sẽ luôn có cùng một địa chỉ IP"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation), thì địa chỉ IP riêng trong mạng nội bộ sẽ được ánh xạ sang địa chỉ IP công cộng khi truy cập Internet:",
    "re": "Giúp tiết kiệm địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức ICMP để gửi thông điệp ping, thì thiết bị đó đang kiểm tra khả năng kết nối với thiết bị khác:",
    "re": "Thiết bị sẽ nhận phản hồi nếu kết nối thành công"
  },
  {
    "con": "Nếu một mạng sử dụng VLAN (Virtual Local Area Network), thì các thiết bị trong các VLAN khác nhau sẽ không thể giao tiếp trực tiếp với nhau:",
    "re": "Cần có router hoặc thiết bị Layer 3 để giao tiếp giữa các VLAN"
  },
  {
    "con": "Trong mạng Ring, mỗi trạm của mạng được nối với vòng nhờ bộ phận:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích trong mạng,",
    "re": "thì nó sẽ bị mất và không được truyền đi tiếp."
  },
  {
    "con": "Nếu một địa chỉ IP không hợp lệ được sử dụng trong mạng,",
    "re": "thì thiết bị sẽ không thể kết nối với mạng."
  },
  {
    "con": "Nếu một router không có bảng định tuyến,",
    "re": "thì nó sẽ không biết cách chuyển tiếp gói tin."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP,",
    "re": "thì nó sẽ đảm bảo tính toàn vẹn của dữ liệu thông qua việc kiểm tra lỗi."
  },
  {
    "con": "Nếu một thiết bị trong mạng bị tắt,",
    "re": "thì các thiết bị khác sẽ không thể giao tiếp với nó."
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch,",
    "re": "thì nó sẽ giảm thiểu va chạm dữ liệu giữa các thiết bị."
  },
  {
    "con": "Nếu một gói tin được mã hóa,",
    "re": "thì chỉ những thiết bị có khóa giải mã mới có thể đọc nội dung của nó."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP,",
    "re": "thì nó sẽ không đảm bảo tính toàn vẹn của dữ liệu."
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng NAT,",
    "re": "thì nó sẽ cho phép nhiều thiết bị trong mạng nội bộ chia sẻ một địa chỉ IP công cộng."
  },
  {
    "con": "Topo mạng cục bộ nào mà tất cả các trạm phân chia chung một đường truyền chính:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích do lỗi mạng:",
    "re": "Gói tin sẽ bị mất và không được chuyển tiếp"
  },
  {
    "con": "Nếu một địa chỉ IP không hợp lệ được sử dụng trong mạng:",
    "re": "Thiết bị sẽ không thể kết nối với mạng"
  },
  {
    "con": "Nếu một router không có bảng định tuyến:",
    "re": "Nó sẽ không thể chuyển tiếp gói tin đến đích"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP:",
    "re": "Dữ liệu sẽ được truyền theo cách đáng tin cậy và có kiểm soát"
  },
  {
    "con": "Nếu một thiết bị trong mạng bị tắt:",
    "re": "Các thiết bị khác sẽ không thể giao tiếp với thiết bị đó"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation):",
    "re": "Nó sẽ cho phép nhiều thiết bị sử dụng một địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một gói tin bị phân mảnh:",
    "re": "Nó sẽ được tái hợp lại tại đích trước khi xử lý"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP:",
    "re": "Dữ liệu sẽ được truyền nhanh hơn nhưng không đảm bảo độ tin cậy"
  },
  {
    "con": "Nếu một thiết bị mạng không được cấu hình đúng:",
    "re": "Nó có thể gây ra sự cố kết nối trong mạng"
  },
  {
    "con": "Byte đầu tiên của một địa chỉ IP có dạng: 11011011. Vậy nó thuộc lớp nào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không nhận được phản hồi trong khoảng thời gian quy định, thì nó sẽ bị coi là mất gói:",
    "re": "Gói tin sẽ được gửi lại"
  },
  {
    "con": "Nếu địa chỉ MAC của một thiết bị là duy nhất trong mạng, thì thiết bị đó có thể giao tiếp với các thiết bị khác trong cùng mạng:",
    "re": "Thiết bị có thể gửi và nhận dữ liệu"
  },
  {
    "con": "Nếu một router nhận được gói tin với địa chỉ đích không nằm trong bảng định tuyến, thì nó sẽ không biết cách chuyển tiếp gói tin đó:",
    "re": "Gói tin sẽ bị loại bỏ"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì nó sẽ đảm bảo rằng dữ liệu được truyền tải một cách đáng tin cậy:",
    "re": "Dữ liệu sẽ được kiểm tra và xác nhận"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng địa chỉ IP tĩnh, thì địa chỉ IP đó sẽ không thay đổi theo thời gian:",
    "re": "Thiết bị sẽ luôn có cùng một địa chỉ IP"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation), thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng:",
    "re": "Thiết bị trong mạng nội bộ có thể truy cập Internet"
  },
  {
    "con": "Nếu một gói tin được mã hóa, thì chỉ những người có khóa giải mã mới có thể đọc nội dung của gói tin đó:",
    "re": "Bảo mật thông tin được đảm bảo"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP, thì nó sẽ không đảm bảo việc truyền tải dữ liệu đáng tin cậy:",
    "re": "Dữ liệu có thể bị mất mà không có thông báo"
  },
  {
    "con": "Nếu một thiết bị trong mạng có địa chỉ IP động, thì địa chỉ IP đó có thể thay đổi mỗi khi thiết bị kết nối lại với mạng:",
    "re": "Thiết bị có thể có địa chỉ IP khác nhau trong các lần kết nối"
  },
  {
    "con": "Byte đầu tiên của một địa chỉ IP có dạng: 01000111. Vậy nó thuộc lớp nào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến đích sau một khoảng thời gian nhất định, thì nó sẽ bị coi là mất gói.",
    "re": "Gói tin sẽ được gửi lại nếu có cơ chế retransmission."
  },
  {
    "con": "Nếu một địa chỉ IP thuộc dải 192.168.0.0 đến 192.168.255.255, thì nó là địa chỉ IP riêng.",
    "re": "Địa chỉ IP này không thể được định tuyến trên Internet công cộng."
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức TCP, thì nó sẽ đảm bảo việc truyền dữ liệu đáng tin cậy.",
    "re": "Dữ liệu sẽ được kiểm tra và xác nhận khi đến đích."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP, thì nó sẽ không đảm bảo việc truyền dữ liệu đáng tin cậy.",
    "re": "Dữ liệu có thể bị mất mà không có thông báo."
  },
  {
    "con": "Nếu một địa chỉ MAC có dạng 00:1A:2B:3C:4D:5E, thì nó là địa chỉ vật lý của một thiết bị mạng.",
    "re": "Địa chỉ này được sử dụng để xác định thiết bị trong mạng LAN."
  },
  {
    "con": "Nếu một router nhận được gói tin với địa chỉ đích không nằm trong bảng định tuyến, thì nó sẽ gửi gói tin đến gateway mặc định.",
    "re": "Gateway mặc định sẽ cố gắng chuyển tiếp gói tin ra ngoài mạng."
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation), thì địa chỉ IP riêng sẽ được chuyển đổi thành địa chỉ IP công cộng.",
    "re": "Điều này cho phép nhiều thiết bị trong mạng nội bộ truy cập Internet thông qua một địa chỉ IP công cộng."
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức DHCP, thì nó sẽ tự động nhận địa chỉ IP từ máy chủ DHCP.",
    "re": "Điều này giúp giảm thiểu sự can thiệp của người dùng trong việc cấu hình địa chỉ IP."
  },
  {
    "con": "Nếu một mạng sử dụng VLAN (Virtual Local Area Network), thì nó sẽ phân chia mạng vật lý thành nhiều mạng logic.",
    "re": "Điều này giúp cải thiện hiệu suất và bảo mật trong mạng."
  },
  {
    "con": "Byte đầu tiên của một địa chỉ IP có dạng 10110111. Vậy nó thuộc lớp nào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không nhận được phản hồi trong khoảng thời gian quy định, thì nó sẽ bị coi là mất gói:",
    "re": "Gói tin sẽ được gửi lại"
  },
  {
    "con": "Nếu một địa chỉ IP thuộc dải 192.168.0.0/16, thì nó là địa chỉ IP riêng:",
    "re": "Địa chỉ IP này không thể được định tuyến qua Internet"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức TCP, thì nó sẽ đảm bảo độ tin cậy trong việc truyền tải dữ liệu:",
    "re": "Dữ liệu sẽ được gửi và xác nhận"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP, thì địa chỉ IP sẽ được cấp phát tự động cho các thiết bị kết nối:",
    "re": "Thiết bị sẽ không cần cấu hình địa chỉ IP thủ công"
  },
  {
    "con": "Nếu một gói tin có địa chỉ đích là 255.255.255.255, thì nó được coi là gói tin phát sóng:",
    "re": "Gói tin sẽ được gửi đến tất cả các thiết bị trong mạng"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức UDP, thì nó sẽ không đảm bảo độ tin cậy trong việc truyền tải dữ liệu:",
    "re": "Dữ liệu có thể bị mất mà không có thông báo"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation), thì địa chỉ IP riêng sẽ được chuyển đổi thành địa chỉ IP công cộng:",
    "re": "Thiết bị trong mạng nội bộ có thể truy cập Internet"
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ MAC là 00:1A:2B:3C:4D:5E, thì nó có thể được xác định duy nhất trong mạng LAN:",
    "re": "Địa chỉ MAC là duy nhất cho mỗi thiết bị"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức SSL/TLS, thì dữ liệu sẽ được mã hóa trong quá trình truyền tải:",
    "re": "Bảo mật thông tin được đảm bảo"
  },
  {
    "con": "Trong các lớp A, B, C, D, E thì lớp nào dùng cho các mạng có số trạm cực lớn:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích trong một khoảng thời gian nhất định,",
    "re": "thì nó sẽ bị loại bỏ và có thể được gửi lại nếu có cơ chế retransmission."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP,",
    "re": "thì nó sẽ đảm bảo tính toàn vẹn và thứ tự của dữ liệu."
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ IP tĩnh,",
    "re": "thì địa chỉ đó sẽ không thay đổi theo thời gian."
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation),",
    "re": "thì nhiều thiết bị có thể chia sẻ một địa chỉ IP công cộng."
  },
  {
    "con": "Nếu một gói tin được gửi qua mạng không có địa chỉ đích hợp lệ,",
    "re": "thì nó sẽ không đến được đích và có thể bị loại bỏ."
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch,",
    "re": "thì nó sẽ giảm thiểu va chạm giữa các gói tin."
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức UDP,",
    "re": "thì nó sẽ không đảm bảo tính toàn vẹn của dữ liệu."
  },
  {
    "con": "Nếu một mạng sử dụng mô hình OSI,",
    "re": "thì nó sẽ có 7 lớp từ vật lý đến ứng dụng."
  },
  {
    "con": "Nếu một mạng không dây sử dụng chuẩn 802.11,",
    "re": "thì nó sẽ có khả năng truyền dữ liệu qua sóng radio."
  },
  {
    "con": "Trong các giao thức giao vận Internet, giao thức nào có liên kết:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một gói tin bị mất trong quá trình truyền tải:",
    "re": "Giao thức TCP sẽ yêu cầu gửi lại gói tin đó"
  },
  {
    "con": "Nếu một địa chỉ IP không hợp lệ được sử dụng trong mạng:",
    "re": "Thiết bị sẽ không thể kết nối với mạng"
  },
  {
    "con": "Khi một thiết bị trong mạng sử dụng NAT:",
    "re": "Địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP:",
    "re": "Thiết bị sẽ tự động nhận địa chỉ IP và thông tin cấu hình mạng"
  },
  {
    "con": "Khi một gói tin được mã hóa trước khi truyền:",
    "re": "Nội dung của gói tin sẽ được bảo vệ khỏi việc bị đọc trái phép"
  },
  {
    "con": "Nếu một mạng sử dụng mô hình OSI:",
    "re": "Các giao thức sẽ được phân chia thành 7 lớp khác nhau"
  },
  {
    "con": "Khi một thiết bị gửi dữ liệu qua mạng không dây:",
    "re": "Tín hiệu có thể bị nhiễu và suy giảm do khoảng cách và vật cản"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch:",
    "re": "Dữ liệu sẽ được chuyển tiếp chỉ đến thiết bị đích thay vì tất cả các thiết bị trong mạng"
  },
  {
    "con": "Khi một giao thức sử dụng mã kiểm tra (checksum):",
    "re": "Nó có thể phát hiện lỗi trong quá trình truyền tải dữ liệu"
  },
  {
    "con": "Số nhị phân 01111100 có giá trị thập phân là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một địa chỉ IP thuộc lớp A có giá trị bắt đầu từ 1 đến 126 thì",
    "re": "Địa chỉ IP đó có thể được sử dụng cho mạng lớn"
  },
  {
    "con": "Nếu một gói tin không đến được đích trong thời gian quy định thì",
    "re": "Gói tin đó sẽ bị mất và có thể được gửi lại"
  },
  {
    "con": "Khi sử dụng giao thức TCP, nếu một gói tin bị mất thì",
    "re": "Giao thức sẽ tự động yêu cầu gửi lại gói tin đó"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation) thì",
    "re": "Nhiều thiết bị có thể chia sẻ một địa chỉ IP công cộng"
  },
  {
    "con": "Khi một thiết bị trong mạng gửi một gói tin đến một địa chỉ không tồn tại thì",
    "re": "Gói tin đó sẽ không được chuyển tiếp và sẽ bị loại bỏ"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP thì",
    "re": "Giao thức này sẽ không đảm bảo độ tin cậy trong việc truyền tải dữ liệu"
  },
  {
    "con": "Khi một thiết bị nhận được một gói tin với địa chỉ MAC không khớp thì",
    "re": "Thiết bị đó sẽ bỏ qua gói tin đó"
  },
  {
    "con": "Nếu một mạng có nhiều router thì",
    "re": "Các router sẽ sử dụng bảng định tuyến để quyết định đường đi của gói tin"
  },
  {
    "con": "Khi một thiết bị trong mạng sử dụng DHCP để lấy địa chỉ IP thì",
    "re": "Thiết bị đó sẽ nhận được địa chỉ IP tạm thời từ máy chủ DHCP"
  },
  {
    "con": "Lớp địa chỉ IP A có thể chứa tối đa 16 triệu địa chỉ host.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì nó sẽ bị loại bỏ và không được gửi lại.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu sử dụng giao thức TCP, thì dữ liệu sẽ được truyền theo cách có kết nối và đảm bảo độ tin cậy.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì địa chỉ IP riêng sẽ không thể truy cập trực tiếp từ Internet.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ MAC, thì nó có thể được nhận diện duy nhất trong mạng LAN.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin được gửi qua mạng mà không có địa chỉ đích, thì nó sẽ không đến được nơi cần đến.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP, thì dữ liệu sẽ được truyền mà không cần xác nhận từ bên nhận.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một router không có bảng định tuyến, thì nó sẽ không biết cách chuyển tiếp gói tin đến đích.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một subnet có Netmask là 255.255.255.0, thì nó có thể chứa tối đa 256 địa chỉ IP.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP, thì các thiết bị sẽ tự động nhận địa chỉ IP từ máy chủ.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Địa chỉ Subnet của một IP nằm từ bit thứ 16 tới bit thứ 23. Vậy địa chỉ IP của nó thuộc lớp nào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không thể đến đích do lỗi mạng, thì gói tin đó sẽ bị mất.",
    "re": "Gói tin không được gửi lại"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức TCP, thì nó sẽ đảm bảo tính toàn vẹn của dữ liệu.",
    "re": "Dữ liệu sẽ được truyền chính xác"
  },
  {
    "con": "Nếu một địa chỉ IP thuộc lớp A, thì nó sẽ có mặt nạ mạng mặc định là 255.0.0.0.",
    "re": "Địa chỉ IP có thể chứa nhiều host"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP, thì các thiết bị trong mạng sẽ tự động nhận địa chỉ IP.",
    "re": "Quá trình cấu hình mạng sẽ đơn giản hơn"
  },
  {
    "con": "Nếu một gói tin được gửi qua mạng mà không có địa chỉ MAC đích, thì gói tin đó sẽ không thể đến được thiết bị đích.",
    "re": "Gói tin sẽ không được truyền đi"
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức UDP, thì nó sẽ không đảm bảo việc truyền dữ liệu thành công.",
    "re": "Dữ liệu có thể bị mất hoặc trễ"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation), thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng.",
    "re": "Giúp tiết kiệm địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một thiết bị trong mạng có địa chỉ IP tĩnh, thì địa chỉ đó sẽ không thay đổi theo thời gian.",
    "re": "Thiết bị sẽ dễ dàng được nhận diện trong mạng"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch, thì băng thông mạng sẽ được tối ưu hóa hơn so với việc sử dụng hub.",
    "re": "Tăng hiệu suất truyền tải dữ liệu"
  },
  {
    "con": "Subnet Mask nào sau đây là hợp lệ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một địa chỉ IP thuộc lớp A có giá trị đầu tiên từ 1 đến 126:",
    "re": "Địa chỉ IP đó là lớp A"
  },
  {
    "con": "Nếu một gói tin không thể đến đích do lỗi mạng:",
    "re": "Gói tin đó sẽ bị mất và không được gửi lại"
  },
  {
    "con": "Khi sử dụng giao thức TCP, nếu một gói tin bị mất:",
    "re": "Gói tin đó sẽ được gửi lại bởi bên gửi"
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ MAC trùng lặp:",
    "re": "Thiết bị đó sẽ gặp vấn đề trong việc giao tiếp trên mạng"
  },
  {
    "con": "Khi một router nhận được gói tin, nếu không có bảng định tuyến phù hợp:",
    "re": "Gói tin đó sẽ bị loại bỏ"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation):",
    "re": "Nó cho phép nhiều thiết bị trong mạng nội bộ sử dụng một địa chỉ IP công cộng"
  },
  {
    "con": "Khi một thiết bị gửi gói tin đến một địa chỉ IP không hợp lệ:",
    "re": "Gói tin đó sẽ không đến được đích"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP:",
    "re": "Nó sẽ không đảm bảo việc truyền tải gói tin"
  },
  {
    "con": "Khi một máy chủ DNS không thể phân giải tên miền:",
    "re": "Máy khách sẽ không thể truy cập vào tài nguyên tương ứng"
  },
  {
    "con": "Trong địa chỉ IP, có 5 lớp A, B, C, D, E. Lớp B là lớp có dãy địa chỉ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một gói tin được gửi từ máy tính A đến máy tính B qua mạng, nếu gói tin không đến được đích do lỗi mạng:",
    "re": "Gói tin sẽ bị mất và không được nhận bởi máy tính B"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức TCP để truyền dữ liệu:",
    "re": "Dữ liệu sẽ được truyền một cách đáng tin cậy và có kiểm soát lỗi"
  },
  {
    "con": "Khi một máy chủ DNS nhận yêu cầu phân giải tên miền:",
    "re": "Nó sẽ tìm kiếm trong cơ sở dữ liệu của mình để trả về địa chỉ IP tương ứng"
  },
  {
    "con": "Nếu một mạng sử dụng địa chỉ IP tĩnh cho các thiết bị:",
    "re": "Các thiết bị sẽ luôn có cùng một địa chỉ IP mỗi khi chúng kết nối vào mạng"
  },
  {
    "con": "Khi một gói tin được mã hóa trước khi gửi qua mạng:",
    "re": "Nội dung của gói tin sẽ được bảo vệ khỏi việc bị đọc bởi các bên không được phép"
  },
  {
    "con": "Nếu một router nhận được gói tin mà không biết cách định tuyến đến đích:",
    "re": "Router sẽ bỏ gói tin đó hoặc gửi nó đến một router khác để tìm đường"
  },
  {
    "con": "Khi một mạng sử dụng giao thức UDP để truyền dữ liệu:",
    "re": "Dữ liệu có thể được gửi nhanh chóng nhưng không đảm bảo độ tin cậy"
  },
  {
    "con": "Nếu một thiết bị mạng bị tấn công từ chối dịch vụ (DoS):",
    "re": "Thiết bị đó sẽ không thể phục vụ các yêu cầu hợp lệ từ người dùng khác"
  },
  {
    "con": "Khi một mạng sử dụng NAT (Network Address Translation):",
    "re": "Nó cho phép nhiều thiết bị trong mạng nội bộ chia sẻ một địa chỉ IP công cộng"
  },
  {
    "con": "Trong địa chỉ IP, có 5 lớp tất cả : A, B, C, D, E. Lớp C là lớp có dãy địa chỉ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì nó sẽ được gửi lại theo giao thức TCP.",
    "re": "Giao thức TCP đảm bảo độ tin cậy trong việc truyền tải dữ liệu."
  },
  {
    "con": "Nếu một thiết bị mạng không có địa chỉ IP, thì nó không thể giao tiếp trên mạng Internet.",
    "re": "Địa chỉ IP là cần thiết để xác định thiết bị trong mạng."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP, thì địa chỉ IP sẽ được cấp phát tự động cho các thiết bị.",
    "re": "Giao thức DHCP giúp quản lý địa chỉ IP hiệu quả."
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải, thì giao thức UDP sẽ không thực hiện việc gửi lại.",
    "re": "Giao thức UDP không đảm bảo độ tin cậy trong việc truyền tải dữ liệu."
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch, thì nó sẽ giảm thiểu độ trễ trong việc truyền tải dữ liệu.",
    "re": "Switch hoạt động ở lớp 2 của mô hình OSI và tối ưu hóa băng thông."
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng NAT, thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng.",
    "re": "NAT giúp tiết kiệm địa chỉ IP và bảo mật mạng."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức SSL/TLS, thì dữ liệu sẽ được mã hóa trong quá trình truyền tải.",
    "re": "SSL/TLS cung cấp bảo mật cho dữ liệu trên mạng."
  },
  {
    "con": "Nếu một thiết bị mạng không được cấu hình đúng, thì nó có thể gây ra xung đột địa chỉ IP.",
    "re": "Xung đột địa chỉ IP sẽ làm gián đoạn kết nối mạng."
  },
  {
    "con": "Nếu một mạng sử dụng mô hình OSI, thì nó sẽ có 7 lớp từ vật lý đến ứng dụng.",
    "re": "Mô hình OSI giúp chuẩn hóa giao tiếp mạng."
  },
  {
    "con": "Lớp C được phép mượn tối đa bao nhiêu bit cho Subnet :",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích sau một khoảng thời gian nhất định :",
    "re": "Gói tin đó sẽ bị loại bỏ và có thể được gửi lại nếu cần"
  },
  {
    "con": "Nếu một địa chỉ IP thuộc lớp A :",
    "re": "Địa chỉ đó sẽ có mặt nạ mạng mặc định là 255.0.0.0"
  },
  {
    "con": "Nếu một router nhận được gói tin với địa chỉ đích không nằm trong bảng định tuyến :",
    "re": "Router sẽ gửi gói tin đó đến địa chỉ mặc định (default gateway) nếu có"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP :",
    "re": "Giao thức này sẽ đảm bảo tính toàn vẹn và thứ tự của dữ liệu"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng địa chỉ MAC :",
    "re": "Thiết bị đó có thể giao tiếp với các thiết bị khác trong cùng một mạng LAN"
  },
  {
    "con": "Nếu một gói tin được gửi qua mạng không có địa chỉ IP đích hợp lệ :",
    "re": "Gói tin đó sẽ không thể đến được đích và sẽ bị loại bỏ"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP :",
    "re": "Giao thức này sẽ không đảm bảo tính toàn vẹn và thứ tự của dữ liệu"
  },
  {
    "con": "Nếu một thiết bị được cấu hình với DHCP :",
    "re": "Thiết bị đó sẽ tự động nhận địa chỉ IP từ máy chủ DHCP"
  },
  {
    "con": "Nếu một mạng có nhiều subnet :",
    "re": "Mỗi subnet sẽ cần một router hoặc một thiết bị định tuyến để giao tiếp với nhau"
  },
  {
    "con": "Byte đầu tiên của một địa chỉ IP có dạng: 00000010. Vậy nó thuộc lớp nào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích do lỗi mạng, thì nó sẽ được gửi lại:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một địa chỉ IP thuộc dải 192.168.0.0/16, thì nó là địa chỉ IP riêng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức TCP, thì nó đảm bảo độ tin cậy trong truyền tải dữ liệu:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin có địa chỉ MAC đích không tồn tại trong mạng, thì gói tin sẽ bị loại bỏ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP, thì địa chỉ IP sẽ được cấp phát động cho các thiết bị:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức UDP, thì nó không đảm bảo thứ tự gói tin:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một router nhận được gói tin với địa chỉ đích không nằm trong bảng định tuyến, thì nó sẽ gửi gói tin đến gateway mặc định:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức HTTPS, thì dữ liệu sẽ được mã hóa trong quá trình truyền tải:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một mạng lớp C cần chia thành 9 mạng con sử dụng Subnet Mask nào sau đây :",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một địa chỉ IP thuộc lớp A có giá trị đầu tiên từ 1 đến 126 :",
    "re": "Địa chỉ IP đó có thể được sử dụng cho mạng lớn"
  },
  {
    "con": "Nếu một gói tin không đến được đích sau một khoảng thời gian nhất định :",
    "re": "Gói tin đó sẽ bị loại bỏ và có thể gửi lại"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức TCP :",
    "re": "Thiết bị đó sẽ đảm bảo việc truyền dữ liệu đáng tin cậy"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation) :",
    "re": "Nó có thể tiết kiệm địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một thiết bị mạng không nhận được địa chỉ IP từ DHCP :",
    "re": "Thiết bị đó sẽ không thể kết nối với mạng"
  },
  {
    "con": "Nếu một mạng sử dụng VLAN (Virtual Local Area Network) :",
    "re": "Nó có thể phân chia mạng thành các nhóm logic khác nhau"
  },
  {
    "con": "Nếu một gói tin được gửi qua mạng không có địa chỉ đích hợp lệ :",
    "re": "Gói tin đó sẽ không được chuyển tiếp"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP :",
    "re": "Dữ liệu có thể được truyền nhanh hơn nhưng không đảm bảo độ tin cậy"
  },
  {
    "con": "Nếu một thiết bị mạng bị tắt chế độ bảo mật :",
    "re": "Nó có thể dễ dàng bị tấn công từ bên ngoài"
  },
  {
    "con": "Lệnh nào dưới đây được dùng để xác định đường truyền trong hệ điều hành Windows:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một địa chỉ IP tĩnh được cấu hình cho một thiết bị mạng:",
    "re": "Thiết bị đó sẽ luôn có cùng một địa chỉ IP mỗi khi khởi động"
  },
  {
    "con": "Khi một gói tin không thể đến đích do lỗi mạng:",
    "re": "Gói tin đó sẽ bị mất và không được gửi lại"
  },
  {
    "con": "Khi sử dụng giao thức TCP:",
    "re": "Dữ liệu sẽ được truyền theo cách đáng tin cậy và có thứ tự"
  },
  {
    "con": "Khi một thiết bị mạng sử dụng NAT (Network Address Translation):",
    "re": "Nó có thể chia sẻ một địa chỉ IP công cộng cho nhiều thiết bị trong mạng nội bộ"
  },
  {
    "con": "Khi một mạng sử dụng mô hình OSI:",
    "re": "Mỗi lớp sẽ thực hiện một chức năng cụ thể và giao tiếp với các lớp liền kề"
  },
  {
    "con": "Khi một thiết bị mạng bị tắt nguồn:",
    "re": "Tất cả các kết nối mạng của thiết bị đó sẽ bị ngắt"
  },
  {
    "con": "Khi sử dụng giao thức UDP:",
    "re": "Dữ liệu có thể được gửi mà không cần xác nhận từ bên nhận"
  },
  {
    "con": "Khi một mạng sử dụng VLAN (Virtual Local Area Network):",
    "re": "Nó có thể phân chia một mạng vật lý thành nhiều mạng logic khác nhau"
  },
  {
    "con": "Khi một thiết bị mạng nhận được một gói tin không hợp lệ:",
    "re": "Thiết bị đó sẽ loại bỏ gói tin và không xử lý nó"
  },
  {
    "con": "Tầng hai trong mô hình OSI tách luồng bit từ Tầng vật lý chuyển lên thành:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một địa chỉ IP tĩnh được cấu hình cho một thiết bị mạng:",
    "re": "Thiết bị đó sẽ luôn có cùng một địa chỉ IP mỗi khi nó kết nối vào mạng"
  },
  {
    "con": "Khi một gói tin được gửi từ một máy tính đến một máy chủ qua Internet:",
    "re": "Gói tin đó sẽ đi qua nhiều router và switch trước khi đến đích"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP:",
    "re": "Dữ liệu sẽ được truyền theo cách đáng tin cậy và có kiểm soát lỗi"
  },
  {
    "con": "Khi một thiết bị mạng sử dụng NAT (Network Address Translation):",
    "re": "Nó có thể chia sẻ một địa chỉ IP công cộng cho nhiều thiết bị trong mạng nội bộ"
  },
  {
    "con": "Nếu một mạng không dây sử dụng WPA2 để bảo mật:",
    "re": "Mạng đó sẽ có mức độ bảo mật cao hơn so với các giao thức bảo mật cũ hơn như WEP"
  },
  {
    "con": "Khi một máy chủ DNS nhận yêu cầu phân giải tên miền:",
    "re": "Nó sẽ trả về địa chỉ IP tương ứng với tên miền đó"
  },
  {
    "con": "Nếu một mạng sử dụng mô hình client-server:",
    "re": "Các client sẽ gửi yêu cầu đến server và nhận phản hồi từ server"
  },
  {
    "con": "Khi một thiết bị mạng bị tấn công DDoS (Distributed Denial of Service):",
    "re": "Nó sẽ gặp khó khăn trong việc xử lý lưu lượng truy cập hợp lệ do bị quá tải"
  },
  {
    "con": "Nếu một giao thức mạng sử dụng UDP:",
    "re": "Dữ liệu sẽ được truyền nhanh hơn nhưng không đảm bảo độ tin cậy"
  },
  {
    "con": "Phương pháp nào dùng để ngăn chặn các thâm nhập trái phép (theo danh sách truy nhập xác định trước) và có thể lọc bỏ các gói tin:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị mạng không có địa chỉ IP hợp lệ:",
    "re": "Nó sẽ không thể giao tiếp với các thiết bị khác trên mạng"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải:",
    "re": "Giao thức TCP sẽ yêu cầu gửi lại gói tin đó"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation):",
    "re": "Nó có thể cho phép nhiều thiết bị sử dụng một địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch thay vì hub:",
    "re": "Hiệu suất mạng sẽ được cải thiện do giảm thiểu va chạm dữ liệu"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức DHCP:",
    "re": "Nó sẽ tự động nhận địa chỉ IP và thông tin cấu hình từ máy chủ DHCP"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức SSL/TLS:",
    "re": "Dữ liệu truyền tải sẽ được mã hóa để bảo mật thông tin"
  },
  {
    "con": "Nếu một mạng có nhiều router kết nối với nhau:",
    "re": "Nó có thể tạo ra các đường dẫn dự phòng để đảm bảo tính khả dụng"
  },
  {
    "con": "Nếu một thiết bị mạng bị tấn công DDoS (Distributed Denial of Service):",
    "re": "Nó có thể bị ngừng hoạt động do quá tải lưu lượng truy cập"
  },
  {
    "con": "Nếu một mạng sử dụng mô hình OSI:",
    "re": "Nó sẽ giúp chuẩn hóa các giao thức và thiết bị mạng để dễ dàng tương tác"
  },
  {
    "con": "Mạng LAN thường sử dụng công nghệ nào để kết nối các thiết bị:",
    "re": "Câu trả lời đúng là Ethernet"
  },
  {
    "con": "Nếu một gói tin không đến được đích trong mạng,",
    "re": "thì nó có thể bị mất hoặc bị lỗi trong quá trình truyền tải"
  },
  {
    "con": "Địa chỉ IP phiên bản 4 (IPv4) có bao nhiêu bit:",
    "re": "Câu trả lời đúng là 32 bit"
  },
  {
    "con": "Nếu một router không có bảng định tuyến,",
    "re": "thì nó không thể chuyển tiếp gói tin đến đích"
  },
  {
    "con": "Mạng WAN thường được sử dụng để kết nối:",
    "re": "các mạng LAN ở khoảng cách xa nhau"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức TCP,",
    "re": "thì nó đảm bảo việc truyền tải dữ liệu đáng tin cậy"
  },
  {
    "con": "Địa chỉ MAC là gì:",
    "re": "Câu trả lời đúng là địa chỉ vật lý của thiết bị trong mạng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP,",
    "re": "thì nó không đảm bảo việc truyền tải dữ liệu đáng tin cậy"
  },
  {
    "con": "Nếu một switch hoạt động ở lớp 2 của mô hình OSI,",
    "re": "thì nó sử dụng địa chỉ MAC để chuyển tiếp gói tin"
  },
  {
    "con": "Mạng không dây thường sử dụng chuẩn nào để truyền dữ liệu:",
    "re": "Câu trả lời đúng là Wi-Fi (802.11)"
  },
  {
    "con": "Để có một kiến trúc mạng chung tương thích giữa các mạng, năm 1984 tổ chức Tiêu chuẩn thế giới đã công bố một mô hình mạng, đó là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một gói dữ liệu được gửi từ nguồn đến đích qua mạng, nó sẽ được chia thành nhiều gói nhỏ hơn để dễ dàng truyền tải hơn,",
    "re": "thì quá trình này được gọi là phân mảnh gói."
  },
  {
    "con": "Nếu một thiết bị mạng không nhận được gói dữ liệu trong thời gian quy định,",
    "re": "thì nó sẽ gửi một thông báo yêu cầu gửi lại gói dữ liệu đó."
  },
  {
    "con": "Khi một mạng sử dụng giao thức TCP/IP,",
    "re": "thì nó sẽ đảm bảo tính toàn vẹn và độ tin cậy của dữ liệu truyền tải."
  },
  {
    "con": "Nếu một mạng có nhiều thiết bị kết nối,",
    "re": "thì việc sử dụng switch sẽ giúp tối ưu hóa băng thông và giảm thiểu va chạm dữ liệu."
  },
  {
    "con": "Khi một địa chỉ IP được phân bổ cho một thiết bị trong mạng,",
    "re": "thì thiết bị đó có thể giao tiếp với các thiết bị khác trong cùng mạng hoặc trên Internet."
  },
  {
    "con": "Nếu một mạng sử dụng mô hình client-server,",
    "re": "thì các client sẽ gửi yêu cầu đến server và nhận phản hồi từ server."
  },
  {
    "con": "Khi một mạng không dây sử dụng chuẩn 802.11,",
    "re": "thì nó sẽ cho phép các thiết bị kết nối mà không cần dây cáp."
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation),",
    "re": "thì nó sẽ cho phép nhiều thiết bị trong mạng nội bộ sử dụng một địa chỉ IP công cộng."
  },
  {
    "con": "Khi một mạng sử dụng giao thức UDP,",
    "re": "thì nó sẽ không đảm bảo tính toàn vẹn của dữ liệu nhưng có tốc độ truyền tải nhanh hơn."
  },
  {
    "con": "Dịch vụ nào cho phép người sử dụng từ một trạm làm việc của mình có thể đăng nhập vào một trạm ở xa qua mạng và có thể làm việc với hệ thống:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng LAN sử dụng giao thức Ethernet để truyền dữ liệu:",
    "re": "Dữ liệu được truyền tải với tốc độ cao và độ trễ thấp"
  },
  {
    "con": "Khi một gói tin bị mất trong quá trình truyền tải qua mạng:",
    "re": "Giao thức TCP sẽ yêu cầu gửi lại gói tin đó"
  },
  {
    "con": "Nếu một thiết bị mạng không có địa chỉ IP hợp lệ:",
    "re": "Thiết bị đó sẽ không thể giao tiếp với các thiết bị khác trên mạng"
  },
  {
    "con": "Khi sử dụng NAT (Network Address Translation):",
    "re": "Nhiều thiết bị trong mạng nội bộ có thể chia sẻ một địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức IPv6:",
    "re": "Mạng đó có khả năng hỗ trợ một lượng lớn địa chỉ IP hơn so với IPv4"
  },
  {
    "con": "Khi một máy chủ DNS nhận yêu cầu phân giải tên miền:",
    "re": "Máy chủ sẽ trả về địa chỉ IP tương ứng với tên miền đó"
  },
  {
    "con": "Nếu một mạng sử dụng mô hình OSI:",
    "re": "Các giao thức mạng sẽ được phân chia thành 7 lớp khác nhau"
  },
  {
    "con": "Khi một thiết bị mạng bị tấn công DDoS (Distributed Denial of Service):",
    "re": "Thiết bị đó sẽ gặp khó khăn trong việc xử lý các yêu cầu hợp lệ từ người dùng"
  },
  {
    "con": "Nếu một mạng không dây sử dụng WPA2 để bảo mật:",
    "re": "Mạng đó sẽ có mức độ bảo mật cao hơn so với WEP"
  },
  {
    "con": "Dịch vụ nào cho phép chuyển các file từ trạm này sang trạm khác, bất kể yếu tố địa lý hay hệ điều hành sử dụng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị mạng không nhận được địa chỉ IP hợp lệ từ DHCP:",
    "re": "Thiết bị đó sẽ không thể kết nối với mạng."
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải:",
    "re": "Gói tin đó sẽ không đến đích và có thể yêu cầu retransmission."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP:",
    "re": "Dữ liệu sẽ được truyền tải một cách đáng tin cậy và theo thứ tự."
  },
  {
    "con": "Nếu một router không có bảng định tuyến chính xác:",
    "re": "Nó sẽ không thể chuyển tiếp gói tin đến đích đúng cách."
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch thay vì hub:",
    "re": "Hiệu suất mạng sẽ được cải thiện do giảm thiểu va chạm."
  },
  {
    "con": "Nếu một thiết bị mạng bị tấn công DDoS:",
    "re": "Nó sẽ gặp khó khăn trong việc cung cấp dịch vụ cho người dùng hợp pháp."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức IP phiên bản 6 (IPv6):",
    "re": "Nó sẽ có khả năng hỗ trợ nhiều địa chỉ IP hơn so với IPv4."
  },
  {
    "con": "Nếu một mạng không được bảo mật đúng cách:",
    "re": "Nó sẽ dễ bị tấn công và rò rỉ thông tin."
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng NAT (Network Address Translation):",
    "re": "Nó có thể cho phép nhiều thiết bị trong mạng nội bộ chia sẻ một địa chỉ IP công cộng."
  },
  {
    "con": "Phương thức nào mà trong đó cả hai bên đều có thể đồng thời gửi dữ liệu đi:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng sử dụng giao thức TCP để truyền dữ liệu:",
    "re": "Dữ liệu sẽ được truyền một cách đáng tin cậy và theo thứ tự"
  },
  {
    "con": "Mạng sử dụng giao thức UDP để truyền dữ liệu:",
    "re": "Dữ liệu có thể bị mất hoặc không theo thứ tự"
  },
  {
    "con": "Một địa chỉ IP tĩnh được cấu hình cho một thiết bị:",
    "re": "Thiết bị đó sẽ luôn có cùng một địa chỉ IP mỗi khi kết nối vào mạng"
  },
  {
    "con": "Một router nhận được gói tin với địa chỉ đích không nằm trong bảng định tuyến:",
    "re": "Router sẽ không biết cách chuyển tiếp gói tin đó"
  },
  {
    "con": "Mạng LAN sử dụng switch để kết nối các thiết bị:",
    "re": "Dữ liệu sẽ được chuyển tiếp chỉ đến thiết bị đích mà không làm tắc nghẽn mạng"
  },
  {
    "con": "Mạng WAN kết nối các mạng LAN ở khoảng cách xa:",
    "re": "Cho phép truyền dữ liệu giữa các địa điểm địa lý khác nhau"
  },
  {
    "con": "Sử dụng NAT (Network Address Translation) trong mạng:",
    "re": "Cho phép nhiều thiết bị trong mạng nội bộ sử dụng một địa chỉ IP công cộng"
  },
  {
    "con": "Mạng không dây sử dụng chuẩn 802.11:",
    "re": "Cho phép các thiết bị kết nối mà không cần dây cáp"
  },
  {
    "con": "Một firewall được cấu hình để chặn tất cả lưu lượng đến từ một địa chỉ IP cụ thể:",
    "re": "Lưu lượng từ địa chỉ IP đó sẽ không thể truy cập vào mạng"
  },
  {
    "con": "Địa chỉ Subnet của một IP nằm từ bit thứ 9 tới bit thứ 23. Vậy địa chỉ IP của nó thuộc lớp nào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không thể đến đích do lỗi mạng, thì gói tin đó sẽ bị mất.",
    "re": "Gói tin không được gửi lại"
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ IP trùng lặp với thiết bị khác, thì sẽ xảy ra xung đột địa chỉ IP.",
    "re": "Thiết bị sẽ không thể kết nối vào mạng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì dữ liệu sẽ được truyền theo cách có kết nối và đảm bảo độ tin cậy.",
    "re": "Dữ liệu sẽ được kiểm tra và xác nhận"
  },
  {
    "con": "Nếu một gói tin được gửi từ một địa chỉ IP đến một địa chỉ IP khác trong cùng một mạng con, thì nó sẽ không cần phải đi qua router.",
    "re": "Gói tin sẽ được xử lý trực tiếp bởi switch"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức DHCP, thì nó sẽ tự động nhận địa chỉ IP từ máy chủ DHCP.",
    "re": "Thiết bị sẽ không cần cấu hình địa chỉ IP thủ công"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation), thì địa chỉ IP riêng sẽ được chuyển đổi thành địa chỉ IP công cộng.",
    "re": "Thiết bị trong mạng riêng có thể truy cập Internet"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải, thì giao thức UDP sẽ không thực hiện việc gửi lại gói tin đó.",
    "re": "Dữ liệu có thể bị mất mà không có thông báo"
  },
  {
    "con": "Nếu một mạng sử dụng VLAN (Virtual Local Area Network), thì các thiết bị trong VLAN khác nhau sẽ không thể giao tiếp trực tiếp với nhau.",
    "re": "Cần có router để kết nối giữa các VLAN"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức SSL/TLS, thì dữ liệu được truyền sẽ được mã hóa để bảo mật.",
    "re": "Dữ liệu sẽ an toàn hơn khi truyền qua mạng"
  },
  {
    "con": "Cáp sợi quang (Fibre Optic) thường được sử dụng để",
    "re": "truyền tải dữ liệu với tốc độ cao và khoảng cách xa hơn so với cáp đồng."
  },
  {
    "con": "Mạng LAN (Local Area Network) thường được sử dụng để",
    "re": "kết nối các thiết bị trong một khu vực địa lý nhỏ như văn phòng hoặc trường học."
  },
  {
    "con": "Giao thức TCP (Transmission Control Protocol) được sử dụng để",
    "re": "đảm bảo việc truyền tải dữ liệu đáng tin cậy giữa các thiết bị trong mạng."
  },
  {
    "con": "Mạng WAN (Wide Area Network) thường được sử dụng để",
    "re": "kết nối các mạng LAN ở các vị trí địa lý khác nhau."
  },
  {
    "con": "Địa chỉ IP tĩnh thường được sử dụng để",
    "re": "cung cấp một địa chỉ cố định cho các thiết bị trong mạng, giúp dễ dàng quản lý và truy cập."
  },
  {
    "con": "Router thường được sử dụng để",
    "re": "chuyển tiếp dữ liệu giữa các mạng khác nhau và định tuyến lưu lượng mạng."
  },
  {
    "con": "Mạng không dây (Wireless Network) thường được sử dụng để",
    "re": "cung cấp kết nối Internet cho các thiết bị di động mà không cần cáp."
  },
  {
    "con": "Firewall thường được sử dụng để",
    "re": "bảo vệ mạng khỏi các truy cập trái phép và các mối đe dọa từ bên ngoài."
  },
  {
    "con": "Mạng VPN (Virtual Private Network) thường được sử dụng để",
    "re": "tạo ra một kết nối an toàn và riêng tư qua Internet."
  },
  {
    "con": "Mô hình OSI (Open Systems Interconnection) được sử dụng để",
    "re": "cung cấp một khung tham chiếu cho việc thiết kế và triển khai mạng máy tính."
  },
  {
    "con": "Các giao thức TCP và UDP đều thuộc lớp Transport trong mô hình OSI.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một địa chỉ IP tĩnh không thay đổi theo thời gian.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một gói tin bị mất trong mạng, giao thức TCP sẽ tự động yêu cầu gửi lại gói tin đó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng LAN thường có tốc độ truyền dữ liệu cao hơn mạng WAN.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Giao thức HTTP không mã hóa dữ liệu khi truyền tải.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mỗi thiết bị trong mạng cần có một địa chỉ MAC duy nhất để nhận diện.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Router có khả năng định tuyến gói tin giữa các mạng khác nhau.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng không dây thường dễ bị tấn công hơn so với mạng có dây.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Giao thức FTP được sử dụng để truyền tải tệp tin giữa máy chủ và máy khách.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng VPN cho phép người dùng kết nối an toàn đến mạng riêng qua Internet.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hãy chỉ ra địa chỉ IP của host không hợp lệ với Subnet Mask = 255.255.255.224",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một gói tin không có địa chỉ MAC đích hợp lệ",
    "re": "Gói tin sẽ không được gửi đi"
  },
  {
    "con": "Nếu một thiết bị trong mạng không có địa chỉ IP",
    "re": "Thiết bị đó sẽ không thể giao tiếp với các thiết bị khác trong mạng"
  },
  {
    "con": "Khi một router nhận được gói tin với địa chỉ đích không nằm trong bảng định tuyến",
    "re": "Router sẽ không biết cách chuyển tiếp gói tin đó"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP",
    "re": "Dữ liệu sẽ được truyền tải một cách đáng tin cậy và có thứ tự"
  },
  {
    "con": "Khi một thiết bị gửi gói tin ARP để tìm địa chỉ MAC của một địa chỉ IP",
    "re": "Thiết bị sẽ nhận được phản hồi từ thiết bị có địa chỉ IP tương ứng"
  },
  {
    "con": "Nếu một mạng sử dụng Subnetting",
    "re": "Mạng sẽ được chia thành các phân đoạn nhỏ hơn, giúp quản lý hiệu quả hơn"
  },
  {
    "con": "Khi một switch nhận được gói tin mà không có địa chỉ MAC trong bảng MAC",
    "re": "Switch sẽ phát gói tin ra tất cả các cổng trừ cổng nhận gói tin"
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức UDP",
    "re": "Dữ liệu có thể bị mất hoặc đến không theo thứ tự"
  },
  {
    "con": "Khi một firewall chặn một gói tin",
    "re": "Gói tin đó sẽ không được phép đi qua mạng"
  },
  {
    "con": "Chương trình Telnet cho phép:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng sử dụng giao thức TCP:",
    "re": "Dữ liệu được truyền tải một cách đáng tin cậy"
  },
  {
    "con": "Một địa chỉ IP không hợp lệ:",
    "re": "Không thể kết nối đến thiết bị mạng"
  },
  {
    "con": "Sử dụng NAT (Network Address Translation):",
    "re": "Giúp tiết kiệm địa chỉ IP công cộng"
  },
  {
    "con": "Giao thức DHCP được kích hoạt:",
    "re": "Thiết bị sẽ tự động nhận địa chỉ IP"
  },
  {
    "con": "Mạng LAN sử dụng switch:",
    "re": "Tăng cường hiệu suất và giảm độ trễ"
  },
  {
    "con": "Giao thức HTTPS được sử dụng:",
    "re": "Dữ liệu được mã hóa khi truyền tải"
  },
  {
    "con": "Sử dụng VPN (Virtual Private Network):",
    "re": "Bảo mật kết nối Internet và ẩn địa chỉ IP"
  },
  {
    "con": "Mạng không dây sử dụng chuẩn 802.11:",
    "re": "Cung cấp kết nối Internet không dây cho thiết bị"
  },
  {
    "con": "Firewall được cấu hình đúng:",
    "re": "Ngăn chặn các truy cập trái phép vào mạng"
  },
  {
    "con": "Có một mạng sử dụng địa chỉ Class B, bạn muốn chia mạng con với mỗi Subnet có tối đa là 500 host, như vậy phải dùng Subnet Mask:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không thể đến đích do lỗi địa chỉ IP, thì gói tin đó sẽ bị loại bỏ và không được chuyển tiếp.",
    "re": "Gói tin sẽ không đến được đích"
  },
  {
    "con": "Nếu bạn sử dụng giao thức TCP, thì dữ liệu sẽ được truyền theo cách có kết nối và đảm bảo độ tin cậy.",
    "re": "Dữ liệu sẽ được đảm bảo không bị mất mát"
  },
  {
    "con": "Nếu một mạng LAN sử dụng Switch, thì băng thông mạng sẽ được tối ưu hóa hơn so với việc sử dụng Hub.",
    "re": "Tăng hiệu suất truyền tải dữ liệu"
  },
  {
    "con": "Nếu bạn cấu hình NAT trên router, thì các thiết bị trong mạng nội bộ sẽ có thể truy cập Internet thông qua một địa chỉ IP công cộng.",
    "re": "Giúp tiết kiệm địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một gói tin được gửi từ một mạng khác đến mạng của bạn mà không có địa chỉ MAC tương ứng, thì gói tin sẽ không được xử lý.",
    "re": "Gói tin sẽ bị loại bỏ"
  },
  {
    "con": "Nếu bạn sử dụng giao thức UDP, thì dữ liệu sẽ được truyền theo cách không có kết nối và không đảm bảo độ tin cậy.",
    "re": "Có thể xảy ra mất mát dữ liệu"
  },
  {
    "con": "Nếu bạn cấu hình VLAN trên Switch, thì bạn có thể phân chia mạng thành các mạng con logic mà không cần thay đổi phần cứng.",
    "re": "Tăng cường bảo mật và quản lý mạng"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng địa chỉ IP tĩnh, thì địa chỉ đó sẽ không thay đổi theo thời gian.",
    "re": "Giúp dễ dàng quản lý và truy cập thiết bị"
  },
  {
    "con": "Nếu bạn sử dụng giao thức DHCP, thì địa chỉ IP sẽ được cấp phát tự động cho các thiết bị trong mạng.",
    "re": "Giảm thiểu công sức quản lý địa chỉ IP"
  },
  {
    "con": "Một nút mạng có thông số về địa chỉ IP như sau: 194.12.2.179   255.255.255.240. Xác định số hiệu của Subnet mà host này thuộc vào và host number của nút mạng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin được gửi từ một máy tính đến một máy chủ qua Internet mà không có địa chỉ IP đích hợp lệ:",
    "re": "Gói tin sẽ không đến được máy chủ đích"
  },
  {
    "con": "Nếu một router nhận được gói tin mà không có thông tin về đường đi đến địa chỉ đích trong bảng định tuyến:",
    "re": "Router sẽ bỏ gói tin đó"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP để truyền dữ liệu:",
    "re": "Dữ liệu sẽ được truyền một cách đáng tin cậy và có thứ tự"
  },
  {
    "con": "Nếu một máy tính trong mạng LAN có địa chỉ IP trùng với một máy tính khác:",
    "re": "Sẽ xảy ra xung đột địa chỉ IP"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải qua mạng:",
    "re": "Giao thức TCP sẽ yêu cầu gửi lại gói tin đó"
  },
  {
    "con": "Nếu một máy chủ DNS không thể phân giải tên miền thành địa chỉ IP:",
    "re": "Máy khách sẽ không thể kết nối đến máy chủ tương ứng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP để truyền dữ liệu:",
    "re": "Dữ liệu có thể bị mất và không đảm bảo thứ tự"
  },
  {
    "con": "Nếu một thiết bị mạng không được cấu hình đúng địa chỉ IP và subnet mask:",
    "re": "Thiết bị sẽ không thể giao tiếp với các thiết bị khác trong cùng mạng"
  },
  {
    "con": "Nếu một firewall chặn một cổng mà một ứng dụng cần sử dụng:",
    "re": "Ứng dụng sẽ không thể nhận hoặc gửi dữ liệu qua cổng đó"
  },
  {
    "con": "Một network có địa chỉ thuộc Class B và sử dụng Subnet Mask là 255.255.252.0, như vậy có thể chia thành bao nhiêu Subnet?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một router không có bảng định tuyến, thì nó sẽ không thể chuyển tiếp gói tin đến đích.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một địa chỉ IP thuộc Class C, thì nó có thể hỗ trợ tối đa 254 host trong một subnet.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì nó sẽ đảm bảo việc truyền dữ liệu đáng tin cậy.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải qua mạng, thì giao thức UDP sẽ không thực hiện việc truyền lại gói tin đó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một địa chỉ IP là 192.168.1.1, thì nó thuộc về dải địa chỉ IP riêng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một switch hoạt động ở Layer 2 của mô hình OSI, thì nó sẽ sử dụng địa chỉ MAC để chuyển tiếp gói tin.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation), thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng LAN sử dụng giao thức Ethernet, thì nó sẽ sử dụng khung dữ liệu (frame) để truyền tải thông tin.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ IP tĩnh, thì địa chỉ này sẽ không thay đổi theo thời gian.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một network có địa chỉ thuộc Class C và sử dụng Subnet Mask là 255.255.255.252. Hỏi có bao nhiêu host trên một Subnet?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một router nhận được gói tin với địa chỉ đích không thuộc mạng của nó và không có route mặc định.",
    "re": "Gói tin sẽ bị loại bỏ"
  },
  {
    "con": "Một máy tính trong mạng LAN sử dụng địa chỉ IP tĩnh và không có DHCP server.",
    "re": "Máy tính sẽ không nhận được địa chỉ IP tự động"
  },
  {
    "con": "Một mạng sử dụng giao thức TCP và có kết nối ổn định.",
    "re": "Dữ liệu sẽ được truyền tải một cách đáng tin cậy"
  },
  {
    "con": "Một gói tin IP có TTL bằng 0 khi đến router.",
    "re": "Gói tin sẽ bị loại bỏ và không được chuyển tiếp"
  },
  {
    "con": "Một mạng sử dụng NAT và có nhiều máy tính nội bộ truy cập Internet.",
    "re": "Tất cả máy tính sẽ chia sẻ một địa chỉ IP công cộng"
  },
  {
    "con": "Một switch nhận được gói tin từ một port mà không biết địa chỉ MAC đích.",
    "re": "Switch sẽ phát gói tin đến tất cả các port khác"
  },
  {
    "con": "Một mạng sử dụng giao thức UDP để truyền tải video trực tuyến.",
    "re": "Dữ liệu có thể bị mất nhưng sẽ không có sự điều chỉnh lại"
  },
  {
    "con": "Một máy chủ DNS nhận yêu cầu phân giải tên miền.",
    "re": "Máy chủ sẽ trả về địa chỉ IP tương ứng với tên miền đó"
  },
  {
    "con": "Một mạng không dây sử dụng WPA2 để bảo mật.",
    "re": "Mạng sẽ được bảo vệ tốt hơn so với WEP"
  },
  {
    "con": "Chức năng chính của tầng Presentation là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng sử dụng giao thức TCP/IP để truyền dữ liệu:",
    "re": "Dữ liệu sẽ được chia thành các gói tin và gửi đến đích một cách đáng tin cậy"
  },
  {
    "con": "Nếu một thiết bị trong mạng không có địa chỉ IP hợp lệ:",
    "re": "Thiết bị đó sẽ không thể giao tiếp với các thiết bị khác trong mạng"
  },
  {
    "con": "Khi một gói tin bị mất trong quá trình truyền tải:",
    "re": "Giao thức TCP sẽ yêu cầu gửi lại gói tin đó"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation):",
    "re": "Nhiều thiết bị có thể chia sẻ một địa chỉ IP công cộng"
  },
  {
    "con": "Khi một thiết bị gửi dữ liệu đến một địa chỉ MAC không tồn tại:",
    "re": "Dữ liệu sẽ không được gửi đi và sẽ bị bỏ qua"
  },
  {
    "con": "Nếu một mạng sử dụng mô hình OSI:",
    "re": "Các tầng sẽ tương tác với nhau theo thứ tự từ tầng ứng dụng xuống tầng vật lý"
  },
  {
    "con": "Khi một router nhận được gói tin:",
    "re": "Router sẽ kiểm tra địa chỉ đích và quyết định đường đi tiếp theo cho gói tin"
  },
  {
    "con": "Nếu một mạng có nhiều thiết bị kết nối cùng một lúc:",
    "re": "Sẽ cần sử dụng các phương pháp điều phối để tránh xung đột dữ liệu"
  },
  {
    "con": "Khi một thiết bị sử dụng giao thức UDP:",
    "re": "Dữ liệu sẽ được gửi đi mà không cần đảm bảo tính toàn vẹn hoặc thứ tự"
  },
  {
    "con": "Cho một nút mạng có địa chỉ IP là 217.65.82.153, Subnet Mask là 255.255.255.248. Hãy chỉ ra nút mạng thuộc cùng Subnet với nút này",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin được gửi từ máy tính A đến máy tính B trong cùng một mạng LAN, và không có router nào giữa chúng",
    "re": "Gói tin sẽ được truyền trực tiếp mà không cần định tuyến"
  },
  {
    "con": "Nếu một địa chỉ IP thuộc lớp A, có dạng 10.0.0.1",
    "re": "Subnet Mask mặc định sẽ là 255.0.0.0"
  },
  {
    "con": "Nếu một máy chủ DNS không thể phân giải tên miền, và không có bản ghi nào trong cache",
    "re": "Máy chủ sẽ gửi yêu cầu đến máy chủ DNS cấp cao hơn"
  },
  {
    "con": "Nếu một gói tin TCP được gửi với cờ SYN, và không nhận được cờ SYN-ACK từ máy chủ",
    "re": "Kết nối sẽ không được thiết lập"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP để cấp phát địa chỉ IP",
    "re": "Các thiết bị trong mạng sẽ tự động nhận địa chỉ IP mà không cần cấu hình thủ công"
  },
  {
    "con": "Nếu một router nhận được gói tin với địa chỉ đích không thuộc mạng của nó",
    "re": "Router sẽ chuyển tiếp gói tin đến router khác theo bảng định tuyến"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức ARP để tìm địa chỉ MAC tương ứng với địa chỉ IP",
    "re": "Thiết bị sẽ gửi một gói tin ARP Request đến toàn bộ mạng"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation)",
    "re": "Địa chỉ IP riêng sẽ được ánh xạ thành địa chỉ IP công cộng khi truy cập Internet"
  },
  {
    "con": "Nếu một gói tin UDP được gửi đến một cổng không mở trên máy chủ",
    "re": "Gói tin sẽ bị bỏ qua mà không có thông báo lỗi"
  },
  {
    "con": "Một mạng lớp B cần chia thành 9 mạng con, phải sử dụng Subnet Mask:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một địa chỉ IP thuộc lớp A, thì dải địa chỉ mạng có thể chứa tối đa 16 triệu địa chỉ host.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không thể đến đích, thì nó sẽ bị loại bỏ sau một khoảng thời gian nhất định.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì nó sẽ đảm bảo tính toàn vẹn của dữ liệu thông qua việc kiểm tra lỗi.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng địa chỉ MAC, thì nó sẽ hoạt động ở lớp liên kết dữ liệu của mô hình OSI.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation), thì nó cho phép nhiều thiết bị trong mạng nội bộ chia sẻ một địa chỉ IP công cộng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin được gửi qua mạng không có địa chỉ đích hợp lệ, thì nó sẽ không thể đến được máy nhận.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP, thì nó sẽ không đảm bảo việc truyền tải dữ liệu thành công.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một thiết bị mạng bị lỗi, thì nó có thể gây ra sự gián đoạn trong kết nối mạng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạng sử dụng VLAN (Virtual Local Area Network), thì nó cho phép phân chia mạng vật lý thành nhiều mạng logic khác nhau.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một mạng lớp C cần chia thành 5 mạng con, sử dụng Subnet Mask nào sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một địa chỉ IP thuộc lớp A có giá trị đầu tiên từ 1 đến 126,",
    "re": "địa chỉ IP đó có thể được sử dụng cho mạng lớn với nhiều máy chủ"
  },
  {
    "con": "Khi một gói tin không thể đến đích do lỗi mạng,",
    "re": "gói tin đó sẽ bị loại bỏ và không được gửi lại"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức TCP,",
    "re": "thì nó sẽ đảm bảo tính toàn vẹn của dữ liệu thông qua việc xác nhận"
  },
  {
    "con": "Khi sử dụng NAT (Network Address Translation),",
    "re": "các địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP,",
    "re": "thì các thiết bị trong mạng sẽ tự động nhận địa chỉ IP"
  },
  {
    "con": "Khi một gói tin được gửi từ một máy tính đến một máy chủ,",
    "re": "gói tin đó sẽ đi qua nhiều router và switch trong mạng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP,",
    "re": "thì nó sẽ không đảm bảo việc truyền tải dữ liệu thành công"
  },
  {
    "con": "Khi một thiết bị trong mạng bị tấn công DDoS,",
    "re": "thì nó sẽ bị quá tải và không thể phục vụ các yêu cầu hợp lệ"
  },
  {
    "con": "Nếu một mạng sử dụng VLAN (Virtual Local Area Network),",
    "re": "thì nó sẽ giúp phân chia mạng vật lý thành nhiều mạng logic"
  },
  {
    "con": "Một mạng lớp C cần chia thành 2 mạng con, sử dụng Subnet Mask nào sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một gói tin IP có TTL bằng 0 khi đến router,",
    "re": "gói tin sẽ bị loại bỏ và không được chuyển tiếp"
  },
  {
    "con": "Khi một thiết bị trong mạng sử dụng DHCP để lấy địa chỉ IP,",
    "re": "nó sẽ nhận được địa chỉ IP tạm thời từ máy chủ DHCP"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch,",
    "re": "thì băng thông sẽ được phân bổ hiệu quả hơn so với việc sử dụng hub"
  },
  {
    "con": "Khi một gói tin TCP được gửi đi,",
    "re": "nó sẽ được chia thành các segment và có header chứa thông tin điều khiển"
  },
  {
    "con": "Nếu một thiết bị không nhận được phản hồi từ một địa chỉ IP trong một khoảng thời gian nhất định,",
    "re": "nó sẽ coi địa chỉ đó là không khả dụng"
  },
  {
    "con": "Khi một mạng sử dụng NAT (Network Address Translation),",
    "re": "các địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một gói tin UDP bị mất trong quá trình truyền tải,",
    "re": "nó sẽ không được tự động gửi lại như trong TCP"
  },
  {
    "con": "Khi một thiết bị trong mạng sử dụng VLAN,",
    "re": "nó sẽ được phân chia thành các mạng logic khác nhau mặc dù vẫn sử dụng cùng một hạ tầng vật lý"
  },
  {
    "con": "Nếu một router không có bảng định tuyến cho một địa chỉ đích,",
    "re": "nó sẽ gửi gói tin đến địa chỉ mặc định (default gateway)"
  },
  {
    "con": "Một mạng con lớp A cần chứa tối thiểu 255 host, sử dụng Subnet Mask nào sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một gói tin được gửi từ một máy tính đến một máy chủ, nếu địa chỉ IP đích không hợp lệ,",
    "re": "gói tin sẽ không đến được đích"
  },
  {
    "con": "Nếu một router không có bảng định tuyến,",
    "re": "nó sẽ không biết cách chuyển tiếp gói tin đến đích"
  },
  {
    "con": "Khi sử dụng giao thức TCP, nếu một gói tin bị mất,",
    "re": "gói tin đó sẽ được gửi lại"
  },
  {
    "con": "Nếu một mạng LAN sử dụng địa chỉ IP tĩnh,",
    "re": "các thiết bị trong mạng sẽ luôn có địa chỉ IP cố định"
  },
  {
    "con": "Khi một thiết bị trong mạng gửi một yêu cầu ARP, nếu không có thiết bị nào phản hồi,",
    "re": "thiết bị đó sẽ không biết địa chỉ MAC của thiết bị đích"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation),",
    "re": "các địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng"
  },
  {
    "con": "Khi một gói tin được mã hóa, nếu không có khóa giải mã,",
    "re": "nội dung của gói tin sẽ không thể được đọc"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP,",
    "re": "nó sẽ không đảm bảo việc truyền tải gói tin thành công"
  },
  {
    "con": "Khi một thiết bị trong mạng gặp sự cố và không thể kết nối,",
    "re": "các thiết bị khác sẽ không thể giao tiếp với thiết bị đó"
  },
  {
    "con": "Một mạng con lớp C cần chứa 15 host, sử dụng Subnet Mask nào sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một địa chỉ IP thuộc lớp A, thì dải địa chỉ có thể từ 1.0.0.0 đến 126.255.255.255.",
    "re": "Địa chỉ IP thuộc lớp A"
  },
  {
    "con": "Nếu một gói tin không thể đến đích, thì nó sẽ bị loại bỏ hoặc gửi lại tùy thuộc vào giao thức.",
    "re": "Gói tin sẽ bị xử lý theo quy tắc của giao thức"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng.",
    "re": "Địa chỉ IP riêng có thể truy cập Internet"
  },
  {
    "con": "Nếu một thiết bị trong mạng không nhận được địa chỉ IP từ DHCP, thì nó sẽ không thể kết nối với mạng.",
    "re": "Thiết bị sẽ không có kết nối mạng"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch, thì băng thông sẽ được phân bổ hiệu quả hơn so với sử dụng hub.",
    "re": "Tăng hiệu suất mạng"
  },
  {
    "con": "Nếu một giao thức sử dụng TCP, thì nó sẽ đảm bảo tính toàn vẹn của dữ liệu thông qua việc xác nhận.",
    "re": "Dữ liệu sẽ được truyền tải một cách đáng tin cậy"
  },
  {
    "con": "Nếu một mạng sử dụng VLAN, thì nó có thể phân chia mạng vật lý thành nhiều mạng logic.",
    "re": "Tăng cường bảo mật và quản lý mạng"
  },
  {
    "con": "Nếu một thiết bị mạng bị tắt, thì tất cả các thiết bị kết nối với nó sẽ không thể giao tiếp.",
    "re": "Mạng sẽ bị gián đoạn"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải, thì giao thức sẽ yêu cầu gửi lại gói tin đó.",
    "re": "Đảm bảo dữ liệu không bị mất"
  },
  {
    "con": "Địa chỉ nào sau đây là địa chỉ mạng con của host 172.16.25.14/30",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một gói tin IP có TTL bằng 0",
    "re": "Gói tin sẽ bị loại bỏ ngay lập tức"
  },
  {
    "con": "Nếu một thiết bị trong mạng không nhận được gói tin ARP yêu cầu",
    "re": "Thiết bị đó sẽ không biết địa chỉ MAC tương ứng với địa chỉ IP đã yêu cầu"
  },
  {
    "con": "Khi một router nhận được gói tin với địa chỉ đích không nằm trong bảng định tuyến",
    "re": "Router sẽ gửi gói tin đó đến địa chỉ mặc định (default gateway)"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP",
    "re": "Dữ liệu sẽ được truyền theo cách có kết nối và đảm bảo độ tin cậy"
  },
  {
    "con": "Khi một thiết bị gửi gói tin ICMP đến một địa chỉ không khả dụng",
    "re": "Thiết bị sẽ nhận được thông báo lỗi 'Destination Unreachable'"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation)",
    "re": "Nhiều thiết bị trong mạng nội bộ có thể chia sẻ một địa chỉ IP công cộng"
  },
  {
    "con": "Khi một gói tin UDP bị mất trong quá trình truyền",
    "re": "Gói tin sẽ không được gửi lại và dữ liệu có thể bị mất"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng DHCP",
    "re": "Thiết bị đó sẽ tự động nhận địa chỉ IP và thông tin cấu hình mạng"
  },
  {
    "con": "Khi một mạng sử dụng VLAN (Virtual Local Area Network)",
    "re": "Các thiết bị trong VLAN khác nhau sẽ không thể giao tiếp trực tiếp với nhau"
  },
  {
    "con": "Địa chỉ nào sau đây là địa chỉ mạng con của host 172.16.55.255/20",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một gói tin IP có TTL bằng 0",
    "re": "Gói tin sẽ bị loại bỏ và không được chuyển tiếp"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng địa chỉ IP tĩnh",
    "re": "Thiết bị đó sẽ giữ nguyên địa chỉ IP ngay cả khi khởi động lại"
  },
  {
    "con": "Khi một router nhận được gói tin với địa chỉ đích không thuộc mạng của nó",
    "re": "Router sẽ chuyển tiếp gói tin đến gateway mặc định"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP",
    "re": "Các thiết bị trong mạng sẽ tự động nhận địa chỉ IP từ máy chủ DHCP"
  },
  {
    "con": "Khi một thiết bị gửi gói tin ARP để tìm địa chỉ MAC",
    "re": "Thiết bị sẽ nhận được phản hồi từ thiết bị có địa chỉ IP tương ứng"
  },
  {
    "con": "Nếu một gói tin TCP không nhận được xác nhận (ACK)",
    "re": "Gói tin sẽ được gửi lại theo cơ chế retransmission"
  },
  {
    "con": "Khi một mạng sử dụng NAT (Network Address Translation)",
    "re": "Địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng để truy cập Internet"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức ICMP",
    "re": "Thiết bị có thể gửi thông báo lỗi hoặc yêu cầu kiểm tra kết nối"
  },
  {
    "con": "Khi một mạng có nhiều VLAN",
    "re": "Các VLAN sẽ tách biệt lưu lượng mạng để tăng cường bảo mật và hiệu suất"
  },
  {
    "con": "Địa chỉ nào sau đây là địa chỉ quảng bá của mạng 192.168.25.128/27",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì nó sẽ bị loại bỏ sau một khoảng thời gian nhất định",
    "re": "Gói tin sẽ không được gửi lại"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức TCP, thì nó sẽ đảm bảo tính toàn vẹn của dữ liệu",
    "re": "Dữ liệu sẽ được truyền tải một cách đáng tin cậy"
  },
  {
    "con": "Nếu một địa chỉ IP thuộc lớp A, thì nó sẽ có mặt nạ mạng mặc định là 255.0.0.0",
    "re": "Địa chỉ IP sẽ có khả năng chứa nhiều địa chỉ con"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng",
    "re": "Thiết bị trong mạng nội bộ có thể truy cập Internet"
  },
  {
    "con": "Nếu một gói tin được gửi qua mạng mà không có địa chỉ MAC đích, thì nó sẽ không thể đến được thiết bị nhận",
    "re": "Gói tin sẽ không được truyền tải thành công"
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức UDP, thì nó sẽ không thực hiện xác nhận nhận gói tin",
    "re": "Dữ liệu có thể bị mất mà không có thông báo"
  },
  {
    "con": "Nếu một mạng sử dụng VLAN, thì nó sẽ cho phép phân chia mạng vật lý thành nhiều mạng logic",
    "re": "Tăng cường bảo mật và quản lý băng thông"
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ IP tĩnh, thì địa chỉ này sẽ không thay đổi theo thời gian",
    "re": "Thiết bị sẽ dễ dàng được truy cập qua địa chỉ IP cố định"
  },
  {
    "con": "Nếu một giao thức sử dụng mô hình OSI, thì nó sẽ có 7 lớp khác nhau",
    "re": "Mỗi lớp sẽ thực hiện một chức năng cụ thể trong quá trình truyền dữ liệu"
  },
  {
    "con": "Địa chỉ nào sau đây là địa chỉ quảng bá của mạng 192.168.25.128/28",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì nó sẽ bị loại bỏ sau một khoảng thời gian nhất định",
    "re": "Gói tin sẽ không được gửi lại"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức TCP, thì nó sẽ đảm bảo tính toàn vẹn của dữ liệu",
    "re": "Dữ liệu sẽ được truyền chính xác và không bị mất mát"
  },
  {
    "con": "Nếu một địa chỉ IP thuộc lớp A, thì nó sẽ có mặt nạ mạng mặc định là 255.0.0.0",
    "re": "Địa chỉ IP sẽ có khả năng chứa nhiều mạng con"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP, thì các thiết bị trong mạng sẽ tự động nhận địa chỉ IP",
    "re": "Quá trình cấu hình mạng sẽ trở nên dễ dàng hơn"
  },
  {
    "con": "Nếu một gói tin được gửi qua mạng mà không có địa chỉ MAC đích, thì nó sẽ không thể đến được thiết bị đích",
    "re": "Gói tin sẽ không được truyền đi"
  },
  {
    "con": "Nếu một thiết bị sử dụng NAT, thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng",
    "re": "Thiết bị có thể truy cập Internet mà không bị lộ địa chỉ IP riêng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức HTTPS, thì dữ liệu được truyền sẽ được mã hóa",
    "re": "Bảo mật thông tin sẽ được nâng cao"
  },
  {
    "con": "Nếu một thiết bị trong mạng gặp sự cố và không thể kết nối, thì các thiết bị khác vẫn có thể hoạt động bình thường",
    "re": "Mạng sẽ không bị ảnh hưởng toàn bộ"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch, thì băng thông sẽ được phân bổ hiệu quả hơn so với việc sử dụng hub",
    "re": "Hiệu suất mạng sẽ được cải thiện"
  },
  {
    "con": "FTP tương ứng với tầng nào của mô hình OSI?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải,",
    "re": "TCP sẽ yêu cầu gửi lại gói tin đó"
  },
  {
    "con": "Nếu một địa chỉ IP không hợp lệ được sử dụng trong mạng,",
    "re": "thiết bị sẽ không thể kết nối đến mạng"
  },
  {
    "con": "Nếu một router không có bảng định tuyến,",
    "re": "nó sẽ không biết cách chuyển tiếp gói tin đến đích"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation),",
    "re": "các địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức DHCP,",
    "re": "nó sẽ tự động nhận địa chỉ IP từ máy chủ DHCP"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch,",
    "re": "nó sẽ giảm thiểu va chạm gói tin so với việc sử dụng hub"
  },
  {
    "con": "Nếu một gói tin được mã hóa,",
    "re": "nó sẽ bảo vệ thông tin khỏi việc bị đọc trái phép"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức HTTPS,",
    "re": "dữ liệu được truyền tải sẽ được mã hóa để bảo mật"
  },
  {
    "con": "Nếu một thiết bị không có kết nối Internet,",
    "re": "nó sẽ không thể truy cập vào các dịch vụ trực tuyến"
  },
  {
    "con": "Một mạng con lớp A mượn 5 bit để chia Subnet",
    "re": "Subnet Mask sẽ là 255.255.255.248"
  },
  {
    "con": "Một địa chỉ IP thuộc lớp B có phần mạng là 16 bit",
    "re": "Số lượng mạng con tối đa có thể tạo ra là 2^14"
  },
  {
    "con": "Khi sử dụng giao thức TCP",
    "re": "Dữ liệu sẽ được truyền theo cách kết nối và đảm bảo độ tin cậy"
  },
  {
    "con": "Một địa chỉ IP lớp C có phần mạng là 24 bit",
    "re": "Số lượng địa chỉ host tối đa có thể sử dụng là 2^8 - 2"
  },
  {
    "con": "Khi một gói tin bị mất trong mạng sử dụng giao thức UDP",
    "re": "Gói tin sẽ không được tự động gửi lại"
  },
  {
    "con": "Khi một router nhận được gói tin",
    "re": "Router sẽ kiểm tra địa chỉ đích và quyết định đường đi tiếp theo"
  },
  {
    "con": "Khi sử dụng NAT (Network Address Translation)",
    "re": "Địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng"
  },
  {
    "con": "Khi một mạng sử dụng giao thức DHCP",
    "re": "Thiết bị sẽ tự động nhận địa chỉ IP từ máy chủ DHCP"
  },
  {
    "con": "Khi một mạng sử dụng VLAN",
    "re": "Các thiết bị trong cùng một VLAN có thể giao tiếp với nhau mà không cần router"
  },
  {
    "con": "Khi một gói tin được mã hóa bằng SSL/TLS",
    "re": "Dữ liệu sẽ được bảo mật trong quá trình truyền tải"
  },
  {
    "con": "Một mạng con lớp A mượn 19 bit để chia Subnet",
    "re": "Subnet Mask sẽ là: 255.255.255.224"
  },
  {
    "con": "Một địa chỉ IP thuộc lớp B có định dạng 172.16.0.1",
    "re": "Địa chỉ này có thể sử dụng cho mạng riêng"
  },
  {
    "con": "Một gói tin được gửi từ máy tính A đến máy tính B trong cùng một mạng LAN",
    "re": "Gói tin sẽ không cần phải đi qua router"
  },
  {
    "con": "Một địa chỉ IP có dạng 192.168.1.1",
    "re": "Địa chỉ này thuộc về lớp C"
  },
  {
    "con": "Một mạng con lớp C mượn 3 bit để chia Subnet",
    "re": "Subnet Mask sẽ là: 255.255.255.224"
  },
  {
    "con": "Khi một máy tính gửi yêu cầu ARP để tìm địa chỉ MAC của một địa chỉ IP",
    "re": "Máy tính sẽ gửi một gói tin broadcast trong mạng LAN"
  },
  {
    "con": "Một router nhận được gói tin với địa chỉ đích không thuộc mạng của nó",
    "re": "Router sẽ chuyển tiếp gói tin đến router khác"
  },
  {
    "con": "Khi một máy tính sử dụng DHCP để nhận địa chỉ IP",
    "re": "Máy tính sẽ nhận địa chỉ IP tạm thời từ server DHCP"
  },
  {
    "con": "Một mạng sử dụng NAT để chia sẻ một địa chỉ IP công cộng",
    "re": "Các máy tính trong mạng nội bộ sẽ có địa chỉ IP riêng"
  },
  {
    "con": "Khi một gói tin TCP được gửi đi",
    "re": "Gói tin sẽ được đảm bảo độ tin cậy và thứ tự"
  },
  {
    "con": "Một mạng con lớp A mượn 22 bit để chia Subnet",
    "re": "Subnet Mask sẽ là 255.255.252.0"
  },
  {
    "con": "Một địa chỉ IP thuộc lớp B",
    "re": "Có thể có tối đa 65,534 host trong mạng"
  },
  {
    "con": "Một router nhận được gói tin với địa chỉ đích không thuộc mạng của nó",
    "re": "Router sẽ chuyển gói tin đó đến gateway mặc định"
  },
  {
    "con": "Một mạng sử dụng giao thức TCP",
    "re": "Sẽ đảm bảo tính toàn vẹn của dữ liệu thông qua cơ chế xác nhận"
  },
  {
    "con": "Một địa chỉ IP được phân bổ theo phương thức DHCP",
    "re": "Sẽ có thời gian thuê (lease time) nhất định trước khi cần gia hạn"
  },
  {
    "con": "Một gói tin ICMP được gửi đi",
    "re": "Sẽ được sử dụng để kiểm tra kết nối mạng (ping)"
  },
  {
    "con": "Một mạng LAN sử dụng switch",
    "re": "Sẽ có khả năng phân phối băng thông hiệu quả hơn so với hub"
  },
  {
    "con": "Một địa chỉ IP tĩnh được cấu hình cho thiết bị",
    "re": "Sẽ không thay đổi theo thời gian, giúp dễ dàng quản lý"
  },
  {
    "con": "Một mạng sử dụng NAT (Network Address Translation)",
    "re": "Sẽ cho phép nhiều thiết bị trong mạng nội bộ chia sẻ một địa chỉ IP công cộng"
  },
  {
    "con": "Một giao thức mạng sử dụng UDP",
    "re": "Sẽ không đảm bảo tính toàn vẹn của dữ liệu nhưng có độ trễ thấp hơn TCP"
  },
  {
    "con": "Để kết nối máy tính và Switch với nhau ta có thể dùng:",
    "re": "Cáp Ethernet"
  },
  {
    "con": "Khi một gói tin được gửi từ máy tính A đến máy tính B qua mạng LAN,",
    "re": "gói tin sẽ đi qua Switch để đến đích"
  },
  {
    "con": "Nếu một thiết bị trong mạng không nhận được địa chỉ IP tự động từ DHCP,",
    "re": "thiết bị đó sẽ không thể kết nối với mạng"
  },
  {
    "con": "Khi sử dụng giao thức TCP để truyền dữ liệu,",
    "re": "dữ liệu sẽ được đảm bảo tính toàn vẹn và thứ tự"
  },
  {
    "con": "Nếu một router không có bảng định tuyến chính xác,",
    "re": "nó sẽ không thể chuyển tiếp gói tin đến đích đúng cách"
  },
  {
    "con": "Khi một mạng sử dụng NAT (Network Address Translation),",
    "re": "các địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một mạng sử dụng VLAN (Virtual Local Area Network),",
    "re": "các thiết bị trong cùng một VLAN sẽ có thể giao tiếp với nhau mà không cần qua router"
  },
  {
    "con": "Khi một thiết bị mạng gặp sự cố và không thể kết nối,",
    "re": "cần kiểm tra cáp, cấu hình IP và trạng thái của thiết bị"
  },
  {
    "con": "Nếu một mạng không được bảo mật đúng cách,",
    "re": "nó sẽ dễ bị tấn công từ bên ngoài"
  },
  {
    "con": "Khi sử dụng giao thức UDP để truyền dữ liệu,",
    "re": "dữ liệu có thể bị mất mà không có thông báo lỗi"
  },
  {
    "con": "Trong số các cặp giao thức và dịch vụ sau, cặp nào là sai?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích do lỗi mạng,",
    "re": "thì nó sẽ bị loại bỏ hoặc gửi lại tùy thuộc vào giao thức."
  },
  {
    "con": "Nếu một địa chỉ IP không hợp lệ được sử dụng trong một mạng,",
    "re": "thì thiết bị sẽ không thể kết nối với mạng đó."
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức TCP,",
    "re": "thì nó sẽ đảm bảo việc truyền dữ liệu tin cậy."
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation),",
    "re": "thì nhiều thiết bị có thể chia sẻ một địa chỉ IP công cộng."
  },
  {
    "con": "Nếu một gói tin được mã hóa,",
    "re": "thì chỉ những người có khóa giải mã mới có thể đọc nội dung của nó."
  },
  {
    "con": "Nếu một mạng sử dụng mô hình OSI,",
    "re": "thì các tầng sẽ tương tác với nhau theo thứ tự từ tầng vật lý đến tầng ứng dụng."
  },
  {
    "con": "Nếu một thiết bị mạng bị tắt,",
    "re": "thì tất cả các thiết bị khác kết nối với nó sẽ không thể giao tiếp."
  },
  {
    "con": "Nếu một giao thức sử dụng UDP,",
    "re": "thì nó sẽ không đảm bảo việc truyền dữ liệu tin cậy như TCP."
  },
  {
    "con": "Nếu một mạng sử dụng VLAN (Virtual Local Area Network),",
    "re": "thì nó có thể phân chia mạng vật lý thành nhiều mạng logic."
  },
  {
    "con": "Cho địa chỉ IP 192.168.25.91/26, Subnet Mask sẽ là:",
    "re": "255.255.255.192"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì nó sẽ được gửi lại theo cơ chế:",
    "re": "Retransmission"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức TCP, thì nó sẽ đảm bảo:",
    "re": "Truyền dữ liệu tin cậy"
  },
  {
    "con": "Nếu một địa chỉ IP thuộc lớp A, thì nó sẽ có:",
    "re": "Mặt nạ mạng 255.0.0.0"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP, thì địa chỉ IP sẽ được:",
    "re": "Cấp phát động cho các thiết bị"
  },
  {
    "con": "Nếu một gói tin được gửi qua mạng mà không có địa chỉ MAC đích, thì:",
    "re": "Gói tin sẽ không thể đến được thiết bị đích"
  },
  {
    "con": "Nếu một thiết bị sử dụng NAT, thì địa chỉ IP công cộng sẽ:",
    "re": "Được ánh xạ tới nhiều địa chỉ IP riêng"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch, thì dữ liệu sẽ được:",
    "re": "Chuyển tiếp chỉ đến thiết bị đích"
  },
  {
    "con": "Nếu một giao thức sử dụng cổng 80, thì đó là:",
    "re": "Giao thức HTTP"
  },
  {
    "con": "Nếu một thiết bị trong mạng không nhận được gói tin ARP, thì nó sẽ:",
    "re": "Không biết địa chỉ MAC của thiết bị khác"
  },
  {
    "con": "Cho địa chỉ IP 192.168.25.91/26, số mạng con và số host tối đa của mỗi mạng con sẽ là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì nó sẽ bị loại bỏ hoặc trả lại cho nguồn.",
    "re": "Gói tin sẽ không được xử lý tiếp"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức TCP, thì nó sẽ đảm bảo việc truyền tải dữ liệu đáng tin cậy.",
    "re": "Dữ liệu sẽ được truyền tải mà không bị mất mát"
  },
  {
    "con": "Nếu một địa chỉ IP thuộc lớp A, thì nó sẽ có định dạng bắt đầu từ 0 đến 127.",
    "re": "Địa chỉ IP sẽ có mặt nạ mạng con 255.0.0.0"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation), thì địa chỉ IP riêng sẽ được chuyển đổi thành địa chỉ IP công cộng.",
    "re": "Thiết bị trong mạng nội bộ có thể truy cập Internet"
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức UDP, thì nó sẽ không đảm bảo thứ tự và độ tin cậy của gói tin.",
    "re": "Dữ liệu có thể đến đích không theo thứ tự"
  },
  {
    "con": "Nếu một mạng sử dụng VLAN (Virtual Local Area Network), thì nó sẽ cho phép phân chia mạng vật lý thành nhiều mạng logic.",
    "re": "Tăng cường bảo mật và quản lý mạng"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức DHCP, thì nó sẽ tự động cấp phát địa chỉ IP cho các thiết bị trong mạng.",
    "re": "Giảm thiểu công sức quản lý địa chỉ IP"
  },
  {
    "con": "Nếu một gói tin được gửi qua mạng không có địa chỉ MAC đích, thì nó sẽ không thể đến được thiết bị đích.",
    "re": "Gói tin sẽ không được chuyển tiếp"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức SSL/TLS, thì dữ liệu truyền tải sẽ được mã hóa để bảo mật.",
    "re": "Ngăn chặn việc nghe lén và giả mạo dữ liệu"
  },
  {
    "con": "Cho địa chỉ IP 192.168.25.91/26, địa chỉ mạng con thứ nhì sẽ là:",
    "re": "192.168.25.128/26"
  },
  {
    "con": "Nếu một gói tin không thể đến đích do lỗi mạng, thì gói tin đó sẽ được gửi lại:",
    "re": "đúng trong trường hợp giao thức TCP"
  },
  {
    "con": "Nếu một địa chỉ IP thuộc lớp A, thì dải địa chỉ mạng sẽ có mặt nạ mạng là:",
    "re": "/8"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức DHCP, thì địa chỉ IP của thiết bị đó sẽ được cấp phát:",
    "re": "tự động từ máy chủ DHCP"
  },
  {
    "con": "Nếu một gói tin được gửi từ một mạng khác, thì địa chỉ MAC của gói tin đó sẽ được thay đổi:",
    "re": "theo địa chỉ MAC của router"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng:",
    "re": "để truy cập Internet"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức ICMP, thì nó có thể gửi thông điệp:",
    "re": "ping để kiểm tra kết nối"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch, thì dữ liệu sẽ được chuyển tiếp:",
    "re": "dựa trên địa chỉ MAC"
  },
  {
    "con": "Nếu một địa chỉ IP có dạng 255.255.255.255, thì đây là địa chỉ:",
    "re": "địa chỉ phát sóng toàn cầu"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức SSL/TLS, thì dữ liệu sẽ được mã hóa:",
    "re": "để bảo mật thông tin truyền tải"
  },
  {
    "con": "Cho địa chỉ IP 192.168.25.91/26, địa chỉ IP thuộc mạng con thứ nhất sẽ là:",
    "re": "192.168.25.64"
  },
  {
    "con": "Nếu một gói tin không thể đến đích do lỗi mạng, thì gói tin đó sẽ được gửi lại nếu giao thức sử dụng là:",
    "re": "TCP"
  },
  {
    "con": "Nếu một thiết bị trong mạng có địa chỉ MAC 00:1A:2B:3C:4D:5E, thì địa chỉ IP tương ứng có thể được tìm thấy trong:",
    "re": "ARP table"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP, thì địa chỉ IP của thiết bị sẽ được cấp phát:",
    "re": "tự động"
  },
  {
    "con": "Nếu một gói tin được gửi từ máy A đến máy B qua router, thì router sẽ thực hiện:",
    "re": "kiểm tra bảng định tuyến"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch, thì dữ liệu sẽ được chuyển tiếp dựa trên:",
    "re": "địa chỉ MAC"
  },
  {
    "con": "Nếu một thiết bị trong mạng không thể kết nối Internet, thì nguyên nhân có thể là:",
    "re": "cấu hình DNS sai"
  },
  {
    "con": "Nếu một giao thức sử dụng port 80, thì giao thức đó là:",
    "re": "HTTP"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì địa chỉ IP riêng sẽ được chuyển đổi thành:",
    "re": "địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một gói tin bị rơi trong quá trình truyền tải, thì giao thức sẽ xử lý bằng cách:",
    "re": "gửi lại gói tin đó"
  },
  {
    "con": "Để kết nối máy tính và Router với nhau ta có thể dùng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một gói tin được gửi qua mạng, nếu địa chỉ IP đích không hợp lệ:",
    "re": "Gói tin sẽ bị loại bỏ và không đến được đích"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP:",
    "re": "Nó sẽ đảm bảo tính toàn vẹn và thứ tự của dữ liệu"
  },
  {
    "con": "Khi một thiết bị trong mạng bị lỗi, nếu không có cơ chế dự phòng:",
    "re": "Mạng sẽ gặp phải sự gián đoạn trong kết nối"
  },
  {
    "con": "Nếu một máy chủ DNS không thể phân giải tên miền:",
    "re": "Người dùng sẽ không thể truy cập vào trang web tương ứng"
  },
  {
    "con": "Khi sử dụng mạng không dây, nếu tín hiệu yếu:",
    "re": "Tốc độ truyền tải dữ liệu sẽ giảm và có thể bị mất kết nối"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch thay vì hub:",
    "re": "Hiệu suất mạng sẽ được cải thiện do giảm thiểu va chạm dữ liệu"
  },
  {
    "con": "Khi một gói tin bị rơi trong quá trình truyền tải, nếu không có cơ chế khôi phục:",
    "re": "Dữ liệu sẽ không được nhận đúng cách và có thể bị mất"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP:",
    "re": "Nó sẽ có tốc độ truyền tải nhanh hơn nhưng không đảm bảo tính toàn vẹn của dữ liệu"
  },
  {
    "con": "Khi một thiết bị mạng được cấu hình sai, nếu không được phát hiện kịp thời:",
    "re": "Nó có thể gây ra sự cố cho toàn bộ mạng"
  },
  {
    "con": "Để kết nối Router với Router ta dùng:",
    "re": "cáp mạng hoặc giao thức OSPF, EIGRP"
  },
  {
    "con": "Khi một gói tin không đến được đích,",
    "re": "thường có thể do lỗi cấu hình hoặc sự cố mạng"
  },
  {
    "con": "Nếu một địa chỉ IP không hợp lệ được sử dụng,",
    "re": "thiết bị sẽ không thể kết nối với mạng"
  },
  {
    "con": "Khi sử dụng NAT (Network Address Translation),",
    "re": "các địa chỉ IP riêng có thể được ánh xạ sang địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một thiết bị trong mạng bị tấn công DDoS,",
    "re": "nó có thể bị ngừng hoạt động hoặc giảm hiệu suất"
  },
  {
    "con": "Khi một mạng sử dụng VLAN (Virtual Local Area Network),",
    "re": "các thiết bị có thể được phân chia thành các nhóm logic khác nhau"
  },
  {
    "con": "Nếu một giao thức mạng không được hỗ trợ bởi thiết bị,",
    "re": "thiết bị sẽ không thể giao tiếp với các thiết bị sử dụng giao thức đó"
  },
  {
    "con": "Khi sử dụng giao thức TCP,",
    "re": "dữ liệu được truyền theo cách có kiểm soát và đảm bảo độ tin cậy"
  },
  {
    "con": "Nếu một mạng không có bảo mật,",
    "re": "dữ liệu có thể bị đánh cắp hoặc bị thay đổi bởi các bên thứ ba"
  },
  {
    "con": "Khi một thiết bị mạng sử dụng DHCP (Dynamic Host Configuration Protocol),",
    "re": "nó có thể tự động nhận địa chỉ IP và thông tin cấu hình mạng"
  },
  {
    "con": "Thiết bị hub thông thường nằm ở tầng nào của mô hình OSI?",
    "re": "Tầng vật lý"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì điều gì có thể xảy ra?",
    "re": "Gói tin có thể bị mất hoặc bị lỗi"
  },
  {
    "con": "Nếu một địa chỉ IP không hợp lệ được sử dụng, thì điều gì sẽ xảy ra?",
    "re": "Thiết bị sẽ không thể kết nối với mạng"
  },
  {
    "con": "Nếu một thiết bị router không có bảng định tuyến, thì điều gì sẽ xảy ra?",
    "re": "Router sẽ không biết cách chuyển tiếp gói tin"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì điều gì sẽ xảy ra?",
    "re": "Dữ liệu sẽ được truyền tải một cách đáng tin cậy"
  },
  {
    "con": "Nếu một thiết bị switch hoạt động ở tầng 2 của mô hình OSI, thì điều gì sẽ xảy ra?",
    "re": "Switch sẽ chuyển tiếp gói tin dựa trên địa chỉ MAC"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP, thì điều gì sẽ xảy ra?",
    "re": "Dữ liệu có thể bị mất nhưng tốc độ truyền tải nhanh hơn"
  },
  {
    "con": "Nếu một firewall được cấu hình sai, thì điều gì sẽ xảy ra?",
    "re": "Mạng có thể bị tấn công hoặc truy cập trái phép"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng NAT, thì điều gì sẽ xảy ra?",
    "re": "Địa chỉ IP riêng sẽ được ánh xạ thành địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một mạng LAN sử dụng VLAN, thì điều gì sẽ xảy ra?",
    "re": "Mạng sẽ được phân chia thành các mạng con logic"
  },
  {
    "con": "Thiết bị Switch thông thường nằm ở tầng nào của mô hình OSI?",
    "re": "Tầng 2 (Data Link)"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì điều gì xảy ra?",
    "re": "Gói tin sẽ bị mất và không được gửi lại trừ khi có cơ chế khôi phục."
  },
  {
    "con": "Nếu một địa chỉ IP thuộc lớp A, thì điều gì xảy ra?",
    "re": "Địa chỉ IP sẽ có định dạng từ 1.0.0.0 đến 126.255.255.255."
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức TCP, thì điều gì xảy ra?",
    "re": "Thiết bị đó sẽ có kết nối đáng tin cậy và đảm bảo dữ liệu được truyền tải chính xác."
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì điều gì xảy ra?",
    "re": "Địa chỉ IP riêng sẽ được ánh xạ thành địa chỉ IP công cộng để truy cập Internet."
  },
  {
    "con": "Nếu một gói tin được gửi qua mạng mà không có địa chỉ MAC, thì điều gì xảy ra?",
    "re": "Gói tin sẽ không thể đến được thiết bị đích trong mạng LAN."
  },
  {
    "con": "Nếu một thiết bị router nhận được gói tin, thì điều gì xảy ra?",
    "re": "Router sẽ kiểm tra địa chỉ đích và quyết định đường đi tiếp theo cho gói tin."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP, thì điều gì xảy ra?",
    "re": "Dữ liệu sẽ được gửi mà không cần xác nhận, có thể dẫn đến mất mát gói tin."
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức DHCP, thì điều gì xảy ra?",
    "re": "Thiết bị sẽ tự động nhận địa chỉ IP và thông tin cấu hình mạng từ máy chủ DHCP."
  },
  {
    "con": "Nếu một mạng có nhiều VLAN, thì điều gì xảy ra?",
    "re": "Mạng sẽ được phân chia thành các mạng con logic, giúp quản lý và bảo mật tốt hơn."
  },
  {
    "con": "Thiết bị Bridge nằm ở tầng nào của mô hình OSI?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì nó sẽ được gửi lại bao nhiêu lần?",
    "re": "Số lần gửi lại phụ thuộc vào giao thức sử dụng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì dữ liệu sẽ được truyền theo cách nào?",
    "re": "Dữ liệu sẽ được truyền theo cách kết nối và đảm bảo độ tin cậy"
  },
  {
    "con": "Nếu một thiết bị router nhận được gói tin, thì nó sẽ làm gì?",
    "re": "Router sẽ kiểm tra địa chỉ IP đích và quyết định đường đi tiếp theo"
  },
  {
    "con": "Nếu một mạng LAN sử dụng địa chỉ IP tĩnh, thì điều gì sẽ xảy ra khi thiết bị được khởi động lại?",
    "re": "Thiết bị sẽ luôn nhận được cùng một địa chỉ IP"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức UDP, thì điều gì sẽ xảy ra với dữ liệu bị mất?",
    "re": "Dữ liệu bị mất sẽ không được gửi lại"
  },
  {
    "con": "Nếu một thiết bị switch nhận được gói tin, thì nó sẽ làm gì?",
    "re": "Switch sẽ chuyển tiếp gói tin đến cổng tương ứng dựa trên địa chỉ MAC"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì điều gì sẽ xảy ra với địa chỉ IP riêng?",
    "re": "Địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một mạng không có bảo mật, thì điều gì có thể xảy ra?",
    "re": "Dữ liệu có thể bị đánh cắp hoặc bị tấn công"
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức DHCP, thì điều gì sẽ xảy ra khi nó kết nối vào mạng?",
    "re": "Thiết bị sẽ tự động nhận địa chỉ IP từ máy chủ DHCP"
  },
  {
    "con": "Thiết bị Repeater nằm ở tầng nào của mô hình OSI?",
    "re": "Tầng vật lý"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì điều này có thể do vấn đề gì?",
    "re": "Lỗi trong mạng hoặc cấu hình sai địa chỉ IP"
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức TCP, thì điều này có nghĩa là gì?",
    "re": "Thiết bị đó đang sử dụng giao thức kết nối và đảm bảo độ tin cậy"
  },
  {
    "con": "Nếu một mạng sử dụng địa chỉ IP tĩnh, thì điều này có nghĩa là gì?",
    "re": "Địa chỉ IP của thiết bị sẽ không thay đổi theo thời gian"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng NAT, thì điều này có nghĩa là gì?",
    "re": "Thiết bị đó đang chuyển đổi địa chỉ IP riêng thành địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch, thì điều này có nghĩa là gì?",
    "re": "Switch sẽ chuyển tiếp dữ liệu dựa trên địa chỉ MAC"
  },
  {
    "con": "Nếu một gói tin bị rơi trong quá trình truyền tải, thì điều này có thể do nguyên nhân gì?",
    "re": "Tắc nghẽn mạng hoặc lỗi phần cứng"
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức UDP, thì điều này có nghĩa là gì?",
    "re": "Thiết bị đó không đảm bảo độ tin cậy và không có kết nối"
  },
  {
    "con": "Nếu một mạng sử dụng mô hình OSI, thì điều này có nghĩa là gì?",
    "re": "Mạng được phân chia thành 7 tầng để quản lý và xử lý dữ liệu"
  },
  {
    "con": "Nếu một thiết bị mạng có địa chỉ MAC, thì điều này có nghĩa là gì?",
    "re": "Thiết bị đó có thể được xác định duy nhất trong mạng LAN"
  },
  {
    "con": "Thiết bị Router thông thường nằm ở tầng nào của mô hình OSI?",
    "re": "Tầng 3 (Tầng mạng)"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì điều này có thể do vấn đề gì?",
    "re": "Có thể do lỗi trong cấu hình mạng hoặc sự cố với thiết bị mạng"
  },
  {
    "con": "Nếu một địa chỉ IP thuộc lớp A, thì địa chỉ đó có thể có bao nhiêu máy chủ tối đa?",
    "re": "Hơn 16 triệu máy chủ"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP, thì điều này có nghĩa là gì?",
    "re": "Mạng đó sử dụng giao thức kết nối, đảm bảo độ tin cậy trong việc truyền dữ liệu"
  },
  {
    "con": "Nếu một thiết bị sử dụng NAT, thì điều này có nghĩa là gì?",
    "re": "Thiết bị đó đang chuyển đổi địa chỉ IP riêng thành địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một mạng LAN sử dụng Switch, thì điều này có nghĩa là gì?",
    "re": "Switch sẽ chuyển tiếp dữ liệu dựa trên địa chỉ MAC của thiết bị"
  },
  {
    "con": "Nếu một giao thức sử dụng UDP, thì điều này có nghĩa là gì?",
    "re": "Giao thức đó không đảm bảo độ tin cậy và không kiểm soát thứ tự gói tin"
  },
  {
    "con": "Nếu một mạng sử dụng mô hình Client-Server, thì điều này có nghĩa là gì?",
    "re": "Có một máy chủ cung cấp dịch vụ và nhiều máy khách yêu cầu dịch vụ từ máy chủ"
  },
  {
    "con": "Nếu một thiết bị mạng bị tắc nghẽn, thì điều này có thể dẫn đến điều gì?",
    "re": "Dẫn đến độ trễ cao và mất gói dữ liệu"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức IP phiên bản 6 (IPv6), thì điều này có nghĩa là gì?",
    "re": "Mạng đó có khả năng hỗ trợ một lượng lớn địa chỉ IP hơn so với IPv4"
  },
  {
    "con": "Thiết bị Hub có bao nhiêu collision domain?",
    "re": "1 collision domain"
  },
  {
    "con": "Thiết bị Switch hoạt động ở tầng nào của mô hình OSI?",
    "re": "Tầng 2 (Data Link Layer)"
  },
  {
    "con": "Nếu một gói tin không đến được đích, thì điều gì xảy ra?",
    "re": "Gói tin sẽ bị loại bỏ hoặc gửi lại tùy thuộc vào giao thức"
  },
  {
    "con": "Địa chỉ IP nào được sử dụng để xác định một thiết bị trong mạng?",
    "re": "Địa chỉ IP duy nhất cho mỗi thiết bị trong mạng"
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức TCP, thì điều gì xảy ra?",
    "re": "Dữ liệu sẽ được truyền theo cách kết nối và đảm bảo độ tin cậy"
  },
  {
    "con": "Giao thức nào được sử dụng để gửi email?",
    "re": "SMTP (Simple Mail Transfer Protocol)"
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì điều gì xảy ra với địa chỉ IP riêng?",
    "re": "Địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một thiết bị sử dụng giao thức UDP, thì điều gì xảy ra?",
    "re": "Dữ liệu sẽ được truyền mà không cần đảm bảo độ tin cậy"
  },
  {
    "con": "Mạng LAN thường sử dụng loại cáp nào?",
    "re": "Cáp Ethernet (cáp đồng hoặc cáp quang)"
  },
  {
    "con": "Nếu một thiết bị không có địa chỉ IP, thì điều gì xảy ra?",
    "re": "Thiết bị sẽ không thể giao tiếp trên mạng IP"
  },
  {
    "con": "Thiết bị Switch có bao nhiêu collision domain?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng LAN sử dụng giao thức Ethernet?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mỗi địa chỉ IP trong mạng phải là duy nhất?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Router có khả năng định tuyến giữa các mạng khác nhau?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Giao thức TCP đảm bảo truyền tải dữ liệu tin cậy?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng WAN thường có phạm vi rộng hơn mạng LAN?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mỗi gói dữ liệu trong mạng đều có địa chỉ nguồn và địa chỉ đích?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Giao thức UDP không đảm bảo độ tin cậy trong truyền tải dữ liệu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng không dây sử dụng sóng radio để truyền dữ liệu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Firewall giúp bảo vệ mạng khỏi các truy cập trái phép?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Thiết bị Switch có bao nhiêu Broadcast domain?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một Router có thể kết nối bao nhiêu mạng khác nhau?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin không tìm thấy địa chỉ đích trong bảng định tuyến của Router,",
    "re": "gói tin sẽ bị loại bỏ"
  },
  {
    "con": "Khi một thiết bị gửi gói tin đến địa chỉ Broadcast,",
    "re": "tất cả các thiết bị trong cùng một mạng sẽ nhận được gói tin đó"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP,",
    "re": "thì nó sẽ đảm bảo tính toàn vẹn của dữ liệu"
  },
  {
    "con": "Khi một thiết bị sử dụng DHCP để nhận địa chỉ IP,",
    "re": "nó sẽ nhận được địa chỉ IP động"
  },
  {
    "con": "Nếu một thiết bị không có địa chỉ IP,",
    "re": "nó sẽ không thể giao tiếp trên mạng IP"
  },
  {
    "con": "Khi một gói tin được mã hóa bằng SSL/TLS,",
    "re": "dữ liệu sẽ được bảo mật trong quá trình truyền tải"
  },
  {
    "con": "Nếu một mạng sử dụng NAT,",
    "re": "thì nhiều thiết bị có thể chia sẻ một địa chỉ IP công cộng"
  },
  {
    "con": "Khi một thiết bị gửi gói tin đến địa chỉ unicast,",
    "re": "gói tin sẽ chỉ được gửi đến một thiết bị duy nhất"
  },
  {
    "con": "Thiết bị Hub có bao nhiêu Broadcast domain?",
    "re": "1"
  },
  {
    "con": "Thiết bị Switch có bao nhiêu Broadcast domain?",
    "re": "1"
  },
  {
    "con": "Router có chức năng gì trong mạng?",
    "re": "Chuyển tiếp gói tin giữa các mạng khác nhau"
  },
  {
    "con": "Mạng LAN thường sử dụng giao thức nào?",
    "re": "Ethernet"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng địa chỉ IP tĩnh, thì điều gì xảy ra khi thiết bị đó được khởi động lại?",
    "re": "Địa chỉ IP của thiết bị sẽ không thay đổi"
  },
  {
    "con": "Nếu một gói tin không thể đến đích, thì điều gì xảy ra?",
    "re": "Gói tin sẽ bị loại bỏ hoặc gửi lại tùy thuộc vào giao thức"
  },
  {
    "con": "Mạng WAN thường kết nối các mạng nào?",
    "re": "Các mạng LAN ở khoảng cách xa"
  },
  {
    "con": "Nếu một thiết bị sử dụng NAT, thì điều gì xảy ra với địa chỉ IP riêng?",
    "re": "Địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng"
  },
  {
    "con": "Giao thức TCP có đặc điểm gì?",
    "re": "Đảm bảo độ tin cậy trong việc truyền tải dữ liệu"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP, thì điều gì xảy ra với địa chỉ IP của thiết bị?",
    "re": "Địa chỉ IP sẽ được cấp phát tự động từ máy chủ DHCP"
  },
  {
    "con": "Thiết bị Router có bao nhiêu collision domain ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng LAN sử dụng địa chỉ IP nào ?",
    "re": "Địa chỉ IP riêng (Private IP)"
  },
  {
    "con": "Giao thức TCP có đảm bảo độ tin cậy không ?",
    "re": "Có, TCP đảm bảo độ tin cậy thông qua cơ chế xác nhận và truyền lại dữ liệu"
  },
  {
    "con": "Giao thức UDP có sử dụng kết nối không ?",
    "re": "Không, UDP là giao thức không kết nối"
  },
  {
    "con": "Mạng WAN thường sử dụng công nghệ nào để kết nối ?",
    "re": "Công nghệ MPLS hoặc VPN"
  },
  {
    "con": "Địa chỉ MAC có vai trò gì trong mạng ?",
    "re": "Địa chỉ MAC xác định duy nhất thiết bị trong mạng LAN"
  },
  {
    "con": "Mạng sử dụng mô hình OSI có bao nhiêu lớp ?",
    "re": "Có 7 lớp"
  },
  {
    "con": "Giao thức HTTP sử dụng cổng nào ?",
    "re": "Cổng 80"
  },
  {
    "con": "Mạng không dây sử dụng chuẩn nào phổ biến nhất ?",
    "re": "Chuẩn IEEE 802.11"
  },
  {
    "con": "Thiết bị Switch hoạt động ở lớp nào của mô hình OSI ?",
    "re": "Lớp 2 (Lớp liên kết dữ liệu)"
  },
  {
    "con": "Thiết bị router có bao nhiêu Broadcast domain?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng LAN sử dụng địa chỉ IP nào?",
    "re": "Địa chỉ IP riêng (Private IP)"
  },
  {
    "con": "Giao thức TCP có đảm bảo độ tin cậy không?",
    "re": "Có, TCP đảm bảo độ tin cậy thông qua cơ chế xác nhận và truyền lại"
  },
  {
    "con": "Giao thức UDP có sử dụng kết nối không?",
    "re": "Không, UDP là giao thức không kết nối"
  },
  {
    "con": "Thiết bị switch hoạt động ở lớp nào trong mô hình OSI?",
    "re": "Lớp 2 (Data Link Layer)"
  },
  {
    "con": "Mạng WAN thường sử dụng công nghệ nào để kết nối các địa điểm xa?",
    "re": "Công nghệ MPLS hoặc VPN"
  },
  {
    "con": "Địa chỉ MAC có độ dài bao nhiêu bit?",
    "re": "Địa chỉ MAC có độ dài 48 bit"
  },
  {
    "con": "Giao thức HTTP sử dụng cổng nào mặc định?",
    "re": "Cổng 80"
  },
  {
    "con": "Mạng không dây sử dụng chuẩn nào để truyền dữ liệu?",
    "re": "Chuẩn IEEE 802.11"
  },
  {
    "con": "Mạng có cấu trúc hình sao có ưu điểm gì?",
    "re": "Dễ dàng quản lý và mở rộng"
  },
  {
    "con": "Cáp UTP có thể kết nối tối đa bao nhiêu mét?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải,",
    "re": "thì giao thức TCP sẽ yêu cầu gửi lại gói tin đó."
  },
  {
    "con": "Nếu một địa chỉ IP thuộc lớp A,",
    "re": "thì nó có thể chứa tối đa 16 triệu địa chỉ."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức DHCP,",
    "re": "thì các thiết bị trong mạng sẽ tự động nhận địa chỉ IP."
  },
  {
    "con": "Nếu một router không có bảng định tuyến,",
    "re": "thì nó sẽ không biết cách chuyển tiếp gói tin đến đích."
  },
  {
    "con": "Nếu một mạng LAN sử dụng switch,",
    "re": "thì nó sẽ giảm thiểu va chạm dữ liệu giữa các thiết bị."
  },
  {
    "con": "Nếu một gói tin được mã hóa bằng SSL/TLS,",
    "re": "thì dữ liệu sẽ được bảo mật trong quá trình truyền tải."
  },
  {
    "con": "Nếu một máy chủ DNS không thể phân giải tên miền,",
    "re": "thì nó sẽ trả về lỗi 'NXDOMAIN'."
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation),",
    "re": "thì nhiều thiết bị có thể chia sẻ một địa chỉ IP công cộng."
  },
  {
    "con": "Nếu một thiết bị trong mạng bị tấn công DDoS,",
    "re": "thì nó sẽ gặp khó khăn trong việc xử lý lưu lượng truy cập hợp lệ."
  },
  {
    "con": "Cáp quang có thể kết nối tối đa bao nhiêu mét ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng LAN thường sử dụng giao thức nào để truyền dữ liệu ?",
    "re": "Giao thức Ethernet"
  },
  {
    "con": "Nếu một thiết bị trong mạng không thể truy cập Internet, thì điều gì có thể xảy ra ?",
    "re": "Có thể do cấu hình IP sai hoặc lỗi phần cứng"
  },
  {
    "con": "Khi sử dụng NAT, địa chỉ IP riêng sẽ được chuyển đổi thành địa chỉ IP công cộng khi nào ?",
    "re": "Khi dữ liệu được gửi ra ngoài mạng"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải, thì giao thức nào sẽ đảm bảo gói tin đó được gửi lại ?",
    "re": "Giao thức TCP"
  },
  {
    "con": "Khi sử dụng mạng không dây, nếu tín hiệu yếu thì điều gì có thể xảy ra ?",
    "re": "Tốc độ truyền tải dữ liệu sẽ giảm và có thể mất kết nối"
  },
  {
    "con": "Nếu một mạng sử dụng mô hình OSI, thì có bao nhiêu lớp trong mô hình này ?",
    "re": "Bảy lớp"
  },
  {
    "con": "Khi một máy chủ DNS không thể phân giải tên miền, thì điều gì có thể xảy ra ?",
    "re": "Người dùng sẽ không thể truy cập vào trang web tương ứng"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng địa chỉ IP tĩnh, thì điều gì sẽ xảy ra khi khởi động lại thiết bị ?",
    "re": "Địa chỉ IP sẽ không thay đổi"
  },
  {
    "con": "Khi một mạng sử dụng VLAN, thì điều gì sẽ xảy ra với lưu lượng mạng ?",
    "re": "Lưu lượng mạng sẽ được phân chia và quản lý tốt hơn"
  },
  {
    "con": "Để nối Router và máy tính ta phải bấm cáp kiểu nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một gói tin không đến được đích, nó sẽ được xử lý như thế nào?",
    "re": "Gói tin sẽ bị loại bỏ hoặc gửi lại tùy thuộc vào giao thức."
  },
  {
    "con": "Nếu một thiết bị trong mạng bị lỗi, thì điều gì sẽ xảy ra với các thiết bị khác?",
    "re": "Các thiết bị khác vẫn có thể hoạt động bình thường nếu không bị ảnh hưởng bởi lỗi đó."
  },
  {
    "con": "Khi sử dụng địa chỉ IP tĩnh, điều gì cần được đảm bảo?",
    "re": "Địa chỉ IP tĩnh phải nằm trong dải địa chỉ hợp lệ của mạng."
  },
  {
    "con": "Nếu một mạng sử dụng NAT, thì điều gì sẽ xảy ra với địa chỉ IP riêng?",
    "re": "Địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng để truy cập Internet."
  },
  {
    "con": "Khi sử dụng giao thức TCP, điều gì đảm bảo rằng dữ liệu được truyền chính xác?",
    "re": "Giao thức TCP sử dụng cơ chế xác nhận và kiểm tra lỗi."
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức DHCP, thì điều gì sẽ xảy ra khi khởi động?",
    "re": "Thiết bị sẽ tự động nhận địa chỉ IP từ máy chủ DHCP."
  },
  {
    "con": "Khi một mạng sử dụng VLAN, điều gì sẽ xảy ra với lưu lượng giữa các VLAN khác nhau?",
    "re": "Lưu lượng giữa các VLAN khác nhau sẽ bị cách ly trừ khi có cấu hình định tuyến giữa chúng."
  },
  {
    "con": "Nếu một mạng sử dụng giao thức HTTPS, thì điều gì sẽ xảy ra với dữ liệu truyền tải?",
    "re": "Dữ liệu sẽ được mã hóa để bảo mật thông tin."
  },
  {
    "con": "Khi một thiết bị mạng bị tấn công DDoS, điều gì sẽ xảy ra?",
    "re": "Thiết bị sẽ bị quá tải và không thể phục vụ yêu cầu từ người dùng khác."
  },
  {
    "con": "Thiết bị Repeater xử lý ở",
    "re": "tầng vật lý của mô hình OSI"
  },
  {
    "con": "Một địa chỉ IP tĩnh được cấu hình cho thiết bị",
    "re": "thì thiết bị đó sẽ giữ nguyên địa chỉ IP sau mỗi lần khởi động"
  },
  {
    "con": "Sử dụng giao thức TCP",
    "re": "thì dữ liệu sẽ được truyền tải một cách đáng tin cậy và theo thứ tự"
  },
  {
    "con": "Một mạng LAN sử dụng switch",
    "re": "thì băng thông sẽ được phân chia hiệu quả hơn so với việc sử dụng hub"
  },
  {
    "con": "Giao thức DHCP được kích hoạt",
    "re": "thì các thiết bị trong mạng sẽ tự động nhận địa chỉ IP"
  },
  {
    "con": "Sử dụng NAT (Network Address Translation)",
    "re": "thì nhiều thiết bị trong mạng nội bộ có thể chia sẻ một địa chỉ IP công cộng"
  },
  {
    "con": "Một mạng sử dụng giao thức UDP",
    "re": "thì dữ liệu có thể bị mất nhưng sẽ có độ trễ thấp hơn"
  },
  {
    "con": "Thiết bị Firewall được cấu hình đúng",
    "re": "thì nó sẽ bảo vệ mạng khỏi các cuộc tấn công từ bên ngoài"
  },
  {
    "con": "Sử dụng mô hình OSI",
    "re": "thì việc phân tích và khắc phục sự cố mạng sẽ dễ dàng hơn"
  },
  {
    "con": "Một mạng không dây sử dụng WPA2",
    "re": "thì mức độ bảo mật sẽ cao hơn so với WEP"
  },
  {
    "con": "Phát biểu nào sau đây là đúng nhất cho Switch:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một địa chỉ IP tĩnh được cấu hình cho một thiết bị:",
    "re": "Thiết bị đó sẽ luôn có cùng một địa chỉ IP mỗi khi nó kết nối vào mạng"
  },
  {
    "con": "Khi một gói tin được gửi từ một thiết bị đến một thiết bị khác trong cùng một mạng LAN:",
    "re": "Gói tin đó sẽ không cần phải đi qua router"
  },
  {
    "con": "Nếu một thiết bị trong mạng sử dụng giao thức TCP:",
    "re": "Nó sẽ đảm bảo rằng dữ liệu được truyền tải một cách đáng tin cậy"
  },
  {
    "con": "Khi một mạng sử dụng NAT (Network Address Translation):",
    "re": "Nó cho phép nhiều thiết bị trong mạng nội bộ chia sẻ một địa chỉ IP công cộng"
  },
  {
    "con": "Nếu một thiết bị không thể kết nối vào mạng Wi-Fi:",
    "re": "Có thể do mật khẩu sai hoặc tín hiệu yếu"
  },
  {
    "con": "Khi một gói tin bị mất trong quá trình truyền tải:",
    "re": "Giao thức TCP sẽ yêu cầu gửi lại gói tin đó"
  },
  {
    "con": "Nếu một mạng sử dụng VLAN (Virtual Local Area Network):",
    "re": "Nó cho phép phân chia mạng vật lý thành nhiều mạng logic khác nhau"
  },
  {
    "con": "Khi một thiết bị sử dụng giao thức DHCP:",
    "re": "Nó sẽ tự động nhận địa chỉ IP từ máy chủ DHCP"
  },
  {
    "con": "Nếu một mạng có nhiều thiết bị kết nối cùng một lúc:",
    "re": "Sẽ cần một thiết bị chuyển mạch (switch) để quản lý lưu lượng dữ liệu"
  },
  {
    "con": "Chọn phát biểu ĐÚNG về switch và hub:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một địa chỉ IP tĩnh được cấu hình cho một thiết bị:",
    "re": "Thiết bị sẽ luôn có cùng một địa chỉ IP mỗi khi khởi động"
  },
  {
    "con": "Khi một gói tin bị mất trong quá trình truyền tải:",
    "re": "Giao thức TCP sẽ yêu cầu gửi lại gói tin đó"
  },
  {
    "con": "Khi sử dụng NAT (Network Address Translation):",
    "re": "Địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng"
  },
  {
    "con": "Khi một thiết bị trong mạng không thể kết nối với Internet:",
    "re": "Có thể do cấu hình DNS không chính xác"
  },
  {
    "con": "Khi sử dụng mô hình OSI:",
    "re": "Mỗi lớp có chức năng và nhiệm vụ riêng biệt"
  },
  {
    "con": "Khi một mạng LAN sử dụng giao thức Ethernet:",
    "re": "Các thiết bị trong mạng có thể giao tiếp với nhau thông qua khung dữ liệu"
  },
  {
    "con": "Khi một router nhận được gói tin:",
    "re": "Router sẽ kiểm tra địa chỉ đích để xác định đường đi tiếp theo"
  },
  {
    "con": "Khi một mạng không dây sử dụng WPA2:",
    "re": "Mạng sẽ được bảo mật tốt hơn so với WEP"
  },
  {
    "con": "Khi một thiết bị sử dụng DHCP:",
    "re": "Thiết bị sẽ tự động nhận địa chỉ IP từ máy chủ DHCP"
  },
  {
    "con": "Cáp UTP được sử dụng với đầu nối là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạng LAN sử dụng giao thức Ethernet thì tốc độ truyền dữ liệu có thể đạt đến 1 Gbps.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một thiết bị trong mạng không có địa chỉ IP thì thiết bị đó không thể giao tiếp với các thiết bị khác trong mạng.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một router không có bảng định tuyến thì nó sẽ không biết cách chuyển tiếp gói tin đến đích.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mạng sử dụng giao thức TCP thì nó sẽ đảm bảo tính toàn vẹn của dữ liệu.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một thiết bị mạng bị lỗi phần cứng thì nó có thể gây ra sự gián đoạn trong kết nối mạng.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mạng sử dụng NAT (Network Address Translation) thì địa chỉ IP riêng sẽ được ánh xạ sang địa chỉ IP công cộng.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một gói tin bị mất trong quá trình truyền tải qua mạng thì giao thức UDP sẽ không thực hiện việc truyền lại gói tin đó.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mạng không có bảo mật thì nó sẽ dễ bị tấn công từ bên ngoài.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một thiết bị mạng sử dụng giao thức DHCP thì nó sẽ tự động nhận địa chỉ IP từ máy chủ DHCP.",
    "re": "Đúng"
  }
]