[
  {
    "con": "Điện áp phân cực tại collector (V_{C}) của mạch khuyếch đại hoạt động ở chế độ A xấp xĩ bằng 0.5V",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tần số của dòng điện xoay chiều (AC) trong một mạch RLC là bằng tần số cộng hưởng",
    "re": "Mạch đạt được công suất tối đa"
  },
  {
    "con": "Điện trở của một dây dẫn tăng lên khi nhiệt độ của nó tăng",
    "re": "Điện trở suất của vật liệu tăng lên"
  },
  {
    "con": "Khi điện áp đầu vào của một mạch khuyếch đại tăng lên",
    "re": "Điện áp đầu ra cũng sẽ tăng lên theo tỷ lệ khuếch đại"
  },
  {
    "con": "Nếu một tụ điện được nạp đầy và sau đó ngắt kết nối khỏi nguồn điện",
    "re": "Nó sẽ giữ lại điện tích cho đến khi được xả"
  },
  {
    "con": "Khi dòng điện chạy qua một cuộn dây, nó sẽ tạo ra một từ trường xung quanh",
    "re": "Từ trường này có thể ảnh hưởng đến các thiết bị lân cận"
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn hơn, thì dòng điện chạy qua mạch sẽ giảm",
    "re": "Theo định luật Ohm, I = V/R"
  },
  {
    "con": "Khi một diode được phân cực thuận",
    "re": "Nó sẽ cho phép dòng điện chạy qua"
  },
  {
    "con": "Nếu tần số của tín hiệu đầu vào vượt quá tần số cắt của bộ lọc",
    "re": "Tín hiệu đầu ra sẽ giảm mạnh"
  },
  {
    "con": "Khi một mạch điện có nhiều nguồn điện song song",
    "re": "Điện áp đầu ra sẽ bằng điện áp của nguồn có điện áp cao nhất"
  },
  {
    "con": "Trở kháng vào của mạch khuyếch đại phân cực base sẽ bằng . . . . . . . .",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở trong mạch nối tiếp sẽ tỉ lệ với giá trị của điện trở đó",
    "re": "Điện áp sẽ được phân chia theo tỷ lệ"
  },
  {
    "con": "Tần số của tín hiệu trong mạch LC sẽ được xác định bởi giá trị của cuộn cảm và tụ điện",
    "re": "Tần số cộng hưởng sẽ được tính bằng công thức f = 1/(2π√(LC))"
  },
  {
    "con": "Nếu điện áp nguồn tăng lên trong một mạch điện trở, thì dòng điện sẽ tăng theo định luật Ohm",
    "re": "Dòng điện sẽ tỉ lệ thuận với điện áp"
  },
  {
    "con": "Trong mạch RLC, nếu tần số của nguồn điện bằng tần số cộng hưởng, thì trở kháng sẽ đạt giá trị tối thiểu",
    "re": "Dòng điện sẽ đạt giá trị tối đa"
  },
  {
    "con": "Nếu một tụ điện được nạp đầy, thì điện áp trên tụ sẽ bằng điện áp nguồn",
    "re": "Tụ điện sẽ không còn nạp thêm điện"
  },
  {
    "con": "Khi một mạch điện có nhiều nhánh song song, thì điện áp trên mỗi nhánh sẽ bằng nhau",
    "re": "Dòng điện sẽ phân chia theo tỷ lệ điện trở"
  },
  {
    "con": "Nếu một cuộn cảm được kết nối với nguồn điện một chiều, thì nó sẽ tạo ra một điện áp phản kháng ban đầu",
    "re": "Điện áp sẽ giảm dần đến 0 khi dòng điện ổn định"
  },
  {
    "con": "Trong một mạch điện xoay chiều, nếu pha của dòng điện và điện áp lệch nhau 90 độ, thì công suất tiêu thụ sẽ bằng 0",
    "re": "Không có công suất thực tiêu thụ"
  },
  {
    "con": "Nếu điện trở của một mạch giảm xuống, thì dòng điện sẽ tăng lên nếu điện áp không đổi",
    "re": "Theo định luật Ohm, dòng điện sẽ tỉ lệ thuận với điện áp và nghịch đảo với điện trở"
  },
  {
    "con": "Trở kháng ra của mạch khuyếch đại phân cực base sẽ bằng . . . . . . . .",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp đầu vào của mạch khuếch đại vượt quá điện áp ngưỡng thì",
    "re": "mạch sẽ bị bão hòa"
  },
  {
    "con": "Nếu tần số của tín hiệu tăng lên trong mạch LC thì",
    "re": "điện trở của mạch sẽ giảm"
  },
  {
    "con": "Nếu điện trở của một mạch giảm xuống thì",
    "re": "dòng điện qua mạch sẽ tăng lên theo định luật Ohm"
  },
  {
    "con": "Nếu một tụ điện được nạp đầy thì",
    "re": "nó sẽ không cho dòng điện đi qua nữa"
  },
  {
    "con": "Nếu một cuộn dây được kết nối với nguồn điện xoay chiều thì",
    "re": "nó sẽ tạo ra một từ trường biến đổi"
  },
  {
    "con": "Nếu điện áp giữa hai đầu của một điện trở là không đổi thì",
    "re": "công suất tiêu thụ của điện trở sẽ tỉ lệ thuận với bình phương dòng điện"
  },
  {
    "con": "Nếu một mạch điện có nhiều nhánh song song thì",
    "re": "điện áp giữa các nhánh sẽ bằng nhau"
  },
  {
    "con": "Nếu tần số của nguồn điện thay đổi thì",
    "re": "các thông số của mạch RLC sẽ thay đổi theo"
  },
  {
    "con": "Nếu một diode được kết nối ngược chiều với nguồn điện thì",
    "re": "nó sẽ không dẫn điện"
  },
  {
    "con": "Độ lệch pha giữa hai tín hiệu vào và ra của mạch khuyếch đại phân cực base bằng 180 độ",
    "re": "Mạch khuyếch đại hoạt động ở chế độ đảo chiều"
  },
  {
    "con": "Điện áp trên một điện trở trong mạch nối tiếp bằng điện áp nguồn",
    "re": "Tổng điện trở trong mạch là tổng của các điện trở"
  },
  {
    "con": "Tần số của tín hiệu đầu vào tăng",
    "re": "Độ lệch pha giữa tín hiệu đầu vào và đầu ra của mạch lọc sẽ thay đổi"
  },
  {
    "con": "Cường độ dòng điện qua một điện trở tăng",
    "re": "Nhiệt độ của điện trở sẽ tăng theo do hiệu ứng Joule"
  },
  {
    "con": "Tổng trở của mạch RLC nối tiếp bằng 0",
    "re": "Mạch sẽ cho dòng điện tối đa tại tần số cộng hưởng"
  },
  {
    "con": "Điện áp trên tụ điện trong mạch RLC giảm",
    "re": "Cường độ dòng điện qua mạch sẽ giảm theo"
  },
  {
    "con": "Tần số của mạch dao động tự do tăng",
    "re": "Thời gian chu kỳ dao động sẽ giảm"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại vượt quá điện áp tối đa cho phép",
    "re": "Mạch có thể bị hỏng hoặc hoạt động không ổn định"
  },
  {
    "con": "Điện trở của một mạch song song giảm",
    "re": "Cường độ dòng điện tổng qua mạch sẽ tăng"
  },
  {
    "con": "Tín hiệu đầu vào của mạch điều chế tần số có biên độ lớn",
    "re": "Tín hiệu đầu ra sẽ có tần số thay đổi theo biên độ tín hiệu đầu vào"
  },
  {
    "con": "Công thức chung để tính hệ số khuyếch đại điện áp của mạch khuyếch đại phân cực base là Av = Vout/Vin",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện trở tương đương của hai điện trở mắc nối tiếp là R = R1 + R2",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi tần số tăng, điện dung của tụ điện sẽ giảm khả năng cản trở dòng điện",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong mạch RLC, tần số cộng hưởng xảy ra khi L và C tạo thành một mạch cộng hưởng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp trên một điện trở là không đổi, thì dòng điện qua điện trở đó sẽ tỉ lệ thuận với giá trị của điện trở",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một mạch điện có điện áp xoay chiều, thì điện áp và dòng điện có thể lệch pha nhau",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn, thì dòng điện chạy qua mạch sẽ nhỏ",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Công suất tiêu thụ trong một mạch điện là tích của điện áp và dòng điện",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi sử dụng biến áp, nếu số vòng dây ở cuộn sơ cấp nhiều hơn cuộn thứ cấp, thì điện áp ở cuộn sơ cấp sẽ lớn hơn điện áp ở cuộn thứ cấp",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tụ điện được nạp đầy, thì nó sẽ không cho dòng điện chạy qua",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trở kháng vào của một mạch khuyếch đại bằng transistor có thể đo được bằng cách sử dụng . .",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở trong mạch nối tiếp bằng với dòng điện nhân với giá trị điện trở đó",
    "re": "Định luật Ohm được áp dụng"
  },
  {
    "con": "Tần số của một mạch LC có thể tính toán bằng công thức f = 1/(2π√(LC))",
    "re": "Tần số cộng hưởng của mạch LC được xác định"
  },
  {
    "con": "Khi điện áp tăng lên trong một mạch RLC, dòng điện sẽ bị trễ pha so với điện áp",
    "re": "Hiện tượng trễ pha trong mạch RLC xảy ra"
  },
  {
    "con": "Nếu một mạch điện có điện trở tổng cộng là R và nguồn điện áp là V, thì công suất tiêu thụ được tính bằng công thức P = V^2/R",
    "re": "Công suất tiêu thụ trong mạch được xác định"
  },
  {
    "con": "Khi sử dụng biến áp, nếu số vòng dây ở cuộn sơ cấp nhiều hơn cuộn thứ cấp, điện áp ở cuộn sơ cấp sẽ cao hơn cuộn thứ cấp",
    "re": "Nguyên tắc biến áp được áp dụng"
  },
  {
    "con": "Trong một mạch điện xoay chiều, nếu điện trở và cảm kháng bằng nhau, thì hệ số công suất sẽ bằng 1",
    "re": "Mạch điện hoạt động ở chế độ công suất tối ưu"
  },
  {
    "con": "Nếu một mạch điện có điện trở và cảm kháng, thì tổng trở Z có thể tính bằng công thức Z = √(R^2 + X^2)",
    "re": "Tổng trở của mạch được xác định"
  },
  {
    "con": "Khi một tụ điện được nạp điện, điện áp trên tụ điện sẽ tăng dần cho đến khi đạt đến điện áp nguồn",
    "re": "Quá trình nạp điện của tụ điện diễn ra"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện, thì điện áp tổng cộng sẽ là tổng đại số của các điện áp nguồn",
    "re": "Nguyên tắc cộng điện áp trong mạch điện được áp dụng"
  },
  {
    "con": "Trở kháng ra của một mạch khuyếch đại bằng transistor có thể đo được bằng cách sử dụng đồng hồ ohm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của một mạch khuếch đại phải nằm trong khoảng cho phép của transistor",
    "re": "Mạch sẽ hoạt động ổn định"
  },
  {
    "con": "Tần số hoạt động của mạch phải nằm trong dải tần số cho phép của linh kiện",
    "re": "Mạch sẽ không bị méo tín hiệu"
  },
  {
    "con": "Nếu điện trở tải quá thấp so với điện trở nguồn",
    "re": "Mạch sẽ tiêu tốn nhiều năng lượng hơn và có thể gây hư hỏng"
  },
  {
    "con": "Nếu sử dụng tụ điện trong mạch lọc",
    "re": "Mạch sẽ loại bỏ được các tần số không mong muốn"
  },
  {
    "con": "Nếu điện áp đầu ra của nguồn cung cấp không ổn định",
    "re": "Thiết bị kết nối sẽ hoạt động không chính xác hoặc hư hỏng"
  },
  {
    "con": "Nếu sử dụng dây dẫn có tiết diện nhỏ cho dòng điện lớn",
    "re": "Dây dẫn sẽ bị nóng và có nguy cơ cháy nổ"
  },
  {
    "con": "Nếu tần số của tín hiệu đầu vào vượt quá tần số cắt của bộ lọc",
    "re": "Tín hiệu đầu ra sẽ bị suy giảm đáng kể"
  },
  {
    "con": "Nếu mạch có nhiều linh kiện mắc nối tiếp",
    "re": "Tổng trở của mạch sẽ tăng lên"
  },
  {
    "con": "Nếu sử dụng diode trong mạch chỉnh lưu",
    "re": "Điện áp đầu ra sẽ được chuyển đổi từ AC sang DC"
  },
  {
    "con": "Họ đặc tuyến ra của BJT là đồ thị của dòng điện collector (Ic) theo điện áp collector-emitter (Vce)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện trở của mạch là R và dòng điện chạy qua mạch là I thì điện áp trên mạch là U = R * I",
    "re": "Định luật Ohm"
  },
  {
    "con": "Nếu một cuộn dây có số vòng quấn N và dòng điện thay đổi theo thời gian thì sẽ xuất hiện điện áp cảm ứng theo định luật Faraday",
    "re": "Điện áp cảm ứng sẽ tỷ lệ thuận với tốc độ thay đổi dòng điện"
  },
  {
    "con": "Nếu tần số của dòng điện xoay chiều là f thì chu kỳ T = 1/f",
    "re": "Mối quan hệ giữa tần số và chu kỳ"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và công suất P thì điện áp U = √(P * R)",
    "re": "Công thức tính điện áp trong mạch điện"
  },
  {
    "con": "Nếu điện áp trên một tụ điện là U và điện dung là C thì điện tích Q = C * U",
    "re": "Công thức tính điện tích trong tụ điện"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở nối tiếp thì điện trở tương đương Rt = R1 + R2 + ... + Rn",
    "re": "Công thức tính điện trở tương đương trong mạch nối tiếp"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở song song thì điện trở tương đương 1/Rt = 1/R1 + 1/R2 + ... + 1/Rn",
    "re": "Công thức tính điện trở tương đương trong mạch song song"
  },
  {
    "con": "Nếu một động cơ điện hoạt động ở công suất P và hiệu suất η thì công suất tiêu thụ điện là Pđiện = P/η",
    "re": "Công thức tính công suất tiêu thụ điện của động cơ"
  },
  {
    "con": "Nếu điện áp trên một điện trở là U và dòng điện chạy qua là I thì công suất tiêu thụ trên điện trở là P = U * I",
    "re": "Công thức tính công suất tiêu thụ trên điện trở"
  },
  {
    "con": "Khi kiểm tra một BJT tốt bằng đồng hồ đo điện trở,",
    "re": "BJT sẽ biểu hiện điện trở vô hạn giữa chân E và C khi chân B không được cấp điện."
  },
  {
    "con": "Khi một mạch điện có điện trở R và nguồn điện áp V,",
    "re": "cường độ dòng điện I sẽ được tính bằng công thức I = V/R."
  },
  {
    "con": "Khi sử dụng một tụ điện trong mạch AC,",
    "re": "tụ điện sẽ tạo ra độ lệch pha giữa điện áp và dòng điện."
  },
  {
    "con": "Khi một cuộn dây được kết nối với nguồn điện xoay chiều,",
    "re": "cuộn dây sẽ tạo ra một từ trường biến đổi theo thời gian."
  },
  {
    "con": "Khi điện áp trên một điện trở tăng lên,",
    "re": "cường độ dòng điện qua điện trở cũng sẽ tăng lên theo định luật Ohm."
  },
  {
    "con": "Khi một diode được kết nối ngược chiều với nguồn điện,",
    "re": "diode sẽ không cho dòng điện chạy qua."
  },
  {
    "con": "Khi một mạch điện có nhiều điện trở nối tiếp,",
    "re": "điện trở tổng sẽ bằng tổng các điện trở riêng lẻ."
  },
  {
    "con": "Khi một mạch điện có nhiều điện trở nối song song,",
    "re": "điện trở tổng sẽ nhỏ hơn điện trở nhỏ nhất trong mạch."
  },
  {
    "con": "Khi một transistor hoạt động trong chế độ khuếch đại,",
    "re": "nó sẽ khuếch đại tín hiệu đầu vào tại chân B ra chân C."
  },
  {
    "con": "Khi một mạch điện có tụ điện và cuộn dây,",
    "re": "mạch sẽ có hiện tượng cộng hưởng tại tần số nhất định."
  },
  {
    "con": "Khi đầu que dương của một đồng hồ đo điện trở [ohmmeter] được nối đến base, còn đầu que âm được nối đến collector của một transistor NPN, giá trị điện trở đo được là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp trên một điện trở tăng lên, thì dòng điện chạy qua điện trở đó cũng sẽ tăng lên theo định luật Ohm.",
    "re": "Dòng điện tăng lên"
  },
  {
    "con": "Khi một mạch điện có điện trở tổng lớn hơn, thì dòng điện chạy qua mạch sẽ giảm xuống.",
    "re": "Dòng điện giảm xuống"
  },
  {
    "con": "Khi tần số của một tín hiệu AC tăng lên, thì điện trở của một cuộn cảm cũng sẽ tăng lên.",
    "re": "Điện trở cuộn cảm tăng lên"
  },
  {
    "con": "Khi một tụ điện được nạp đầy, thì điện áp trên tụ điện sẽ đạt đến giá trị tối đa và không còn dòng điện chạy qua.",
    "re": "Không còn dòng điện chạy qua"
  },
  {
    "con": "Khi một transistor được phân cực thuận, thì nó sẽ dẫn điện và cho phép dòng điện chạy qua.",
    "re": "Dòng điện chạy qua"
  },
  {
    "con": "Khi một mạch điện có nhiều nguồn điện song song, thì điện áp tổng của mạch sẽ bằng điện áp của nguồn có điện áp cao nhất.",
    "re": "Điện áp tổng bằng điện áp cao nhất"
  },
  {
    "con": "Khi một mạch điện có điện trở và cuộn cảm nối tiếp, thì tổng điện trở của mạch sẽ là tổng của điện trở và điện trở tương đương của cuộn cảm.",
    "re": "Tổng điện trở là tổng của điện trở và điện trở cuộn cảm"
  },
  {
    "con": "Khi một mạch điện có điện trở và tụ điện nối tiếp, thì tổng điện trở của mạch sẽ phụ thuộc vào tần số của tín hiệu.",
    "re": "Tổng điện trở phụ thuộc vào tần số"
  },
  {
    "con": "Khi một mạch điện có điện áp xoay chiều, thì dòng điện sẽ thay đổi theo hình sin theo thời gian.",
    "re": "Dòng điện thay đổi theo hình sin"
  },
  {
    "con": "Khi đầu que âm của một ohmmeter được nối đến cực base và đầu que dương được nối đến cực emitter của một transistor NPN, thì giá trị điện trở đo được là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp trên một điện trở tăng lên, thì dòng điện chạy qua điện trở đó cũng sẽ tăng lên theo định luật Ohm.",
    "re": "Dòng điện tăng"
  },
  {
    "con": "Khi một mạch điện có điện trở lớn hơn, thì công suất tiêu thụ trong mạch sẽ giảm nếu điện áp không đổi.",
    "re": "Công suất giảm"
  },
  {
    "con": "Khi tần số của dòng điện xoay chiều tăng lên, thì điện trở của cuộn cảm sẽ tăng theo.",
    "re": "Điện trở cuộn cảm tăng"
  },
  {
    "con": "Khi một tụ điện được nạp đầy, thì điện áp trên tụ sẽ bằng điện áp nguồn.",
    "re": "Điện áp tụ bằng điện áp nguồn"
  },
  {
    "con": "Khi một mạch điện có nhiều nguồn điện song song, thì điện áp tổng của mạch sẽ bằng điện áp của nguồn có điện áp cao nhất.",
    "re": "Điện áp tổng bằng điện áp cao nhất"
  },
  {
    "con": "Khi một transistor hoạt động trong vùng bão hòa, thì nó sẽ dẫn điện tối đa và điện áp giữa collector và emitter sẽ gần bằng 0.",
    "re": "Điện áp collector-emitter gần bằng 0"
  },
  {
    "con": "Khi một mạch điện có điện trở nhỏ hơn, thì dòng điện chạy qua mạch sẽ tăng lên nếu điện áp không đổi.",
    "re": "Dòng điện tăng"
  },
  {
    "con": "Khi một cuộn cảm được kết nối với nguồn điện một chiều, thì nó sẽ tạo ra một điện áp ngược trong quá trình chuyển đổi.",
    "re": "Điện áp ngược xuất hiện"
  },
  {
    "con": "Khi một mạch điện có điện trở và tụ điện nối tiếp, thì thời gian để tụ điện nạp đầy sẽ phụ thuộc vào giá trị của điện trở và tụ điện.",
    "re": "Thời gian nạp phụ thuộc vào R và C"
  },
  {
    "con": "Điện trở đo được giữa hai cực collector và emitter của một transistor tốt là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp trên một điện trở là 10V và điện trở là 5Ω, thì dòng điện chạy qua điện trở đó là bao nhiêu ?",
    "re": "2A"
  },
  {
    "con": "Nếu một mạch điện có tổng trở là 20Ω và dòng điện chạy qua là 3A, thì điện áp trên mạch đó là bao nhiêu ?",
    "re": "60V"
  },
  {
    "con": "Nếu tần số của một sóng điện từ là 50Hz, thì chu kỳ của sóng đó là bao nhiêu ?",
    "re": "0.02s"
  },
  {
    "con": "Nếu một tụ điện có điện dung 10μF và điện áp 12V, thì năng lượng lưu trữ trong tụ điện đó là bao nhiêu ?",
    "re": "0.72mJ"
  },
  {
    "con": "Nếu một động cơ điện có công suất 1500W và điện áp 230V, thì dòng điện tiêu thụ của động cơ đó là bao nhiêu ?",
    "re": "6.52A"
  },
  {
    "con": "Nếu một mạch điện có hai điện trở 4Ω và 6Ω mắc nối tiếp, thì tổng điện trở của mạch đó là bao nhiêu ?",
    "re": "10Ω"
  },
  {
    "con": "Nếu một transistor hoạt động trong chế độ khuếch đại, thì điện áp đầu ra sẽ phụ thuộc vào điện áp đầu vào và hệ số khuếch đại của transistor đó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một cuộn dây có độ tự cảm 2H và dòng điện thay đổi 3A trong 1 giây, thì điện áp cảm ứng trong cuộn dây đó là bao nhiêu ?",
    "re": "6V"
  },
  {
    "con": "Nếu một mạch điện có công suất tiêu thụ 100W và điện áp 220V, thì hệ số công suất của mạch đó là bao nhiêu ?",
    "re": "0.45"
  },
  {
    "con": "Giá trị điện áp trên collector của transistor ở hình 3.40a, là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện trở của mạch điện là R, và điện áp là U, thì dòng điện I sẽ được tính bằng công thức nào ?",
    "re": "I = U / R"
  },
  {
    "con": "Nếu tần số của dòng điện xoay chiều tăng lên, thì độ lớn của điện dung cần thiết để duy trì cùng một điện áp sẽ như thế nào ?",
    "re": "Giảm xuống"
  },
  {
    "con": "Nếu một cuộn dây có số vòng quấn N và dòng điện I chạy qua, thì từ thông Φ sẽ được tính như thế nào ?",
    "re": "Φ = L * I, với L là độ tự cảm"
  },
  {
    "con": "Nếu điện áp trên một tụ điện là U và điện dung là C, thì năng lượng lưu trữ trong tụ điện sẽ được tính bằng công thức nào ?",
    "re": "W = 0.5 * C * U^2"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và công suất P, thì điện áp U sẽ được tính như thế nào ?",
    "re": "U = √(P * R)"
  },
  {
    "con": "Nếu một động cơ điện hoạt động ở tần số f và có công suất P, thì mô-men xoắn T sẽ được tính bằng công thức nào ?",
    "re": "T = P / (2 * π * f)"
  },
  {
    "con": "Nếu điện áp đầu vào của một bộ khuếch đại là Vin và hệ số khuếch đại là A, thì điện áp đầu ra Vout sẽ được tính như thế nào ?",
    "re": "Vout = A * Vin"
  },
  {
    "con": "Nếu một mạch điện có điện trở R1 và R2 mắc nối tiếp, thì điện trở tương đương Rt sẽ được tính như thế nào ?",
    "re": "Rt = R1 + R2"
  },
  {
    "con": "Nếu một tụ điện được nạp điện với điện áp U và có điện dung C, thì thời gian nạp điện t sẽ phụ thuộc vào điều gì ?",
    "re": "Thời gian nạp điện t phụ thuộc vào R và C trong mạch RC"
  },
  {
    "con": "Điện áp trên collector của transistor ở mạch hình 3.40b là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện trở của mạch nối tiếp là tổng của các điện trở trong mạch đó ?",
    "re": "Điều này đúng"
  },
  {
    "con": "Công suất tiêu thụ trong một mạch điện là tích của điện áp và dòng điện ?",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu tần số của dòng điện xoay chiều tăng thì độ cảm kháng của cuộn cảm sẽ tăng ?",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu điện áp trên một tụ điện tăng thì điện tích trên tụ cũng tăng ?",
    "re": "Điều này đúng"
  },
  {
    "con": "Trong mạch điện một chiều, nếu điện trở tăng thì dòng điện sẽ giảm ?",
    "re": "Điều này đúng theo định luật Ohm"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện thì điện áp tổng của mạch sẽ là tổng các điện áp của nguồn ?",
    "re": "Điều này đúng trong mạch nối tiếp"
  },
  {
    "con": "Nếu điện áp và dòng điện trong mạch điện là đồng pha thì công suất tiêu thụ là cực đại ?",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một cuộn cảm và một tụ điện được kết nối với nhau thì chúng có thể tạo ra dao động điện từ ?",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu điện áp trên một điện trở là không thì dòng điện qua điện trở đó cũng sẽ là không ?",
    "re": "Điều này đúng theo định luật Ohm"
  },
  {
    "con": "Mức điện áp DC trên collector của transistor ở mạch hình 3.41, là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện trở của mạch là R và dòng điện chạy qua là I, thì điện áp trên mạch là bao nhiêu ?",
    "re": "Điện áp U = R * I"
  },
  {
    "con": "Nếu tần số của dòng điện xoay chiều là f, thì chu kỳ T của dòng điện là bao nhiêu ?",
    "re": "Chu kỳ T = 1/f"
  },
  {
    "con": "Nếu công suất tiêu thụ của một thiết bị là P và điện áp là U, thì dòng điện I chạy qua thiết bị là bao nhiêu ?",
    "re": "Dòng điện I = P/U"
  },
  {
    "con": "Nếu một mạch điện có hai điện trở R1 và R2 mắc nối tiếp, thì điện trở tương đương R tổng là bao nhiêu ?",
    "re": "R tổng = R1 + R2"
  },
  {
    "con": "Nếu một mạch điện có hai điện trở R1 và R2 mắc song song, thì điện trở tương đương R tổng là bao nhiêu ?",
    "re": "1/R tổng = 1/R1 + 1/R2"
  },
  {
    "con": "Nếu điện áp trên một tụ điện là U và điện dung là C, thì điện tích Q trên tụ điện là bao nhiêu ?",
    "re": "Điện tích Q = C * U"
  },
  {
    "con": "Nếu một cuộn dây có độ tự cảm L và dòng điện thay đổi theo thời gian, thì sức điện động cảm ứng E là bao nhiêu ?",
    "re": "E = -L * (dI/dt)"
  },
  {
    "con": "Nếu một mạch điện có công suất P và điện áp U, thì hiệu suất η của mạch là bao nhiêu ?",
    "re": "η = P thực tế / P lý thuyết"
  },
  {
    "con": "Nếu một mạch điện có điện áp U và điện trở R, thì công suất tiêu thụ P là bao nhiêu ?",
    "re": "P = U^2 / R"
  },
  {
    "con": "Điện áp DC trên cực base của transistor ở mạch hình 3.41, là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện trở của mạch nối tiếp là tổng của các điện trở trong mạch đó",
    "re": "Điện trở tổng là R1 + R2 + ... + Rn"
  },
  {
    "con": "Tần số của dòng điện xoay chiều là tần số của nguồn cung cấp",
    "re": "Tần số AC thường là 50Hz hoặc 60Hz"
  },
  {
    "con": "Công suất tiêu thụ của một mạch điện là tích của điện áp và dòng điện",
    "re": "Công suất P = U * I"
  },
  {
    "con": "Nếu điện áp trên một tụ điện tăng lên, thì điện tích trên tụ điện cũng tăng lên",
    "re": "Điện tích Q = C * U"
  },
  {
    "con": "Trong mạch điện, nếu điện trở giảm, thì dòng điện sẽ tăng lên",
    "re": "Theo định luật Ohm, I = U / R"
  },
  {
    "con": "Nếu một cuộn dây có dòng điện thay đổi, thì sẽ sinh ra điện áp cảm ứng",
    "re": "Điện áp cảm ứng được mô tả bởi định luật Faraday"
  },
  {
    "con": "Nếu điện áp trên một điện trở là không, thì dòng điện qua điện trở đó cũng sẽ là không",
    "re": "Theo định luật Ohm, I = U / R"
  },
  {
    "con": "Nếu tần số của tín hiệu tăng lên, thì chiều dài sóng sẽ giảm",
    "re": "Chiều dài sóng λ = v / f, với v là tốc độ ánh sáng"
  },
  {
    "con": "Nếu một mạch điện có nhiều nhánh song song, thì điện áp trên mỗi nhánh là như nhau",
    "re": "Điện áp U = U1 = U2 = ... = Un"
  },
  {
    "con": "Điện áp tín hiệu trên collector của transistor ở mạch hình 3.41, là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện trở của mạch song song giảm khi điện trở của một trong các nhánh giảm.",
    "re": "Điện trở tương đương của mạch giảm"
  },
  {
    "con": "Tần số của tín hiệu AC tăng thì chiều dài sóng của tín hiệu giảm.",
    "re": "Chiều dài sóng ngắn lại"
  },
  {
    "con": "Khi điện áp trên một tụ điện tăng, thì điện tích trên tụ điện cũng tăng.",
    "re": "Điện tích tích lũy trên tụ điện tăng"
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn hơn, thì dòng điện chạy qua mạch sẽ giảm.",
    "re": "Dòng điện giảm"
  },
  {
    "con": "Khi nhiệt độ của một chất dẫn điện tăng, thì điện trở của chất đó thường tăng.",
    "re": "Điện trở tăng"
  },
  {
    "con": "Nếu tần số của tín hiệu trong mạch RLC vượt quá tần số cộng hưởng, thì mạch sẽ có tính chất kháng.",
    "re": "Mạch có tính chất kháng"
  },
  {
    "con": "Khi một cuộn dây được đặt trong từ trường thay đổi, thì nó sẽ tạo ra điện áp.",
    "re": "Điện áp được tạo ra"
  },
  {
    "con": "Nếu điện áp trên một diode vượt quá điện áp ngưỡng, thì diode sẽ dẫn điện.",
    "re": "Diode dẫn điện"
  },
  {
    "con": "Khi một mạch điện có công suất tiêu thụ lớn, thì nhiệt độ của các linh kiện trong mạch sẽ tăng.",
    "re": "Nhiệt độ linh kiện tăng"
  },
  {
    "con": "tụ đầu ra (C2) ở hình 3.41, hở mạch",
    "re": "mức điện áp tín hiệu trên collector của transistor là bao nhiêu ?"
  },
  {
    "con": "mạch điện có điện trở R1 và R2 nối tiếp",
    "re": "điện trở tương đương là R1 + R2"
  },
  {
    "con": "mạch điện có tụ điện C nối song song với điện trở R",
    "re": "tần số cắt của mạch là 1/(2πRC)"
  },
  {
    "con": "mạch điện có nguồn điện một chiều",
    "re": "cường độ dòng điện qua mạch là I = V/R"
  },
  {
    "con": "mạch điện có transistor hoạt động trong chế độ khuếch đại",
    "re": "tín hiệu đầu ra sẽ lớn hơn tín hiệu đầu vào"
  },
  {
    "con": "mạch điện có cuộn cảm L nối với điện trở R",
    "re": "điện trở tương đương sẽ thay đổi theo tần số"
  },
  {
    "con": "mạch điện có diode nối ngược",
    "re": "dòng điện qua diode sẽ bằng 0"
  },
  {
    "con": "mạch điện có điện áp xoay chiều",
    "re": "cường độ dòng điện sẽ thay đổi theo thời gian"
  },
  {
    "con": "mạch điện có tụ điện được nạp đầy",
    "re": "điện áp trên tụ sẽ bằng điện áp nguồn"
  },
  {
    "con": "mạch điện có điện trở R và tụ điện C nối song song",
    "re": "tần số cắt của mạch là 1/(2πRC)"
  },
  {
    "con": "Tại sao cần phải ổn định mạch khuyếch đại bằng BJT để chống lại sự thay đổi ở beta ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạch điện có điện trở R và tụ điện C nối tiếp thì tần số cắt của mạch là bao nhiêu ?",
    "re": "Tần số cắt được tính bằng công thức f_c = 1 / (2πRC)"
  },
  {
    "con": "Khi điện áp đầu vào của mạch khuếch đại vượt quá ngưỡng cho phép thì điều gì xảy ra ?",
    "re": "Mạch sẽ bị bão hòa và không còn khuếch đại tín hiệu nữa"
  },
  {
    "con": "Nếu sử dụng dây dẫn có tiết diện nhỏ hơn yêu cầu thì điều gì sẽ xảy ra ?",
    "re": "Dây dẫn sẽ bị nóng lên do dòng điện lớn hơn mức cho phép, có thể gây cháy nổ"
  },
  {
    "con": "Khi sử dụng biến áp, nếu số vòng dây ở cuộn sơ cấp lớn hơn cuộn thứ cấp thì điều gì xảy ra ?",
    "re": "Điện áp ở cuộn thứ cấp sẽ thấp hơn điện áp ở cuộn sơ cấp"
  },
  {
    "con": "Nếu tần số của tín hiệu AC tăng lên thì điện trở của tụ điện sẽ thay đổi như thế nào ?",
    "re": "Điện trở của tụ điện sẽ giảm, cho phép dòng điện chạy qua dễ dàng hơn"
  },
  {
    "con": "Khi một mạch điện có điện trở R và công suất P thì điện áp V được tính như thế nào ?",
    "re": "Điện áp V được tính bằng công thức V = √(P * R)"
  },
  {
    "con": "Nếu một diode được mắc ngược trong mạch thì điều gì sẽ xảy ra ?",
    "re": "Diode sẽ không dẫn điện và mạch sẽ không hoạt động"
  },
  {
    "con": "Khi một tụ điện được nạp đầy thì điều gì xảy ra với dòng điện qua nó ?",
    "re": "Dòng điện sẽ giảm về 0 khi tụ điện đạt điện áp tối đa"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện nối song song thì điện áp tổng của mạch sẽ như thế nào ?",
    "re": "Điện áp tổng của mạch sẽ bằng điện áp của nguồn điện có điện áp cao nhất"
  },
  {
    "con": "Giá trị beta điển hình của một transistor có thể xem xét là từ 20 đến 1000",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện trở của một mạch điện song song sẽ nhỏ hơn điện trở của bất kỳ nhánh nào trong mạch",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi tần số của tín hiệu tăng, điện dung của tụ điện sẽ ảnh hưởng đến độ lớn của dòng điện",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp trên một điện trở tăng, thì dòng điện qua điện trở đó cũng sẽ tăng theo định luật Ohm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong một mạch điện xoay chiều, nếu điện trở và điện kháng bằng nhau, thì hệ số công suất sẽ bằng 1",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một cuộn dây được kết nối với nguồn điện xoay chiều, nó sẽ tạo ra một điện áp tự cảm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện, thì điện áp tổng của mạch sẽ là tổng các điện áp của từng nguồn",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhiệt độ của một chất dẫn điện tăng, điện trở của chất đó thường sẽ tăng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có công suất tiêu thụ lớn hơn công suất cung cấp, thì mạch sẽ không hoạt động ổn định",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong một mạch điện, nếu điện áp giảm, thì công suất tiêu thụ sẽ giảm theo định luật Joule",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "mạch điện có điện trở R và nguồn điện áp V,",
    "re": "cường độ dòng điện I sẽ được tính bằng định luật Ohm: I = V/R"
  },
  {
    "con": "tần số của dòng điện xoay chiều tăng,",
    "re": "điện dung của tụ điện sẽ giảm trong mạch RLC"
  },
  {
    "con": "công suất tiêu thụ trong mạch điện là P,",
    "re": "nếu điện áp tăng gấp đôi, công suất sẽ tăng gấp bốn lần"
  },
  {
    "con": "mạch khuyếch đại có độ lợi A và tín hiệu đầu vào Vin,",
    "re": "tín hiệu đầu ra Vout sẽ là A * Vin"
  },
  {
    "con": "điện áp trên một tụ điện tăng,",
    "re": "năng lượng lưu trữ trong tụ điện sẽ tăng theo bình phương điện áp"
  },
  {
    "con": "mạch điện có nhiều nguồn điện,",
    "re": "cần sử dụng quy tắc cộng điện áp để tính điện áp tổng"
  },
  {
    "con": "tần số cộng hưởng của mạch RLC giảm,",
    "re": "điện trở của mạch sẽ tăng"
  },
  {
    "con": "mạch điện có điện trở R1 và R2 nối tiếp,",
    "re": "điện trở tương đương sẽ là R = R1 + R2"
  },
  {
    "con": "mạch điện có cuộn cảm L và điện trở R,",
    "re": "thời gian đáp ứng sẽ phụ thuộc vào tỷ lệ L/R"
  },
  {
    "con": "mạch điện có điện áp AC và tải phi tuyến,",
    "re": "cần sử dụng phân tích Fourier để xác định thành phần tần số"
  },
  {
    "con": "Trong mạch phân cực phân áp, tại sao điện áp tại điểm nối của Rb1 và Rb2 được xem là độc lập với dòng base của transistor ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp trên một tụ điện tăng lên, thì điện tích trên tụ điện cũng sẽ tăng theo.",
    "re": "Điều này đúng theo định luật của tụ điện."
  },
  {
    "con": "Nếu một mạch điện có điện trở R và nguồn điện áp V, thì dòng điện I chạy qua mạch sẽ được tính bằng công thức I = V/R.",
    "re": "Đây là định luật Ohm."
  },
  {
    "con": "Khi tần số của tín hiệu tăng lên trong một mạch RLC, thì trở kháng của cuộn cảm sẽ tăng lên.",
    "re": "Điều này đúng theo định nghĩa về trở kháng của cuộn cảm."
  },
  {
    "con": "Nếu một transistor hoạt động trong vùng bão hòa, thì nó sẽ dẫn điện tối đa và không còn kiểm soát được dòng điện.",
    "re": "Điều này đúng với nguyên lý hoạt động của transistor."
  },
  {
    "con": "Khi một mạch điện có nhiều điện trở nối tiếp, thì tổng điện trở sẽ bằng tổng các điện trở riêng lẻ.",
    "re": "Đây là quy tắc tính điện trở nối tiếp."
  },
  {
    "con": "Nếu một mạch điện có điện trở song song, thì tổng điện trở sẽ nhỏ hơn điện trở nhỏ nhất trong mạch.",
    "re": "Điều này đúng theo quy tắc tính điện trở song song."
  },
  {
    "con": "Khi một cuộn cảm được kết nối với nguồn điện một chiều, thì nó sẽ tạo ra một dòng điện ổn định sau một khoảng thời gian.",
    "re": "Điều này đúng theo nguyên lý hoạt động của cuộn cảm."
  },
  {
    "con": "Nếu điện áp trên một điện trở tăng lên, thì dòng điện chạy qua điện trở đó cũng sẽ tăng lên.",
    "re": "Điều này đúng theo định luật Ohm."
  },
  {
    "con": "Khi một mạch điện có điện áp xoay chiều, thì dòng điện sẽ thay đổi theo chu kỳ và có thể có độ lệch pha với điện áp.",
    "re": "Điều này đúng với nguyên lý của mạch điện xoay chiều."
  },
  {
    "con": "Trong các mạch khuyếch đại phân cực phân áp, sự chênh lệch điện áp giữa emitter và base luôn bằng 0.7V",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp trên một tụ điện tăng lên, dòng điện qua tụ điện sẽ giảm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và dòng điện I, thì điện áp U sẽ bằng R nhân I",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong một mạch RLC, nếu tần số của nguồn điện bằng tần số riêng của mạch, thì hiện tượng cộng hưởng xảy ra",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một cuộn dây có số vòng quấn N và dòng điện I chạy qua, thì từ thông Φ sẽ tỷ lệ thuận với N và I",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một diode được phân cực thuận, nó sẽ dẫn điện và điện áp rơi trên diode sẽ khoảng 0.7V",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có điện áp U và công suất P, thì dòng điện I sẽ được tính bằng P chia U",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong một mạch điện xoay chiều, nếu tần số tăng, thì điện trở của mạch RLC sẽ thay đổi theo quy luật cộng hưởng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp trên một điện trở tăng lên, thì công suất tiêu thụ trên điện trở sẽ tăng theo bình phương điện áp",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một transistor hoạt động trong chế độ khuếch đại, dòng điện ở collector sẽ tỷ lệ thuận với dòng điện ở base",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong các mạch khuyếch đại phân cực phân áp, khi đã tính được điện áp emitter DC,",
    "re": "dòng collector tại điểm tĩnh có thể tính gần đúng bằng cách chia điện áp emitter cho điện trở của tải."
  },
  {
    "con": "Khi một mạch điện có điện trở R và điện áp U,",
    "re": "dòng điện I chạy qua mạch có thể tính bằng định luật Ohm là I = U/R."
  },
  {
    "con": "Trong một mạch RLC nối tiếp, khi tần số của nguồn điện bằng tần số cộng hưởng,",
    "re": "điện trở tổng của mạch sẽ đạt giá trị tối thiểu và dòng điện sẽ đạt giá trị tối đa."
  },
  {
    "con": "Khi sử dụng transistor trong chế độ khuếch đại,",
    "re": "điện áp đầu ra sẽ tỷ lệ thuận với điện áp đầu vào nếu transistor hoạt động trong vùng tuyến tính."
  },
  {
    "con": "Khi một cuộn dây (inductor) được kết nối với nguồn điện một chiều,",
    "re": "dòng điện qua cuộn dây sẽ tăng dần theo thời gian cho đến khi đạt giá trị ổn định."
  },
  {
    "con": "Trong một mạch điện xoay chiều, khi điện áp và dòng điện lệch pha 90 độ,",
    "re": "công suất thực sẽ bằng 0."
  },
  {
    "con": "Khi một tụ điện (capacitor) được nạp điện,",
    "re": "điện áp trên tụ sẽ tăng dần cho đến khi đạt giá trị điện áp nguồn."
  },
  {
    "con": "Khi sử dụng mạch điều khiển PID,",
    "re": "các tham số tỉ lệ, tích phân và vi phân cần được điều chỉnh để đạt được phản hồi ổn định."
  },
  {
    "con": "Trong một mạch điện có nhiều nguồn điện song song,",
    "re": "điện áp trên mỗi nguồn sẽ bằng nhau, nhưng dòng điện sẽ chia theo tỷ lệ điện trở."
  },
  {
    "con": "Khi thiết kế mạch điện, nếu điện trở tải quá thấp,",
    "re": "có thể dẫn đến quá tải và hư hỏng các linh kiện trong mạch."
  },
  {
    "con": "Trong các mạch khuyếch đại phân cực phân áp, điện áp collector được tính bằng cách . . . . . . .",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện trở tương đương của hai điện trở mắc nối tiếp được tính bằng tổng của chúng",
    "re": "R_eq = R1 + R2"
  },
  {
    "con": "Khi một mạch điện có điện áp không đổi, dòng điện sẽ tỉ lệ nghịch với điện trở",
    "re": "Dòng điện sẽ tăng khi điện trở giảm theo định luật Ohm"
  },
  {
    "con": "Trong một mạch RLC, tần số cộng hưởng xảy ra khi điện trở là tối thiểu",
    "re": "Tần số cộng hưởng được tính bằng f_0 = 1/(2π√(LC))"
  },
  {
    "con": "Khi một cuộn cảm được kết nối với nguồn điện xoay chiều, nó sẽ tạo ra một độ lệch pha giữa điện áp và dòng điện",
    "re": "Dòng điện sẽ chậm pha so với điện áp"
  },
  {
    "con": "Trong một mạch điện ba pha, công suất toàn phần được tính bằng tích của điện áp, dòng điện và hệ số công suất",
    "re": "P = √3 * V * I * cos(φ)"
  },
  {
    "con": "Khi điện áp tăng lên trong một mạch điện, nếu điện trở không thay đổi, dòng điện sẽ tăng lên",
    "re": "Theo định luật Ohm, I = V/R"
  },
  {
    "con": "Khi một diode được phân cực thuận, nó sẽ cho phép dòng điện đi qua",
    "re": "Dòng điện sẽ chạy từ anode sang cathode"
  },
  {
    "con": "Trong một mạch điện, nếu điện áp giảm xuống, công suất tiêu thụ sẽ giảm theo",
    "re": "P = V * I, do đó P giảm khi V giảm"
  },
  {
    "con": "Khi một tụ điện được nạp điện, điện áp trên tụ sẽ tăng lên cho đến khi đạt đến điện áp nguồn",
    "re": "Dòng điện sẽ giảm dần khi tụ điện gần đầy"
  },
  {
    "con": "Mạch phân cực phân áp độc lập với beta, nhưng phải trả giá cho sự không phụ thuộc với beta là gì ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp trên một tụ điện tăng lên, thì dòng điện qua tụ điện sẽ có xu hướng như thế nào ?",
    "re": "Dòng điện sẽ giảm"
  },
  {
    "con": "Nếu một mạch điện có điện trở giảm, thì dòng điện trong mạch sẽ như thế nào ?",
    "re": "Dòng điện sẽ tăng"
  },
  {
    "con": "Nếu tần số của tín hiệu AC tăng, thì điện trở của cuộn cảm sẽ như thế nào ?",
    "re": "Điện trở của cuộn cảm sẽ tăng"
  },
  {
    "con": "Nếu điện áp đầu vào của một bộ khuếch đại tăng lên, thì điện áp đầu ra sẽ như thế nào ?",
    "re": "Điện áp đầu ra sẽ tăng theo tỷ lệ khuếch đại"
  },
  {
    "con": "Nếu một mạch điện có công suất tiêu thụ tăng, thì nhiệt độ của các linh kiện trong mạch sẽ như thế nào ?",
    "re": "Nhiệt độ sẽ tăng"
  },
  {
    "con": "Nếu điện áp lưới thay đổi, thì tần số của máy phát điện sẽ như thế nào ?",
    "re": "Tần số sẽ không thay đổi"
  },
  {
    "con": "Nếu một tụ điện được sạc đầy, thì điện áp trên tụ điện sẽ như thế nào ?",
    "re": "Điện áp sẽ giữ nguyên cho đến khi tụ điện được xả"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện song song, thì điện áp trên các nguồn này sẽ như thế nào ?",
    "re": "Điện áp sẽ bằng nhau"
  },
  {
    "con": "Nếu một cuộn cảm được nối với nguồn điện DC, thì dòng điện qua cuộn cảm sẽ như thế nào ?",
    "re": "Dòng điện sẽ tăng dần cho đến khi đạt giá trị ổn định"
  },
  {
    "con": "Khi tính trở kháng vào, hai điện trở base (Rb1 và Rb2) xuất hiện dưới dạng song song",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp trên một tụ điện tăng lên, dòng điện qua tụ điện sẽ giảm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một mạch điện có điện trở lớn hơn, dòng điện chạy qua mạch sẽ giảm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi tần số của tín hiệu tăng, trở kháng của cuộn cảm sẽ tăng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi sử dụng biến áp, nếu số vòng dây ở cuộn sơ cấp nhiều hơn cuộn thứ cấp, điện áp ở cuộn sơ cấp sẽ lớn hơn cuộn thứ cấp",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một diode được phân cực thuận, nó sẽ cho phép dòng điện chạy qua",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một mạch điện có tụ điện và cuộn cảm, nó có thể tạo ra hiện tượng cộng hưởng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp trên một điện trở tăng, công suất tiêu thụ trên điện trở cũng sẽ tăng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một mạch điện có nhiều nguồn điện song song, điện áp đầu ra sẽ bằng điện áp của nguồn có điện áp cao nhất",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một mạch điện có điện trở không đổi và điện áp tăng, dòng điện sẽ tăng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện trở động của tiếp giáp base - emitter là được mắc ở chế độ phân cực thuận",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp trên một điện trở tăng lên gấp đôi",
    "re": "Dòng điện qua điện trở cũng sẽ tăng lên gấp đôi theo định luật Ohm"
  },
  {
    "con": "Nếu tần số của tín hiệu AC tăng lên",
    "re": "Điện trở của cuộn cảm sẽ tăng lên do hiện tượng cảm kháng"
  },
  {
    "con": "Nếu một mạch điện có điện trở tương đương thấp",
    "re": "Dòng điện trong mạch sẽ lớn hơn theo định luật Ohm"
  },
  {
    "con": "Nếu một tụ điện được nạp điện đến điện áp tối đa",
    "re": "Năng lượng lưu trữ trong tụ điện sẽ đạt giá trị tối đa"
  },
  {
    "con": "Nếu một mạch điện có điện áp không đổi và điện trở tăng",
    "re": "Dòng điện trong mạch sẽ giảm theo định luật Ohm"
  },
  {
    "con": "Nếu một diode được mắc ngược",
    "re": "Nó sẽ không cho dòng điện chạy qua, trừ khi điện áp ngược vượt quá điện áp đổ vỡ"
  },
  {
    "con": "Nếu một mạch RLC được kích thích bằng tín hiệu AC",
    "re": "Mạch sẽ có hiện tượng cộng hưởng tại tần số nhất định"
  },
  {
    "con": "Nếu điện áp đầu vào của một bộ khuếch đại tăng lên",
    "re": "Điện áp đầu ra cũng sẽ tăng lên theo tỷ lệ khuếch đại của bộ khuếch đại"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện song song",
    "re": "Điện áp đầu ra sẽ bằng điện áp của nguồn có điện áp cao nhất"
  },
  {
    "con": "Trở kháng ra của mạch khuyếch đại emitter chung sẽ bằng . . . . . .",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp trên một tụ điện tăng lên thì dòng điện qua tụ điện sẽ . . . . . .",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tần số của tín hiệu tăng thì trở kháng của cuộn cảm sẽ . . . . . .",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và điện áp U thì dòng điện I sẽ bằng . . . . . .",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu công suất tiêu thụ của một thiết bị điện là P và điện áp là U thì dòng điện sẽ bằng . . . . . .",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện xoay chiều có tần số f thì chu kỳ T sẽ bằng . . . . . .",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp trên một điện trở là U và điện trở là R thì công suất tiêu thụ sẽ bằng . . . . . .",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có hai điện trở R1 và R2 mắc nối tiếp thì tổng điện trở sẽ bằng . . . . . .",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tụ điện được nạp điện với điện áp U thì năng lượng lưu trữ trong tụ điện sẽ bằng . . . . . .",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một cuộn cảm có độ tự cảm L và dòng điện qua nó thay đổi thì điện áp cảm ứng sẽ bằng . . . . . .",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Kiểu mạch khuyếch đại phân cực phân áp nào có trở kháng vào cao nhất ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp đầu vào của mạch RLC vượt quá giá trị định mức thì",
    "re": "mạch có thể bị hư hỏng hoặc hoạt động không ổn định"
  },
  {
    "con": "Nếu tần số của tín hiệu đầu vào tăng lên trong mạch LC thì",
    "re": "điện áp đầu ra sẽ giảm do hiện tượng cộng hưởng"
  },
  {
    "con": "Nếu sử dụng transistor NPN trong mạch khuếch đại thì",
    "re": "cần phải cung cấp điện áp dương cho cực B để transistor hoạt động"
  },
  {
    "con": "Nếu điện trở trong mạch song song giảm thì",
    "re": "dòng điện tổng trong mạch sẽ tăng lên"
  },
  {
    "con": "Nếu sử dụng tụ điện trong mạch lọc thì",
    "re": "tụ điện sẽ làm giảm tần số thấp và cho phép tần số cao đi qua"
  },
  {
    "con": "Nếu mạch điện có điện trở lớn hơn thì",
    "re": "dòng điện chạy qua mạch sẽ giảm theo định luật Ohm"
  },
  {
    "con": "Nếu điện áp xoay chiều có biên độ lớn hơn thì",
    "re": "công suất tiêu thụ trong mạch sẽ tăng lên"
  },
  {
    "con": "Nếu sử dụng biến áp trong mạch điện thì",
    "re": "biến áp sẽ thay đổi điện áp mà không làm thay đổi tần số"
  },
  {
    "con": "Nếu mạch điện có nhiều nguồn điện song song thì",
    "re": "cần phải đảm bảo rằng điện áp của các nguồn là giống nhau để tránh dòng điện không mong muốn"
  },
  {
    "con": "Kiểu mạch khuyếch đại phân cực phân áp nào có trở kháng ra cao nhất ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp trên một tụ điện tăng lên, thì dòng điện qua tụ điện sẽ như thế nào ?",
    "re": "Dòng điện sẽ giảm"
  },
  {
    "con": "Nếu một mạch điện có điện trở tăng lên, thì dòng điện trong mạch sẽ như thế nào ?",
    "re": "Dòng điện sẽ giảm"
  },
  {
    "con": "Nếu tần số của tín hiệu AC tăng, thì điện trở của cuộn cảm sẽ như thế nào ?",
    "re": "Điện trở của cuộn cảm sẽ tăng"
  },
  {
    "con": "Nếu một mạch điện có điện áp không đổi và điện trở giảm, thì công suất tiêu thụ sẽ như thế nào ?",
    "re": "Công suất tiêu thụ sẽ tăng"
  },
  {
    "con": "Nếu một diode được mắc ngược, thì nó sẽ như thế nào ?",
    "re": "Diode sẽ không dẫn điện"
  },
  {
    "con": "Nếu một mạch RLC có tần số cộng hưởng, thì trở kháng của mạch sẽ như thế nào ?",
    "re": "Trở kháng sẽ đạt giá trị tối thiểu"
  },
  {
    "con": "Nếu điện áp đầu vào của một bộ chuyển đổi DC-DC tăng, thì điện áp đầu ra sẽ như thế nào ?",
    "re": "Điện áp đầu ra sẽ tăng theo tỷ lệ chuyển đổi"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện song song, thì điện áp tổng của mạch sẽ như thế nào ?",
    "re": "Điện áp tổng sẽ bằng điện áp của nguồn có điện áp cao nhất"
  },
  {
    "con": "Nếu một mạch điện có tụ điện và cuộn cảm mắc nối tiếp, thì tần số cộng hưởng sẽ phụ thuộc vào cái gì ?",
    "re": "Tần số cộng hưởng sẽ phụ thuộc vào giá trị của tụ điện và cuộn cảm"
  },
  {
    "con": "Kiểu mạch khuyếch đại phân cực phân áp nào có hệ số khuyếch đại cao nhất ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một tụ điện trong mạch AC có tần số cao hơn tần số cắt của mạch lọc thì",
    "re": "tụ điện sẽ có điện áp lớn hơn điện áp nguồn"
  },
  {
    "con": "Trong mạch điện một chiều, nếu điện trở tăng thì",
    "re": "dòng điện chạy qua mạch sẽ giảm"
  },
  {
    "con": "Khi một cuộn dây được kết nối với nguồn điện xoay chiều thì",
    "re": "cuộn dây sẽ tạo ra một từ trường biến thiên"
  },
  {
    "con": "Nếu tần số của tín hiệu AC tăng thì",
    "re": "điện trở của mạch RLC sẽ thay đổi theo quy luật của tần số"
  },
  {
    "con": "Khi một diode được phân cực thuận thì",
    "re": "nó sẽ dẫn điện và cho phép dòng điện chạy qua"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở nối tiếp thì",
    "re": "điện trở tổng sẽ bằng tổng các điện trở"
  },
  {
    "con": "Trong một mạch điện từ, nếu dòng điện tăng thì",
    "re": "từ trường tạo ra sẽ mạnh hơn"
  },
  {
    "con": "Khi một transistor hoạt động trong chế độ khuếch đại thì",
    "re": "nó sẽ khuếch đại tín hiệu đầu vào"
  },
  {
    "con": "Nếu điện áp nguồn của một mạch điện giảm thì",
    "re": "công suất tiêu thụ của mạch cũng sẽ giảm"
  },
  {
    "con": "Kiểu mạch khuyếch đại phân cực phân áp nào có méo dạng ít nhất ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại tăng lên thì điện áp đầu ra sẽ như thế nào ?",
    "re": "Điện áp đầu ra cũng sẽ tăng lên theo tỷ lệ khuếch đại"
  },
  {
    "con": "Nếu điện trở của mạch giảm xuống thì dòng điện trong mạch sẽ ra sao ?",
    "re": "Dòng điện sẽ tăng lên theo định luật Ohm"
  },
  {
    "con": "Khi tần số của tín hiệu tăng lên thì trở kháng của tụ điện sẽ như thế nào ?",
    "re": "Trở kháng của tụ điện sẽ giảm xuống"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở nối tiếp thì điện trở tổng sẽ ra sao ?",
    "re": "Điện trở tổng sẽ bằng tổng các điện trở"
  },
  {
    "con": "Khi một cuộn dây được kết nối với nguồn điện xoay chiều thì từ trường sẽ như thế nào ?",
    "re": "Từ trường sẽ thay đổi theo tần số của nguồn điện"
  },
  {
    "con": "Nếu điện áp trên một tụ điện tăng lên thì năng lượng lưu trữ trong tụ điện sẽ ra sao ?",
    "re": "Năng lượng lưu trữ sẽ tăng lên theo bình phương điện áp"
  },
  {
    "con": "Khi một mạch điện có nhiều tụ điện nối tiếp thì điện dung tổng sẽ như thế nào ?",
    "re": "Điện dung tổng sẽ giảm xuống"
  },
  {
    "con": "Nếu một mạch điện có điện trở và cuộn dây thì mạch đó sẽ có đặc tính gì ?",
    "re": "Mạch sẽ có độ dốc pha và độ suy giảm"
  },
  {
    "con": "Khi tần số của tín hiệu trong mạch LC tăng lên thì độ lợi của mạch sẽ như thế nào ?",
    "re": "Độ lợi của mạch sẽ thay đổi theo tần số"
  },
  {
    "con": "Điện áp base tại điểm tĩnh của mạch khuyếch đại phân cực emitter thường bằng 0.7V",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện trở tải của mạch khuếch đại nhỏ hơn điện trở nguồn",
    "re": "Mạch sẽ hoạt động hiệu quả hơn"
  },
  {
    "con": "Tần số của tín hiệu đầu vào vượt quá tần số cắt của bộ lọc",
    "re": "Tín hiệu đầu ra sẽ bị suy giảm đáng kể"
  },
  {
    "con": "Điện áp nguồn cung cấp cho mạch vượt quá mức cho phép",
    "re": "Mạch có nguy cơ bị hỏng hoặc cháy"
  },
  {
    "con": "Dòng điện qua một cuộn dây thay đổi nhanh chóng",
    "re": "Sẽ tạo ra một điện áp cảm ứng ngược chiều"
  },
  {
    "con": "Tụ điện được nối song song với tải",
    "re": "Tụ điện sẽ giúp ổn định điện áp tại tải"
  },
  {
    "con": "Mạch điện có điện trở lớn hơn 0 ohm",
    "re": "Sẽ có dòng điện chạy qua mạch khi có điện áp"
  },
  {
    "con": "Tần số của dòng điện xoay chiều là 50Hz",
    "re": "Điện áp sẽ thay đổi theo hình sin với chu kỳ 20ms"
  },
  {
    "con": "Điện áp trên một điện trở tỉ lệ thuận với dòng điện qua nó",
    "re": "Đúng theo định luật Ohm"
  },
  {
    "con": "Mạch điện có nhiều nhánh song song",
    "re": "Dòng điện sẽ chia đều cho các nhánh"
  },
  {
    "con": "Mạch điện có điện trở R và nguồn điện áp V thì dòng điện I chạy qua mạch được tính bằng định luật Ohm",
    "re": "I = V/R"
  },
  {
    "con": "Nếu một tụ điện được nạp điện với điện áp V và có điện dung C thì năng lượng lưu trữ trong tụ điện được tính bằng công thức",
    "re": "W = 1/2 * C * V^2"
  },
  {
    "con": "Khi tần số của tín hiệu tăng lên trong một mạch RLC thì trở kháng của cuộn cảm L sẽ tăng lên",
    "re": "Điều này dẫn đến giảm dòng điện qua mạch"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở mắc nối tiếp thì tổng điện trở R tổng sẽ bằng tổng các điện trở",
    "re": "R tổng = R1 + R2 + ... + Rn"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở mắc song song thì tổng điện trở R tổng sẽ được tính bằng công thức",
    "re": "1/R tổng = 1/R1 + 1/R2 + ... + 1/Rn"
  },
  {
    "con": "Khi một cuộn dây được đặt trong từ trường biến thiên thì sẽ xuất hiện điện áp cảm ứng theo định luật Faraday",
    "re": "Điện áp cảm ứng tỉ lệ với tốc độ thay đổi từ thông"
  },
  {
    "con": "Nếu một mạch điện có điện áp xoay chiều thì điện áp và dòng điện sẽ có độ lệch pha",
    "re": "Điều này ảnh hưởng đến công suất tiêu thụ trong mạch"
  },
  {
    "con": "Nếu một động cơ điện hoạt động ở chế độ quá tải thì nhiệt độ của động cơ sẽ tăng lên",
    "re": "Điều này có thể dẫn đến hư hỏng động cơ"
  },
  {
    "con": "Khi sử dụng biến áp để chuyển đổi điện áp thì tỉ lệ điện áp giữa cuộn sơ cấp và cuộn thứ cấp tỉ lệ với số vòng dây của chúng",
    "re": "V1/V2 = N1/N2"
  },
  {
    "con": "Nếu một mạch điện có tụ điện và cuộn cảm thì nó có thể tạo ra dao động điện từ",
    "re": "Điều này dẫn đến sự hình thành của mạch cộng hưởng"
  },
  {
    "con": "Hệ số khuyếch đại điện áp của mạch khuyếch đại phân cực emitter là . . . . .",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện trở của một mạch nối tiếp là tổng của các điện trở thành phần",
    "re": "Điện trở tổng cộng sẽ lớn hơn bất kỳ điện trở nào trong mạch"
  },
  {
    "con": "Tần số của dòng điện xoay chiều là tần số của nguồn cung cấp",
    "re": "Dòng điện sẽ thay đổi chiều theo tần số đó"
  },
  {
    "con": "Công suất tiêu thụ của một thiết bị điện là sản phẩm của điện áp và dòng điện",
    "re": "Công suất sẽ tăng nếu điện áp hoặc dòng điện tăng"
  },
  {
    "con": "Mạch điện có điện trở không đổi và điện áp thay đổi",
    "re": "Dòng điện sẽ thay đổi theo định luật Ohm"
  },
  {
    "con": "Khi một tụ điện được nạp đầy, dòng điện qua nó sẽ ngừng lại",
    "re": "Điện áp trên tụ điện sẽ đạt giá trị tối đa"
  },
  {
    "con": "Trong một mạch điện từ, từ trường sẽ sinh ra dòng điện khi có sự thay đổi từ thông",
    "re": "Hiện tượng cảm ứng điện từ sẽ xảy ra"
  },
  {
    "con": "Khi điện áp tăng trong một mạch điện, nếu điện trở không đổi",
    "re": "Dòng điện sẽ tăng theo định luật Ohm"
  },
  {
    "con": "Một mạch điện có điện trở và cuộn cảm sẽ có độ lệch pha giữa điện áp và dòng điện",
    "re": "Điện áp sẽ dẫn trước dòng điện trong mạch cảm"
  },
  {
    "con": "Khi một diode được phân cực thuận, nó sẽ dẫn điện",
    "re": "Dòng điện sẽ chảy qua diode"
  },
  {
    "con": "Các mạch khuyếch đại phân cực hồi tiếp kiểu điện áp thực tế thích hợp cho làm việc với tín hiệu yếu",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của một mạch khuếch đại vượt quá mức cho phép",
    "re": "Mạch có thể bị hỏng hoặc hoạt động không ổn định"
  },
  {
    "con": "Sử dụng dây dẫn có tiết diện nhỏ hơn yêu cầu cho dòng điện lớn",
    "re": "Dây dẫn có thể bị nóng và gây ra cháy nổ"
  },
  {
    "con": "Tần số của tín hiệu đầu vào vượt quá tần số cắt của bộ lọc",
    "re": "Tín hiệu đầu ra sẽ bị suy giảm đáng kể"
  },
  {
    "con": "Sử dụng tụ điện có điện áp định mức thấp hơn điện áp hoạt động",
    "re": "Tụ điện có thể bị nổ hoặc hỏng"
  },
  {
    "con": "Mạch điện có điện trở tương đương thấp hơn điện trở của tải",
    "re": "Dòng điện sẽ tăng lên và có thể gây quá tải"
  },
  {
    "con": "Sử dụng transistor trong chế độ bão hòa",
    "re": "Transistor sẽ hoạt động như một công tắc đóng"
  },
  {
    "con": "Khi điện áp trên một tụ điện đạt đến giá trị định mức",
    "re": "Tụ điện sẽ không còn tích trữ thêm điện năng"
  },
  {
    "con": "Mạch điện có điện trở lớn hơn vô cùng",
    "re": "Dòng điện sẽ bằng 0"
  },
  {
    "con": "Sử dụng diode trong chiều ngược lại với chiều dòng điện",
    "re": "Diode sẽ không dẫn điện và ngăn dòng chảy"
  },
  {
    "con": "Trở kháng vào của mạch khuyếch đại phân cực hồi tiếp kiểu điện áp bị ảnh hưởng bởi các thành phần của mạch",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một tụ điện sẽ không thay đổi ngay lập tức khi có sự thay đổi trong mạch",
    "re": "Điều này dẫn đến sự xuất hiện của dòng điện tạm thời"
  },
  {
    "con": "Nếu tần số của tín hiệu đầu vào tăng lên trong mạch LC",
    "re": "Thì trở kháng của mạch sẽ thay đổi theo quy luật cộng hưởng"
  },
  {
    "con": "Khi một mạch điện có điện trở lớn hơn, dòng điện sẽ giảm",
    "re": "Điều này tuân theo định luật Ohm"
  },
  {
    "con": "Nếu một cuộn dây được đặt trong từ trường biến thiên",
    "re": "Thì sẽ xuất hiện điện áp cảm ứng theo định luật Faraday"
  },
  {
    "con": "Khi điện áp trên một điện trở tăng lên",
    "re": "Thì công suất tiêu thụ của điện trở cũng sẽ tăng lên theo quy luật P = V^2/R"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện song song",
    "re": "Thì điện áp trên các nhánh sẽ bằng nhau"
  },
  {
    "con": "Khi một mạch điện có tụ điện và điện trở nối tiếp",
    "re": "Thì thời gian sạc và xả của tụ điện sẽ phụ thuộc vào giá trị của R và C"
  },
  {
    "con": "Nếu một mạch điện có điện trở và cuộn cảm nối tiếp",
    "re": "Thì tổng trở của mạch sẽ là tổng của điện trở và trở kháng của cuộn cảm"
  },
  {
    "con": "Khi sử dụng biến áp, nếu số vòng dây ở cuộn sơ cấp nhiều hơn cuộn thứ cấp",
    "re": "Thì điện áp ở cuộn sơ cấp sẽ lớn hơn điện áp ở cuộn thứ cấp"
  },
  {
    "con": "Tại sao cần phải biết trở kháng vào của mỗi tầng trong một bộ khuyếch đại nhiều tầng ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp đầu vào của một mạch điện tăng lên,",
    "re": "thì dòng điện qua mạch cũng sẽ tăng lên theo định luật Ohm."
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn hơn,",
    "re": "thì dòng điện chạy qua mạch sẽ nhỏ hơn."
  },
  {
    "con": "Khi tần số của tín hiệu tăng lên trong một mạch RLC,",
    "re": "thì trở kháng của cuộn cảm sẽ tăng và trở kháng của tụ điện sẽ giảm."
  },
  {
    "con": "Nếu một động cơ điện hoạt động ở chế độ quá tải,",
    "re": "thì nó có thể bị nóng và hư hỏng."
  },
  {
    "con": "Khi sử dụng biến áp,",
    "re": "thì điện áp đầu ra sẽ tỷ lệ thuận với số vòng dây của cuộn sơ cấp và thứ cấp."
  },
  {
    "con": "Nếu điện áp lưới không ổn định,",
    "re": "thì thiết bị điện có thể bị hư hỏng do quá tải hoặc sụt áp."
  },
  {
    "con": "Khi một mạch điện có nhiều nguồn điện song song,",
    "re": "thì điện áp đầu ra sẽ bằng điện áp của nguồn có điện áp cao nhất."
  },
  {
    "con": "Nếu một tụ điện được nạp đầy,",
    "re": "thì nó sẽ không cho dòng điện đi qua nữa."
  },
  {
    "con": "Khi sử dụng mạch điện xoay chiều,",
    "re": "thì cần phải tính toán pha giữa điện áp và dòng điện để đảm bảo hiệu suất tối ưu."
  },
  {
    "con": "Một trong những ưu điểm chính của việc sử dụng các tụ ghép giữa các tầng là gì ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp tăng lên trong một mạch điện, thì dòng điện sẽ giảm nếu điện trở không đổi.",
    "re": "Định luật Ohm"
  },
  {
    "con": "Nếu một cuộn dây được đặt trong từ trường biến đổi, thì nó sẽ tạo ra điện áp cảm ứng.",
    "re": "Định luật Faraday"
  },
  {
    "con": "Khi tần số của dòng điện xoay chiều tăng, thì điện trở của mạch RLC sẽ thay đổi theo cách nào?",
    "re": "Điện trở tổng trở sẽ tăng lên"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở nối tiếp, thì điện trở tổng sẽ là gì?",
    "re": "Tổng của tất cả các điện trở"
  },
  {
    "con": "Khi một tụ điện được nạp đầy, thì dòng điện qua tụ sẽ ngừng lại.",
    "re": "Tụ điện đạt đến điện áp tối đa"
  },
  {
    "con": "Nếu một mạch điện có điện áp không đổi, thì công suất tiêu thụ sẽ phụ thuộc vào yếu tố nào?",
    "re": "Điện trở của mạch"
  },
  {
    "con": "Khi một điện áp xoay chiều được đưa vào một điện trở thuần, thì dòng điện sẽ có đặc điểm gì?",
    "re": "Dòng điện và điện áp sẽ đồng pha"
  },
  {
    "con": "Nếu một mạch điện có điện trở và tụ điện nối song song, thì điện trở tương đương sẽ là gì?",
    "re": "Nhỏ hơn điện trở của từng thành phần"
  },
  {
    "con": "Khi một máy phát điện quay, thì nó sẽ tạo ra điện năng nhờ vào nguyên lý nào?",
    "re": "Nguyên lý cảm ứng điện từ"
  },
  {
    "con": "Hệ số khuyếch đại điện áp toàn bộ của mạch khuyếch đại nhiều tầng sẽ bằng với . . . . . . . .",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện trở của một mạch nối tiếp sẽ bằng tổng điện trở của tất cả các phần tử trong mạch",
    "re": "Điện trở tổng của mạch nối tiếp"
  },
  {
    "con": "Nếu điện áp trên một tụ điện tăng lên, thì điện tích trên tụ điện cũng sẽ tăng lên",
    "re": "Điện tích trên tụ điện tỉ lệ thuận với điện áp"
  },
  {
    "con": "Nếu tần số của tín hiệu tăng lên, thì độ lớn của điện trở cảm kháng sẽ tăng lên",
    "re": "Điện trở cảm kháng tỉ lệ thuận với tần số"
  },
  {
    "con": "Nếu một mạch điện có điện trở không đổi và điện áp tăng lên, thì dòng điện trong mạch sẽ tăng lên",
    "re": "Dòng điện tỉ lệ thuận với điện áp theo định luật Ohm"
  },
  {
    "con": "Nếu công suất tiêu thụ của một thiết bị điện tăng lên, thì dòng điện qua thiết bị đó cũng sẽ tăng lên nếu điện áp không đổi",
    "re": "Công suất tỉ lệ thuận với dòng điện"
  },
  {
    "con": "Nếu một cuộn dây được kết nối với nguồn điện xoay chiều, thì nó sẽ tạo ra một điện trường từ trường",
    "re": "Cuộn dây tạo ra từ trường khi có dòng điện"
  },
  {
    "con": "Nếu một mạch điện có điện trở và điện cảm, thì nó sẽ có một tần số cộng hưởng nhất định",
    "re": "Mạch RLC có tần số cộng hưởng"
  },
  {
    "con": "Nếu điện áp trên một điện trở giảm, thì dòng điện qua điện trở đó cũng sẽ giảm",
    "re": "Dòng điện tỉ lệ nghịch với điện trở theo định luật Ohm"
  },
  {
    "con": "Nếu một mạch điện có điện trở và điện dung, thì nó sẽ có một thời gian trễ nhất định khi thay đổi điện áp",
    "re": "Mạch RC có thời gian trễ khi thay đổi điện áp"
  },
  {
    "con": "Các mạch khuyếch đại ghép trực tiếp có ưu điểm hơn các mạch khuyếch đại ghép RC là ở chỗ chúng có thể khuyếch đại tín hiệu với độ méo thấp hơn",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp đầu vào của một mạch RLC vượt quá giá trị định mức thì mạch sẽ xảy ra hiện tượng cộng hưởng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một cuộn dây có số vòng quấn tăng lên thì độ tự cảm của cuộn dây sẽ tăng theo",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi tần số của tín hiệu tăng lên trong một mạch RC thì điện áp trên tụ điện sẽ giảm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn hơn thì dòng điện chạy qua mạch sẽ giảm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một diode được mắc ngược thì nó sẽ không dẫn điện và có thể gây ra hiện tượng đứt mạch",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có công suất tiêu thụ lớn hơn công suất định mức của thiết bị thì thiết bị có thể bị hỏng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp trên một tụ điện đạt đến giá trị tối đa thì tụ điện sẽ bắt đầu xả điện",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có tần số cao hơn thì độ suy giảm tín hiệu sẽ lớn hơn",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi sử dụng biến trở trong mạch thì việc điều chỉnh biến trở sẽ thay đổi điện áp và dòng điện trong mạch",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong thực tế các bộ khuyếch đại ghép trực tiếp có thể dễ bị ảnh hưởng với vấn đề . . . . . .",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của một mạch điện không được vượt quá điện áp định mức của linh kiện",
    "re": "Linh kiện có thể bị hỏng hoặc gây ra sự cố"
  },
  {
    "con": "Khi sử dụng dây dẫn có tiết diện nhỏ hơn yêu cầu cho dòng điện",
    "re": "Dây dẫn sẽ bị quá nhiệt và có nguy cơ cháy nổ"
  },
  {
    "con": "Nếu tần số của tín hiệu vượt quá tần số cắt của bộ lọc",
    "re": "Tín hiệu sẽ bị suy giảm đáng kể"
  },
  {
    "con": "Khi một mạch điện có nhiều tải không đồng đều",
    "re": "Dòng điện sẽ phân bố không đều, dẫn đến nguy cơ quá tải"
  },
  {
    "con": "Nếu không sử dụng tụ điện đúng cách trong mạch điện",
    "re": "Mạch có thể gặp vấn đề về ổn định và hiệu suất"
  },
  {
    "con": "Khi sử dụng transistor trong chế độ bão hòa",
    "re": "Transistor sẽ hoạt động như một công tắc, cho phép dòng điện lớn đi qua"
  },
  {
    "con": "Nếu không có biện pháp bảo vệ quá dòng cho mạch điện",
    "re": "Mạch có thể bị hỏng do dòng điện vượt quá giới hạn cho phép"
  },
  {
    "con": "Khi sử dụng biến áp không đúng cách",
    "re": "Có thể gây ra hiện tượng quá tải và hỏng biến áp"
  },
  {
    "con": "Nếu không kiểm tra độ cách điện của dây dẫn",
    "re": "Có thể xảy ra rò rỉ điện và gây nguy hiểm cho người sử dụng"
  },
  {
    "con": "Điện áp đo được trên collector của Q2 ở mạch hình 4.24JC, là 13,8VDC,",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng trở của mạch R1 và R2 song song là 5Ω,",
    "re": "Dòng điện qua mạch sẽ tăng lên"
  },
  {
    "con": "Tần số của tín hiệu AC là 60Hz,",
    "re": "Chu kỳ của tín hiệu là 16,67ms"
  },
  {
    "con": "Điện trở của một mạch là 10Ω và dòng điện là 2A,",
    "re": "Điện áp trên mạch là 20V"
  },
  {
    "con": "Công suất tiêu thụ của một thiết bị là 100W và điện áp là 220V,",
    "re": "Dòng điện qua thiết bị là 0,45A"
  },
  {
    "con": "Một tụ điện có điện dung 10μF và điện áp 50V,",
    "re": "Năng lượng lưu trữ trong tụ là 0,0125J"
  },
  {
    "con": "Mạch điện có hai nguồn điện song song với điện áp 12V,",
    "re": "Điện áp tổng của mạch vẫn là 12V"
  },
  {
    "con": "Một cuộn dây có độ tự cảm 2H và dòng điện thay đổi 3A/s,",
    "re": "Điện áp cảm ứng trong cuộn dây là 6V"
  },
  {
    "con": "Điện áp trên một điện trở là 5V và điện trở là 10Ω,",
    "re": "Dòng điện qua điện trở là 0,5A"
  },
  {
    "con": "Một mạch RLC có tần số cộng hưởng là 1kHz,",
    "re": "Mạch sẽ có trở kháng tối thiểu tại tần số này"
  },
  {
    "con": "Điện áp DC tại điểm nối của hai điện trở R4 và R5 ở mạch hình 4.24JC, bằng 0V.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng điện trở trong mạch nối tiếp bằng tổng các điện trở thành phần.",
    "re": "Điện áp tổng sẽ chia đều theo tỷ lệ điện trở."
  },
  {
    "con": "Tần số của dòng điện xoay chiều tăng lên.",
    "re": "Điện trở của mạch sẽ giảm do tác động của phản kháng."
  },
  {
    "con": "Cường độ dòng điện qua một điện trở không thay đổi.",
    "re": "Điện áp trên điện trở sẽ tỷ lệ thuận với giá trị của điện trở đó."
  },
  {
    "con": "Mạch điện có điện trở R và tụ điện C mắc nối tiếp.",
    "re": "Thời gian hằng định của mạch sẽ được xác định bởi R và C."
  },
  {
    "con": "Điện áp đầu vào của một bộ khuếch đại thấp hơn điện áp ngưỡng.",
    "re": "Bộ khuếch đại sẽ không hoạt động."
  },
  {
    "con": "Tụ điện được nạp đầy và ngắt kết nối khỏi nguồn.",
    "re": "Tụ điện sẽ giữ điện tích cho đến khi có mạch nối."
  },
  {
    "con": "Mạch điện có nhiều nguồn điện mắc song song.",
    "re": "Điện áp trên mỗi nhánh sẽ bằng nhau."
  },
  {
    "con": "Tần số của dòng điện xoay chiều là 60Hz.",
    "re": "Chu kỳ của dòng điện sẽ là 16.67ms."
  },
  {
    "con": "Cường độ dòng điện trong mạch giảm.",
    "re": "Công suất tiêu thụ của mạch cũng sẽ giảm theo."
  },
  {
    "con": "Phát biểu nào sau đây là đúng, với mạch khuếch đại vi sai đảm bảo yêu cầu phải có:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạch điện có điện trở R và nguồn điện áp V, nếu điện áp tăng lên gấp đôi thì dòng điện sẽ tăng lên gấp đôi.",
    "re": "Dòng điện sẽ tăng lên gấp đôi"
  },
  {
    "con": "Nếu một tụ điện được nạp điện với điện áp V và sau đó được ngắt khỏi nguồn, thì điện tích trên tụ điện sẽ không thay đổi.",
    "re": "Điện tích trên tụ điện sẽ không thay đổi"
  },
  {
    "con": "Trong một mạch RLC, nếu tần số của nguồn điện bằng tần số cộng hưởng, thì trở kháng của mạch sẽ đạt giá trị tối thiểu.",
    "re": "Trở kháng của mạch sẽ đạt giá trị tối thiểu"
  },
  {
    "con": "Nếu một cuộn dây có số vòng quấn N và dòng điện I chạy qua, thì từ thông sinh ra sẽ tỷ lệ thuận với tích của N và I.",
    "re": "Từ thông sinh ra sẽ tỷ lệ thuận với tích của N và I"
  },
  {
    "con": "Nếu điện áp trên một điện trở là V và điện trở là R, thì dòng điện chạy qua điện trở sẽ được tính bằng công thức I = V/R.",
    "re": "Dòng điện chạy qua điện trở sẽ được tính bằng công thức I = V/R"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở mắc nối tiếp, thì tổng điện trở sẽ bằng tổng các điện trở riêng lẻ.",
    "re": "Tổng điện trở sẽ bằng tổng các điện trở riêng lẻ"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở mắc song song, thì tổng điện trở sẽ nhỏ hơn điện trở nhỏ nhất trong mạch.",
    "re": "Tổng điện trở sẽ nhỏ hơn điện trở nhỏ nhất trong mạch"
  },
  {
    "con": "Nếu một transistor hoạt động trong vùng khuếch đại, thì dòng điện ra sẽ tỷ lệ thuận với dòng điện vào.",
    "re": "Dòng điện ra sẽ tỷ lệ thuận với dòng điện vào"
  },
  {
    "con": "Nếu tần số của tín hiệu điện thay đổi, thì điện trở của tụ điện sẽ thay đổi theo tần số đó.",
    "re": "Điện trở của tụ điện sẽ thay đổi theo tần số đó"
  },
  {
    "con": "Hệ số khuyếch đại điện áp tín hiệu của Q1 gần bằng 3,",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại thấp hơn điện áp nguồn,",
    "re": "Mạch sẽ hoạt động bình thường"
  },
  {
    "con": "Tần số của tín hiệu đầu vào vượt quá tần số cắt của bộ lọc,",
    "re": "Tín hiệu sẽ bị suy giảm đáng kể"
  },
  {
    "con": "Điện trở tải của mạch thấp hơn điện trở nội của nguồn điện,",
    "re": "Công suất tiêu thụ sẽ tăng lên"
  },
  {
    "con": "Dòng điện qua một cuộn dây tăng lên nhanh chóng,",
    "re": "Sẽ tạo ra một điện áp phản kháng lớn"
  },
  {
    "con": "Tần số của dòng điện xoay chiều là 50Hz,",
    "re": "Điện áp hiệu dụng sẽ được tính bằng công thức U = √2 * Umax"
  },
  {
    "con": "Mạch điện có điện trở và cảm kháng bằng nhau,",
    "re": "Mạch sẽ có hệ số công suất bằng 0.707"
  },
  {
    "con": "Điện áp giữa hai đầu tụ điện không đổi,",
    "re": "Dòng điện qua tụ điện sẽ bằng 0"
  },
  {
    "con": "Công suất tiêu thụ của một thiết bị điện là 100W và điện áp là 220V,",
    "re": "Dòng điện qua thiết bị sẽ là 0.4545A"
  },
  {
    "con": "Một mạch điện có hai điện trở nối tiếp,",
    "re": "Điện trở tương đương sẽ là tổng của hai điện trở"
  },
  {
    "con": "Trong mạch khuyếch đại collector chung, cực collector được nối với nguồn điện",
    "re": "Điện áp đầu ra sẽ cao hơn điện áp đầu vào"
  },
  {
    "con": "Khi điện trở trong mạch giảm",
    "re": "Dòng điện qua mạch sẽ tăng lên nếu điện áp không đổi"
  },
  {
    "con": "Trong mạch RLC, tần số cộng hưởng xảy ra khi",
    "re": "điện trở bằng 0 và tổng cảm kháng bằng tổng dung kháng"
  },
  {
    "con": "Khi một cuộn dây được đặt trong từ trường biến thiên",
    "re": "Một điện áp sẽ được cảm ứng trong cuộn dây"
  },
  {
    "con": "Nếu điện áp trên một tụ điện tăng",
    "re": "Điện tích trên tụ điện cũng sẽ tăng theo"
  },
  {
    "con": "Trong một mạch điện xoay chiều, nếu tần số tăng",
    "re": "điện trở của tụ điện sẽ giảm"
  },
  {
    "con": "Khi một mạch điện có điện trở lớn hơn điện trở tối ưu",
    "re": "Hiệu suất của mạch sẽ giảm"
  },
  {
    "con": "Nếu một mạch điện có điện áp không đổi và điện trở tăng",
    "re": "Dòng điện trong mạch sẽ giảm"
  },
  {
    "con": "Khi sử dụng biến áp, nếu số vòng dây ở cuộn sơ cấp nhiều hơn cuộn thứ cấp",
    "re": "Điện áp ở cuộn sơ cấp sẽ cao hơn điện áp ở cuộn thứ cấp"
  },
  {
    "con": "Trong một mạch điện, nếu công suất tiêu thụ tăng",
    "re": "Dòng điện qua mạch cũng sẽ tăng nếu điện áp không đổi"
  },
  {
    "con": "Mạch khuyếch đại collector chung có thể sử dụng kiểu phân cực phân cực trực tiếp",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp đầu vào của mạch RLC vượt quá giá trị định mức",
    "re": "thì mạch có thể bị hỏng hoặc hoạt động không ổn định"
  },
  {
    "con": "Khi sử dụng biến trở trong mạch điện",
    "re": "thì giá trị điện trở có thể điều chỉnh được để thay đổi dòng điện"
  },
  {
    "con": "Nếu tần số của tín hiệu AC tăng",
    "re": "thì điện trở của cuộn cảm sẽ tăng theo"
  },
  {
    "con": "Mạch điện song song có điện áp giống nhau",
    "re": "thì dòng điện sẽ chia theo tỷ lệ nghịch với điện trở"
  },
  {
    "con": "Nếu một tụ điện được nạp đầy",
    "re": "thì nó sẽ lưu trữ năng lượng dưới dạng điện trường"
  },
  {
    "con": "Khi sử dụng diode trong mạch chỉnh lưu",
    "re": "thì nó sẽ cho phép dòng điện chỉ chảy theo một chiều"
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn",
    "re": "thì dòng điện chảy qua mạch sẽ nhỏ"
  },
  {
    "con": "Khi sử dụng transistor trong mạch khuếch đại",
    "re": "thì nó có thể hoạt động như một công tắc hoặc khuếch đại tín hiệu"
  },
  {
    "con": "Nếu tần số của tín hiệu vượt quá tần số cắt của bộ lọc",
    "re": "thì tín hiệu sẽ bị suy giảm đáng kể"
  },
  {
    "con": "Cấu hình collector chung có điện trở tải lớn hơn điện trở vào",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tần số của dòng điện xoay chiều tăng",
    "re": "Điện trở của mạch sẽ giảm"
  },
  {
    "con": "Điện áp trên một tụ điện tăng",
    "re": "Dòng điện qua tụ điện sẽ giảm"
  },
  {
    "con": "Mạch điện có điện trở và cảm kháng bằng nhau",
    "re": "Mạch sẽ có pha 45 độ"
  },
  {
    "con": "Sử dụng biến áp để giảm điện áp",
    "re": "Dòng điện sẽ tăng lên tương ứng"
  },
  {
    "con": "Tăng tần số trong mạch RLC",
    "re": "Điện trở của mạch sẽ thay đổi theo quy luật cộng hưởng"
  },
  {
    "con": "Mạch điện có điện trở thấp và điện áp cao",
    "re": "Dòng điện sẽ lớn"
  },
  {
    "con": "Sử dụng diode trong mạch chỉnh lưu",
    "re": "Dòng điện chỉ cho phép chảy theo một chiều"
  },
  {
    "con": "Tụ điện được nạp đầy",
    "re": "Dòng điện qua tụ sẽ ngừng lại"
  },
  {
    "con": "Mạch điện có điện trở nối tiếp",
    "re": "Tổng điện trở sẽ bằng tổng các điện trở"
  },
  {
    "con": "Hệ số khuyếch đại điện áp của mạch collector chung là 1 + (Rc / Re)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện trở của mạch song song được tính bằng công thức 1/Rt = 1/R1 + 1/R2",
    "re": "Thì điện trở tương đương Rt sẽ nhỏ hơn R1 và R2"
  },
  {
    "con": "Nếu tần số của tín hiệu tăng lên trong một mạch LC",
    "re": "Thì độ lợi của mạch sẽ thay đổi theo quy luật cộng hưởng"
  },
  {
    "con": "Nếu điện áp trên một tụ điện tăng lên",
    "re": "Thì dòng điện qua tụ điện sẽ giảm xuống"
  },
  {
    "con": "Nếu một cuộn dây có số vòng quấn tăng lên",
    "re": "Thì độ tự cảm của cuộn dây sẽ tăng lên"
  },
  {
    "con": "Nếu điện áp đầu vào của một bộ khuếch đại vượt quá mức cho phép",
    "re": "Thì bộ khuếch đại có thể bị hỏng hoặc bị méo tín hiệu"
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn hơn",
    "re": "Thì dòng điện chạy qua mạch sẽ giảm"
  },
  {
    "con": "Nếu tần số của dòng điện xoay chiều là 50Hz",
    "re": "Thì chu kỳ của dòng điện là 20ms"
  },
  {
    "con": "Nếu điện áp và dòng điện trong một mạch điện là đồng pha",
    "re": "Thì công suất tiêu thụ sẽ đạt giá trị tối đa"
  },
  {
    "con": "Nếu một mạch điện có điện trở thuần và điện cảm",
    "re": "Thì điện trở tương đương sẽ được tính bằng công thức Z = √(R² + (XL - XC)²)"
  },
  {
    "con": "Hệ số khuyếch đại công suất của một mạch có thể tính được bằng phép nhân.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp và dòng điện trong một mạch RLC nối tiếp có thể được tính bằng định luật Kirchhoff.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tần số của tín hiệu tăng lên, thì độ lớn của điện trở cảm kháng trong mạch RLC sẽ tăng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có điện trở không đổi và điện áp tăng lên, thì dòng điện trong mạch sẽ tăng theo định luật Ohm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu công suất tiêu thụ của một thiết bị điện được tính bằng tích của điện áp và dòng điện, thì công suất sẽ tăng khi điện áp hoặc dòng điện tăng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện, thì điện áp tổng của mạch sẽ là tổng các điện áp của từng nguồn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện trở của một dây dẫn tăng lên do nhiệt độ tăng, thì điện trở của dây dẫn sẽ ảnh hưởng đến dòng điện chảy qua nó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tụ điện được nạp điện, thì điện áp trên tụ sẽ tăng cho đến khi đạt đến điện áp nguồn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có điện trở và tụ điện, thì mạch sẽ có hiện tượng trễ pha giữa điện áp và dòng điện.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một máy biến áp hoạt động ở chế độ lý tưởng, thì công suất vào sẽ bằng công suất ra.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cấu hình BJT nào cho sự khuyếch đại công suất ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở tỉ lệ thuận với dòng điện chạy qua nó ?",
    "re": "Đúng theo định luật Ohm"
  },
  {
    "con": "Tần số của dòng điện xoay chiều tăng lên ?",
    "re": "Thì điện trở của cuộn cảm sẽ tăng"
  },
  {
    "con": "Một mạch điện có tổng trở Z ?",
    "re": "Thì dòng điện I sẽ được tính bằng định luật Ohm: I = V/Z"
  },
  {
    "con": "Khi nhiệt độ của một chất dẫn điện tăng lên ?",
    "re": "Thì điện trở của chất đó thường tăng"
  },
  {
    "con": "Một tụ điện được nạp điện ?",
    "re": "Thì nó sẽ lưu trữ năng lượng điện trong trường điện"
  },
  {
    "con": "Khi một mạch điện có nhiều điện trở nối tiếp ?",
    "re": "Thì tổng điện trở sẽ bằng tổng các điện trở"
  },
  {
    "con": "Khi một mạch điện có nhiều điện trở nối song song ?",
    "re": "Thì tổng điện trở sẽ nhỏ hơn điện trở nhỏ nhất trong mạch"
  },
  {
    "con": "Một máy phát điện hoạt động ?",
    "re": "Thì nó chuyển đổi năng lượng cơ học thành năng lượng điện"
  },
  {
    "con": "Khi điện áp tăng lên trong một mạch điện ?",
    "re": "Thì công suất tiêu thụ sẽ tăng theo định luật P = V x I"
  },
  {
    "con": "Cặp Darlington thay cho transistor thông thường trong mạch collector chung sẽ tăng cường độ khuếch đại",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp đầu vào của một mạch khuếch đại vượt quá điện áp định mức của transistor thì transistor có thể bị hỏng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu sử dụng tụ điện trong mạch lọc thì nó sẽ giúp loại bỏ nhiễu tần số cao",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện trở tải giảm trong mạch khuếch đại thì công suất đầu ra sẽ tăng lên",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tần số của tín hiệu đầu vào tăng thì phản ứng của mạch RLC sẽ thay đổi theo",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu sử dụng biến áp với tỷ lệ biến áp không phù hợp thì điện áp đầu ra sẽ không đạt yêu cầu",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu mạch điện có nhiều nhánh song song thì tổng điện trở sẽ giảm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu sử dụng diode trong mạch chỉnh lưu thì nó sẽ cho phép dòng điện chỉ đi theo một chiều",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tần số của nguồn điện thay đổi thì hiệu suất của động cơ điện có thể bị ảnh hưởng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu sử dụng mạch điều khiển PID trong hệ thống tự động thì nó sẽ giúp cải thiện độ ổn định và độ chính xác",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "cặp Darlington được lắp bằng hai transistor với mỗi transistor bằng 40",
    "re": "mạch Darlington có beta bằng 1600"
  },
  {
    "con": "mạch điện có điện trở R1 và R2 nối tiếp",
    "re": "điện trở tương đương R = R1 + R2"
  },
  {
    "con": "mạch điện có điện trở R1 và R2 song song",
    "re": "điện trở tương đương R = (R1 * R2) / (R1 + R2)"
  },
  {
    "con": "một cuộn dây có độ tự cảm L và dòng điện I thay đổi theo thời gian",
    "re": "điện áp cảm ứng E = -L * (dI/dt)"
  },
  {
    "con": "mạch điện xoay chiều có điện áp U và dòng điện I lệch pha",
    "re": "công suất thực P = U * I * cos(φ)"
  },
  {
    "con": "một tụ điện có điện dung C và điện áp U",
    "re": "năng lượng lưu trữ W = 0.5 * C * U^2"
  },
  {
    "con": "một transistor hoạt động trong vùng khuếch đại",
    "re": "dòng điện collector Ic = β * Ib"
  },
  {
    "con": "mạch điện có nguồn điện một chiều và điện trở R",
    "re": "dòng điện I = U / R theo định luật Ohm"
  },
  {
    "con": "một mạch điện có tần số f và điện dung C",
    "re": "điện trở phản kháng của tụ Xc = 1 / (2 * π * f * C)"
  },
  {
    "con": "một mạch điện có tần số f và cuộn dây có độ tự cảm L",
    "re": "điện trở phản kháng của cuộn dây Xl = 2 * π * f * L"
  },
  {
    "con": "Mạch Darlington khi hoạt động khuyếch đại ở chế độ A, điện áp giữa cực base và emitter là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện trở trong mạch song song giảm khi số lượng điện trở tăng lên ?",
    "re": "Điện trở tổng giảm"
  },
  {
    "con": "Nếu điện áp trên một tụ điện tăng lên, thì điện tích trên tụ điện cũng tăng lên ?",
    "re": "Điện tích tăng"
  },
  {
    "con": "Nếu tần số của dòng điện xoay chiều tăng, thì điện trở của cuộn cảm cũng tăng ?",
    "re": "Điện trở cuộn cảm tăng"
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn hơn, thì dòng điện chạy qua mạch sẽ nhỏ hơn ?",
    "re": "Dòng điện giảm"
  },
  {
    "con": "Nếu điện áp trên một điện trở là không đổi, thì công suất tiêu thụ của điện trở sẽ tăng khi điện trở giảm ?",
    "re": "Công suất tăng"
  },
  {
    "con": "Nếu một mạch điện có điện áp không đổi và điện trở giảm, thì dòng điện sẽ tăng ?",
    "re": "Dòng điện tăng"
  },
  {
    "con": "Nếu một tụ điện được nạp đầy, thì điện áp trên tụ sẽ không thay đổi cho đến khi nó được xả ?",
    "re": "Điện áp giữ nguyên"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện nối tiếp, thì điện áp tổng sẽ bằng tổng các điện áp của từng nguồn ?",
    "re": "Điện áp tổng tăng"
  },
  {
    "con": "Nếu một cuộn cảm được kết nối với nguồn điện một chiều, thì nó sẽ tạo ra một dòng điện ban đầu lớn và sau đó giảm dần ?",
    "re": "Dòng điện giảm dần"
  },
  {
    "con": "Thông thường, tầng collector chung là tầng cuối cùng trước tải. Chức năng chính của tầng collector chung là để . . . . . .",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp đầu vào của một mạch khuếch đại vượt quá ngưỡng cho phép của transistor,",
    "re": "transistor có thể bị hỏng do quá tải."
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn hơn,",
    "re": "thì dòng điện chạy qua mạch sẽ giảm."
  },
  {
    "con": "Khi tần số của tín hiệu tăng lên trong một mạch RLC,",
    "re": "thì trở kháng của cuộn cảm sẽ tăng và trở kháng của tụ điện sẽ giảm."
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện song song,",
    "re": "thì điện áp trên mỗi nguồn sẽ bằng nhau."
  },
  {
    "con": "Khi sử dụng biến áp, nếu số vòng dây ở cuộn sơ cấp nhiều hơn cuộn thứ cấp,",
    "re": "thì điện áp ở cuộn sơ cấp sẽ cao hơn điện áp ở cuộn thứ cấp."
  },
  {
    "con": "Nếu một mạch điện có tụ điện bị hỏng,",
    "re": "thì mạch có thể không hoạt động đúng như thiết kế."
  },
  {
    "con": "Khi một diode được kết nối ngược,",
    "re": "thì nó sẽ không cho dòng điện chạy qua."
  },
  {
    "con": "Nếu một mạch điện có điện trở nhỏ hơn,",
    "re": "thì dòng điện chạy qua mạch sẽ tăng."
  },
  {
    "con": "Khi một mạch điện có tần số cao,",
    "re": "thì hiện tượng cộng hưởng có thể xảy ra trong mạch RLC."
  },
  {
    "con": "Một bộ khuyếch đại điện áp có ba tầng có các hệ số khuyếch đại là 32, 16, và 1. Hệ số khuyếch đại điện áp của toàn mạch là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một mạch điện có điện trở R1 và R2 mắc nối tiếp. Tổng điện trở của mạch là R1 + R2.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một mạch điện có điện trở R1 và R2 mắc song song. Tổng điện trở của mạch là 1/(1/R1 + 1/R2).",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp trên một tụ điện tăng lên, thì điện tích trên tụ điện cũng sẽ tăng lên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một cuộn dây có số vòng quấn tăng lên, thì độ tự cảm của cuộn dây cũng sẽ tăng lên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tần số của dòng điện xoay chiều tăng lên, thì điện trở của mạch RLC sẽ thay đổi theo quy luật của tần số.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có nguồn điện áp không đổi và điện trở tăng lên, thì dòng điện trong mạch sẽ giảm xuống.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có công suất tiêu thụ P và điện áp U, thì dòng điện I có thể tính bằng công thức I = P/U.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một động cơ điện hoạt động ở tải nặng, thì dòng điện tiêu thụ sẽ tăng lên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có điện áp xoay chiều, thì điện áp hiệu dụng sẽ bằng điện áp đỉnh chia cho căn bậc hai của 2.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạch điện có điện trở R và nguồn điện áp V",
    "re": "Dòng điện I sẽ được tính bằng công thức I = V/R"
  },
  {
    "con": "Tần số của dòng điện xoay chiều là f",
    "re": "Chu kỳ T sẽ được tính bằng công thức T = 1/f"
  },
  {
    "con": "Mạch điện có nhiều điện trở nối tiếp",
    "re": "Điện trở tương đương Rt sẽ bằng tổng các điện trở: Rt = R1 + R2 + ... + Rn"
  },
  {
    "con": "Mạch điện có nhiều điện trở song song",
    "re": "Điện trở tương đương Rp sẽ được tính bằng công thức 1/Rp = 1/R1 + 1/R2 + ... + 1/Rn"
  },
  {
    "con": "Một cuộn dây có số vòng quấn N và dòng điện I",
    "re": "Từ thông Φ sẽ được tính bằng công thức Φ = L * I, với L là độ tự cảm"
  },
  {
    "con": "Một tụ điện có điện dung C và điện áp V",
    "re": "Điện tích Q sẽ được tính bằng công thức Q = C * V"
  },
  {
    "con": "Mạch điện có công suất P và điện áp V",
    "re": "Dòng điện I sẽ được tính bằng công thức P = V * I"
  },
  {
    "con": "Một mạch điện có điện trở R và công suất P",
    "re": "Điện áp V sẽ được tính bằng công thức V = √(P * R)"
  },
  {
    "con": "Mạch điện có điện áp V và dòng điện I",
    "re": "Công suất P sẽ được tính bằng công thức P = V * I"
  },
  {
    "con": "Một mạch điện có điện trở R và dòng điện I",
    "re": "Nhiệt lượng tỏa ra Q sẽ được tính bằng công thức Q = I² * R * t, với t là thời gian"
  },
  {
    "con": "Hệ số khuyếch đại dòng của mạch base chung là 100",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện trở của mạch nối tiếp là tổng của các điện trở",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên các điện trở trong mạch song song là như nhau",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Công suất tiêu thụ của một mạch điện là tích của điện áp và dòng điện",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tần số của dòng điện xoay chiều là số lần dòng điện thay đổi chiều trong một giây",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạch RLC có thể tạo ra hiện tượng cộng hưởng khi tần số dòng điện bằng tần số riêng của mạch",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp hiệu dụng của dòng điện xoay chiều là giá trị điện áp tối đa chia cho căn bậc hai của 2",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Công thức tính điện trở tương đương của mạch song song là 1/Rt = 1/R1 + 1/R2 + ... + 1/Rn",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp cực đại của dòng điện xoay chiều là điện áp hiệu dụng nhân với căn bậc hai của 2",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạch điện có điện trở không đổi và điện áp thay đổi sẽ có dòng điện tỷ lệ thuận với điện áp",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cấu hình emitter chung có điện trở tải lớn",
    "re": "Điện áp đầu ra sẽ tăng"
  },
  {
    "con": "Mạch điện có điện trở R và tụ điện C mắc nối tiếp",
    "re": "Thời gian hằng định sẽ được xác định bởi R và C"
  },
  {
    "con": "Tần số của tín hiệu AC tăng",
    "re": "Điện trở của cuộn cảm sẽ tăng"
  },
  {
    "con": "Điện áp trên một tụ điện không thay đổi",
    "re": "Dòng điện qua tụ điện sẽ bằng 0"
  },
  {
    "con": "Mạch điện có điện trở R và cuộn cảm L mắc nối tiếp",
    "re": "Điện áp rơi trên R và L sẽ phụ thuộc vào tần số tín hiệu"
  },
  {
    "con": "Tụ điện được nạp đầy",
    "re": "Dòng điện qua tụ sẽ ngừng lại"
  },
  {
    "con": "Mạch điện có nguồn điện DC",
    "re": "Dòng điện sẽ ổn định theo thời gian"
  },
  {
    "con": "Tần số của tín hiệu AC giảm",
    "re": "Điện trở của tụ điện sẽ tăng"
  },
  {
    "con": "Mạch điện có nhiều nguồn điện song song",
    "re": "Điện áp trên mỗi nguồn sẽ bằng nhau"
  },
  {
    "con": "Cuộn cảm được kết nối với nguồn điện AC",
    "re": "Dòng điện sẽ bị trễ pha so với điện áp"
  },
  {
    "con": "Khi BJT được mắc theo cấu hình base chung",
    "re": "mạch có khả năng cung cấp dòng điện lớn hơn dòng vào"
  },
  {
    "con": "Khi điện áp trên một tụ điện tăng lên",
    "re": "năng lượng lưu trữ trong tụ điện cũng tăng lên"
  },
  {
    "con": "Khi sử dụng biến áp giảm áp",
    "re": "điện áp đầu ra sẽ thấp hơn điện áp đầu vào"
  },
  {
    "con": "Khi một mạch điện có điện trở lớn",
    "re": "dòng điện chạy qua mạch sẽ nhỏ hơn"
  },
  {
    "con": "Khi tần số của tín hiệu tăng",
    "re": "điện trở của cuộn cảm sẽ tăng lên"
  },
  {
    "con": "Khi một diode được mắc theo chiều thuận",
    "re": "nó sẽ cho phép dòng điện chạy qua"
  },
  {
    "con": "Khi một mạch RLC được điều chỉnh ở tần số cộng hưởng",
    "re": "điện áp trên cuộn cảm và tụ điện sẽ đạt giá trị cực đại"
  },
  {
    "con": "Khi một mạch điện có nhiều nguồn điện",
    "re": "cần phải sử dụng phương pháp phân tích mạch thích hợp để tính toán"
  },
  {
    "con": "Khi điện áp và dòng điện trong mạch AC lệch pha",
    "re": "công suất thực sẽ thấp hơn công suất biểu kiến"
  },
  {
    "con": "Khi sử dụng mạch khuếch đại",
    "re": "tín hiệu đầu ra sẽ lớn hơn tín hiệu đầu vào"
  },
  {
    "con": "Khi BJT được mắc theo cấu hình collector chung",
    "re": "mạch có khả năng cung cấp dòng ra lớn hơn dòng vào"
  },
  {
    "con": "Khi điện áp trên một tụ điện đạt đến giá trị tối đa",
    "re": "tụ điện sẽ không thể tích trữ thêm điện tích"
  },
  {
    "con": "Khi một mạch điện có điện trở lớn",
    "re": "dòng điện chạy qua mạch sẽ giảm"
  },
  {
    "con": "Khi sử dụng biến trở trong mạch",
    "re": "có thể điều chỉnh điện áp hoặc dòng điện theo ý muốn"
  },
  {
    "con": "Khi tần số của tín hiệu tăng",
    "re": "điện trở của cuộn cảm sẽ tăng lên"
  },
  {
    "con": "Khi mắc các điện trở song song",
    "re": "điện trở tương đương sẽ nhỏ hơn điện trở nhỏ nhất trong mạch"
  },
  {
    "con": "Khi một diode được mắc ngược",
    "re": "nó sẽ không cho dòng điện chạy qua"
  },
  {
    "con": "Khi điện áp trên một điện trở tăng",
    "re": "công suất tiêu thụ của điện trở cũng sẽ tăng"
  },
  {
    "con": "Khi một mạch điện có tụ điện và cuộn cảm",
    "re": "mạch sẽ có hiện tượng cộng hưởng tại tần số nhất định"
  },
  {
    "con": "Khi sử dụng nguồn điện một chiều",
    "re": "dòng điện sẽ chỉ chảy theo một chiều duy nhất"
  },
  {
    "con": "Khi BJT được mắc theo cấu hình emitter chung",
    "re": "mạch có khả năng cung cấp dòng ra lớn hơn dòng vào"
  },
  {
    "con": "Khi điện áp trên một tụ điện đạt đến giá trị tối đa",
    "re": "tụ điện sẽ không thể tích lũy thêm điện tích"
  },
  {
    "con": "Khi một mạch điện có điện trở lớn hơn,",
    "re": "dòng điện chạy qua mạch sẽ giảm theo định luật Ohm"
  },
  {
    "con": "Khi tần số của tín hiệu tăng lên trong một mạch RLC",
    "re": "điện trở của cuộn cảm sẽ tăng và điện trở của tụ điện sẽ giảm"
  },
  {
    "con": "Khi một diode được mắc ngược chiều",
    "re": "nó sẽ không cho dòng điện chạy qua, trừ khi điện áp ngược vượt quá điện áp đổ vỡ"
  },
  {
    "con": "Khi một mạch điện có nhiều nguồn điện song song",
    "re": "điện áp trên mỗi nguồn sẽ bằng nhau"
  },
  {
    "con": "Khi sử dụng biến áp,",
    "re": "tỉ lệ điện áp giữa cuộn sơ cấp và cuộn thứ cấp tỉ lệ với số vòng dây của chúng"
  },
  {
    "con": "Khi một mạch điện có điện trở và cuộn cảm mắc nối tiếp",
    "re": "điện trở tổng sẽ lớn hơn điện trở của từng phần tử"
  },
  {
    "con": "Khi một mạch điện có tụ điện và cuộn cảm mắc song song",
    "re": "tần số cộng hưởng sẽ xảy ra khi điện trở tổng là nhỏ nhất"
  },
  {
    "con": "Khi điện áp AC được chuyển đổi thành DC qua một mạch chỉnh lưu",
    "re": "điện áp đầu ra sẽ có dạng sóng một chiều với các đỉnh"
  },
  {
    "con": "Một nguồn dòng hằng 10mA cung cấp cho tải 1kΩ. Nếu thay đổi điện trở tải là 2kΩ, thì dòng chảy qua tải là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp trên một điện trở là 5V và điện trở đó có giá trị 1kΩ, thì dòng điện chạy qua điện trở là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có hai điện trở nối tiếp là 4Ω và 6Ω, thì điện trở tương đương của mạch là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tụ điện có điện dung 10μF và được nạp với điện áp 12V, thì năng lượng lưu trữ trong tụ là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một cuộn dây có độ tự cảm 2H và dòng điện qua nó thay đổi từ 0A đến 5A trong 2 giây, thì điện áp cảm ứng trong cuộn dây là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguồn điện áp xoay chiều có tần số 50Hz và điện trở tải là 100Ω, thì điện áp hiệu dụng là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có công suất tiêu thụ là 100W và điện áp là 220V, thì dòng điện chạy qua mạch là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có điện trở 10Ω và dòng điện chạy qua là 2A, thì điện áp trên mạch là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một điện trở có giá trị 5kΩ và công suất tối đa cho phép là 0.25W, thì điện áp tối đa mà điện trở có thể chịu được là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có hai điện trở song song là 3Ω và 6Ω, thì điện trở tương đương của mạch là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một mạch khuyếch đại vi sai được thiết kế với nguồn dòng hằng 10mA, nguồn cung cấp 12V, và điện trở ở nhánh collector (Rc) cho cả hai BJT là 1k. Cả hai đầu vào được thiết lập là 100mV. Mức chênh lệch điện áp đo được giữa hai hai đầu ra collector của transistor là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện trở của một mạch là 10Ω và dòng điện chạy qua mạch là 2A, thì điện áp trên mạch là bao nhiêu ?",
    "re": "20V"
  },
  {
    "con": "Nếu một tụ điện có điện dung 100μF và được nạp với điện áp 12V, thì năng lượng lưu trữ trong tụ điện là bao nhiêu ?",
    "re": "0.0072J"
  },
  {
    "con": "Nếu một cuộn cảm có độ tự cảm 1H và dòng điện qua nó thay đổi từ 0A đến 5A trong 2 giây, thì điện áp cảm ứng trên cuộn cảm là bao nhiêu ?",
    "re": "2.5V"
  },
  {
    "con": "Nếu một mạch RLC có điện trở 50Ω, độ tự cảm 0.1H và điện dung 100μF, thì tần số dao động tự nhiên của mạch là bao nhiêu ?",
    "re": "7.96Hz"
  },
  {
    "con": "Nếu một mạch điện xoay chiều có điện áp hiệu dụng 230V và điện trở 100Ω, thì dòng điện hiệu dụng trong mạch là bao nhiêu ?",
    "re": "2.3A"
  },
  {
    "con": "Nếu một transistor BJT hoạt động trong chế độ khuếch đại với dòng collector là 5mA và hệ số khuếch đại dòng (β) là 100, thì dòng base là bao nhiêu ?",
    "re": "0.05mA"
  },
  {
    "con": "Nếu một mạch điện có công suất tiêu thụ 100W và điện áp 220V, thì dòng điện chạy qua mạch là bao nhiêu ?",
    "re": "0.4545A"
  },
  {
    "con": "Nếu một mạch điện có điện trở 200Ω và công suất tiêu thụ là 50W, thì điện áp trên mạch là bao nhiêu ?",
    "re": "100V"
  },
  {
    "con": "Nếu một mạch điện có tần số 60Hz và điện dung 10μF, thì phản kháng của tụ điện là bao nhiêu ?",
    "re": "2652.58Ω"
  },
  {
    "con": "Một mạch khuyếch đại vi sai được thiết kế với nguồn dòng hằng 10mA, nguồn cung cấp 12V, và điện trở ở nhánh collector (Rc) cho cả hai BJT là 1k. Cả hai đầu vào được thiết lập là 100mV. Mức điện áp đo được trên collector của một trong hai đầu ra của transistor so với đất là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện trở của một mạch điện là 10 ohm và dòng điện chạy qua mạch là 2A, thì điện áp trên mạch sẽ là bao nhiêu ?",
    "re": "20V"
  },
  {
    "con": "Nếu một tụ điện có điện dung 100μF và được nạp với điện áp 12V, thì năng lượng lưu trữ trong tụ điện sẽ là bao nhiêu ?",
    "re": "0.0072J"
  },
  {
    "con": "Nếu một cuộn dây có độ tự cảm 1H và dòng điện thay đổi với tốc độ 5A/s, thì điện áp cảm ứng trong cuộn dây sẽ là bao nhiêu ?",
    "re": "5V"
  },
  {
    "con": "Nếu một mạch điện xoay chiều có tần số 50Hz và điện trở 20 ohm, thì điện trở tương đương của mạch sẽ là bao nhiêu ?",
    "re": "20 ohm"
  },
  {
    "con": "Nếu một transistor được sử dụng trong chế độ khuyếch đại với β = 100 và dòng vào là 10mA, thì dòng ra sẽ là bao nhiêu ?",
    "re": "1A"
  },
  {
    "con": "Nếu một nguồn điện áp DC có điện áp 24V và điện trở tải là 12 ohm, thì dòng điện chạy qua tải sẽ là bao nhiêu ?",
    "re": "2A"
  },
  {
    "con": "Nếu một mạch điện có công suất tiêu thụ 100W và điện áp 220V, thì dòng điện chạy qua mạch sẽ là bao nhiêu ?",
    "re": "0.4545A"
  },
  {
    "con": "Nếu một mạch điện có điện trở 30 ohm và dòng điện 3A, thì công suất tiêu thụ của mạch sẽ là bao nhiêu ?",
    "re": "270W"
  },
  {
    "con": "Nếu một mạch điện có điện áp 12V và điện trở 4 ohm, thì điện năng tiêu thụ trong 1 giờ sẽ là bao nhiêu ?",
    "re": "36Wh"
  },
  {
    "con": "Điện áp tín hiệu trên tải trong mạch ở hình 5.21JC, đo được là 1Vpp. Vấn đề có nhiều khả năng xảy ra nhất đối với mạch là gì ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện trở của một mạch giảm xuống trong khi điện áp không đổi, thì dòng điện trong mạch sẽ như thế nào?",
    "re": "Dòng điện sẽ tăng lên"
  },
  {
    "con": "Nếu tần số của một tín hiệu AC tăng lên, thì độ lớn của điện trở cảm kháng sẽ như thế nào?",
    "re": "Độ lớn của điện trở cảm kháng sẽ tăng lên"
  },
  {
    "con": "Nếu một tụ điện được nạp đầy và sau đó được ngắt kết nối khỏi nguồn điện, thì điện tích trên tụ điện sẽ như thế nào?",
    "re": "Điện tích sẽ giữ nguyên cho đến khi tụ điện xả ra"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở nối tiếp, thì tổng điện trở của mạch sẽ như thế nào?",
    "re": "Tổng điện trở sẽ bằng tổng các điện trở riêng lẻ"
  },
  {
    "con": "Nếu một cuộn dây được kết nối với nguồn điện một chiều, thì dòng điện trong cuộn dây sẽ như thế nào?",
    "re": "Dòng điện sẽ tăng dần cho đến khi đạt giá trị ổn định"
  },
  {
    "con": "Nếu điện áp trên một tải giảm xuống trong khi công suất tiêu thụ không đổi, thì dòng điện sẽ như thế nào?",
    "re": "Dòng điện sẽ giảm xuống"
  },
  {
    "con": "Nếu một mạch điện có điện trở và tụ điện nối song song, thì điện áp trên tụ điện sẽ như thế nào?",
    "re": "Điện áp trên tụ điện sẽ bằng điện áp nguồn"
  },
  {
    "con": "Nếu một máy phát điện hoạt động ở tần số không đúng, thì hiệu suất của máy phát điện sẽ như thế nào?",
    "re": "Hiệu suất sẽ giảm"
  },
  {
    "con": "Nếu một mạch điện có điện trở và cuộn dây nối tiếp, thì tổng trở của mạch sẽ như thế nào?",
    "re": "Tổng trở sẽ là căn bậc hai của tổng bình phương điện trở và cảm kháng"
  },
  {
    "con": "Điện áp trên base ở mạch hình 5.21JC, đo được là 1,2VDC. Vấn đề có nhiều khả năng xảy ra nhất đối với mạch là gì ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện trở của một mạch là 0 ohm, thì dòng điện trong mạch sẽ như thế nào?",
    "re": "Dòng điện sẽ không xác định (hoặc vô hạn) theo định luật Ohm."
  },
  {
    "con": "Nếu tần số của tín hiệu AC tăng lên, thì điện trở của mạch RLC sẽ thay đổi như thế nào?",
    "re": "Điện trở tổng của mạch RLC sẽ thay đổi do sự thay đổi của reaktans."
  },
  {
    "con": "Nếu điện áp đầu vào của một bộ khuếch đại là 0V, thì điện áp đầu ra sẽ như thế nào?",
    "re": "Điện áp đầu ra cũng sẽ là 0V."
  },
  {
    "con": "Nếu một tụ điện được nạp đầy và sau đó được ngắt kết nối khỏi nguồn, thì điện tích trên tụ điện sẽ như thế nào?",
    "re": "Điện tích sẽ giữ nguyên cho đến khi tụ điện được xả."
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn hơn, thì dòng điện chạy qua mạch sẽ như thế nào?",
    "re": "Dòng điện sẽ giảm theo định luật Ohm."
  },
  {
    "con": "Nếu một động cơ điện không quay khi có điện áp cấp, thì nguyên nhân có thể là gì?",
    "re": "Có thể do động cơ bị kẹt hoặc hỏng hóc."
  },
  {
    "con": "Nếu điện áp trên một tụ điện tăng lên, thì năng lượng lưu trữ trong tụ điện sẽ như thế nào?",
    "re": "Năng lượng lưu trữ sẽ tăng theo bình phương điện áp."
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện song song, thì điện áp tổng của mạch sẽ như thế nào?",
    "re": "Điện áp tổng sẽ bằng điện áp của nguồn điện có điện áp cao nhất."
  },
  {
    "con": "Nếu một cuộn dây được kết nối với nguồn điện một chiều, thì từ trường xung quanh cuộn dây sẽ như thế nào?",
    "re": "Từ trường sẽ xuất hiện và ổn định sau một khoảng thời gian ngắn."
  },
  {
    "con": "Tín hiệu ra ở mạch hình 5.21JC, dao động trên mức 6VDC. Vấn đề có nhiều khả năng xảy ra nhất đối với mạch là gì ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của bộ chuyển đổi DC-DC thấp hơn điện áp đầu ra yêu cầu. Mạch sẽ không hoạt động hiệu quả.",
    "re": "Mạch sẽ không hoạt động hiệu quả"
  },
  {
    "con": "Nếu điện trở trong mạch giảm xuống dưới mức cho phép, dòng điện sẽ tăng lên.",
    "re": "Dòng điện sẽ tăng lên"
  },
  {
    "con": "Khi tần số của tín hiệu AC tăng, điện trở của cuộn cảm sẽ tăng.",
    "re": "Điện trở của cuộn cảm sẽ tăng"
  },
  {
    "con": "Nếu một tụ điện bị quá tải, nó có thể bị hỏng hoặc phát nổ.",
    "re": "Nó có thể bị hỏng hoặc phát nổ"
  },
  {
    "con": "Khi sử dụng mạch song song, điện áp trên mỗi nhánh sẽ bằng nhau.",
    "re": "Điện áp trên mỗi nhánh sẽ bằng nhau"
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn, dòng điện sẽ giảm.",
    "re": "Dòng điện sẽ giảm"
  },
  {
    "con": "Khi một cuộn cảm được kết nối với nguồn điện DC, nó sẽ tạo ra một từ trường.",
    "re": "Nó sẽ tạo ra một từ trường"
  },
  {
    "con": "Nếu tần số của tín hiệu vượt quá tần số cắt của bộ lọc, tín hiệu sẽ bị suy giảm.",
    "re": "Tín hiệu sẽ bị suy giảm"
  },
  {
    "con": "Khi một diode được kết nối ngược, nó sẽ không cho dòng điện đi qua.",
    "re": "Nó sẽ không cho dòng điện đi qua"
  },
  {
    "con": "Mức tín hiệu vào ở mạch hình 5.22JC, được đặt ở mức 0. Điện áp trên collector của Q1 và Q2 đo được là 12V. Vấn đề có nhiều khả năng xảy ra nhất đối với mạch là gì ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên hai đầu một điện trở là 10V và điện trở có giá trị 5Ω.",
    "re": "Dòng điện chạy qua điện trở là 2A"
  },
  {
    "con": "Tần số của tín hiệu AC là 60Hz và điện áp đỉnh là 120V.",
    "re": "Điện áp hiệu dụng của tín hiệu là 84.85V"
  },
  {
    "con": "Một mạch RLC nối tiếp có điện trở 10Ω, cuộn cảm 0.1H và tụ điện 100μF.",
    "re": "Tần số cộng hưởng của mạch là 15.9Hz"
  },
  {
    "con": "Một mạch điện có công suất tiêu thụ 1000W và điện áp 220V.",
    "re": "Dòng điện chạy qua mạch là 4.55A"
  },
  {
    "con": "Một transistor NPN được sử dụng trong chế độ khuếch đại với β = 100 và dòng base là 0.01A.",
    "re": "Dòng collector sẽ là 1A"
  },
  {
    "con": "Một mạch điện có điện trở tương đương 30Ω và nguồn điện 120V.",
    "re": "Công suất tiêu thụ của mạch là 480W"
  },
  {
    "con": "Một tụ điện có điện dung 10μF được nạp điện với điện áp 50V.",
    "re": "Năng lượng lưu trữ trong tụ điện là 0.0125J"
  },
  {
    "con": "Một mạch điện có hai điện trở 20Ω và 30Ω nối song song.",
    "re": "Điện trở tương đương của mạch là 12Ω"
  },
  {
    "con": "Một động cơ điện có công suất 1500W và hiệu suất 90%.",
    "re": "Công suất đầu vào của động cơ là 1666.67W"
  },
  {
    "con": "Mức tín hiệu vào ở mạch hình 5.22JC, được đặt ở mức 0. Điện áp trên collector của Q1 đo được là 12V và điện áp trên Q2 đo được là 0,2V. Vấn đề có nhiều khả năng xảy ra nhất đối với mạch là gì ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện trở của một mạch điện là 0 ohm.",
    "re": "Dòng điện trong mạch sẽ là vô hạn nếu điện áp không bằng 0."
  },
  {
    "con": "Tần số của tín hiệu AC tăng lên.",
    "re": "Điện trở của mạch sẽ giảm nếu có tụ điện trong mạch."
  },
  {
    "con": "Một mạch điện có điện áp nguồn là 12V và điện trở tải là 6 ohm.",
    "re": "Dòng điện chạy qua mạch sẽ là 2A."
  },
  {
    "con": "Một tụ điện được nạp đầy và sau đó được ngắt kết nối khỏi nguồn.",
    "re": "Nó sẽ giữ điện tích và có thể cung cấp điện cho mạch ngoài trong một thời gian."
  },
  {
    "con": "Một transistor được sử dụng trong chế độ khuếch đại.",
    "re": "Tín hiệu đầu ra sẽ lớn hơn tín hiệu đầu vào nếu transistor hoạt động đúng."
  },
  {
    "con": "Một mạch điện có điện áp 220V và công suất tiêu thụ là 1100W.",
    "re": "Dòng điện trong mạch sẽ là 5A."
  },
  {
    "con": "Một cuộn dây trong mạch điện có dòng điện thay đổi nhanh.",
    "re": "Nó sẽ tạo ra một điện áp tự cảm phản kháng lại sự thay đổi của dòng điện."
  },
  {
    "con": "Một mạch điện có điện trở R1 = 10 ohm và R2 = 20 ohm mắc nối tiếp.",
    "re": "Điện trở tương đương của mạch sẽ là 30 ohm."
  },
  {
    "con": "Một diode được mắc ngược trong mạch.",
    "re": "Nó sẽ không dẫn điện và có thể gây ra hư hỏng nếu điện áp ngược vượt quá giới hạn cho phép."
  },
  {
    "con": "Mức tín hiệu vào ở mạch hình 5.22JC, được đặt ở mức 0. Điện áp trên collector của Q1 và Q2 đo được là 6V. Vấn đề có nhiều khả năng xảy ra nhất đối với mạch là gì ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên hai đầu của một điện trở trong mạch là 10V và điện trở có giá trị 5Ω.",
    "re": "Dòng điện chạy qua điện trở là 2A"
  },
  {
    "con": "Tần số của tín hiệu AC là 50Hz và điện trở tải là 10Ω.",
    "re": "Công suất tiêu thụ của tải là 25W"
  },
  {
    "con": "Một tụ điện có điện dung 100μF được nối với nguồn điện 12V.",
    "re": "Năng lượng lưu trữ trong tụ điện là 0.0072J"
  },
  {
    "con": "Một cuộn dây có độ tự cảm 200mH và dòng điện qua cuộn dây thay đổi với tốc độ 5A/s.",
    "re": "Điện áp cảm ứng trên cuộn dây là 1V"
  },
  {
    "con": "Một mạch RLC nối tiếp có điện trở 10Ω, độ tự cảm 100mH và điện dung 10μF.",
    "re": "Tần số cộng hưởng của mạch là 159.15Hz"
  },
  {
    "con": "Một mạch điện có nguồn điện 24V và điện trở 12Ω.",
    "re": "Dòng điện trong mạch là 2A"
  },
  {
    "con": "Một transistor NPN được sử dụng trong chế độ khuếch đại với dòng điện vào là 1mA.",
    "re": "Dòng điện ra có thể lớn hơn 1mA tùy thuộc vào hệ số khuếch đại"
  },
  {
    "con": "Một mạch điện có điện áp 220V và công suất tiêu thụ là 1100W.",
    "re": "Dòng điện trong mạch là 5A"
  },
  {
    "con": "Một mạch điện có điện trở 4Ω và công suất tiêu thụ là 16W.",
    "re": "Điện áp trên mạch là 16V"
  },
  {
    "con": "khi BJT dẫn bão hòa",
    "re": "VCE xấp xỉ bằng 0V"
  },
  {
    "con": "khi điện áp trên tụ điện đạt giá trị tối đa",
    "re": "dòng điện qua tụ điện bằng 0"
  },
  {
    "con": "khi một mạch điện có điện trở R và nguồn điện áp V",
    "re": "dòng điện I sẽ bằng V/R theo định luật Ohm"
  },
  {
    "con": "khi tần số của tín hiệu tăng",
    "re": "điện dung của tụ điện sẽ ảnh hưởng đến dòng điện qua nó"
  },
  {
    "con": "khi một cuộn dây có dòng điện thay đổi",
    "re": "nó sẽ tạo ra một điện áp tự cảm chống lại sự thay đổi đó"
  },
  {
    "con": "khi sử dụng mạch RLC",
    "re": "tần số cộng hưởng sẽ xảy ra khi XL = XC"
  },
  {
    "con": "khi điện áp trên một điện trở là V và điện trở là R",
    "re": "công suất tiêu thụ P sẽ bằng V^2/R"
  },
  {
    "con": "khi một mạch điện xoay chiều có tần số f",
    "re": "điện trở tương đương sẽ phụ thuộc vào R, L, và C"
  },
  {
    "con": "khi sử dụng transistor trong chế độ khuếch đại",
    "re": "tín hiệu đầu ra sẽ tỷ lệ với tín hiệu đầu vào"
  },
  {
    "con": "khi một mạch điện có nhiều nguồn điện",
    "re": "cần áp dụng quy tắc Kirchhoff để phân tích"
  },
  {
    "con": "Hệ số khuếch đại điện áp của mạch khuếch đại dùng transistor có công thức:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện trở của một mạch điện là hằng số khi nhiệt độ không thay đổi:",
    "re": "Điện trở sẽ không thay đổi theo thời gian"
  },
  {
    "con": "Khi điện áp tăng lên trong một mạch điện có điện trở cố định:",
    "re": "Dòng điện sẽ tăng theo định luật Ohm"
  },
  {
    "con": "Trong một mạch RLC, tần số cộng hưởng xảy ra khi:",
    "re": "Điện trở thuần bằng 0 và tổng cảm kháng bằng tổng dung kháng"
  },
  {
    "con": "Nếu một mạch điện có công suất tiêu thụ lớn hơn công suất định mức của thiết bị:",
    "re": "Thiết bị sẽ bị hỏng hoặc giảm tuổi thọ"
  },
  {
    "con": "Khi một tụ điện được nạp đầy điện tích:",
    "re": "Điện áp trên tụ điện sẽ đạt đến giá trị tối đa"
  },
  {
    "con": "Trong một mạch điện xoay chiều, nếu tần số tăng lên:",
    "re": "Điện trở cảm kháng sẽ tăng lên"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện song song:",
    "re": "Điện áp trên mỗi nguồn sẽ bằng nhau"
  },
  {
    "con": "Khi một cuộn dây được đặt trong từ trường biến thiên:",
    "re": "Sẽ xuất hiện sức điện động cảm ứng trong cuộn dây"
  },
  {
    "con": "Nếu điện áp đầu vào của một bộ chuyển đổi DC-DC là ổn định:",
    "re": "Điện áp đầu ra sẽ cũng ổn định nếu không có tải thay đổi"
  },
  {
    "con": "Mạch khuếch đại dùng BJT với cách mắc mạch nào thì tín hiệu ra sẽ ngược pha với tín hiệu vào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở trong mạch nối tiếp tỉ lệ thuận với giá trị của điện trở đó:",
    "re": "Điện áp sẽ lớn hơn khi điện trở lớn hơn"
  },
  {
    "con": "Khi tần số của tín hiệu tăng trong mạch RLC, thì độ lợi của mạch sẽ giảm:",
    "re": "Mạch sẽ trở nên kém hiệu quả hơn trong việc khuếch đại tín hiệu"
  },
  {
    "con": "Nếu một cuộn dây được kết nối với nguồn điện xoay chiều, thì nó sẽ tạo ra từ trường biến thiên:",
    "re": "Từ trường này có thể gây ra hiện tượng cảm ứng điện từ"
  },
  {
    "con": "Khi điện áp trên một tụ điện tăng, thì điện tích trên tụ điện cũng sẽ tăng:",
    "re": "Điện tích sẽ tỉ lệ thuận với điện áp theo công thức Q = C * V"
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn hơn, thì dòng điện chạy qua mạch sẽ giảm:",
    "re": "Dòng điện sẽ tỉ lệ nghịch với điện trở theo định luật Ohm"
  },
  {
    "con": "Khi một diode được mắc ngược, thì nó sẽ không cho dòng điện chạy qua:",
    "re": "Diode sẽ ở trạng thái ngắt"
  },
  {
    "con": "Nếu tần số của tín hiệu trong mạch LC bằng tần số cộng hưởng, thì trở kháng của mạch sẽ đạt giá trị tối thiểu:",
    "re": "Mạch sẽ cho phép dòng điện chạy qua dễ dàng nhất"
  },
  {
    "con": "Khi một transistor hoạt động trong vùng bão hòa, thì nó sẽ hoạt động như một công tắc đóng:",
    "re": "Dòng điện sẽ chạy qua từ collector đến emitter"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện song song, thì điện áp tổng của mạch sẽ bằng điện áp của một nguồn:",
    "re": "Điện áp không thay đổi nhưng dòng điện sẽ cộng dồn"
  },
  {
    "con": "Mạch khuếch đại dùng BJT với cách mắc mạch nào thì tín hiệu ra sẽ cùng pha với tín hiệu vào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp trên một tụ điện tăng lên thì dòng điện qua tụ điện sẽ:",
    "re": "Giảm xuống"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và nguồn điện áp V thì dòng điện I sẽ được tính bằng công thức:",
    "re": "I = V/R"
  },
  {
    "con": "Nếu tần số của tín hiệu AC tăng lên thì độ lớn của điện trở cảm kháng sẽ:",
    "re": "Tăng lên"
  },
  {
    "con": "Nếu một cuộn dây có số vòng quấn N tăng lên thì cảm kháng của cuộn dây sẽ:",
    "re": "Tăng lên"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở mắc nối tiếp thì điện trở tổng R sẽ:",
    "re": "Bằng tổng các điện trở"
  },
  {
    "con": "Nếu một diode được mắc ngược thì nó sẽ:",
    "re": "Không dẫn điện"
  },
  {
    "con": "Nếu điện áp trên một điện trở tăng lên thì công suất tiêu thụ P sẽ:",
    "re": "Tăng lên theo bình phương điện áp"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và công suất P thì điện áp V sẽ được tính bằng công thức:",
    "re": "V = √(P*R)"
  },
  {
    "con": "Nếu tần số của một mạch LC thay đổi thì tần số cộng hưởng sẽ:",
    "re": "Thay đổi theo công thức f = 1/(2π√(LC))"
  },
  {
    "con": "Khi mạch khuếch đại bằng BJT được phân cực để hoạt động ở chế độ A",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp trên một tụ điện đạt đến giá trị tối đa",
    "re": "Tụ điện sẽ bắt đầu xả điện"
  },
  {
    "con": "Khi một mạch điện có điện trở thấp hơn điện trở của tải",
    "re": "Dòng điện sẽ tăng lên theo định luật Ohm"
  },
  {
    "con": "Khi tần số của tín hiệu tăng lên trong một mạch LC",
    "re": "Độ lợi của mạch sẽ giảm"
  },
  {
    "con": "Khi một cuộn cảm được kết nối với nguồn điện một chiều",
    "re": "Cuộn cảm sẽ tạo ra một dòng điện tăng dần"
  },
  {
    "con": "Khi điện áp đầu vào của một bộ chuyển đổi DC-DC tăng lên",
    "re": "Điện áp đầu ra cũng sẽ tăng lên nếu tỷ lệ biến đổi không đổi"
  },
  {
    "con": "Khi một diode được phân cực thuận",
    "re": "Diode sẽ dẫn điện"
  },
  {
    "con": "Khi một mạch điện có nhiều nguồn điện song song",
    "re": "Điện áp đầu ra sẽ bằng điện áp của nguồn có điện áp cao nhất"
  },
  {
    "con": "Khi một mạch điện có điện trở lớn hơn điện trở của tải",
    "re": "Dòng điện sẽ giảm xuống"
  },
  {
    "con": "Khi tần số của dòng điện xoay chiều tăng lên",
    "re": "Điện trở của cuộn cảm sẽ tăng lên"
  },
  {
    "con": "Hồi tiếp âm có đặc điểm sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp vượt quá mức cho phép của linh kiện điện tử:",
    "re": "Có thể gây hỏng hóc hoặc giảm tuổi thọ của linh kiện"
  },
  {
    "con": "Dòng điện chạy qua một điện trở:",
    "re": "Sẽ tạo ra nhiệt lượng theo định luật Joule"
  },
  {
    "con": "Tần số của dòng điện xoay chiều tăng:",
    "re": "Thì điện áp và dòng điện sẽ thay đổi theo chu kỳ"
  },
  {
    "con": "Một mạch điện có điện trở tương đương thấp:",
    "re": "Sẽ cho phép dòng điện lớn hơn chảy qua"
  },
  {
    "con": "Sử dụng tụ điện trong mạch điện:",
    "re": "Có thể giúp lọc nhiễu và ổn định điện áp"
  },
  {
    "con": "Khi một cuộn dây được đặt trong từ trường thay đổi:",
    "re": "Sẽ tạo ra điện áp cảm ứng theo định luật Faraday"
  },
  {
    "con": "Mạch điện song song có điện trở tương đương:",
    "re": "Sẽ nhỏ hơn bất kỳ điện trở nào trong mạch"
  },
  {
    "con": "Khi điện áp tăng trong một mạch kín:",
    "re": "Dòng điện sẽ tăng theo định luật Ohm"
  },
  {
    "con": "Sử dụng biến trở trong mạch điện:",
    "re": "Có thể điều chỉnh dòng điện hoặc điện áp theo ý muốn"
  },
  {
    "con": "Mạch điện có điện trở R và nguồn điện áp V",
    "re": "Dòng điện I sẽ được tính bằng công thức I = V/R"
  },
  {
    "con": "Tần số của dòng điện xoay chiều là f",
    "re": "Chu kỳ T sẽ được tính bằng công thức T = 1/f"
  },
  {
    "con": "Một tụ điện có điện dung C và điện áp V",
    "re": "Năng lượng lưu trữ W sẽ được tính bằng công thức W = 1/2 * C * V^2"
  },
  {
    "con": "Một cuộn dây có độ tự cảm L và dòng điện I",
    "re": "Điện áp cảm ứng U sẽ được tính bằng công thức U = L * (dI/dt)"
  },
  {
    "con": "Mạch điện có nhiều điện trở nối tiếp",
    "re": "Điện trở tương đương Rt sẽ được tính bằng Rt = R1 + R2 + ... + Rn"
  },
  {
    "con": "Mạch điện có nhiều điện trở nối song song",
    "re": "Điện trở tương đương Rp sẽ được tính bằng công thức 1/Rp = 1/R1 + 1/R2 + ... + 1/Rn"
  },
  {
    "con": "Một mạch điện có điện áp V và công suất P",
    "re": "Dòng điện I sẽ được tính bằng công thức I = P/V"
  },
  {
    "con": "Một mạch điện có điện áp V và điện trở R",
    "re": "Công suất tiêu thụ P sẽ được tính bằng công thức P = V^2/R"
  },
  {
    "con": "Một mạch điện có điện áp V và dòng điện I",
    "re": "Công suất P sẽ được tính bằng công thức P = V * I"
  },
  {
    "con": "Một mạch điện có tần số f và điện dung C",
    "re": "Điện trở phản kháng của tụ điện Xc sẽ được tính bằng công thức Xc = 1/(2πfC)"
  },
  {
    "con": "Mạch điện của bộ khuếch đại có hồi tiếp có đặc điểm: tín hiệu hồi tiếp đưa về đầu vào nối tiếp với nguồn tín hiệu ban đầu và tỷ lệ với điện áp ở đầu ra, vậy nó thuộc loại hồi tiếp nào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp trên một tụ điện tăng lên, thì dòng điện qua tụ điện sẽ:",
    "re": "Giảm xuống"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và nguồn điện áp V, thì dòng điện I chạy qua mạch sẽ được tính bằng công thức:",
    "re": "I = V / R"
  },
  {
    "con": "Nếu tần số của tín hiệu AC tăng lên, thì độ lớn của điện trở cảm kháng trong mạch RLC sẽ:",
    "re": "Tăng lên"
  },
  {
    "con": "Nếu một cuộn dây có số vòng quấn N và dòng điện I chạy qua, thì từ thông Φ trong cuộn dây sẽ:",
    "re": "Tăng theo tỷ lệ với N và I"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở mắc nối tiếp, thì điện trở tương đương R tổng sẽ:",
    "re": "Bằng tổng các điện trở riêng lẻ"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và công suất P tiêu thụ, thì điện áp U trên mạch sẽ được tính bằng công thức:",
    "re": "U = √(P * R)"
  },
  {
    "con": "Nếu một động cơ điện hoạt động ở chế độ quá tải, thì nhiệt độ của động cơ sẽ:",
    "re": "Tăng lên và có thể gây hư hỏng"
  },
  {
    "con": "Nếu một mạch điện có tụ điện và cuộn dây mắc nối tiếp, thì tần số cộng hưởng sẽ xảy ra khi:",
    "re": "Cảm kháng bằng dung kháng"
  },
  {
    "con": "Nếu điện áp trên một điện trở tăng lên trong khi điện trở không thay đổi, thì dòng điện qua điện trở sẽ:",
    "re": "Tăng lên"
  },
  {
    "con": "Hồi tiếp âm sẽ cho hệ số khuếch đại như thế nào so với hệ số khuếch đại của mạch không có hồi tiếp:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện trở của một mạch nối tiếp sẽ bằng tổng điện trở của các thành phần trong mạch:",
    "re": "Điện trở tổng sẽ lớn hơn bất kỳ điện trở nào trong mạch"
  },
  {
    "con": "Khi tần số của tín hiệu tăng lên trong một mạch RLC, thì độ lợi của mạch sẽ thay đổi như thế nào:",
    "re": "Độ lợi sẽ giảm xuống do hiện tượng suy giảm"
  },
  {
    "con": "Nếu một cuộn dây được kết nối với nguồn điện xoay chiều, thì từ trường tạo ra sẽ có đặc điểm gì:",
    "re": "Từ trường sẽ thay đổi theo chu kỳ của dòng điện"
  },
  {
    "con": "Khi điện áp tăng lên trong một mạch có điện trở không đổi, thì dòng điện sẽ thay đổi như thế nào:",
    "re": "Dòng điện sẽ tăng lên theo định luật Ohm"
  },
  {
    "con": "Nếu một tụ điện được nạp điện và sau đó ngắt kết nối với nguồn, thì điện tích trên tụ sẽ như thế nào:",
    "re": "Điện tích sẽ giữ nguyên cho đến khi tụ được xả"
  },
  {
    "con": "Khi một mạch điện có nhiều nhánh song song, thì điện áp trên mỗi nhánh sẽ như thế nào:",
    "re": "Điện áp trên mỗi nhánh sẽ bằng nhau"
  },
  {
    "con": "Nếu một động cơ điện hoạt động ở tải nặng, thì hiệu suất của động cơ sẽ như thế nào:",
    "re": "Hiệu suất sẽ giảm do tổn thất năng lượng"
  },
  {
    "con": "Khi sử dụng biến áp, nếu số vòng dây ở cuộn sơ cấp nhiều hơn cuộn thứ cấp, thì điện áp sẽ như thế nào:",
    "re": "Điện áp ở cuộn sơ cấp sẽ cao hơn điện áp ở cuộn thứ cấp"
  },
  {
    "con": "Nếu một mạch điện có điện trở và tụ điện, thì thời gian để tụ nạp đầy sẽ phụ thuộc vào yếu tố nào:",
    "re": "Thời gian nạp sẽ phụ thuộc vào giá trị của điện trở và tụ điện"
  },
  {
    "con": "Ảnh hưởng của hồi tiếp âm đến trở kháng vào, phát biểu nào sau đây là đúng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở tỉ lệ thuận với dòng điện chạy qua nó:",
    "re": "Định luật Ohm được áp dụng"
  },
  {
    "con": "Tần số của dòng điện xoay chiều tăng lên:",
    "re": "Điện trở của cuộn cảm sẽ tăng lên"
  },
  {
    "con": "Khi một mạch điện có điện trở giảm xuống:",
    "re": "Dòng điện trong mạch sẽ tăng lên nếu điện áp không đổi"
  },
  {
    "con": "Khi một tụ điện được nạp đầy:",
    "re": "Dòng điện qua tụ sẽ ngừng lại"
  },
  {
    "con": "Khi một mạch điện có nhiều nguồn điện song song:",
    "re": "Điện áp trên mỗi nguồn sẽ bằng nhau"
  },
  {
    "con": "Khi một cuộn dây được đặt trong từ trường thay đổi:",
    "re": "Sẽ xuất hiện sức điện động cảm ứng trong cuộn dây"
  },
  {
    "con": "Khi điện áp đầu vào của một bộ khuếch đại tăng lên:",
    "re": "Điện áp đầu ra cũng sẽ tăng lên theo tỷ lệ khuếch đại"
  },
  {
    "con": "Khi một mạch điện có điện trở và cuộn cảm nối tiếp:",
    "re": "Tổng trở sẽ lớn hơn điện trở thuần"
  },
  {
    "con": "Khi một mạch điện có tụ điện và điện trở nối tiếp:",
    "re": "Thời gian nạp và xả của tụ điện sẽ phụ thuộc vào giá trị của điện trở"
  },
  {
    "con": "Mạch điện có điện trở R và nguồn điện áp V, thì dòng điện I chạy qua mạch được tính bằng công thức:",
    "re": "I = V/R"
  },
  {
    "con": "Khi tần số của tín hiệu tăng lên trong một mạch RLC, thì trở kháng của cuộn cảm L sẽ:",
    "re": "tăng lên"
  },
  {
    "con": "Trong một mạch điện xoay chiều, nếu điện áp và dòng điện lệch pha 90 độ, thì công suất thực sẽ:",
    "re": "bằng 0"
  },
  {
    "con": "Khi sử dụng biến áp, nếu số vòng dây ở cuộn sơ cấp nhiều hơn cuộn thứ cấp, thì điện áp ở cuộn thứ cấp sẽ:",
    "re": "nhỏ hơn điện áp ở cuộn sơ cấp"
  },
  {
    "con": "Nếu một tụ điện được nạp điện và sau đó được ngắt khỏi nguồn, thì điện tích trên tụ điện sẽ:",
    "re": "giữ nguyên cho đến khi xả"
  },
  {
    "con": "Khi một mạch điện có điện trở R và công suất P, thì điện áp U được tính bằng công thức:",
    "re": "U = √(P*R)"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở mắc nối tiếp, thì điện trở tương đương R sẽ:",
    "re": "bằng tổng các điện trở"
  },
  {
    "con": "Trong một mạch điện, nếu điện áp tăng lên mà điện trở không đổi, thì dòng điện I sẽ:",
    "re": "tăng lên"
  },
  {
    "con": "Khi một động cơ điện hoạt động, nếu tải trọng tăng lên, thì dòng điện tiêu thụ sẽ:",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và công suất P, thì dòng điện I được tính bằng công thức:",
    "re": "I = √(P/R)"
  },
  {
    "con": "Với mạch hồi tiếp âm nối tiếp dòng điện thì trở kháng vào và trở kháng ra thay đổi thế nào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp tăng lên trong một mạch RLC thì dòng điện sẽ thay đổi như thế nào:",
    "re": "Dòng điện sẽ tăng lên nếu điện áp vượt quá trở kháng tổng của mạch."
  },
  {
    "con": "Nếu tần số của nguồn điện thay đổi thì phản kháng của cuộn cảm sẽ thay đổi ra sao:",
    "re": "Phản kháng của cuộn cảm sẽ tăng lên khi tần số tăng."
  },
  {
    "con": "Khi một điện trở được nối song song với một tụ điện thì tổng trở kháng của mạch sẽ như thế nào:",
    "re": "Tổng trở kháng sẽ giảm xuống do sự kết hợp của điện trở và tụ điện."
  },
  {
    "con": "Nếu một mạch điện có điện áp không đổi thì công suất tiêu thụ sẽ thay đổi như thế nào khi điện trở thay đổi:",
    "re": "Công suất tiêu thụ sẽ tăng lên khi điện trở giảm xuống."
  },
  {
    "con": "Khi một mạch điện có nhiều nguồn điện khác nhau thì cách tính điện áp tổng sẽ như thế nào:",
    "re": "Điện áp tổng sẽ là tổng đại số của các điện áp nguồn, tính theo chiều và dấu."
  },
  {
    "con": "Nếu một tụ điện được nạp đầy thì điện áp trên tụ sẽ như thế nào khi ngắt kết nối với nguồn:",
    "re": "Điện áp trên tụ điện sẽ giữ nguyên cho đến khi nó được xả ra."
  },
  {
    "con": "Khi một cuộn cảm được nối với nguồn điện một chiều thì dòng điện sẽ thay đổi như thế nào theo thời gian:",
    "re": "Dòng điện sẽ tăng dần lên theo hàm mũ cho đến khi đạt giá trị ổn định."
  },
  {
    "con": "Nếu một mạch điện có điện trở và cuộn cảm thì độ lệch pha giữa điện áp và dòng điện sẽ như thế nào:",
    "re": "Độ lệch pha sẽ dương, tức là điện áp sẽ dẫn dòng điện."
  },
  {
    "con": "Khi sử dụng biến áp để thay đổi điện áp thì tỉ lệ giữa số vòng dây sẽ ảnh hưởng đến điều gì:",
    "re": "Tỉ lệ giữa số vòng dây sẽ ảnh hưởng đến điện áp đầu ra so với điện áp đầu vào."
  },
  {
    "con": "Mạch sau ở hình 3 thuộc loại hồi tiếp nào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở tỉ lệ thuận với dòng điện chạy qua nó:",
    "re": "Định luật Ohm được áp dụng"
  },
  {
    "con": "Tần số của dòng điện xoay chiều tăng lên:",
    "re": "Điện trở của cuộn cảm sẽ tăng lên"
  },
  {
    "con": "Một mạch điện có điện trở và công suất tiêu thụ xác định:",
    "re": "Công suất tiêu thụ sẽ tỉ lệ thuận với bình phương điện áp"
  },
  {
    "con": "Khi điện áp trong mạch tăng lên mà điện trở không đổi:",
    "re": "Dòng điện trong mạch sẽ tăng lên"
  },
  {
    "con": "Khi một tụ điện được nạp đầy:",
    "re": "Dòng điện qua tụ điện sẽ ngừng lại"
  },
  {
    "con": "Khi một cuộn cảm được kết nối với nguồn điện một chiều:",
    "re": "Dòng điện sẽ tăng dần cho đến khi đạt giá trị ổn định"
  },
  {
    "con": "Trong một mạch RLC, tần số cộng hưởng đạt được khi:",
    "re": "Điện trở của mạch là tối thiểu"
  },
  {
    "con": "Khi một mạch điện có nhiều nguồn điện song song:",
    "re": "Điện áp trên mỗi nguồn sẽ bằng nhau"
  },
  {
    "con": "Khi điện áp trong mạch giảm xuống:",
    "re": "Công suất tiêu thụ sẽ giảm theo"
  },
  {
    "con": "Mạch sau ở hình 4 thuộc loại hồi tiếp nào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một tụ điện sẽ tăng lên khi dòng điện chạy qua nó là:",
    "re": "Dòng điện không đổi"
  },
  {
    "con": "Nếu điện trở của mạch giảm xuống trong khi điện áp không đổi:",
    "re": "Dòng điện trong mạch sẽ tăng lên"
  },
  {
    "con": "Khi tần số của dòng điện xoay chiều tăng lên:",
    "re": "Điện trở của cuộn cảm sẽ tăng lên"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở nối tiếp:",
    "re": "Tổng điện trở sẽ bằng tổng các điện trở"
  },
  {
    "con": "Khi một tụ điện được nạp đầy:",
    "re": "Dòng điện qua tụ sẽ giảm về 0"
  },
  {
    "con": "Nếu một mạch điện có điện áp không đổi và điện trở tăng lên:",
    "re": "Dòng điện trong mạch sẽ giảm xuống"
  },
  {
    "con": "Khi một cuộn cảm được kết nối với nguồn điện một chiều:",
    "re": "Nó sẽ tạo ra một dòng điện tăng dần"
  },
  {
    "con": "Nếu một mạch điện có điện áp xoay chiều và điện trở thuần:",
    "re": "Dòng điện sẽ lệch pha với điện áp"
  },
  {
    "con": "Khi một mạch điện có điện trở và cuộn cảm nối tiếp:",
    "re": "Tổng trở sẽ lớn hơn điện trở thuần"
  },
  {
    "con": "Mạch sau ở hình 5 thuộc loại hồi tiếp nào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một tụ điện không thay đổi đột ngột:",
    "re": "Dòng điện qua tụ điện sẽ bằng 0 tại thời điểm thay đổi"
  },
  {
    "con": "Công suất tiêu thụ của một điện trở là tích của điện áp và dòng điện:",
    "re": "Công suất sẽ được tính bằng công thức P = U * I"
  },
  {
    "con": "Mạch điện có điện trở tương đương R1 và R2 mắc nối tiếp:",
    "re": "Điện trở tương đương sẽ là R = R1 + R2"
  },
  {
    "con": "Mạch điện có điện trở tương đương R1 và R2 mắc song song:",
    "re": "Điện trở tương đương sẽ được tính bằng 1/R = 1/R1 + 1/R2"
  },
  {
    "con": "Tần số của dòng điện xoay chiều là 50Hz:",
    "re": "Chu kỳ của dòng điện sẽ là 20ms"
  },
  {
    "con": "Một cuộn dây có độ tự cảm L và dòng điện thay đổi:",
    "re": "Sẽ sinh ra một điện áp cảm ứng theo định luật Faraday"
  },
  {
    "con": "Một mạch điện có điện áp U và điện trở R:",
    "re": "Dòng điện I sẽ được tính bằng công thức I = U/R"
  },
  {
    "con": "Một động cơ điện hoạt động ở chế độ tải tối ưu:",
    "re": "Hiệu suất của động cơ sẽ đạt giá trị cao nhất"
  },
  {
    "con": "Khi điện áp tăng lên trong một mạch điện kín:",
    "re": "Dòng điện sẽ tăng lên nếu điện trở không thay đổi"
  },
  {
    "con": "Mạch khuếch đại dùng BJT ở hình 2 mắc theo loại nào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại vượt quá điện áp định mức:",
    "re": "Mạch có thể bị hỏng hoặc không hoạt động đúng"
  },
  {
    "con": "Dòng điện qua một điện trở tăng lên:",
    "re": "Điện áp trên điện trở cũng sẽ tăng theo định luật Ohm"
  },
  {
    "con": "Tần số của tín hiệu đầu vào tăng lên trong mạch LC:",
    "re": "Độ lợi của mạch sẽ thay đổi theo tần số"
  },
  {
    "con": "Mạch điện có điện trở R và tụ điện C mắc nối tiếp:",
    "re": "Thời gian hằng định của mạch sẽ được xác định bởi R và C"
  },
  {
    "con": "Tụ điện được nạp đầy:",
    "re": "Dòng điện qua tụ sẽ giảm về 0"
  },
  {
    "con": "Mạch điện có nhiều nguồn điện song song:",
    "re": "Điện áp trên mỗi nguồn sẽ bằng nhau"
  },
  {
    "con": "Tần số của dòng điện xoay chiều là 50Hz:",
    "re": "Chu kỳ của dòng điện là 20ms"
  },
  {
    "con": "Mạch điện có điện trở R và cuộn cảm L mắc nối tiếp:",
    "re": "Trở kháng tổng của mạch sẽ bao gồm cả điện trở và phản kháng của cuộn cảm"
  },
  {
    "con": "Điện áp trên một tụ điện trong mạch AC:",
    "re": "Sẽ bị trễ pha so với dòng điện"
  },
  {
    "con": "Mạch khuếch đại dùng BJT ở hình 3 mắc theo loại nào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một tụ điện không thay đổi đột ngột:",
    "re": "Điện áp sẽ giữ nguyên cho đến khi có dòng điện chạy qua"
  },
  {
    "con": "Trong mạch điện xoay chiều, nếu tần số tăng:",
    "re": "Điện trở của cuộn cảm sẽ tăng"
  },
  {
    "con": "Nếu điện trở của một mạch giảm xuống:",
    "re": "Dòng điện qua mạch sẽ tăng lên theo định luật Ohm"
  },
  {
    "con": "Khi một diode được mắc ngược:",
    "re": "Diode sẽ không dẫn điện và chỉ cho dòng điện đi qua khi mắc thuận"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện song song:",
    "re": "Điện áp tổng của mạch sẽ bằng điện áp của nguồn có điện áp cao nhất"
  },
  {
    "con": "Khi một tụ điện được nạp đầy:",
    "re": "Dòng điện qua tụ sẽ giảm về 0"
  },
  {
    "con": "Nếu tần số của tín hiệu tăng trong mạch RC:",
    "re": "Thời gian hằng định của mạch sẽ giảm"
  },
  {
    "con": "Khi một cuộn cảm được kết nối với nguồn điện một chiều:",
    "re": "Dòng điện sẽ tăng dần cho đến khi đạt giá trị tối đa"
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn hơn 0:",
    "re": "Sẽ luôn có một điện áp nhất định trên mạch khi có dòng điện chạy qua"
  },
  {
    "con": "Thành phần nào trong mạch ở hình 3 giữ vai trò hồi tiếp:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một tụ điện tỉ lệ thuận với điện tích của nó:",
    "re": "Điện áp tăng khi điện tích tăng"
  },
  {
    "con": "Nếu một mạch điện có điện trở không đổi và điện áp tăng:",
    "re": "Dòng điện trong mạch sẽ tăng"
  },
  {
    "con": "Khi tần số của dòng điện xoay chiều tăng:",
    "re": "Điện trở của cuộn cảm sẽ tăng"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện song song:",
    "re": "Điện áp trên các nguồn điện sẽ bằng nhau"
  },
  {
    "con": "Khi một điện trở được nối với nguồn điện một chiều:",
    "re": "Dòng điện sẽ ổn định sau một thời gian ngắn"
  },
  {
    "con": "Nếu một tụ điện được nạp đầy:",
    "re": "Nó sẽ không cho dòng điện đi qua nữa"
  },
  {
    "con": "Khi một mạch điện có điện trở lớn hơn điện trở của tải:",
    "re": "Dòng điện sẽ giảm"
  },
  {
    "con": "Nếu một cuộn cảm được nối với nguồn điện một chiều:",
    "re": "Nó sẽ tạo ra một dòng điện tăng dần"
  },
  {
    "con": "Khi điện áp trên một tải giảm:",
    "re": "Công suất tiêu thụ của tải cũng sẽ giảm"
  },
  {
    "con": "Hệ số hồi tiếp K_{ht}=X_{ht}/X_{r} của mạch trong hình 3 được xác định có trị tuyệt đối là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở trong mạch nối tiếp sẽ tỉ lệ thuận với giá trị của điện trở đó:",
    "re": "Điện áp sẽ phân bổ theo tỷ lệ giữa các điện trở"
  },
  {
    "con": "Nếu tần số của dòng điện xoay chiều tăng lên, thì điện trở của cuộn cảm sẽ tăng lên:",
    "re": "Điện trở cuộn cảm tỉ lệ thuận với tần số"
  },
  {
    "con": "Nếu điện áp đầu vào của một bộ khuếch đại tăng lên, thì điện áp đầu ra cũng sẽ tăng lên theo hệ số khuếch đại:",
    "re": "Điện áp đầu ra sẽ tỉ lệ thuận với điện áp đầu vào"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và công suất P, thì điện áp U có thể được tính bằng công thức U = √(P * R):",
    "re": "Điện áp được xác định từ công suất và điện trở"
  },
  {
    "con": "Nếu một tụ điện được nạp điện, thì điện áp trên tụ sẽ tăng lên cho đến khi đạt giá trị tối đa:",
    "re": "Tụ điện sẽ tích trữ điện năng cho đến khi đạt điện áp tối đa"
  },
  {
    "con": "Nếu dòng điện qua một cuộn cảm thay đổi nhanh chóng, thì sẽ xuất hiện một điện áp phản kháng:",
    "re": "Điện áp phản kháng sẽ chống lại sự thay đổi của dòng điện"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện, thì điện áp tổng của mạch sẽ là tổng các điện áp của từng nguồn:",
    "re": "Điện áp tổng sẽ là tổng đại số của các nguồn điện"
  },
  {
    "con": "Nếu một mạch điện có điện trở và tụ điện nối song song, thì điện trở tương đương sẽ nhỏ hơn điện trở nhỏ nhất trong mạch:",
    "re": "Điện trở tương đương sẽ giảm xuống"
  },
  {
    "con": "Nếu công suất tiêu thụ của một thiết bị điện tăng lên, thì dòng điện qua thiết bị đó cũng sẽ tăng lên nếu điện áp không đổi:",
    "re": "Dòng điện sẽ tỉ lệ thuận với công suất tiêu thụ"
  },
  {
    "con": "Thành phần nào trong mạch ở hình 5 giữ vai trò hồi tiếp:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của một mạch khuếch đại thấp hơn điện áp đầu ra:",
    "re": "Mạch khuếch đại hoạt động đúng"
  },
  {
    "con": "Tần số của tín hiệu đầu vào tăng lên:",
    "re": "Độ lợi của mạch khuếch đại có thể giảm"
  },
  {
    "con": "Điện trở trong mạch song song giảm:",
    "re": "Tổng điện trở của mạch cũng giảm"
  },
  {
    "con": "Dòng điện qua một điện trở tăng:",
    "re": "Điện áp trên điện trở cũng tăng theo định luật Ohm"
  },
  {
    "con": "Tần số của nguồn điện thay đổi:",
    "re": "Độ cảm kháng của cuộn dây sẽ thay đổi"
  },
  {
    "con": "Điện áp trên tụ điện đạt đến giá trị tối đa:",
    "re": "Dòng điện qua tụ điện sẽ giảm về 0"
  },
  {
    "con": "Công suất tiêu thụ của một thiết bị điện tăng:",
    "re": "Dòng điện qua thiết bị cũng sẽ tăng nếu điện áp không đổi"
  },
  {
    "con": "Mạch điện có điện trở lớn hơn 0:",
    "re": "Có thể xảy ra rò rỉ điện nếu không được cách điện đúng cách"
  },
  {
    "con": "Tín hiệu đầu vào của bộ khuếch đại là tín hiệu AC:",
    "re": "Bộ khuếch đại sẽ khuếch đại tín hiệu theo dạng sóng"
  },
  {
    "con": "Hệ số hồi tiếp K_{ht}=X_{ht}/X_{r} của mạch trong hình 5 khi hồi tiếp một chiều được xác định có trị tuyệt đối là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở trong mạch nối tiếp bằng tổng điện áp nguồn thì",
    "re": "Điện trở đó có giá trị bằng tổng điện trở của mạch"
  },
  {
    "con": "Nếu tần số của dòng điện xoay chiều tăng lên thì",
    "re": "điện trở cảm kháng của cuộn dây sẽ tăng lên"
  },
  {
    "con": "Khi một tụ điện được nạp đầy điện thì",
    "re": "dòng điện qua tụ sẽ bằng 0"
  },
  {
    "con": "Nếu điện áp trên một mạch RLC song song được giữ cố định thì",
    "re": "dòng điện qua mỗi phần tử sẽ thay đổi theo giá trị của chúng"
  },
  {
    "con": "Khi một mạch điện có điện trở thuần và điện trở cảm kháng thì",
    "re": "hệ số công suất sẽ nhỏ hơn 1"
  },
  {
    "con": "Nếu điện áp và dòng điện trong một mạch điện có cùng pha thì",
    "re": "công suất tiêu thụ là công suất thực"
  },
  {
    "con": "Khi một máy biến áp hoạt động ở chế độ lý tưởng thì",
    "re": "công suất vào bằng công suất ra"
  },
  {
    "con": "Nếu điện áp trên một tụ điện tăng lên thì",
    "re": "năng lượng lưu trữ trong tụ điện cũng tăng lên"
  },
  {
    "con": "Khi một mạch điện có điện trở và tụ điện thì",
    "re": "thời gian nạp và xả của tụ điện phụ thuộc vào giá trị của điện trở"
  },
  {
    "con": "Thành phần nào trong mạch ở hình 2 giữ vai trò hồi tiếp",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở tỉ lệ thuận với dòng điện chạy qua nó",
    "re": "Định luật Ohm được áp dụng"
  },
  {
    "con": "Tần số của dòng điện xoay chiều tăng",
    "re": "Điện trở của cuộn cảm sẽ tăng"
  },
  {
    "con": "Một mạch điện có điện trở và điện dung mắc nối tiếp",
    "re": "Thời gian đáp ứng của mạch sẽ bị ảnh hưởng bởi cả hai thành phần"
  },
  {
    "con": "Cường độ dòng điện trong mạch kín",
    "re": "Sẽ luôn tuân theo định luật Kirchhoff về dòng điện"
  },
  {
    "con": "Một mạch điện có điện trở mắc song song",
    "re": "Điện trở tương đương sẽ nhỏ hơn điện trở nhỏ nhất trong mạch"
  },
  {
    "con": "Điện áp trên một tụ điện tăng",
    "re": "Năng lượng lưu trữ trong tụ điện cũng sẽ tăng"
  },
  {
    "con": "Một cuộn cảm trong mạch điện xoay chiều",
    "re": "Sẽ tạo ra một độ lệch pha giữa điện áp và dòng điện"
  },
  {
    "con": "Khi nhiệt độ của một chất dẫn điện tăng",
    "re": "Điện trở của chất đó thường sẽ tăng"
  },
  {
    "con": "Một mạch điện có nguồn điện áp không đổi",
    "re": "Dòng điện sẽ ổn định nếu không có thay đổi về tải"
  },
  {
    "con": "Hệ số hồi tiếp K_{ht}=X_{ht}/X_{r} của mạch trong hình 2 được xác định có trị tuyệt đối là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện trở R của mạch điện được xác định bằng công thức R = V/I với V là điện áp và I là dòng điện thì",
    "re": "Điện trở R sẽ có đơn vị là Ohm"
  },
  {
    "con": "Nếu tần số f của sóng điện từ tăng lên thì",
    "re": "Chiều dài sóng λ sẽ giảm"
  },
  {
    "con": "Nếu một mạch điện có điện áp U và công suất P thì",
    "re": "Dòng điện I có thể tính bằng công thức I = P/U"
  },
  {
    "con": "Nếu một tụ điện có điện dung C và điện áp U thì",
    "re": "Năng lượng lưu trữ trong tụ điện W có thể tính bằng công thức W = 1/2 * C * U^2"
  },
  {
    "con": "Nếu một cuộn dây có độ tự cảm L và dòng điện I thay đổi theo thời gian thì",
    "re": "Điện áp cảm ứng E sẽ được tính bằng công thức E = -L * (dI/dt)"
  },
  {
    "con": "Nếu một mạch điện xoay chiều có tần số f và điện trở R thì",
    "re": "Điện trở tương đương Z sẽ được tính bằng công thức Z = R cho mạch thuần trở"
  },
  {
    "con": "Nếu một mạch điện có điện áp U và điện trở R thì",
    "re": "Công suất tiêu thụ P có thể tính bằng công thức P = U^2/R"
  },
  {
    "con": "Nếu một mạch điện có dòng điện I và điện áp U thì",
    "re": "Công suất P có thể tính bằng công thức P = U * I"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và công suất P thì",
    "re": "Điện áp U có thể tính bằng công thức U = √(P * R)"
  },
  {
    "con": "Mạch điện có điện trở R và nguồn điện áp V, thì dòng điện I chạy qua mạch được tính bằng công thức:",
    "re": "I = V / R"
  },
  {
    "con": "Khi tần số của tín hiệu tăng lên trong một mạch RLC, thì độ lớn của điện trở tương đương sẽ:",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một tụ điện được nạp điện với điện áp V và có điện dung C, thì năng lượng lưu trữ trong tụ điện là:",
    "re": "W = 0.5 * C * V^2"
  },
  {
    "con": "Khi một mạch điện có nhiều điện trở nối tiếp, thì điện trở tương đương R tổng sẽ:",
    "re": "bằng tổng các điện trở riêng lẻ"
  },
  {
    "con": "Nếu một cuộn dây có số vòng quấn N và dòng điện I chạy qua, thì từ thông Φ qua cuộn dây sẽ:",
    "re": "tăng lên khi N hoặc I tăng"
  },
  {
    "con": "Khi một mạch điện xoay chiều có tần số f, thì điện áp hiệu dụng U sẽ:",
    "re": "tăng lên khi tần số f tăng"
  },
  {
    "con": "Nếu một mạch điện có điện áp U và công suất P, thì dòng điện I sẽ được tính bằng công thức:",
    "re": "I = P / U"
  },
  {
    "con": "Khi một mạch điện có điện trở R và công suất P, thì điện áp U sẽ:",
    "re": "U = √(P * R)"
  },
  {
    "con": "Nếu một mạch điện có tụ điện và cuộn dây, thì hiện tượng cộng hưởng xảy ra khi:",
    "re": "tần số của nguồn điện bằng tần số tự nhiên của mạch"
  },
  {
    "con": "Khi một mạch điện có điện trở R và tụ điện C, thì thời gian hằng số τ sẽ:",
    "re": "τ = R * C"
  },
  {
    "con": "Thực chất của việc ổn định điểm làm việc của mạch khuếch đại dùng BJT là làm cho điểm làm việc không phụ thuộc vào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một tụ điện không thay đổi ngay lập tức khi có sự thay đổi về điện áp nguồn:",
    "re": "Điều này dẫn đến sự xuất hiện của dòng điện trong mạch."
  },
  {
    "con": "Khi tần số của tín hiệu tăng lên trong một mạch RLC, thì:",
    "re": "Độ cảm kháng của cuộn cảm sẽ tăng lên."
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn hơn, thì:",
    "re": "Dòng điện chạy qua mạch sẽ giảm."
  },
  {
    "con": "Khi một diode được phân cực thuận, thì:",
    "re": "Nó sẽ cho phép dòng điện chạy qua."
  },
  {
    "con": "Nếu một mạch điện có công suất tiêu thụ lớn hơn công suất cung cấp, thì:",
    "re": "Mạch sẽ không hoạt động ổn định và có thể gây hỏng hóc."
  },
  {
    "con": "Khi sử dụng biến áp, nếu số vòng dây ở cuộn sơ cấp nhiều hơn cuộn thứ cấp, thì:",
    "re": "Điện áp ở cuộn sơ cấp sẽ lớn hơn điện áp ở cuộn thứ cấp."
  },
  {
    "con": "Nếu một mạch điện có tụ điện và cuộn cảm mắc nối tiếp, thì:",
    "re": "Tần số cộng hưởng sẽ xảy ra khi cảm kháng và dung kháng bằng nhau."
  },
  {
    "con": "Khi một transistor hoạt động trong vùng khuếch đại, thì:",
    "re": "Nó sẽ cho phép tín hiệu đầu vào được khuếch đại ở đầu ra."
  },
  {
    "con": "Nếu điện áp trên một điện trở tăng lên, thì:",
    "re": "Dòng điện chạy qua điện trở cũng sẽ tăng lên theo định luật Ohm."
  },
  {
    "con": "β thay đổi",
    "re": "sự thiếu ổn định của điểm làm việc trong mạch khuếch đại dùng BJT sẽ tăng lên"
  },
  {
    "con": "tần số của tín hiệu đầu vào tăng",
    "re": "điện áp đầu ra của mạch khuếch đại sẽ bị suy giảm"
  },
  {
    "con": "điện trở tải giảm",
    "re": "công suất đầu ra của mạch khuếch đại sẽ tăng lên"
  },
  {
    "con": "nhiệt độ môi trường tăng",
    "re": "điện trở của các linh kiện bán dẫn sẽ giảm"
  },
  {
    "con": "tăng điện áp nguồn",
    "re": "cường độ dòng điện qua mạch sẽ tăng lên nếu điện trở không đổi"
  },
  {
    "con": "tần số dao động của mạch LC thay đổi",
    "re": "tần số cộng hưởng của mạch sẽ thay đổi theo"
  },
  {
    "con": "sử dụng tụ điện có điện dung lớn hơn",
    "re": "thời gian sạc và xả của mạch RC sẽ tăng lên"
  },
  {
    "con": "mạch có điện trở lớn hơn",
    "re": "cường độ dòng điện sẽ giảm theo định luật Ohm"
  },
  {
    "con": "tăng tần số trong mạch RLC",
    "re": "điện áp trên tụ điện sẽ thay đổi theo quy luật tần số"
  },
  {
    "con": "sử dụng transistor trong chế độ khuếch đại",
    "re": "tín hiệu đầu ra sẽ được khuếch đại so với tín hiệu đầu vào"
  },
  {
    "con": "Cấu hình Collector chung (CC) có đặc điểm:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở tỉ lệ thuận với dòng điện qua nó:",
    "re": "Định luật Ohm được áp dụng"
  },
  {
    "con": "Tần số của dòng điện xoay chiều tăng lên:",
    "re": "Điện trở của cuộn cảm sẽ tăng"
  },
  {
    "con": "Một mạch điện có điện trở và điện cảm nối tiếp:",
    "re": "Tổng trở sẽ lớn hơn tổng điện trở"
  },
  {
    "con": "Khi nhiệt độ của một chất dẫn điện tăng lên:",
    "re": "Điện trở của chất dẫn sẽ tăng"
  },
  {
    "con": "Một tụ điện được nạp đầy:",
    "re": "Nó sẽ không cho dòng điện đi qua nữa"
  },
  {
    "con": "Khi một mạch điện có điện áp không đổi và điện trở giảm:",
    "re": "Dòng điện trong mạch sẽ tăng"
  },
  {
    "con": "Một mạch điện có điện trở song song:",
    "re": "Tổng điện trở sẽ nhỏ hơn điện trở nhỏ nhất trong mạch"
  },
  {
    "con": "Khi một cuộn cảm được kết nối với nguồn điện xoay chiều:",
    "re": "Nó sẽ tạo ra một điện áp ngược pha với dòng điện"
  },
  {
    "con": "Một mạch điện có điện áp thay đổi theo thời gian:",
    "re": "Nó có thể được mô tả bằng phương trình vi phân"
  },
  {
    "con": "Hệ số khuếch đại điện áp của mạch Collector chung (CC):",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở trong mạch nối tiếp:",
    "re": "Tỉ lệ với dòng điện chạy qua nó"
  },
  {
    "con": "Công suất tiêu thụ của một thiết bị điện:",
    "re": "Bằng tích của điện áp và dòng điện chạy qua thiết bị đó"
  },
  {
    "con": "Trong mạch RLC nối tiếp, tần số cộng hưởng:",
    "re": "Xảy ra khi điện trở bằng 0"
  },
  {
    "con": "Nếu một cuộn dây có độ tự cảm lớn:",
    "re": "Thì nó sẽ có khả năng lưu trữ năng lượng từ trường cao"
  },
  {
    "con": "Khi điện áp tăng lên trong một mạch điện:",
    "re": "Dòng điện sẽ tăng lên nếu điện trở không đổi"
  },
  {
    "con": "Trong mạch điện xoay chiều, điện áp và dòng điện có thể lệch pha:",
    "re": "Gây ra sự thay đổi trong công suất thực và công suất phản kháng"
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn:",
    "re": "Thì dòng điện chạy qua mạch sẽ nhỏ"
  },
  {
    "con": "Khi sử dụng biến áp, nếu số vòng dây ở cuộn sơ cấp nhiều hơn cuộn thứ cấp:",
    "re": "Thì điện áp ở cuộn sơ cấp sẽ cao hơn điện áp ở cuộn thứ cấp"
  },
  {
    "con": "Trong một mạch điện, nếu điện áp giảm:",
    "re": "Thì công suất tiêu thụ sẽ giảm nếu điện trở không đổi"
  },
  {
    "con": "Loại mắc mạch BJT nào dùng cho khuếch đại công suất:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của một mạch khuếch đại vượt quá điện áp cho phép:",
    "re": "Mạch có thể bị hỏng hoặc hoạt động không ổn định"
  },
  {
    "con": "Tần số của tín hiệu AC tăng lên:",
    "re": "Trở kháng của tụ điện giảm"
  },
  {
    "con": "Sử dụng dây dẫn có tiết diện nhỏ hơn yêu cầu:",
    "re": "Dây dẫn có thể bị quá nhiệt và gây cháy"
  },
  {
    "con": "Mạch điện có điện trở lớn hơn điện trở tải:",
    "re": "Dòng điện qua mạch sẽ giảm"
  },
  {
    "con": "Sử dụng diode trong mạch chỉnh lưu:",
    "re": "Điện áp đầu ra sẽ có dạng một chiều"
  },
  {
    "con": "Tăng giá trị của điện trở trong mạch phân áp:",
    "re": "Điện áp tại đầu ra của mạch sẽ tăng"
  },
  {
    "con": "Sử dụng tụ điện trong mạch lọc:",
    "re": "Mạch sẽ loại bỏ các tần số không mong muốn"
  },
  {
    "con": "Mạch điện có nhiều nguồn điện song song:",
    "re": "Điện áp đầu ra sẽ bằng điện áp của nguồn có điện áp cao nhất"
  },
  {
    "con": "Tần số cộng hưởng của mạch RLC đạt được:",
    "re": "Mạch sẽ có trở kháng tối thiểu và dòng điện tối đa"
  },
  {
    "con": "Hệ số khuếch đại công suất được xác định theo công thức:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện trở của một dây dẫn tỉ lệ thuận với chiều dài và tỉ lệ nghịch với tiết diện của dây dẫn:",
    "re": "Điện trở sẽ tăng khi chiều dài dây dẫn tăng hoặc tiết diện giảm"
  },
  {
    "con": "Công suất tiêu thụ của một thiết bị điện được tính bằng tích của điện áp và dòng điện:",
    "re": "Công suất sẽ tăng nếu điện áp hoặc dòng điện tăng"
  },
  {
    "con": "Trong mạch điện xoay chiều, điện áp và dòng điện có thể lệch pha:",
    "re": "Công suất thực sẽ thấp hơn công suất biểu kiến"
  },
  {
    "con": "Khi điện áp tăng trong một mạch điện, nếu điện trở không đổi:",
    "re": "Dòng điện sẽ tăng theo định luật Ohm"
  },
  {
    "con": "Khi sử dụng tụ điện trong mạch điện xoay chiều:",
    "re": "Tụ điện sẽ tạo ra sự lệch pha giữa điện áp và dòng điện"
  },
  {
    "con": "Trong một mạch điện nối tiếp, tổng điện trở là tổng của các điện trở thành phần:",
    "re": "Điện áp trên mạch sẽ phân chia theo tỷ lệ điện trở"
  },
  {
    "con": "Khi một cuộn dây được đặt trong từ trường thay đổi:",
    "re": "Sẽ xuất hiện sức điện động cảm ứng theo định luật Faraday"
  },
  {
    "con": "Khi tần số của dòng điện xoay chiều tăng:",
    "re": "Điện trở của cuộn dây sẽ tăng do hiện tượng cảm ứng"
  },
  {
    "con": "Trong một mạch điện, nếu điện áp không đổi và điện trở giảm:",
    "re": "Dòng điện sẽ tăng lên theo định luật Ohm"
  },
  {
    "con": "Dòng điện chạy qua một điện trở",
    "re": "sẽ tạo ra một điện áp theo định luật Ohm"
  },
  {
    "con": "Một mạch điện kín",
    "re": "sẽ cho phép dòng điện chạy qua"
  },
  {
    "con": "Tần số của dòng điện xoay chiều",
    "re": "sẽ xác định tốc độ thay đổi của dòng điện"
  },
  {
    "con": "Điện áp tăng lên trong một mạch song song",
    "re": "sẽ làm giảm dòng điện qua các nhánh khác"
  },
  {
    "con": "Một tụ điện được nạp đầy",
    "re": "sẽ ngừng tích trữ điện năng"
  },
  {
    "con": "Một cuộn cảm trong mạch điện",
    "re": "sẽ tạo ra từ trường khi có dòng điện chạy qua"
  },
  {
    "con": "Điện trở của một vật liệu",
    "re": "sẽ phụ thuộc vào nhiệt độ và loại vật liệu"
  },
  {
    "con": "Mạch điện có điện trở lớn",
    "re": "sẽ tiêu thụ ít dòng điện hơn"
  },
  {
    "con": "Một nguồn điện áp ổn định",
    "re": "sẽ cung cấp điện áp không thay đổi cho mạch"
  },
  {
    "con": "Công suất tiêu thụ trong một mạch",
    "re": "sẽ bằng tích của điện áp và dòng điện"
  },
  {
    "con": "Hệ số khuếch đại dòng điện của mạch Base chung (BC):",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở trong mạch nối tiếp: ",
    "re": "Bằng dòng điện nhân với điện trở"
  },
  {
    "con": "Tần số của dòng điện xoay chiều: ",
    "re": "Tác động đến giá trị của điện trở và dung kháng"
  },
  {
    "con": "Khi điện áp tăng lên trong một mạch RLC: ",
    "re": "Dòng điện sẽ thay đổi theo quy luật Ohm"
  },
  {
    "con": "Nếu một cuộn dây được kết nối với nguồn điện xoay chiều: ",
    "re": "Nó sẽ tạo ra một từ trường biến thiên"
  },
  {
    "con": "Trong mạch điện một chiều, nếu điện trở tăng: ",
    "re": "Dòng điện sẽ giảm theo định luật Ohm"
  },
  {
    "con": "Khi một tụ điện được nạp điện: ",
    "re": "Nó sẽ lưu trữ năng lượng dưới dạng điện trường"
  },
  {
    "con": "Nếu một mạch điện có nhiều nhánh song song: ",
    "re": "Điện áp trên mỗi nhánh sẽ bằng nhau"
  },
  {
    "con": "Khi sử dụng biến áp: ",
    "re": "Tỉ lệ điện áp và số vòng dây sẽ tỷ lệ thuận"
  },
  {
    "con": "Nếu tần số của tín hiệu tăng: ",
    "re": "Độ lớn của dung kháng sẽ giảm"
  },
  {
    "con": "Cấu hình Emitter chung (EC) có đặc điểm:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở tỉ lệ thuận với dòng điện chạy qua nó theo định luật Ohm:",
    "re": "Điện áp bằng dòng điện nhân với điện trở"
  },
  {
    "con": "Một mạch điện có tổng trở Z và dòng điện I chạy qua:",
    "re": "Công suất tiêu thụ P bằng bình phương dòng điện nhân với tổng trở"
  },
  {
    "con": "Khi tần số của tín hiệu tăng lên trong một mạch RLC nối tiếp:",
    "re": "Điện trở tương đương của mạch sẽ thay đổi"
  },
  {
    "con": "Trong một mạch điện xoay chiều, nếu điện áp và dòng điện lệch pha 90 độ:",
    "re": "Công suất thực sẽ bằng 0"
  },
  {
    "con": "Khi sử dụng biến áp, nếu số vòng dây ở cuộn sơ cấp gấp đôi cuộn thứ cấp:",
    "re": "Điện áp ở cuộn sơ cấp sẽ gấp đôi điện áp ở cuộn thứ cấp"
  },
  {
    "con": "Khi một tụ điện được nạp điện, điện áp trên tụ sẽ tăng lên cho đến khi đạt giá trị tối đa:",
    "re": "Dòng điện sẽ giảm dần về 0"
  },
  {
    "con": "Trong một mạch điện, nếu điện trở tăng lên trong khi điện áp không đổi:",
    "re": "Dòng điện sẽ giảm xuống"
  },
  {
    "con": "Khi một động cơ điện hoạt động, nếu tải tăng lên:",
    "re": "Dòng điện tiêu thụ sẽ tăng lên"
  },
  {
    "con": "Khi một diode được phân cực thuận:",
    "re": "Nó sẽ dẫn điện và cho phép dòng điện chạy qua"
  },
  {
    "con": "Khi BJT mắc theo kiểu BC",
    "re": "mạch có khả năng cung cấp dòng điện lớn hơn dòng vào"
  },
  {
    "con": "Khi điện áp trên tụ điện đạt đến giá trị tối đa",
    "re": "tụ điện sẽ bắt đầu phóng điện"
  },
  {
    "con": "Khi sử dụng biến trở trong mạch điện",
    "re": "thay đổi điện trở sẽ làm thay đổi dòng điện chạy qua mạch"
  },
  {
    "con": "Khi tần số của tín hiệu tăng",
    "re": "điện trở của cuộn cảm sẽ tăng lên"
  },
  {
    "con": "Khi điện áp trên một điện trở tăng",
    "re": "dòng điện chạy qua điện trở cũng sẽ tăng theo định luật Ohm"
  },
  {
    "con": "Khi mắc các điện trở song song",
    "re": "điện trở tương đương sẽ nhỏ hơn điện trở nhỏ nhất trong mạch"
  },
  {
    "con": "Khi một mạch điện có điện áp xoay chiều",
    "re": "các thành phần tần số cao sẽ bị giảm thiểu bởi tụ điện"
  },
  {
    "con": "Khi sử dụng diode trong mạch chỉnh lưu",
    "re": "diode sẽ cho phép dòng điện chỉ chảy theo một chiều"
  },
  {
    "con": "Khi một mạch điện có cuộn cảm và tụ điện",
    "re": "mạch sẽ có hiện tượng cộng hưởng tại tần số nhất định"
  },
  {
    "con": "Khi điện áp trên một tụ điện giảm",
    "re": "năng lượng lưu trữ trong tụ điện cũng sẽ giảm"
  },
  {
    "con": "Khi BJT mắc theo kiểu CC",
    "re": "mạch có khả năng cung cấp dòng điện lớn hơn"
  },
  {
    "con": "Khi điện áp trên một tụ điện đạt đến giá trị tối đa",
    "re": "tụ điện sẽ không còn tích điện thêm"
  },
  {
    "con": "Khi một mạch điện có điện trở lớn",
    "re": "dòng điện chạy qua mạch sẽ nhỏ"
  },
  {
    "con": "Khi tần số của tín hiệu tăng",
    "re": "điện trở của tụ điện sẽ giảm"
  },
  {
    "con": "Khi sử dụng biến áp với tỷ số cuộn dây 1:2",
    "re": "điện áp đầu ra sẽ gấp đôi điện áp đầu vào"
  },
  {
    "con": "Khi một diode được mắc ngược",
    "re": "nó sẽ không cho dòng điện chạy qua"
  },
  {
    "con": "Khi mạch điện có nhiều nhánh song song",
    "re": "điện áp trên mỗi nhánh sẽ bằng nhau"
  },
  {
    "con": "Khi điện áp AC được chỉnh lưu",
    "re": "nó sẽ trở thành điện áp DC"
  },
  {
    "con": "Khi một mạch điện có tụ điện và điện trở mắc nối tiếp",
    "re": "tần số cắt sẽ phụ thuộc vào giá trị của tụ điện và điện trở"
  },
  {
    "con": "Khi một mạch điện có điện trở và cuộn cảm mắc nối tiếp",
    "re": "mạch sẽ có độ tự cảm ảnh hưởng đến dòng điện"
  },
  {
    "con": "Khi BJT mắc theo kiểu EC",
    "re": "mạch có khả năng cung cấp dòng điện lớn hơn dòng vào"
  },
  {
    "con": "Khi điện áp trên một tụ điện tăng",
    "re": "năng lượng lưu trữ trong tụ điện cũng tăng"
  },
  {
    "con": "Khi sử dụng biến trở trong mạch điện",
    "re": "có thể điều chỉnh điện trở và do đó điều chỉnh dòng điện"
  },
  {
    "con": "Khi tần số của tín hiệu tăng",
    "re": "điện trở của cuộn cảm sẽ tăng theo"
  },
  {
    "con": "Khi mạch điện có nhiều nhánh song song",
    "re": "điện áp trên mỗi nhánh sẽ bằng nhau"
  },
  {
    "con": "Khi điện áp nguồn tăng",
    "re": "công suất tiêu thụ của tải cũng sẽ tăng nếu điện trở không đổi"
  },
  {
    "con": "Khi sử dụng diode trong mạch chỉnh lưu",
    "re": "điện áp đầu ra sẽ luôn thấp hơn điện áp đầu vào"
  },
  {
    "con": "Khi mạch điện có tụ điện và cuộn cảm",
    "re": "mạch sẽ có hiện tượng cộng hưởng tại tần số nhất định"
  },
  {
    "con": "Khi sử dụng transistor trong mạch khuếch đại",
    "re": "tín hiệu đầu ra sẽ được khuếch đại theo tỷ lệ nhất định"
  },
  {
    "con": "Khi điện trở của một dây dẫn tăng",
    "re": "dòng điện chạy qua dây dẫn sẽ giảm nếu điện áp không đổi"
  },
  {
    "con": "Các tụ C1, C2 trong hình 2 có nhiệm vụ gì:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở tỉ lệ thuận với dòng điện chạy qua nó:",
    "re": "Định luật Ohm được áp dụng"
  },
  {
    "con": "Một mạch điện có tổng trở Z lớn hơn 0:",
    "re": "Mạch điện đó có thể có dòng điện chạy qua"
  },
  {
    "con": "Khi tần số của dòng điện xoay chiều tăng:",
    "re": "Điện trở của cuộn cảm sẽ tăng"
  },
  {
    "con": "Khi điện áp tăng trong một mạch điện kín:",
    "re": "Dòng điện chạy qua mạch cũng sẽ tăng theo"
  },
  {
    "con": "Một tụ điện được nạp đầy:",
    "re": "Nó sẽ không cho dòng điện chạy qua nữa"
  },
  {
    "con": "Khi một điện trở được nối song song với một tụ điện:",
    "re": "Tụ điện sẽ làm giảm tổng trở của mạch"
  },
  {
    "con": "Khi một cuộn cảm được nối vào mạch điện xoay chiều:",
    "re": "Nó sẽ tạo ra một độ lệch pha giữa điện áp và dòng điện"
  },
  {
    "con": "Khi sử dụng biến áp để giảm điện áp:",
    "re": "Dòng điện sẽ tăng lên nếu công suất được giữ nguyên"
  },
  {
    "con": "Khi một mạch điện có điện trở lớn hơn 0:",
    "re": "Nó sẽ tiêu thụ công suất điện"
  },
  {
    "con": "mạch điện có điện trở R và nguồn điện V được kết nối song song:",
    "re": "cường độ dòng điện tổng sẽ lớn hơn cường độ dòng điện qua từng nhánh"
  },
  {
    "con": "một cuộn dây có số vòng quấn N và dòng điện I chạy qua:",
    "re": "sẽ tạo ra từ trường mạnh hơn khi N và I tăng"
  },
  {
    "con": "tần số của dòng điện xoay chiều tăng:",
    "re": "thì điện trở của mạch RLC sẽ thay đổi do ảnh hưởng của điện trở cảm kháng và điện trở dung kháng"
  },
  {
    "con": "một tụ điện có điện dung C và điện áp U:",
    "re": "thì năng lượng lưu trữ trong tụ điện sẽ được tính bằng công thức W = 0.5 * C * U^2"
  },
  {
    "con": "một mạch điện có điện trở R và công suất P:",
    "re": "thì điện áp U sẽ được tính bằng công thức U = √(P * R)"
  },
  {
    "con": "một động cơ điện hoạt động ở chế độ không tải:",
    "re": "thì công suất tiêu thụ sẽ thấp hơn so với khi động cơ hoạt động ở tải tối đa"
  },
  {
    "con": "một mạch điện có điện trở R và dòng điện I:",
    "re": "thì điện áp U sẽ được tính bằng định luật Ohm: U = R * I"
  },
  {
    "con": "một máy biến áp có tỉ số cuộn dây n:",
    "re": "thì điện áp đầu ra sẽ tỉ lệ thuận với điện áp đầu vào theo tỉ số n"
  },
  {
    "con": "một mạch điện có điện trở R và tụ điện C mắc nối tiếp:",
    "re": "thì tần số cắt sẽ giảm khi giá trị R hoặc C tăng"
  },
  {
    "con": "một mạch điện có nhiều nguồn điện song song:",
    "re": "thì điện áp đầu ra sẽ bằng điện áp của nguồn có điện áp cao nhất"
  },
  {
    "con": "Tụ CE trong hình 5 có nhiệm vụ gì:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở tỉ lệ thuận với dòng điện chạy qua nó:",
    "re": "Định luật Ohm được áp dụng"
  },
  {
    "con": "Một mạch điện có tổng trở bằng 0:",
    "re": "Dòng điện sẽ không bị giới hạn"
  },
  {
    "con": "Tần số của dòng điện xoay chiều tăng:",
    "re": "Điện áp hiệu dụng sẽ tăng nếu điện trở không đổi"
  },
  {
    "con": "Một cuộn dây có dòng điện thay đổi nhanh:",
    "re": "Sẽ tạo ra điện áp cảm ứng theo định luật Faraday"
  },
  {
    "con": "Một mạch điện có điện trở lớn hơn điện trở của tải:",
    "re": "Dòng điện sẽ giảm xuống"
  },
  {
    "con": "Khi nhiệt độ của một chất dẫn điện tăng:",
    "re": "Điện trở của chất đó thường sẽ tăng"
  },
  {
    "con": "Một tụ điện được nạp đầy:",
    "re": "Sẽ không cho dòng điện chạy qua"
  },
  {
    "con": "Khi một mạch điện có điện áp không đổi và điện trở giảm:",
    "re": "Dòng điện sẽ tăng lên"
  },
  {
    "con": "Một máy phát điện hoạt động theo nguyên lý cảm ứng điện từ:",
    "re": "Sẽ tạo ra điện năng từ cơ năng"
  },
  {
    "con": "Phương pháp bù nhiệt để ổn định điểm làm việc trong các sơ đồ ổn định phi tuyến, người ta có thể dùng Diode và transistor (cùng loại bán dẫn) để bù nhiệt cho nhau vì:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp đầu vào của một mạch khuếch đại vượt quá ngưỡng cho phép, mạch sẽ bị méo tín hiệu vì:",
    "re": "Điện áp đầu ra không còn tỷ lệ với điện áp đầu vào"
  },
  {
    "con": "Nếu sử dụng dây dẫn có tiết diện nhỏ cho một dòng điện lớn, dây dẫn sẽ nóng lên vì:",
    "re": "Điện trở của dây dẫn gây ra tổn thất năng lượng dưới dạng nhiệt"
  },
  {
    "con": "Khi tần số của tín hiệu tăng lên, khả năng truyền tải của cáp đồng giảm vì:",
    "re": "Hiện tượng suy hao tín hiệu tăng lên do điện dung và điện cảm của cáp"
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn, dòng điện sẽ nhỏ hơn vì:",
    "re": "Theo định luật Ohm, dòng điện tỉ lệ nghịch với điện trở"
  },
  {
    "con": "Khi sử dụng tụ điện trong mạch AC, tụ điện sẽ cản trở dòng điện vì:",
    "re": "Tụ điện có điện trở tương đương với tần số của tín hiệu"
  },
  {
    "con": "Nếu một động cơ điện không được cấp đủ điện áp, động cơ sẽ không hoạt động hiệu quả vì:",
    "re": "Mô men xoắn của động cơ phụ thuộc vào điện áp cung cấp"
  },
  {
    "con": "Khi sử dụng biến áp, nếu số vòng dây ở cuộn sơ cấp lớn hơn cuộn thứ cấp, điện áp đầu ra sẽ thấp hơn điện áp đầu vào vì:",
    "re": "Biến áp hoạt động theo nguyên tắc tỷ lệ số vòng dây"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện song song, điện áp đầu ra sẽ bằng điện áp của nguồn có điện áp cao nhất vì:",
    "re": "Các nguồn điện song song chia sẻ tải nhưng không thay đổi điện áp"
  },
  {
    "con": "Khi sử dụng transistor trong chế độ khuếch đại, nếu không có điện trở tải, transistor sẽ không khuếch đại tín hiệu vì:",
    "re": "Không có tải để tạo ra sự khác biệt điện áp cần thiết cho khuếch đại"
  },
  {
    "con": "Thành phần nào đóng vai trò hồi tiếp đối với tín hiệu một chiều trong mạch ở hình 6:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạch điện có điện trở R và nguồn điện V thì dòng điện I sẽ được tính bằng công thức Ohm:",
    "re": "I = V/R"
  },
  {
    "con": "Nếu tần số của tín hiệu tăng lên trong mạch RLC thì độ lợi của mạch sẽ thay đổi:",
    "re": "Độ lợi có thể tăng hoặc giảm tùy thuộc vào cấu hình mạch"
  },
  {
    "con": "Khi điện áp trên một tụ điện tăng lên thì điện tích trên tụ điện cũng sẽ tăng:",
    "re": "Điện tích Q = C * V"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở nối tiếp thì điện trở tương đương sẽ là tổng của các điện trở:",
    "re": "R_total = R1 + R2 + ... + Rn"
  },
  {
    "con": "Trong một mạch điện xoay chiều, nếu điện áp và dòng điện lệch pha 90 độ thì công suất thực sẽ bằng 0:",
    "re": "Công suất thực P = V * I * cos(φ)"
  },
  {
    "con": "Nếu một cuộn dây có số vòng quấn tăng lên thì cảm kháng của cuộn dây sẽ tăng:",
    "re": "Cảm kháng X_L = 2πfL"
  },
  {
    "con": "Khi một diode được phân cực thuận thì nó sẽ dẫn điện:",
    "re": "Điện áp trên diode sẽ giảm xuống gần bằng 0.7V cho silicon"
  },
  {
    "con": "Nếu tần số của tín hiệu trong mạch LC bằng tần số cộng hưởng thì điện áp sẽ đạt giá trị cực đại:",
    "re": "Điện áp tại tần số cộng hưởng là tối đa"
  },
  {
    "con": "Nếu một mạch điện có điện trở và tụ điện nối tiếp thì thời gian để tụ điện sạc đầy sẽ phụ thuộc vào điện trở và điện dung:",
    "re": "Thời gian sạc T = R * C"
  },
  {
    "con": "Khi vẽ sơ đồ tương đương đối với tín hiệu xoay chiều của mạch khuếch tín hiệu nhỏ dùng transistor, ta thực hiện:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi sử dụng định luật Ohm để tính toán dòng điện trong mạch, ta áp dụng:",
    "re": "Dòng điện bằng điện áp chia cho điện trở"
  },
  {
    "con": "Khi thiết kế mạch điện, nếu cần giảm điện áp, ta sử dụng:",
    "re": "Biến áp giảm áp"
  },
  {
    "con": "Khi phân tích mạch điện một chiều, nếu có nhiều nguồn điện, ta áp dụng:",
    "re": "Nguyên lý chồng chất"
  },
  {
    "con": "Khi tính toán công suất tiêu thụ trong mạch điện, nếu biết điện áp và dòng điện, ta sử dụng:",
    "re": "Công suất bằng điện áp nhân với dòng điện"
  },
  {
    "con": "Khi thiết kế mạch điều khiển, nếu cần sử dụng cảm biến, ta chọn:",
    "re": "Cảm biến phù hợp với loại tín hiệu cần đo"
  },
  {
    "con": "Khi phân tích mạch xoay chiều, nếu cần tính toán pha, ta sử dụng:",
    "re": "Phương pháp số phức"
  },
  {
    "con": "Khi lắp đặt hệ thống điện, nếu cần đảm bảo an toàn, ta phải:",
    "re": "Sử dụng cầu chì và thiết bị bảo vệ"
  },
  {
    "con": "Khi thiết kế mạch điện tử, nếu cần khuếch đại tín hiệu, ta sử dụng:",
    "re": "Mạch khuếch đại"
  },
  {
    "con": "Khi kiểm tra mạch điện, nếu phát hiện có dòng rò, ta cần:",
    "re": "Kiểm tra cách điện và các kết nối"
  },
  {
    "con": "Ở chế độ tĩnh, V_{C} của mạch ở hình 7 được xác định theo công thức:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp trên một tụ điện tăng lên, dòng điện qua tụ điện sẽ giảm xuống.",
    "re": "Điều này tuân theo định luật Kirchhoff về điện áp."
  },
  {
    "con": "Nếu một mạch điện có điện trở R và dòng điện I, thì công suất tiêu thụ P được tính bằng công thức P = I^2 * R.",
    "re": "Công suất tiêu thụ sẽ tăng khi dòng điện tăng."
  },
  {
    "con": "Khi tần số của tín hiệu AC tăng, điện trở của cuộn cảm sẽ tăng theo công thức X_L = 2πfL.",
    "re": "Điều này dẫn đến giảm dòng điện trong mạch."
  },
  {
    "con": "Nếu một mạch điện có nhiều nhánh song song, điện áp trên mỗi nhánh sẽ bằng nhau.",
    "re": "Dòng điện sẽ phân chia theo tỷ lệ điện trở của từng nhánh."
  },
  {
    "con": "Khi một diode được phân cực thuận, nó sẽ dẫn điện.",
    "re": "Điều này cho phép dòng điện chảy qua diode."
  },
  {
    "con": "Nếu điện áp đầu vào của một bộ khuếch đại vượt quá mức cho phép, bộ khuếch đại sẽ bị bão hòa.",
    "re": "Kết quả là tín hiệu đầu ra sẽ không còn chính xác."
  },
  {
    "con": "Khi một tụ điện được sạc đầy, điện áp trên tụ sẽ bằng điện áp nguồn.",
    "re": "Dòng điện qua tụ sẽ ngừng lại."
  },
  {
    "con": "Nếu một mạch điện có điện trở R và điện áp V, thì dòng điện I được tính bằng công thức I = V/R.",
    "re": "Dòng điện sẽ tăng khi điện áp tăng hoặc điện trở giảm."
  },
  {
    "con": "Khi một cuộn cảm được kết nối với nguồn điện DC, nó sẽ tạo ra một dòng điện tăng dần.",
    "re": "Điều này xảy ra do hiện tượng tự cảm."
  },
  {
    "con": "Xác định chế độ tĩnh của mạch ở hình 7 với R_{B}=470K\\Omega , R_{c}=2.2K \\Omega , R_{E}=2.2K\\Omega , V_{CC}=20V và \\Beta=100.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sử dụng định luật Ohm để tính điện áp trên một điện trở R khi dòng điện I chạy qua nó.",
    "re": "Điện áp U = I * R"
  },
  {
    "con": "Áp dụng định luật Kirchhoff cho mạch điện kín với nhiều nhánh.",
    "re": "Tổng dòng vào một nút bằng tổng dòng ra khỏi nút đó."
  },
  {
    "con": "Tính công suất tiêu thụ của một điện trở R khi có điện áp U áp dụng.",
    "re": "Công suất P = U^2 / R"
  },
  {
    "con": "Sử dụng công thức tính điện dung C của tụ điện trong mạch AC.",
    "re": "C = I / (2 * π * f * U)"
  },
  {
    "con": "Xác định tần số tự nhiên của mạch RLC nối tiếp.",
    "re": "Tần số f_0 = 1 / (2 * π * √(L * C))"
  },
  {
    "con": "Áp dụng định luật Faraday về cảm ứng điện từ trong cuộn dây.",
    "re": "Điện áp cảm ứng U = -L * (dI/dt)"
  },
  {
    "con": "Tính toán điện trở tương đương của hai điện trở R1 và R2 mắc nối tiếp.",
    "re": "R_eq = R1 + R2"
  },
  {
    "con": "Sử dụng định luật Joule để tính nhiệt lượng sinh ra trong một điện trở.",
    "re": "Nhiệt lượng Q = I^2 * R * t"
  },
  {
    "con": "Xác định mối quan hệ giữa điện áp, dòng điện và điện trở trong mạch điện.",
    "re": "U = I * R"
  },
  {
    "con": "Giá trị của r_{e} của mạch ở hình 7 là: với các thông số giống như trên (RB=470K\\Omega , Rc=2.2K\\Omega , RE=2.2K\\Omega , VCC=20V và \\beta=100):",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp đầu vào của mạch khuếch đại thấp hơn điện áp ngưỡng của transistor:",
    "re": "Transistor sẽ không dẫn điện"
  },
  {
    "con": "Nếu tần số của tín hiệu đầu vào vượt quá tần số cắt của bộ lọc:",
    "re": "Tín hiệu đầu ra sẽ giảm mạnh"
  },
  {
    "con": "Nếu điện trở tải của mạch thấp hơn điện trở nguồn:",
    "re": "Mạch sẽ tiêu thụ nhiều dòng điện hơn"
  },
  {
    "con": "Nếu điện áp trên tụ điện đạt đến giá trị tối đa cho phép:",
    "re": "Tụ điện có thể bị hỏng hoặc nổ"
  },
  {
    "con": "Nếu giá trị của điện trở trong mạch song song giảm:",
    "re": "Dòng điện tổng sẽ tăng lên"
  },
  {
    "con": "Nếu tần số của sóng điện từ tăng:",
    "re": "Chiều dài sóng sẽ giảm"
  },
  {
    "con": "Nếu điện áp đầu vào của bộ chuyển đổi DC-DC là ổn định:",
    "re": "Điện áp đầu ra sẽ cũng ổn định"
  },
  {
    "con": "Nếu mạch có nhiều nhánh song song và một nhánh bị ngắt:",
    "re": "Dòng điện sẽ chuyển sang các nhánh còn lại"
  },
  {
    "con": "Nếu điện áp trên một điện trở trong mạch RLC đạt đến giá trị tối đa:",
    "re": "Mạch sẽ xảy ra hiện tượng cộng hưởng"
  },
  {
    "con": "Theo sơ đồ tương đương của mạch khuếch đại hình 7, trở kháng vào của mạch là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp trên một tụ điện tăng lên, thì dòng điện qua tụ điện sẽ:",
    "re": "giảm xuống"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và nguồn điện áp V, thì dòng điện I chảy qua mạch là:",
    "re": "I = V/R"
  },
  {
    "con": "Nếu tần số của tín hiệu tăng lên trong một mạch LC, thì độ lợi của mạch sẽ:",
    "re": "giảm xuống"
  },
  {
    "con": "Nếu một cuộn dây có số vòng quấn tăng lên, thì cảm kháng của cuộn dây sẽ:",
    "re": "tăng lên"
  },
  {
    "con": "Nếu điện áp trên một điện trở giảm xuống, thì công suất tiêu thụ trên điện trở sẽ:",
    "re": "giảm xuống"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở nối tiếp, thì điện trở tương đương của mạch là:",
    "re": "tổng của các điện trở"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở song song, thì điện trở tương đương của mạch là:",
    "re": "nhỏ hơn điện trở nhỏ nhất trong mạch"
  },
  {
    "con": "Nếu tần số của nguồn điện thay đổi, thì điện áp hiệu dụng của mạch RLC sẽ:",
    "re": "thay đổi theo tần số"
  },
  {
    "con": "Nếu một mạch điện có điện áp xoay chiều, thì dòng điện sẽ:",
    "re": "có pha lệch so với điện áp"
  },
  {
    "con": "Trở kháng ra của mạch khuếch đại dùng transistor được xác định khi:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở trong mạch nối tiếp được tính bằng cách chia điện áp nguồn cho tổng trở của mạch:",
    "re": "Điện áp trên điện trở đó"
  },
  {
    "con": "Công suất tiêu thụ của một thiết bị điện được tính bằng tích của điện áp và dòng điện qua thiết bị đó:",
    "re": "Công suất tiêu thụ"
  },
  {
    "con": "Nếu tần số của tín hiệu tăng lên trong một mạch LC, thì:",
    "re": "Độ lợi của mạch sẽ giảm"
  },
  {
    "con": "Trong một mạch RLC, nếu điện trở R tăng lên, thì:",
    "re": "Độ Q của mạch sẽ giảm"
  },
  {
    "con": "Nếu điện áp đầu vào của một bộ khuếch đại vượt quá mức cho phép, thì:",
    "re": "Bộ khuếch đại có thể bị hỏng"
  },
  {
    "con": "Khi một cuộn dây được kết nối với nguồn điện xoay chiều, thì:",
    "re": "Cuộn dây sẽ tạo ra một từ trường biến đổi"
  },
  {
    "con": "Nếu điện trở của một mạch song song giảm xuống, thì:",
    "re": "Dòng điện tổng trong mạch sẽ tăng lên"
  },
  {
    "con": "Khi một tụ điện được nạp điện, thì:",
    "re": "Điện áp trên tụ điện sẽ tăng lên cho đến khi đạt giá trị tối đa"
  },
  {
    "con": "Nếu tần số của nguồn điện xoay chiều thay đổi, thì:",
    "re": "Điện áp và dòng điện sẽ có pha khác nhau"
  },
  {
    "con": "Theo sơ đồ tương đương của mạch khuếch đại hình 7, trở kháng RA của mạch là: (nếu giả thiết rce vô cùng lớn)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp trên một tụ điện tăng lên, thì dòng điện qua tụ điện sẽ giảm xuống",
    "re": "Điều này đúng theo định luật Kirchhoff về điện áp"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và nguồn điện áp V, thì dòng điện I chạy qua mạch được tính bằng công thức I = V/R",
    "re": "Đây là định luật Ohm"
  },
  {
    "con": "Khi tần số của tín hiệu tăng lên trong một mạch RLC, thì trở kháng của cuộn cảm sẽ tăng lên",
    "re": "Điều này đúng theo công thức Z_L = jωL"
  },
  {
    "con": "Nếu một mạch điện có nhiều nhánh song song, thì điện áp trên mỗi nhánh là như nhau",
    "re": "Đây là quy tắc của mạch song song"
  },
  {
    "con": "Khi một cuộn dây được đặt trong từ trường biến thiên, thì sẽ xuất hiện điện áp cảm ứng trong cuộn dây đó",
    "re": "Đây là định luật Faraday về cảm ứng điện từ"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và công suất P, thì điện áp U được tính bằng công thức U = √(P*R)",
    "re": "Đây là mối quan hệ giữa công suất, điện trở và điện áp"
  },
  {
    "con": "Khi một diode được phân cực thuận, thì nó sẽ dẫn điện",
    "re": "Điều này đúng với nguyên lý hoạt động của diode"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và dòng điện I, thì công suất tiêu thụ P được tính bằng công thức P = I^2 * R",
    "re": "Đây là công thức tính công suất trong mạch điện"
  },
  {
    "con": "Khi một mạch điện có tụ điện và cuộn cảm, thì tần số cộng hưởng được xác định bởi công thức f_0 = 1/(2π√(LC))",
    "re": "Đây là công thức tần số cộng hưởng trong mạch RLC"
  },
  {
    "con": "Hệ số khuếch đại điện áp của mạch khuếch đại hình 7 được xác định có trị tuyệt đối: với R_{E}>>r_{e}",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại không vượt quá điện áp nguồn",
    "re": "Mạch hoạt động bình thường"
  },
  {
    "con": "Tần số của tín hiệu đầu vào nằm trong dải tần số cho phép của bộ lọc",
    "re": "Bộ lọc hoạt động hiệu quả"
  },
  {
    "con": "Điện trở tải lớn hơn điện trở nguồn trong mạch phân áp",
    "re": "Điện áp đầu ra ổn định"
  },
  {
    "con": "Dòng điện qua một cuộn cảm không thay đổi đột ngột",
    "re": "Từ trường trong cuộn cảm duy trì ổn định"
  },
  {
    "con": "Tần số của sóng điện từ nằm trong dải tần số của anten",
    "re": "Anten phát hoặc thu sóng hiệu quả"
  },
  {
    "con": "Điện áp trên tụ điện đạt đến giá trị tối đa",
    "re": "Tụ điện được sạc đầy"
  },
  {
    "con": "Mạch điện có điện trở tương đương thấp hơn điện trở của từng phần tử",
    "re": "Dòng điện trong mạch tăng lên"
  },
  {
    "con": "Tần số dao động của mạch LC được tính toán chính xác",
    "re": "Mạch dao động hoạt động tại tần số mong muốn"
  },
  {
    "con": "Điện áp đầu vào của bộ chuyển đổi ADC nằm trong khoảng cho phép",
    "re": "Kết quả chuyển đổi chính xác"
  },
  {
    "con": "Mạch khuếch đại ở hình 7 với các thông số cho ở trên (R_{B}=470K\\Omega, R_{c}=2.2K\\omega, R_{E}=2.2K\\omega, V_{CC}=20V và \\Beta=100) có trở kháng vào là: Nếu giả thiết bỏ qua r_{e}",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở trong mạch nối tiếp là: Nếu tổng điện áp nguồn là 12V và điện trở là 4Ω và 8Ω",
    "re": "Điện áp trên 4Ω là 4V và trên 8Ω là 8V"
  },
  {
    "con": "Mạch điện xoay chiều có tần số 50Hz và điện trở 10Ω: Nếu điện áp hiệu dụng là 220V",
    "re": "Dòng điện hiệu dụng là 22A"
  },
  {
    "con": "Mạch RLC nối tiếp có R=10Ω, L=0.1H, C=100μF: Nếu tần số dao động là 50Hz",
    "re": "Tần số cộng hưởng là 31.83Hz"
  },
  {
    "con": "Một tụ điện có điện dung 10μF và điện áp 12V: Nếu tụ điện được nạp đầy",
    "re": "Năng lượng lưu trữ trong tụ điện là 0.72mJ"
  },
  {
    "con": "Mạch điện một chiều với nguồn điện 9V và điện trở 3Ω: Nếu sử dụng định luật Ohm",
    "re": "Dòng điện chạy qua mạch là 3A"
  },
  {
    "con": "Mạch điện có hai điện trở R1=5Ω và R2=10Ω nối song song: Nếu điện áp nguồn là 15V",
    "re": "Dòng điện tổng qua mạch là 3A"
  },
  {
    "con": "Một động cơ điện có công suất 1500W và điện áp 230V: Nếu hiệu suất của động cơ là 85%",
    "re": "Dòng điện tiêu thụ là 9.8A"
  },
  {
    "con": "Mạch điện có điện trở 20Ω và công suất 100W: Nếu sử dụng công thức P=U^2/R",
    "re": "Điện áp là 44.72V"
  },
  {
    "con": "Một mạch điện có tần số 60Hz và điện trở 50Ω: Nếu sử dụng công thức Z=R cho mạch thuần trở",
    "re": "Trở kháng Z là 50Ω"
  },
  {
    "con": "Mạch khuếch đại ở hình 7 với các thông số cho ở trên (R_{B}=470K\\Omega, R_{c}=2.2K\\omega, R_{E}=2.2K\\omega, V_{CC}=20V và \\Beta=100) có trở kháng ra là: nếu giả thiết r_{ce} vô cùng lớn",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại không đổi và tần số tín hiệu thấp hơn tần số cắt của mạch",
    "re": "Mạch hoạt động trong chế độ tuyến tính"
  },
  {
    "con": "Tần số của tín hiệu đầu vào tăng lên và trở kháng của tụ điện giảm",
    "re": "Dòng điện qua tụ điện tăng lên"
  },
  {
    "con": "Mạch điện có điện trở R và điện áp U, nếu R tăng lên",
    "re": "Dòng điện I sẽ giảm theo định luật Ohm"
  },
  {
    "con": "Một cuộn dây có cảm kháng L và tần số f, nếu tần số f giảm",
    "re": "Cảm kháng L sẽ giảm"
  },
  {
    "con": "Một mạch điện xoay chiều với điện áp U và tần số f, nếu điện áp U tăng",
    "re": "Công suất tiêu thụ trong mạch sẽ tăng"
  },
  {
    "con": "Một mạch điện có RLC nối tiếp, nếu điện trở R tăng",
    "re": "Q sẽ giảm và mạch sẽ tiêu tán năng lượng nhiều hơn"
  },
  {
    "con": "Một transistor hoạt động trong vùng bão hòa, nếu điện áp V_{CE} giảm xuống",
    "re": "Transistor sẽ chuyển sang vùng cắt"
  },
  {
    "con": "Một mạch điện có nguồn điện DC, nếu điện áp nguồn tăng",
    "re": "Dòng điện trong mạch sẽ tăng theo định luật Ohm"
  },
  {
    "con": "Một tụ điện được nạp điện với điện áp U, nếu điện dung C tăng",
    "re": "Năng lượng lưu trữ trong tụ điện sẽ tăng"
  },
  {
    "con": "Mạch khuếch đại ở hình 7 với các thông số cho ở trên (R_{B}=470K\\Omega, R_{c}=2.2K\\omega, R_{E}=2.2K\\omega, V_{CC}=20V và \\Beta=100) có trị tuyệt đối của hệ số khuếch đại điện áp là: với R_{E}>>r_{e}",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại không vượt quá điện áp nguồn cung cấp",
    "re": "Mạch hoạt động bình thường"
  },
  {
    "con": "Nếu điện trở tải của mạch thấp hơn điện trở nội của nguồn điện",
    "re": "Mạch sẽ bị giảm hiệu suất"
  },
  {
    "con": "Khi tần số tín hiệu đầu vào tăng lên trong mạch RC",
    "re": "Điện áp ra sẽ giảm do hiện tượng suy giảm tần số"
  },
  {
    "con": "Nếu điện áp trên tụ điện vượt quá điện áp định mức của nó",
    "re": "Tụ điện có thể bị hỏng hoặc nổ"
  },
  {
    "con": "Khi sử dụng transistor trong chế độ khuếch đại",
    "re": "Cần đảm bảo rằng transistor hoạt động trong vùng tuyến tính"
  },
  {
    "con": "Nếu dòng điện qua một điện trở tăng lên",
    "re": "Điện áp rơi trên điện trở cũng sẽ tăng theo định luật Ohm"
  },
  {
    "con": "Khi mạch điện có nhiều nguồn điện song song",
    "re": "Điện áp đầu ra sẽ bằng điện áp của nguồn có điện áp cao nhất"
  },
  {
    "con": "Nếu tần số của tín hiệu đầu vào vượt quá tần số cắt của bộ lọc",
    "re": "Tín hiệu đầu ra sẽ bị suy giảm đáng kể"
  },
  {
    "con": "Khi sử dụng mạch điều chỉnh điện áp với IC",
    "re": "Cần đảm bảo rằng IC không bị quá nhiệt trong quá trình hoạt động"
  },
  {
    "con": "Mạch khuếch đại ở hình 7 với các thông số cho ở trên (R_{B}=470K\\Omega, R_{c}=2.2K\\omega, R_{E}=2.2K\\omega, V_{CC}=20V và \\Beta=100) có hệ số khuếch đại dòng điện xấp xỉ (với R_{E}>>r_{e}):",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại nhỏ hơn điện áp ngưỡng: ",
    "re": "Mạch không hoạt động"
  },
  {
    "con": "Tần số của tín hiệu đầu vào vượt quá tần số cắt của mạch lọc: ",
    "re": "Tín hiệu đầu ra sẽ giảm đáng kể"
  },
  {
    "con": "Điện trở tải lớn hơn điện trở nguồn trong mạch điện: ",
    "re": "Công suất tiêu thụ sẽ giảm"
  },
  {
    "con": "Dòng điện qua một cuộn dây tăng lên: ",
    "re": "Từ trường xung quanh cuộn dây sẽ mạnh lên"
  },
  {
    "con": "Điện áp trên tụ điện đạt đến giá trị tối đa: ",
    "re": "Tụ điện sẽ bắt đầu xả điện"
  },
  {
    "con": "Mạch điện có điện trở tương đương thấp hơn 1 ohm: ",
    "re": "Dòng điện sẽ rất lớn khi có điện áp áp dụng"
  },
  {
    "con": "Tần số của nguồn điện không khớp với tần số của tải: ",
    "re": "Mạch sẽ không hoạt động hiệu quả"
  },
  {
    "con": "Điện áp trên một điện trở tăng lên: ",
    "re": "Dòng điện qua điện trở đó cũng sẽ tăng lên theo định luật Ohm"
  },
  {
    "con": "Mạch điện có các thành phần không đồng bộ: ",
    "re": "Có thể xảy ra hiện tượng nhiễu và mất tín hiệu"
  },
  {
    "con": "Mạch khuếch đại ở hình 7 với các thông số cho ở trên (R_{B}=470K\\Omega, R_{c}=2.2K\\omega, R_{E}=2.2K\\omega, V_{CC}=20V và \\Beta=100) có hệ số khuếch đại công suất (với R_{E}>>r_{e}):",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại nhỏ hơn điện áp ngưỡng: ",
    "re": "Mạch không hoạt động"
  },
  {
    "con": "Tần số của tín hiệu đầu vào vượt quá tần số cắt của mạch lọc: ",
    "re": "Tín hiệu đầu ra sẽ bị suy giảm"
  },
  {
    "con": "Điện trở tải (R_{L}) giảm xuống dưới giá trị tối ưu: ",
    "re": "Hiệu suất của mạch sẽ giảm"
  },
  {
    "con": "Dòng điện qua một cuộn dây tăng lên: ",
    "re": "Từ trường xung quanh cuộn dây sẽ mạnh hơn"
  },
  {
    "con": "Điện áp trên tụ điện đạt đến giá trị tối đa: ",
    "re": "Tụ điện sẽ bắt đầu phóng điện"
  },
  {
    "con": "Mạch điện có điện trở tương đương thấp hơn điện áp nguồn: ",
    "re": "Dòng điện sẽ tăng lên theo định luật Ohm"
  },
  {
    "con": "Tần số của nguồn điện thay đổi: ",
    "re": "Điện áp đầu ra của mạch sẽ thay đổi theo"
  },
  {
    "con": "Mạch điện có điện trở nối tiếp: ",
    "re": "Tổng điện trở sẽ bằng tổng các điện trở"
  },
  {
    "con": "Mạch điện có điện trở song song: ",
    "re": "Tổng điện trở sẽ nhỏ hơn điện trở nhỏ nhất trong mạch"
  },
  {
    "con": "Theo sơ đồ tương đương của mạch khuếch đại hình 5, trở kháng vào của mạch là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp đầu vào của một mạch RLC song song tăng lên, dòng điện qua mạch sẽ:",
    "re": "Tăng lên"
  },
  {
    "con": "Nếu tần số của tín hiệu đầu vào vượt quá tần số cắt của bộ lọc thông thấp, thì tín hiệu đầu ra sẽ:",
    "re": "Giảm xuống"
  },
  {
    "con": "Khi một cuộn dây được kết nối với nguồn điện xoay chiều, từ trường xung quanh cuộn dây sẽ:",
    "re": "Thay đổi theo thời gian"
  },
  {
    "con": "Nếu điện trở của một mạch giảm xuống trong khi điện áp không đổi, thì dòng điện qua mạch sẽ:",
    "re": "Tăng lên theo định luật Ohm"
  },
  {
    "con": "Khi một tụ điện được nạp đầy, dòng điện qua tụ sẽ:",
    "re": "Ngừng lại"
  },
  {
    "con": "Nếu một mạch điện có nhiều nhánh song song, thì điện áp trên mỗi nhánh sẽ:",
    "re": "Bằng nhau"
  },
  {
    "con": "Khi một transistor hoạt động trong vùng bão hòa, nó sẽ:",
    "re": "Hành động như một công tắc đóng"
  },
  {
    "con": "Nếu tần số của tín hiệu đầu vào trong một mạch cộng hưởng đạt đến tần số cộng hưởng, thì trở kháng của mạch sẽ:",
    "re": "Đạt giá trị tối thiểu"
  },
  {
    "con": "Khi một mạch điện có điện trở lớn hơn, thì công suất tiêu thụ sẽ:",
    "re": "Giảm xuống nếu điện áp không đổi"
  },
  {
    "con": "Theo sơ đồ tương đương của mạch khuếch đại hình 5, trở kháng RA của mạch là: (nếu giả thiết r_{ce} vô cùng lớn)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp đầu vào của một mạch khuếch đại vượt quá ngưỡng bão hòa,",
    "re": "mạch sẽ không còn khuếch đại tín hiệu đầu vào nữa"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và điện áp U,",
    "re": "thì dòng điện I chạy qua mạch được tính bằng công thức I = U/R"
  },
  {
    "con": "Khi tần số của tín hiệu đầu vào tăng lên trong một mạch RC,",
    "re": "thì trở kháng của tụ điện sẽ giảm"
  },
  {
    "con": "Nếu một cuộn dây có số vòng quấn N và dòng điện I chạy qua,",
    "re": "thì từ thông Φ trong cuộn dây sẽ tỷ lệ thuận với N và I"
  },
  {
    "con": "Khi một mạch điện xoay chiều có điện trở R và công suất P,",
    "re": "thì dòng điện hiệu dụng I được tính bằng công thức I = √(P/R)"
  },
  {
    "con": "Nếu một mạch điện có điện áp U và công suất P,",
    "re": "thì điện trở R của mạch được tính bằng R = U^2/P"
  },
  {
    "con": "Khi một tụ điện được nạp điện,",
    "re": "thì điện áp trên tụ điện sẽ tăng dần cho đến khi đạt giá trị tối đa"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện song song,",
    "re": "thì điện áp trên mỗi nguồn sẽ bằng nhau"
  },
  {
    "con": "Khi một mạch điện có điện trở R và công suất tiêu thụ P,",
    "re": "thì điện năng tiêu thụ trong một khoảng thời gian t được tính bằng W = P * t"
  },
  {
    "con": "Hệ số khuếch đại điện áp của mạch khuếch đại hình 5 được xác định có trị tuyệt đối: \n(với r_{ce} vô cùng lớn)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại vượt quá mức cho phép",
    "re": "Mạch có thể bị hư hỏng hoặc không hoạt động đúng"
  },
  {
    "con": "Tần số của tín hiệu đầu vào nằm trong dải tần số hoạt động của bộ lọc",
    "re": "Bộ lọc sẽ cho phép tín hiệu đi qua mà không bị suy giảm"
  },
  {
    "con": "Điện trở tải của mạch bằng với điện trở nguồn",
    "re": "Mạch sẽ hoạt động với hiệu suất tối ưu"
  },
  {
    "con": "Dòng điện qua một cuộn dây thay đổi nhanh chóng",
    "re": "Sẽ tạo ra một điện áp cảm ứng theo định luật Faraday"
  },
  {
    "con": "Tần số của nguồn điện xoay chiều là 50Hz",
    "re": "Điện áp sẽ dao động với chu kỳ 20ms"
  },
  {
    "con": "Điện áp trên hai đầu tụ điện đạt đến giá trị tối đa",
    "re": "Tụ điện sẽ bắt đầu phóng điện nếu có mạch kín"
  },
  {
    "con": "Mạch điện có điện trở và cảm kháng bằng nhau",
    "re": "Mạch sẽ có pha điện áp và dòng điện lệch nhau 45 độ"
  },
  {
    "con": "Tất cả các thành phần trong mạch điện đều hoạt động bình thường",
    "re": "Mạch sẽ hoạt động ổn định và không có hiện tượng quá tải"
  },
  {
    "con": "Điện áp trên một điện trở là 0V",
    "re": "Dòng điện qua điện trở đó sẽ bằng 0A"
  },
  {
    "con": "Xác định chế độ tĩnh của mạch khuếch đại ở hình 5 với  (R_{B}=470K\\Omega, R_{c}=2.2K\\omega, R_{E}=2.2K\\omega, V_{CC}=20V và \\Beta=100)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sử dụng định luật Ohm để tính điện áp trên một điện trở R khi dòng điện I chạy qua nó",
    "re": "Điện áp U = I * R"
  },
  {
    "con": "Áp dụng định luật Kirchhoff cho mạch điện kín với nhiều nhánh",
    "re": "Tổng dòng vào một nút bằng tổng dòng ra khỏi nút"
  },
  {
    "con": "Tính công suất tiêu thụ của một thiết bị điện với điện áp U và dòng điện I",
    "re": "Công suất P = U * I"
  },
  {
    "con": "Sử dụng công thức tính điện trở tương đương của các điện trở mắc nối tiếp",
    "re": "Điện trở tương đương R_{eq} = R_1 + R_2 + ... + R_n"
  },
  {
    "con": "Sử dụng công thức tính điện trở tương đương của các điện trở mắc song song",
    "re": "1/R_{eq} = 1/R_1 + 1/R_2 + ... + 1/R_n"
  },
  {
    "con": "Xác định tần số của một mạch LC với L là độ tự cảm và C là điện dung",
    "re": "Tần số f = 1/(2π√(LC))"
  },
  {
    "con": "Tính điện áp đầu ra của một mạch khuếch đại với hệ số khuếch đại A và điện áp đầu vào V_in",
    "re": "Điện áp đầu ra V_out = A * V_in"
  },
  {
    "con": "Sử dụng định luật Faraday để tính điện áp cảm ứng trong một cuộn dây",
    "re": "Điện áp cảm ứng E = -dΦ/dt"
  },
  {
    "con": "Áp dụng định luật Joule để tính nhiệt lượng sinh ra trong một điện trở",
    "re": "Nhiệt lượng Q = I^2 * R * t"
  },
  {
    "con": "Mạch khuếch đại ở hình 5 với các thông số cho ở trên (R_{B}=470K\\Omega, R_{c}=2.2K\\omega, R_{E}=2.2K\\omega, V_{CC}=20V và \\Beta=100) có trở kháng vào xấp xỉ bằng (Nếu giả thiết R_{B}>>\\beta r_{e})",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại nhỏ hơn điện áp ngưỡng thì mạch không hoạt động",
    "re": "Mạch không khuếch đại tín hiệu"
  },
  {
    "con": "Nếu tần số của tín hiệu đầu vào vượt quá tần số cắt của bộ lọc thì tín hiệu đầu ra sẽ giảm mạnh",
    "re": "Bộ lọc không cho phép tín hiệu đi qua"
  },
  {
    "con": "Nếu điện trở tải giảm xuống dưới giá trị nhất định thì công suất tiêu thụ của mạch sẽ tăng lên",
    "re": "Mạch có thể bị quá tải"
  },
  {
    "con": "Nếu điện áp nguồn cung cấp cho mạch tăng lên quá mức cho phép thì linh kiện trong mạch có thể bị hỏng",
    "re": "Mạch không hoạt động ổn định"
  },
  {
    "con": "Nếu tần số của dòng điện xoay chiều thay đổi thì giá trị hiệu dụng của dòng điện cũng sẽ thay đổi",
    "re": "Công suất tiêu thụ sẽ thay đổi theo"
  },
  {
    "con": "Nếu sử dụng tụ điện có điện dung lớn hơn yêu cầu trong mạch lọc thì tần số cắt sẽ giảm",
    "re": "Mạch lọc sẽ hoạt động ở tần số thấp hơn"
  },
  {
    "con": "Nếu điện trở trong của nguồn điện thấp hơn điện trở tải thì dòng điện sẽ tăng lên",
    "re": "Công suất tiêu thụ sẽ tăng lên"
  },
  {
    "con": "Nếu mạch điện có nhiều nhánh song song thì tổng trở của mạch sẽ giảm",
    "re": "Dòng điện tổng sẽ tăng lên"
  },
  {
    "con": "Nếu sử dụng transistor trong chế độ khuếch đại thì điện áp đầu ra sẽ tỷ lệ thuận với điện áp đầu vào",
    "re": "Mạch sẽ khuếch đại tín hiệu"
  },
  {
    "con": "Mạch khuếch đại ở hình 5 với các thông số cho ở trên (R_{B}=470K\\Omega, R_{c}=2.2K\\omega, R_{E}=2.2K\\omega, V_{CC}=20V và \\Beta=100) có trở kháng ra xấp xỉ bằng (giả thiết r_{ce} =50K\\Omega)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại không vượt quá điện áp nguồn",
    "re": "Mạch hoạt động ổn định"
  },
  {
    "con": "Tần số tín hiệu đầu vào nằm trong dải tần số cho phép của mạch lọc",
    "re": "Mạch lọc hoạt động hiệu quả"
  },
  {
    "con": "Điện trở tải lớn hơn điện trở nội của nguồn điện",
    "re": "Công suất tiêu thụ tối ưu"
  },
  {
    "con": "Dòng điện qua một cuộn dây không vượt quá giá trị định mức",
    "re": "Cuộn dây không bị quá nhiệt"
  },
  {
    "con": "Tần số hoạt động của mạch dao động nằm trong giới hạn thiết kế",
    "re": "Mạch dao động phát tín hiệu ổn định"
  },
  {
    "con": "Điện áp trên tụ điện không vượt quá điện áp định mức của nó",
    "re": "Tụ điện không bị hỏng"
  },
  {
    "con": "Mạch điện có các thành phần được kết nối đúng cách theo sơ đồ",
    "re": "Mạch hoạt động như mong đợi"
  },
  {
    "con": "Tất cả các linh kiện trong mạch đều có thông số kỹ thuật tương thích",
    "re": "Mạch hoạt động hiệu quả và an toàn"
  },
  {
    "con": "Nhiệt độ môi trường không vượt quá giới hạn cho phép của linh kiện",
    "re": "Linh kiện hoạt động bền bỉ và ổn định"
  },
  {
    "con": "Mạch khuếch đại ở hình 5 với các thông số cho ở trên (R_{B}=470K\\Omega, R_{c}=2.2K\\omega, R_{E}=2.2K\\omega, V_{CC}=20V và \\Beta=100) có trị tuyệt đối của hệ số khuếch đại điện áp là: (nếu r_{ce} vô cùng lớn)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại nhỏ hơn điện áp ngưỡng của transistor",
    "re": "Transistor sẽ không dẫn điện"
  },
  {
    "con": "Mạch điện có điện trở tương đương R_{eq} được tính bằng công thức 1/R_{eq} = 1/R_{1} + 1/R_{2} (với R_{1} và R_{2} mắc song song)",
    "re": "Giá trị R_{eq} sẽ nhỏ hơn cả R_{1} và R_{2}"
  },
  {
    "con": "Tần số của tín hiệu đầu vào vượt quá tần số cắt của bộ lọc thông thấp",
    "re": "Tín hiệu đầu ra sẽ giảm mạnh"
  },
  {
    "con": "Mạch điện có điện áp nguồn V_{s} và điện trở tải R_{L} mắc nối tiếp",
    "re": "Điện áp trên R_{L} sẽ bằng V_{s} nhân với tỉ lệ R_{L}/(R_{L} + R_{T})"
  },
  {
    "con": "Dòng điện trong mạch điện một chiều (DC) có điện trở R và điện áp V",
    "re": "Dòng điện I sẽ được tính bằng công thức I = V/R"
  },
  {
    "con": "Mạch điện có tụ điện C và điện trở R mắc song song",
    "re": "Thời gian hằng định của mạch sẽ được tính bằng τ = R * C"
  },
  {
    "con": "Mạch điện có điện áp xoay chiều (AC) với tần số f và điện trở R",
    "re": "Điện trở tương đương sẽ được tính bằng Z = R cho trường hợp không có tụ điện hoặc cuộn cảm"
  },
  {
    "con": "Mạch điện có cuộn cảm L và điện trở R mắc nối tiếp",
    "re": "Trở kháng của mạch sẽ được tính bằng Z = R + jωL"
  },
  {
    "con": "Mạch điện có điện áp nguồn V_{s} và điện trở R_{L} mắc song song",
    "re": "Điện áp trên R_{L} sẽ bằng V_{s} cho trường hợp không có điện trở khác mắc song song"
  },
  {
    "con": "Mạch khuếch đại ở hình 5 với các thông số cho ở trên (R_{B}=470K\\Omega, R_{c}=2.2K\\omega, R_{E}=2.2K\\omega, V_{CC}=20V và \\Beta=100) có hệ số khuếch đại dòng điện xấp xỉ (nếu r_{ce} vô cùng lớn, R_{B}>>\\beta r_{e}):",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở trong mạch nối tiếp bằng tổng điện áp nguồn và điện trở đó có giá trị dương:",
    "re": "Điện áp trên điện trở sẽ được phân chia theo tỷ lệ với giá trị của nó"
  },
  {
    "con": "Nếu một tụ điện được nạp đầy và sau đó được ngắt kết nối khỏi nguồn điện:",
    "re": "Tụ điện sẽ giữ lại điện tích và điện áp cho đến khi nó được giải phóng"
  },
  {
    "con": "Trong một mạch RLC, nếu tần số của nguồn điện bằng tần số riêng của mạch:",
    "re": "Mạch sẽ xảy ra hiện tượng cộng hưởng, dẫn đến dòng điện lớn nhất"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và dòng điện I chạy qua nó:",
    "re": "Điện áp trên mạch sẽ được tính bằng định luật Ohm: V = I * R"
  },
  {
    "con": "Nếu một cuộn dây có số vòng quấn N và dòng điện I chạy qua nó:",
    "re": "Cuộn dây sẽ tạo ra một từ trường với cường độ tỷ lệ với N và I"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và công suất P tiêu thụ:",
    "re": "Điện áp trên mạch sẽ được tính bằng công thức: V = √(P * R)"
  },
  {
    "con": "Nếu một diode được mắc theo chiều thuận trong mạch điện:",
    "re": "Diode sẽ dẫn điện và cho phép dòng điện chạy qua"
  },
  {
    "con": "Nếu một transistor được sử dụng trong chế độ khuếch đại:",
    "re": "Transistor sẽ khuếch đại tín hiệu đầu vào theo tỷ lệ nhất định"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện song song:",
    "re": "Điện áp trên các nguồn sẽ bằng nhau, nhưng dòng điện sẽ được chia theo tỷ lệ điện trở"
  },
  {
    "con": "Xác định chế độ tĩnh của mạch khuếch đại ở hình 4 với R_{B}=470K\\Omega, R_{c}=2.2K\\omega, V_{CC}=20V và \\Beta=100",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sử dụng định luật Ohm để tính toán dòng điện trong mạch với điện áp 12V và điện trở 4Ω",
    "re": "Dòng điện là 3A"
  },
  {
    "con": "Áp dụng định luật Kirchhoff cho mạch điện có hai nhánh với dòng vào 5A và dòng ra 3A và 2A",
    "re": "Dòng vào bằng dòng ra"
  },
  {
    "con": "Tính công suất tiêu thụ của một điện trở 10Ω khi có dòng điện 2A chạy qua",
    "re": "Công suất là 40W"
  },
  {
    "con": "Sử dụng công thức tính điện dung để xác định điện dung của tụ điện trong mạch với tần số 50Hz và trở kháng 100Ω",
    "re": "Điện dung là 31.83μF"
  },
  {
    "con": "Phân tích mạch RLC với R=100Ω, L=0.1H và C=100μF tại tần số 1000Hz",
    "re": "Mạch có tính chất cộng hưởng"
  },
  {
    "con": "Tính điện áp đầu ra của mạch khuếch đại với điện áp đầu vào 1V và hệ số khuếch đại 10",
    "re": "Điện áp đầu ra là 10V"
  },
  {
    "con": "Xác định tần số tự nhiên của mạch LC với L=0.01H và C=100μF",
    "re": "Tần số tự nhiên là 159.15Hz"
  },
  {
    "con": "Sử dụng định luật Faraday để tính toán điện áp cảm ứng trong cuộn dây với 100 vòng và từ thông thay đổi 0.5Wb",
    "re": "Điện áp cảm ứng là 50V"
  },
  {
    "con": "Tính toán điện trở tương đương của hai điện trở 4Ω và 6Ω mắc nối tiếp",
    "re": "Điện trở tương đương là 10Ω"
  },
  {
    "con": "Theo sơ đồ tương đương của mạch khuếch đại hình 4, trở kháng vào của mạch là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp trên một tụ điện tăng lên, thì dòng điện qua tụ điện sẽ:",
    "re": "Giảm xuống"
  },
  {
    "con": "Nếu tần số của tín hiệu AC tăng lên, thì trở kháng của cuộn cảm sẽ:",
    "re": "Tăng lên"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và nguồn điện áp V, thì dòng điện I chạy qua mạch sẽ:",
    "re": "Được tính bằng định luật Ohm là I = V/R"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở nối tiếp, thì tổng điện trở R tổng sẽ:",
    "re": "Bằng tổng các điện trở riêng lẻ"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở song song, thì tổng điện trở R tổng sẽ:",
    "re": "Bằng nghịch đảo của tổng các nghịch đảo của điện trở riêng lẻ"
  },
  {
    "con": "Nếu một cuộn cảm được kết nối với nguồn điện DC, thì sau một thời gian ngắn, dòng điện qua cuộn cảm sẽ:",
    "re": "Đạt đến giá trị tối đa và ổn định"
  },
  {
    "con": "Nếu điện áp trên một điện trở tăng lên, thì công suất tiêu thụ P sẽ:",
    "re": "Tăng lên theo công thức P = V^2/R"
  },
  {
    "con": "Nếu một mạch điện có điện áp xoay chiều, thì điện áp hiệu dụng sẽ:",
    "re": "Bằng điện áp đỉnh chia cho căn bậc hai của 2"
  },
  {
    "con": "Nếu tần số của một mạch LC thay đổi, thì tần số cộng hưởng f sẽ:",
    "re": "Thay đổi theo công thức f = 1/(2π√(LC))"
  },
  {
    "con": "Theo sơ đồ tương đương của mạch khuếch đại hình 4, trở kháng RA của mạch là: (nếu giả thiết r_{ce} vô cùng lớn)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp đầu vào của mạch RLC là một sóng sin, thì điện áp đầu ra sẽ có dạng sóng sin với độ lệch pha phụ thuộc vào tần số.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một cuộn dây có điện trở R và độ tự cảm L, thì tần số tự nhiên của mạch LC là f = 1/(2π√(LC)).",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và nguồn điện áp V, thì dòng điện chạy qua mạch được tính bằng định luật Ohm: I = V/R.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một transistor hoạt động trong vùng khuếch đại, thì dòng điện ra sẽ tỷ lệ thuận với dòng điện vào theo hệ số khuếch đại β.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện xoay chiều có tần số f, thì điện trở tương đương của mạch sẽ bao gồm cả điện trở thuần và điện trở phản kháng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tụ điện được nạp điện với điện áp V, thì năng lượng lưu trữ trong tụ điện được tính bằng công thức W = 1/2 CV^2.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện, thì điện áp tổng của mạch sẽ là tổng đại số của các điện áp nguồn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một động cơ điện hoạt động ở chế độ không tải, thì dòng điện tiêu thụ sẽ thấp hơn nhiều so với chế độ tải.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có điện trở R1 và R2 mắc nối tiếp, thì điện trở tương đương R = R1 + R2.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hệ số khuếch đại điện áp của mạch khuếch đại hình 4 được xác định có trị tuyệt đối:  (với r_{ce} vô cùng lớn)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại vượt quá mức cho phép",
    "re": "Mạch có thể bị hư hỏng hoặc không hoạt động đúng"
  },
  {
    "con": "Tần số của tín hiệu đầu vào nằm trong dải tần số hoạt động của bộ lọc",
    "re": "Bộ lọc sẽ cho phép tín hiệu đi qua mà không bị suy giảm"
  },
  {
    "con": "Điện trở tải của mạch bằng với điện trở nguồn",
    "re": "Mạch sẽ hoạt động với hiệu suất tối ưu"
  },
  {
    "con": "Dòng điện qua một cuộn dây thay đổi nhanh chóng",
    "re": "Sẽ tạo ra một điện áp cảm ứng theo định luật Faraday"
  },
  {
    "con": "Tần số của dòng điện xoay chiều là 50Hz",
    "re": "Điện áp sẽ thay đổi theo hình sin với chu kỳ 20ms"
  },
  {
    "con": "Điện áp giữa hai đầu tụ điện đạt đến giá trị tối đa",
    "re": "Tụ điện sẽ bắt đầu phóng điện nếu có mạch kín"
  },
  {
    "con": "Mạch điện có điện trở và cảm kháng bằng nhau",
    "re": "Mạch sẽ có pha điện áp và dòng điện lệch nhau 45 độ"
  },
  {
    "con": "Công suất tiêu thụ của một thiết bị điện là 1000W",
    "re": "Thiết bị sẽ tiêu thụ 1000J năng lượng trong 1 giây"
  },
  {
    "con": "Điện áp đầu vào của bộ chuyển đổi DC-DC là 12V",
    "re": "Bộ chuyển đổi có thể cung cấp điện áp đầu ra khác nhau tùy thuộc vào cấu hình"
  },
  {
    "con": "Mạch khuếch đại ở hình 4 với các thông số cho ở trên R_{B}=470K\\Omega, R_{c}=2.2K\\omega, V_{CC}=20V và \\Beta=100 có trở kháng vào xấp xỉ bằng (Nếu giả thiết R_{B}>>\\beta r_{e})",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở trong mạch nối tiếp bằng tổng điện áp nguồn (Nếu các điện trở được nối tiếp)",
    "re": "Điện áp trên mỗi điện trở sẽ tỉ lệ thuận với giá trị của nó"
  },
  {
    "con": "Công suất tiêu thụ của một điện trở bằng bình phương điện áp qua nó chia cho giá trị điện trở (Nếu áp dụng định luật Ohm)",
    "re": "Công suất sẽ được tính chính xác"
  },
  {
    "con": "Tần số của dòng điện xoay chiều sẽ ảnh hưởng đến giá trị của điện trở tương đương (Nếu có sự hiện diện của tụ điện và cuộn cảm trong mạch)",
    "re": "Điện trở tương đương sẽ thay đổi theo tần số"
  },
  {
    "con": "Mạch điện có điện trở tương đương thấp hơn sẽ cho dòng điện lớn hơn (Nếu điện áp không đổi)",
    "re": "Dòng điện sẽ tăng lên"
  },
  {
    "con": "Khi một tụ điện được sạc đầy, dòng điện qua nó sẽ bằng 0 (Nếu tụ điện đạt đến điện áp nguồn)",
    "re": "Tụ điện sẽ không còn tích trữ năng lượng"
  },
  {
    "con": "Mạch điện có cuộn cảm sẽ tạo ra điện áp ngược khi dòng điện thay đổi (Nếu có sự thay đổi đột ngột trong dòng điện)",
    "re": "Điện áp ngược sẽ bảo vệ mạch khỏi sự thay đổi đột ngột"
  },
  {
    "con": "Nếu điện áp trên một mạch song song bằng nhau, thì dòng điện sẽ phân chia theo tỷ lệ nghịch với điện trở (Nếu các điện trở khác nhau)",
    "re": "Dòng điện sẽ được phân chia chính xác"
  },
  {
    "con": "Khi sử dụng transistor trong chế độ khuếch đại, dòng điện vào sẽ điều khiển dòng điện ra (Nếu transistor hoạt động trong vùng tuyến tính)",
    "re": "Dòng điện ra sẽ tỉ lệ thuận với dòng điện vào"
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn hơn, thì công suất tiêu thụ sẽ giảm (Nếu điện áp không đổi)",
    "re": "Công suất sẽ giảm theo tỷ lệ với điện trở"
  },
  {
    "con": "Mạch khuếch đại ở hình 4 với các thông số cho ở trên R_{B}=470K\\Omega, R_{c}=2.2K\\omega, V_{CC}=20V và \\Beta=100 có trở kháng ra xấp xỉ bằng (giả thiết r_{ce} vô cùng lớn)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở trong mạch nối tiếp bằng tổng điện áp nguồn",
    "re": "Điện áp trên mỗi điện trở sẽ tỉ lệ thuận với giá trị của nó"
  },
  {
    "con": "Trong một mạch RLC nối tiếp, tần số cộng hưởng xảy ra khi cảm kháng bằng dung kháng",
    "re": "Tại tần số cộng hưởng, mạch sẽ có trở kháng tối thiểu và dòng điện tối đa"
  },
  {
    "con": "Khi một mạch điện có điện trở R và nguồn điện áp V, nếu điện trở tăng lên gấp đôi",
    "re": "Dòng điện trong mạch sẽ giảm xuống một nửa theo định luật Ohm"
  },
  {
    "con": "Nếu một tụ điện được nạp đầy và sau đó được ngắt kết nối khỏi nguồn điện",
    "re": "Nó sẽ giữ lại điện tích và điện áp cho đến khi được nối lại với một mạch"
  },
  {
    "con": "Trong một mạch điện xoay chiều, nếu tần số tăng lên",
    "re": "Điện trở của cuộn cảm sẽ tăng lên, trong khi điện trở của tụ điện sẽ giảm xuống"
  },
  {
    "con": "Khi một transistor được sử dụng trong chế độ khuếch đại, nếu điện áp đầu vào tăng lên",
    "re": "Điện áp đầu ra sẽ tăng lên theo tỷ lệ khuếch đại của transistor"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện song song",
    "re": "Điện áp trên mỗi nguồn sẽ bằng nhau, nhưng dòng điện sẽ chia theo tỷ lệ điện trở"
  },
  {
    "con": "Khi một diode được kết nối ngược chiều trong mạch",
    "re": "Nó sẽ không cho dòng điện chạy qua, trừ khi điện áp ngược vượt quá điện áp đổ vỡ"
  },
  {
    "con": "Nếu một mạch điện có điện trở R1 và R2 nối song song",
    "re": "Tổng trở của mạch sẽ nhỏ hơn cả hai điện trở R1 và R2"
  },
  {
    "con": "Mạch khuếch đại ở hình 4 với các thông số cho ở trên R_{B}=470K\\Omega, R_{c}=2.2K\\omega, V_{CC}=20V và \\Beta=100 có trị tuyệt đối của hệ số khuếch đại điện áp là: (nếu r_{ce} vô cùng lớn)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại không vượt quá điện áp nguồn cung cấp",
    "re": "Mạch hoạt động ổn định"
  },
  {
    "con": "Nếu điện trở tải R_{L} nhỏ hơn điện trở nội của nguồn điện",
    "re": "Mạch sẽ tiêu tán công suất lớn và có thể gây hư hỏng"
  },
  {
    "con": "Nếu tần số của tín hiệu đầu vào vượt quá tần số cắt của mạch lọc",
    "re": "Tín hiệu đầu ra sẽ giảm đáng kể"
  },
  {
    "con": "Nếu điện áp trên tụ điện vượt quá điện áp định mức của nó",
    "re": "Tụ điện có thể bị hỏng hoặc nổ"
  },
  {
    "con": "Nếu dòng điện qua một cuộn dây thay đổi nhanh chóng",
    "re": "Sẽ xuất hiện điện áp cảm ứng ngược lại theo định luật Faraday"
  },
  {
    "con": "Nếu mạch điện có nhiều nhánh song song",
    "re": "Dòng điện sẽ phân chia theo tỷ lệ nghịch với điện trở của mỗi nhánh"
  },
  {
    "con": "Nếu điện áp trên một điện trở là không đổi",
    "re": "Dòng điện qua điện trở đó sẽ tỷ lệ thuận với giá trị của điện trở theo định luật Ohm"
  },
  {
    "con": "Nếu tần số của dòng điện xoay chiều tăng lên",
    "re": "Điện trở của mạch sẽ thay đổi do hiện tượng cảm kháng"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và công suất P được cung cấp",
    "re": "Điện áp trên mạch sẽ được tính bằng công thức V = √(P * R)"
  },
  {
    "con": "Mạch khuếch đại ở hình 4 với các thông số cho ở trên R_{B}=470K\\Omega, R_{c}=2.2K\\omega, V_{CC}=20V và \\Beta=100 có hệ số khuếch đại dòng điện xấp xỉ (nếu r_{ce} vô cùng lớn, R_{B}>>\\beta r_{e}):",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại nhỏ hơn điện áp ngưỡng của transistor:",
    "re": "Transistor sẽ không dẫn điện"
  },
  {
    "con": "Tần số của tín hiệu đầu vào vượt quá tần số cắt của mạch lọc:",
    "re": "Tín hiệu đầu ra sẽ bị suy giảm đáng kể"
  },
  {
    "con": "Điện trở tải của mạch khuếch đại thấp hơn điện trở đầu ra của transistor:",
    "re": "Hệ số khuếch đại sẽ giảm"
  },
  {
    "con": "Dòng điện qua một cuộn dây tăng lên nhanh chóng:",
    "re": "Điện áp trên cuộn dây sẽ tăng lên theo quy luật Lenz"
  },
  {
    "con": "Tần số của nguồn điện xoay chiều thay đổi:",
    "re": "Điện trở tương đối của mạch sẽ thay đổi theo"
  },
  {
    "con": "Mạch điện có điện trở và tụ điện mắc nối tiếp:",
    "re": "Thời gian đáp ứng của mạch sẽ phụ thuộc vào giá trị của điện trở và tụ điện"
  },
  {
    "con": "Điện áp trên một tụ điện đạt đến giá trị tối đa:",
    "re": "Dòng điện qua tụ điện sẽ bằng 0"
  },
  {
    "con": "Mạch điện có nhiều nguồn điện mắc song song:",
    "re": "Điện áp trên mỗi nhánh sẽ bằng nhau"
  },
  {
    "con": "Tần số của tín hiệu đầu vào trong mạch dao động vượt quá tần số cộng hưởng:",
    "re": "Mạch sẽ không hoạt động hiệu quả"
  },
  {
    "con": "Cho mạch khuếch đại ở hình 14, xác định chế độ tĩnh của mạch với R_{1}=56K\\omega, R_{2}=39K\\omega, R_{c}=1K\\omega, R_{E}=600\\omega, V_{CC}=9V và \\beta=100",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạch điện có điện trở R và nguồn điện áp V, nếu R tăng thì dòng điện I sẽ giảm",
    "re": "Theo định luật Ohm, I = V/R"
  },
  {
    "con": "Trong mạch RLC nối tiếp, nếu tần số f tăng thì độ lợi của mạch sẽ thay đổi",
    "re": "Độ lợi đạt cực đại tại tần số cộng hưởng"
  },
  {
    "con": "Khi sử dụng transistor trong chế độ khuếch đại, nếu điện áp vào tăng thì điện áp ra cũng sẽ tăng",
    "re": "Đây là nguyên lý hoạt động của transistor khuếch đại"
  },
  {
    "con": "Nếu một cuộn dây có số vòng quấn N và dòng điện I chạy qua, thì từ thông Φ sẽ tỷ lệ thuận với N và I",
    "re": "Φ = L * I, với L là độ tự cảm của cuộn dây"
  },
  {
    "con": "Trong mạch điện xoay chiều, nếu điện trở R và điện kháng Xc bằng nhau thì mạch sẽ ở trạng thái cộng hưởng",
    "re": "Dòng điện sẽ đạt giá trị cực đại"
  },
  {
    "con": "Nếu một mạch điện có điện áp AC và điện trở R, thì công suất tiêu thụ P sẽ được tính bằng công thức P = V^2/R",
    "re": "Đây là công thức tính công suất trong mạch điện"
  },
  {
    "con": "Khi một tụ điện được nạp điện, nếu điện áp trên tụ tăng thì điện tích Q trên tụ cũng sẽ tăng",
    "re": "Q = C * V, với C là điện dung của tụ"
  },
  {
    "con": "Trong mạch điện một chiều, nếu điện áp nguồn V tăng thì công suất P sẽ tăng theo",
    "re": "P = V * I, với I là dòng điện"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở nối tiếp, thì điện trở tương đương R_total sẽ bằng tổng các điện trở",
    "re": "R_total = R_1 + R_2 + ... + R_n"
  },
  {
    "con": "Theo sơ đồ tương đương của mạch khuếch đại hình 14, trở kháng vào của mạch là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp trên một điện trở tăng lên, thì dòng điện chạy qua điện trở đó sẽ:",
    "re": "Tăng lên theo định luật Ohm"
  },
  {
    "con": "Nếu tần số của tín hiệu tăng lên trong một mạch LC, thì độ lợi của mạch sẽ:",
    "re": "Giảm xuống"
  },
  {
    "con": "Khi một tụ điện được nạp đầy, thì điện áp trên tụ sẽ:",
    "re": "Bằng điện áp nguồn"
  },
  {
    "con": "Nếu một mạch điện có trở kháng thấp hơn, thì công suất tiêu thụ sẽ:",
    "re": "Tăng lên"
  },
  {
    "con": "Khi một cuộn dây được kết nối với nguồn điện xoay chiều, thì từ trường xung quanh cuộn dây sẽ:",
    "re": "Thay đổi theo tần số của dòng điện"
  },
  {
    "con": "Nếu điện áp đầu vào của một bộ khuếch đại vượt quá mức cho phép, thì bộ khuếch đại sẽ:",
    "re": "Bị bão hòa"
  },
  {
    "con": "Khi một mạch điện có nhiều điện trở nối tiếp, thì tổng trở kháng của mạch sẽ:",
    "re": "Bằng tổng của các điện trở"
  },
  {
    "con": "Nếu một mạch điện có điện áp không đổi và điện trở tăng lên, thì dòng điện sẽ:",
    "re": "Giảm xuống"
  },
  {
    "con": "Khi một diode được phân cực thuận, thì nó sẽ:",
    "re": "Cho phép dòng điện chạy qua"
  },
  {
    "con": "Theo sơ đồ tương đương của mạch khuếch đại hình 14, trở kháng RA của mạch là: (giả thiết r_{ce} vô cùng lớn)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp đầu vào của một mạch khuếch đại vượt quá ngưỡng bão hòa của transistor",
    "re": "Mạch sẽ không còn khuếch đại tín hiệu một cách chính xác"
  },
  {
    "con": "Nếu tần số của tín hiệu đầu vào vượt quá tần số cắt của bộ lọc thông thấp",
    "re": "Tín hiệu đầu ra sẽ giảm mạnh"
  },
  {
    "con": "Khi sử dụng định luật Ohm, nếu điện trở tăng trong khi điện áp không đổi",
    "re": "Dòng điện sẽ giảm"
  },
  {
    "con": "Nếu một mạch điện có nhiều nhánh song song, tổng trở của mạch sẽ nhỏ hơn trở của bất kỳ nhánh nào",
    "re": "Dòng điện sẽ phân bố qua các nhánh"
  },
  {
    "con": "Khi một tụ điện được nạp đầy, điện áp trên tụ sẽ bằng điện áp nguồn",
    "re": "Dòng điện qua tụ sẽ bằng 0"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và công suất P, thì điện áp U có thể tính bằng công thức U = √(P * R)",
    "re": "Điện áp U sẽ được xác định chính xác"
  },
  {
    "con": "Khi một cuộn dây được kết nối với nguồn điện xoay chiều, từ trường sẽ thay đổi theo tần số của dòng điện",
    "re": "Cuộn dây sẽ tạo ra điện áp cảm ứng"
  },
  {
    "con": "Nếu một mạch điện có điện áp xoay chiều, thì điện áp hiệu dụng sẽ bằng điện áp đỉnh chia cho √2",
    "re": "Điện áp hiệu dụng sẽ được tính chính xác"
  },
  {
    "con": "Khi một diode được kết nối ngược chiều với nguồn điện, nó sẽ không dẫn điện",
    "re": "Dòng điện qua diode sẽ bằng 0"
  },
  {
    "con": "Hệ số khuếch đại điện áp của mạch khuếch đại hình 14 được xác định có trị tuyệt đối:  (với r_{ce} vô cùng lớn)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại vượt quá mức cho phép",
    "re": "Mạch sẽ bị bão hòa và không hoạt động đúng"
  },
  {
    "con": "Tần số của tín hiệu đầu vào nằm trong dải tần số hoạt động của bộ lọc",
    "re": "Bộ lọc sẽ cho phép tín hiệu đi qua mà không bị suy giảm"
  },
  {
    "con": "Điện trở tải của mạch bằng với điện trở nguồn",
    "re": "Công suất tối đa sẽ được truyền từ nguồn đến tải"
  },
  {
    "con": "Dòng điện qua một cuộn dây thay đổi nhanh chóng",
    "re": "Một điện áp tự cảm sẽ được sinh ra để chống lại sự thay đổi đó"
  },
  {
    "con": "Tần số của dòng điện xoay chiều là 60 Hz",
    "re": "Chu kỳ của dòng điện là 16.67 ms"
  },
  {
    "con": "Điện áp trên một tụ điện tăng lên",
    "re": "Dòng điện qua tụ điện sẽ giảm dần theo thời gian"
  },
  {
    "con": "Mạch điện có điện trở và tụ điện mắc nối tiếp",
    "re": "Thời gian hằng định của mạch sẽ được xác định bởi giá trị của điện trở và tụ điện"
  },
  {
    "con": "Một mạch điện có điện trở không đổi và điện áp tăng",
    "re": "Dòng điện trong mạch sẽ tăng theo định luật Ohm"
  },
  {
    "con": "Một mạch điện có nhiều nguồn điện mắc song song",
    "re": "Điện áp trên tất cả các nhánh sẽ bằng nhau"
  },
  {
    "con": "Mạch khuếch đại ở hình 14 với các thông số cho ở trên R_{1}=56K\\omega, R_{2}=39K\\omega, R_{c}=1K\\omega, R_{E}=600\\omega, V_{CC}=9V và \\beta=100 có trở kháng vào xấp xỉ bằng (giả thiết R_{B}>>\\beta r_{e})",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại không vượt quá điện áp nguồn",
    "re": "Mạch hoạt động ổn định"
  },
  {
    "con": "Tần số của tín hiệu đầu vào nằm trong dải tần số cho phép của mạch lọc",
    "re": "Mạch lọc hoạt động hiệu quả"
  },
  {
    "con": "Điện trở tải lớn hơn điện trở nội của nguồn điện",
    "re": "Công suất tiêu thụ tối ưu"
  },
  {
    "con": "Tổng trở kháng của mạch RLC ở tần số cộng hưởng bằng 0",
    "re": "Mạch đạt được cộng hưởng"
  },
  {
    "con": "Dòng điện qua một cuộn cảm không thay đổi đột ngột",
    "re": "Tạo ra điện áp tự cảm"
  },
  {
    "con": "Điện áp trên tụ điện tăng dần theo thời gian khi được nạp",
    "re": "Tụ điện đạt đến điện áp nguồn"
  },
  {
    "con": "Mạch điện có điện trở tương đương thấp hơn điện trở của từng thành phần",
    "re": "Dòng điện trong mạch tăng lên"
  },
  {
    "con": "Tần số của tín hiệu đầu vào vượt quá tần số cắt của bộ lọc",
    "re": "Tín hiệu đầu ra giảm đáng kể"
  },
  {
    "con": "Mạch điện có điện áp đầu vào ổn định và không có nhiễu",
    "re": "Tín hiệu đầu ra rõ ràng và chính xác"
  },
  {
    "con": "Mạch khuếch đại ở hình 14 với các thông số cho ở trên R_{1}=56K\\omega, R_{2}=39K\\omega, R_{c}=1K\\omega, R_{E}=600\\omega, V_{CC}=9V và \\beta=100 có trở kháng ra xấp xỉ bằng (giả thiết r_{ce} vô cùng lớn)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại không vượt quá điện áp nguồn cung cấp",
    "re": "Mạch hoạt động ổn định và không bị bão hòa"
  },
  {
    "con": "Tần số của tín hiệu đầu vào nằm trong dải tần số cho phép của mạch lọc",
    "re": "Mạch lọc sẽ cho tín hiệu ra chính xác mà không bị suy giảm"
  },
  {
    "con": "Điện trở tải được kết nối với mạch khuếch đại có giá trị lớn hơn điện trở đầu ra của mạch",
    "re": "Mạch sẽ hoạt động hiệu quả hơn và giảm thiểu tổn thất công suất"
  },
  {
    "con": "Tất cả các linh kiện trong mạch đều hoạt động trong giới hạn nhiệt độ cho phép",
    "re": "Mạch sẽ có tuổi thọ cao và hoạt động ổn định"
  },
  {
    "con": "Dòng điện qua một cuộn dây trong mạch từ trường không thay đổi",
    "re": "Từ trường xung quanh cuộn dây sẽ ổn định và không gây ra điện áp cảm ứng"
  },
  {
    "con": "Tần số của tín hiệu đầu vào và tần số cộng hưởng của mạch LC trùng nhau",
    "re": "Mạch sẽ đạt được độ khuếch đại tối đa"
  },
  {
    "con": "Điện áp trên tụ điện trong mạch RC đạt đến giá trị ổn định",
    "re": "Tụ điện sẽ không còn tích trữ điện năng và mạch sẽ ở trạng thái tĩnh"
  },
  {
    "con": "Mạch điện có điện trở tổng lớn hơn điện trở của các nhánh song song",
    "re": "Mạch sẽ tiêu thụ ít công suất hơn"
  },
  {
    "con": "Tín hiệu đầu vào của mạch điều chế có biên độ nhỏ hơn biên độ của sóng mang",
    "re": "Mạch điều chế sẽ hoạt động hiệu quả và không bị méo tín hiệu"
  },
  {
    "con": "Mạch khuếch đại ở hình 14 với các thông số cho ở trên R_{1}=56K\\omega, R_{2}=39K\\omega,\nR_{c}=1K\\omega, R_{E}=600\\omega, V_{CC}=9V và \\beta=100 có trị tuyệt đối của hệ số khuếch đại điện áp là: (nếu r_{ce} vô cùng\nlớn)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại nhỏ hơn điện áp ngưỡng của transistor",
    "re": "Transistor sẽ không dẫn điện"
  },
  {
    "con": "Tần số của tín hiệu đầu vào vượt quá tần số cắt của mạch lọc",
    "re": "Tín hiệu đầu ra sẽ bị suy giảm đáng kể"
  },
  {
    "con": "Điện trở tải của mạch khuếch đại bằng với điện trở nguồn",
    "re": "Hệ số khuếch đại sẽ đạt giá trị tối đa"
  },
  {
    "con": "Dòng điện qua một cuộn dây tăng lên nhanh chóng",
    "re": "Điện áp trên cuộn dây sẽ tăng lên theo quy luật Lenz"
  },
  {
    "con": "Mạch điện có điện trở R và điện áp U",
    "re": "Dòng điện I sẽ được tính bằng công thức I = U/R"
  },
  {
    "con": "Tần số của mạch dao động LC được xác định bởi giá trị của L và C",
    "re": "Tần số sẽ được tính bằng công thức f = 1/(2π√(LC))"
  },
  {
    "con": "Mạch điện có nhiều nhánh song song",
    "re": "Điện áp trên mỗi nhánh sẽ bằng nhau"
  },
  {
    "con": "Điện áp đầu vào của bộ chuyển đổi DC-DC là 12V và tỷ lệ biến đổi là 2:1",
    "re": "Điện áp đầu ra sẽ là 6V"
  },
  {
    "con": "Mạch điện có tụ điện C và điện trở R nối tiếp",
    "re": "Thời gian hằng định sẽ được tính bằng τ = R*C"
  },
  {
    "con": "Mạch khuếch đại ở hình 14 với các thông số cho ở trên R_{1}=56K\\omega, R_{2}=39K\\omega, R_{c}=1K\\omega, R_{E}=600\\omega, V_{CC}=9V và \\beta=100 có hệ số khuếch đại dòng điện xấp xỉ (nếu r_{ce} vô cùng lớn, R_{B}>>\\beta_{re}):",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại nhỏ hơn điện áp ngưỡng của transistor:",
    "re": "Transistor sẽ không dẫn điện"
  },
  {
    "con": "Tần số của tín hiệu đầu vào vượt quá tần số cắt của mạch lọc:",
    "re": "Tín hiệu đầu ra sẽ giảm mạnh"
  },
  {
    "con": "Điện trở tải của mạch khuếch đại thấp hơn điện trở đầu ra của transistor:",
    "re": "Hệ số khuếch đại sẽ giảm"
  },
  {
    "con": "Mạch điện có điện trở tương đương bằng 0:",
    "re": "Dòng điện sẽ đạt giá trị cực đại theo định luật Ohm"
  },
  {
    "con": "Tần số của tín hiệu đầu vào nằm trong dải tần số cho phép của bộ lọc thông thấp:",
    "re": "Tín hiệu sẽ được truyền qua mà không bị suy giảm"
  },
  {
    "con": "Điện áp nguồn cung cấp cho mạch điện thấp hơn điện áp yêu cầu của thiết bị:",
    "re": "Thiết bị sẽ không hoạt động"
  },
  {
    "con": "Mạch điện có điện trở nối tiếp và điện trở song song được tính toán chính xác:",
    "re": "Điện áp và dòng điện sẽ phân bố đúng theo định luật Kirchhoff"
  },
  {
    "con": "Tụ điện trong mạch được nạp đầy và sau đó ngắt kết nối với nguồn:",
    "re": "Tụ điện sẽ giữ điện tích và có thể cung cấp điện cho mạch"
  },
  {
    "con": "Mạch điện có tần số hoạt động cao hơn tần số tự nhiên của mạch:",
    "re": "Mạch sẽ có hiện tượng cộng hưởng"
  },
  {
    "con": "Cho mạch khuếch đại ở hình 15, xác định chế độ tĩnh của mạch với R_{1}=56K\\omega, R_{2}=39K\\omega, R_{c}=1K\\omega, R_{E}=600\\omega, V_{CC}=9V và \\beta=100",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp đầu vào của mạch khuếch đại nhỏ hơn điện áp ngưỡng, mạch sẽ không hoạt động",
    "re": "Mạch không có tín hiệu đầu ra"
  },
  {
    "con": "Nếu điện trở tải của mạch khuếch đại quá thấp, thì hiệu suất khuếch đại sẽ giảm",
    "re": "Mạch sẽ không hoạt động hiệu quả"
  },
  {
    "con": "Khi tần số tín hiệu đầu vào vượt quá tần số cắt của mạch lọc, thì độ lợi của mạch sẽ giảm",
    "re": "Mạch sẽ không lọc tín hiệu hiệu quả"
  },
  {
    "con": "Nếu điện áp nguồn cung cấp cho mạch vượt quá mức cho phép, thì linh kiện trong mạch có thể bị hỏng",
    "re": "Mạch sẽ không hoạt động an toàn"
  },
  {
    "con": "Khi sử dụng transistor trong chế độ khuếch đại, nếu dòng điện vào quá lớn, thì transistor có thể bị quá tải",
    "re": "Transistor có thể bị hỏng"
  },
  {
    "con": "Nếu mạch điện có điện trở lớn hơn điện trở tải, thì dòng điện qua mạch sẽ giảm",
    "re": "Mạch sẽ tiêu thụ ít năng lượng hơn"
  },
  {
    "con": "Khi sử dụng tụ điện trong mạch, nếu điện áp trên tụ vượt quá điện áp định mức, thì tụ điện có thể bị nổ",
    "re": "Mạch sẽ gặp sự cố nghiêm trọng"
  },
  {
    "con": "Nếu tần số của tín hiệu đầu vào nằm trong dải tần số cho phép của mạch khuếch đại, thì mạch sẽ hoạt động ổn định",
    "re": "Mạch sẽ cho ra tín hiệu đầu ra chính xác"
  },
  {
    "con": "Khi sử dụng mạch điện xoay chiều, nếu không có tụ điện hoặc cuộn cảm, thì mạch sẽ không có khả năng lọc tần số",
    "re": "Mạch sẽ không hoạt động hiệu quả"
  },
  {
    "con": "Theo sơ đồ tương đương của mạch khuếch đại hình 15, trở kháng vào của mạch là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp trên một tụ điện tăng lên, dòng điện qua tụ điện sẽ:",
    "re": "Giảm xuống"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và điện áp U, thì dòng điện I chảy qua mạch là:",
    "re": "I = U/R"
  },
  {
    "con": "Khi tần số của tín hiệu tăng, trở kháng của cuộn cảm sẽ:",
    "re": "Tăng lên"
  },
  {
    "con": "Nếu một mạch điện xoay chiều có điện áp hiệu dụng U và điện trở R, thì công suất tiêu thụ P là:",
    "re": "P = U^2/R"
  },
  {
    "con": "Khi một diode được phân cực thuận, nó sẽ:",
    "re": "Cho phép dòng điện chảy qua"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở nối tiếp, tổng điện trở R tổng sẽ:",
    "re": "Bằng tổng các điện trở riêng lẻ"
  },
  {
    "con": "Khi một tụ điện được nạp đầy, dòng điện qua tụ sẽ:",
    "re": "Ngừng lại"
  },
  {
    "con": "Nếu một mạch điện có điện áp U và công suất P, thì dòng điện I sẽ:",
    "re": "I = P/U"
  },
  {
    "con": "Khi một cuộn cảm được kết nối với nguồn điện một chiều, dòng điện qua cuộn cảm sẽ:",
    "re": "Tăng dần cho đến khi đạt giá trị ổn định"
  },
  {
    "con": "Theo sơ đồ tương đương của mạch khuếch đại hình 15, trở kháng R_{A} của mạch là: (giả thiết r_{ce} vô cùng lớn)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp đầu vào của mạch khuếch đại vượt quá ngưỡng bão hòa của transistor",
    "re": "Mạch sẽ không khuếch đại tín hiệu đầu vào"
  },
  {
    "con": "Nếu tần số của tín hiệu đầu vào vượt quá tần số cắt của bộ lọc",
    "re": "Tín hiệu đầu ra sẽ giảm mạnh"
  },
  {
    "con": "Khi điện trở tải giảm xuống dưới giá trị tối ưu trong mạch khuếch đại",
    "re": "Hiệu suất khuếch đại sẽ giảm"
  },
  {
    "con": "Nếu sử dụng tụ điện trong mạch lọc, với tần số cắt được xác định bởi giá trị của tụ và điện trở",
    "re": "Mạch sẽ có khả năng lọc tần số không mong muốn"
  },
  {
    "con": "Khi điện áp trên một tụ điện đạt đến giá trị tối đa cho phép",
    "re": "Tụ điện có thể bị hỏng hoặc bị rò rỉ"
  },
  {
    "con": "Nếu sử dụng dây dẫn có tiết diện nhỏ cho dòng điện lớn",
    "re": "Dây dẫn sẽ nóng lên và có nguy cơ cháy nổ"
  },
  {
    "con": "Khi tần số của tín hiệu AC tăng lên trong mạch RLC",
    "re": "Trở kháng của mạch sẽ thay đổi và có thể dẫn đến hiện tượng cộng hưởng"
  },
  {
    "con": "Nếu điện áp đầu vào của một mạch chỉnh lưu vượt quá điện áp định mức của diode",
    "re": "Diode có thể bị hỏng do quá tải"
  },
  {
    "con": "Khi sử dụng biến áp với tỷ lệ biến áp không phù hợp cho ứng dụng",
    "re": "Điện áp đầu ra sẽ không đạt yêu cầu kỹ thuật"
  },
  {
    "con": "Hệ số khuếch đại điện áp của mạch khuếch đại hình 15 được xác định có trị tuyệt đối:  (với r_{ce} vô cùng lớn, R_{E}>>r_{e})",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện trở của một mạch điện song song được tính bằng công thức 1/R_total = 1/R_1 + 1/R_2 + ... + 1/R_n",
    "re": "Giá trị điện trở tổng là chính xác"
  },
  {
    "con": "Nếu tần số của tín hiệu điện tăng lên, thì độ cảm kháng của cuộn cảm cũng tăng lên",
    "re": "Điều này đúng với định luật Ohm"
  },
  {
    "con": "Nếu điện áp trên một tụ điện tăng lên, thì điện tích trên tụ điện cũng tăng theo",
    "re": "Điều này đúng theo định luật của tụ điện"
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn hơn, thì dòng điện chạy qua mạch sẽ giảm",
    "re": "Điều này đúng theo định luật Ohm"
  },
  {
    "con": "Nếu công suất tiêu thụ của một thiết bị điện tăng lên, thì dòng điện chạy qua thiết bị cũng sẽ tăng lên nếu điện áp không đổi",
    "re": "Điều này đúng theo công thức P = U * I"
  },
  {
    "con": "Nếu một mạch điện có điện áp xoay chiều, thì điện trở tương đương sẽ được tính bằng R + jX",
    "re": "Điều này đúng với mạch điện xoay chiều"
  },
  {
    "con": "Nếu tần số của dòng điện xoay chiều tăng lên, thì điện dung của tụ điện sẽ ảnh hưởng đến độ lệch pha giữa dòng điện và điện áp",
    "re": "Điều này đúng theo lý thuyết mạch điện"
  },
  {
    "con": "Nếu một cuộn cảm được kết nối với nguồn điện xoay chiều, thì nó sẽ tạo ra một điện áp ngược pha với dòng điện",
    "re": "Điều này đúng theo nguyên lý hoạt động của cuộn cảm"
  },
  {
    "con": "Nếu một mạch điện có nhiều nguồn điện, thì điện áp tổng của mạch sẽ là tổng các điện áp của từng nguồn",
    "re": "Điều này đúng với mạch điện nối tiếp"
  },
  {
    "con": "Mạch khuếch đại ở hình 15 với các thông số cho ở trên R_{1}=56K\\omega, R_{2}=39K\\omega,\nR_{c}=1K\\omega, R_{E}=600\\omega, V_{CC}=9V và \\beta=100 có trở kháng vào xấp xỉ bằng (giả thiết R_{B}>>\\beta r_{e})",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại không vượt quá điện áp nguồn cung cấp",
    "re": "Mạch hoạt động ổn định"
  },
  {
    "con": "Tần số của tín hiệu đầu vào nằm trong dải tần số cho phép của mạch lọc",
    "re": "Mạch lọc hoạt động hiệu quả"
  },
  {
    "con": "Điện trở tải lớn hơn điện trở nội của nguồn điện",
    "re": "Công suất tiêu thụ tối ưu"
  },
  {
    "con": "Tất cả các linh kiện trong mạch đều hoạt động trong giới hạn nhiệt độ cho phép",
    "re": "Mạch không bị hỏng do quá nhiệt"
  },
  {
    "con": "Dòng điện qua một điện trở không vượt quá giá trị định mức của nó",
    "re": "Điện trở không bị cháy"
  },
  {
    "con": "Tần số dao động của mạch LC nằm trong dải tần số thiết kế",
    "re": "Mạch dao động hoạt động chính xác"
  },
  {
    "con": "Điện áp đầu ra của bộ chuyển đổi DC-DC nằm trong giới hạn cho phép",
    "re": "Bộ chuyển đổi hoạt động an toàn"
  },
  {
    "con": "Tất cả các kết nối trong mạch đều được hàn chắc chắn và không có tiếp xúc kém",
    "re": "Mạch hoạt động ổn định và không bị gián đoạn"
  },
  {
    "con": "Tần số của tín hiệu đầu vào không gây ra hiện tượng cộng hưởng trong mạch",
    "re": "Mạch không bị méo tín hiệu"
  },
  {
    "con": "Mạch khuếch đại ở hình 15 với các thông số cho ở trên R_{1}=56K\\omega, R_{2}=39K\\omega, R_{c}=1K\\omega, R_{E}=600\\omega, V_{CC}=9V và \\beta=100 có trở kháng ra xấp xỉ bằng (giả thiết r_{ce} vô cùng lớn)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại không vượt quá điện áp nguồn cung cấp",
    "re": "Mạch hoạt động bình thường"
  },
  {
    "con": "Tần số của tín hiệu đầu vào nằm trong dải tần số cho phép của mạch lọc",
    "re": "Mạch lọc sẽ hoạt động hiệu quả"
  },
  {
    "con": "Điện trở tải lớn hơn điện trở nội của nguồn điện",
    "re": "Công suất tiêu thụ sẽ tối ưu"
  },
  {
    "con": "Tần số dao động của mạch LC được tính bằng công thức f = 1/(2π√(LC))",
    "re": "Mạch sẽ dao động với tần số f"
  },
  {
    "con": "Điện áp trên tụ điện trong mạch RC đạt đến giá trị ổn định",
    "re": "Dòng điện qua mạch sẽ giảm xuống gần bằng 0"
  },
  {
    "con": "Mạch điện có điện trở tương đương R_{eq} được tính bằng công thức 1/R_{eq} = 1/R_{1} + 1/R_{2}",
    "re": "Mạch sẽ có điện trở tổng hợp R_{eq}"
  },
  {
    "con": "Tần số của tín hiệu đầu vào vượt quá tần số cắt của bộ lọc thông thấp",
    "re": "Tín hiệu đầu ra sẽ bị suy giảm"
  },
  {
    "con": "Mạch điện có điện áp nguồn ổn định và không có nhiễu",
    "re": "Tín hiệu đầu ra sẽ chính xác và ổn định"
  },
  {
    "con": "Điện áp trên các điện trở trong mạch phân áp được tính theo công thức V_{out} = V_{in} * (R_{2}/(R_{1}+R_{2}))",
    "re": "Điện áp đầu ra V_{out} sẽ được xác định"
  },
  {
    "con": "Mạch khuếch đại ở hình 15 với các thông số cho ở trên R_{1}=56K\\omega, R_{2}=39K\\omega, R_{c}=1K\\omega, R_{E}=600\\omega, V_{CC}=9V và \\beta=100 có trị tuyệt đối của hệ số khuếch đại điện áp là: (nếu r_{ce} vô cùng lớn, R_{E}>>r_{e})",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại không đổi và tần số tín hiệu thấp hơn tần số cắt của mạch",
    "re": "Mạch sẽ hoạt động trong chế độ tuyến tính"
  },
  {
    "con": "Nếu điện trở tải R_{L} nhỏ hơn điện trở nguồn R_{S}",
    "re": "Công suất tiêu thụ sẽ tăng lên"
  },
  {
    "con": "Nếu tần số của tín hiệu đầu vào vượt quá tần số cắt của bộ lọc",
    "re": "Tín hiệu đầu ra sẽ giảm mạnh"
  },
  {
    "con": "Nếu điện áp trên tụ điện vượt quá điện áp định mức của nó",
    "re": "Tụ điện sẽ bị hỏng hoặc nổ"
  },
  {
    "con": "Nếu dòng điện qua cuộn dây thay đổi nhanh chóng",
    "re": "Sẽ xuất hiện điện áp tự cảm ngược lại"
  },
  {
    "con": "Nếu mạch điện có nhiều nhánh song song",
    "re": "Tổng điện trở của mạch sẽ giảm"
  },
  {
    "con": "Nếu điện áp đầu vào của bộ chuyển đổi DC-DC là ổn định",
    "re": "Điện áp đầu ra sẽ được điều chỉnh theo yêu cầu"
  },
  {
    "con": "Nếu tần số của dòng điện xoay chiều tăng lên",
    "re": "Điện trở của mạch sẽ tăng do hiệu ứng da"
  },
  {
    "con": "Nếu sử dụng transistor trong chế độ bão hòa",
    "re": "Transistor sẽ hoạt động như một công tắc"
  },
  {
    "con": "Mạch khuếch đại ở hình 15 với các thông số cho ở trên R_{1}=56K\\omega, R_{2}=39K\\omega, R_{c}=1K\\omega, R_{E}=600\\omega, V_{CC}=9V và \\beta=100 có hệ số khuếch đại dòng điện xấp xỉ ((nếu r_{ce} vô cùng lớn, R_{B}>>\\beta r_{e})",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại không đổi và điện trở tải lớn hơn điện trở đầu vào của mạch khuếch đại",
    "re": "Hệ số khuếch đại điện áp sẽ gần bằng 1"
  },
  {
    "con": "Tần số của tín hiệu đầu vào tăng lên trong một mạch RC",
    "re": "Điện áp ra sẽ giảm do hiện tượng suy giảm tần số"
  },
  {
    "con": "Mạch điện có điện trở R và tụ điện C mắc nối tiếp, và tần số dòng điện xoay chiều là f",
    "re": "Điện trở tương đương Z sẽ được tính bằng công thức Z = R + 1/(j2πfC)"
  },
  {
    "con": "Một động cơ điện không đồng bộ hoạt động ở chế độ quá tải",
    "re": "Nhiệt độ của động cơ sẽ tăng lên và có thể dẫn đến hư hỏng"
  },
  {
    "con": "Một mạch điện có điện áp nguồn V và điện trở R mắc nối tiếp",
    "re": "Dòng điện I sẽ được tính bằng định luật Ohm: I = V/R"
  },
  {
    "con": "Tụ điện được nạp đầy và sau đó được ngắt kết nối khỏi nguồn điện",
    "re": "Tụ điện sẽ giữ lại điện tích và có thể phóng điện qua tải bên ngoài"
  },
  {
    "con": "Một mạch điện có nhiều nguồn điện khác nhau mắc song song",
    "re": "Điện áp trên mỗi nhánh sẽ bằng nhau và tổng dòng điện sẽ là tổng các dòng điện qua từng nhánh"
  },
  {
    "con": "Một mạch điện có điện trở R1 và R2 mắc song song",
    "re": "Điện trở tương đương R sẽ được tính bằng công thức 1/R = 1/R1 + 1/R2"
  },
  {
    "con": "Một cuộn dây có dòng điện thay đổi nhanh chóng",
    "re": "Sẽ tạo ra một điện áp cảm ứng theo định luật Faraday"
  },
  {
    "con": "Cho mạch khuếch đại ở hình 16, xác định chế độ tĩnh của mạch với R_{B}=180K\\omega, R_{c}=2.7K\\omega, R_{E}=1K\\omega, V_{CC}=9V và \\beta=100.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp đầu vào của mạch khuếch đại nhỏ hơn điện áp ngưỡng,",
    "re": "thì mạch sẽ không hoạt động."
  },
  {
    "con": "Nếu điện trở tải giảm xuống dưới giá trị tối thiểu,",
    "re": "thì hiệu suất của mạch sẽ giảm."
  },
  {
    "con": "Nếu tần số của tín hiệu đầu vào vượt quá tần số cắt của bộ lọc,",
    "re": "thì tín hiệu đầu ra sẽ bị suy giảm đáng kể."
  },
  {
    "con": "Nếu điện áp nguồn tăng lên mà không có sự điều chỉnh,",
    "re": "thì các linh kiện trong mạch có thể bị hỏng."
  },
  {
    "con": "Nếu sử dụng tụ điện có điện dung không đủ cho mạch lọc,",
    "re": "thì mạch sẽ không đạt được hiệu suất mong muốn."
  },
  {
    "con": "Nếu mạch có điện trở lớn hơn giá trị tối ưu,",
    "re": "thì dòng điện sẽ giảm và công suất tiêu thụ sẽ thấp."
  },
  {
    "con": "Nếu sử dụng transistor trong chế độ bão hòa,",
    "re": "thì nó sẽ hoạt động như một công tắc."
  },
  {
    "con": "Nếu tần số dao động của mạch cộng hưởng bằng tần số tự nhiên,",
    "re": "thì biên độ dao động sẽ đạt giá trị cực đại."
  },
  {
    "con": "Nếu mạch có điện trở vào thấp và điện trở ra cao,",
    "re": "thì mạch sẽ có khả năng khuếch đại tốt hơn."
  },
  {
    "con": "Theo sơ đồ tương đương của mạch khuếch đại hình 16, trở kháng R_{A} của mạch là: (giả thiết r_{ce} vô cùng lớn)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp đầu vào của mạch RLC song song vượt quá điện áp ngưỡng của tụ điện",
    "re": "Tụ điện sẽ bị hỏng nếu không có biện pháp bảo vệ"
  },
  {
    "con": "Nếu tần số của tín hiệu đầu vào tăng lên trong mạch lọc thông thấp",
    "re": "Điện áp đầu ra sẽ giảm xuống"
  },
  {
    "con": "Khi sử dụng transistor NPN trong chế độ khuếch đại",
    "re": "Dòng điện thu vào sẽ lớn hơn dòng điện phát ra"
  },
  {
    "con": "Nếu trở kháng tải bằng với trở kháng nguồn trong mạch điện",
    "re": "Công suất truyền tải sẽ đạt giá trị tối đa"
  },
  {
    "con": "Khi điện áp trên một tụ điện đạt đến giá trị tối đa",
    "re": "Tụ điện sẽ bắt đầu xả điện ra ngoài"
  },
  {
    "con": "Nếu sử dụng dây dẫn có tiết diện nhỏ cho dòng điện lớn",
    "re": "Dây dẫn sẽ bị nóng và có nguy cơ cháy nổ"
  },
  {
    "con": "Khi tần số của dòng điện xoay chiều tăng lên",
    "re": "Trở kháng của cuộn cảm sẽ tăng theo"
  },
  {
    "con": "Nếu điện áp trên một điện trở tăng lên",
    "re": "Dòng điện chạy qua điện trở cũng sẽ tăng lên theo định luật Ohm"
  },
  {
    "con": "Khi một mạch điện có nhiều nguồn điện song song",
    "re": "Điện áp đầu ra sẽ bằng điện áp của nguồn có điện áp cao nhất"
  },
  {
    "con": "Hệ số khuếch đại điện áp của mạch khuếch đại hình 16 được xác định có trị tuyệt đối:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại vượt quá mức cho phép:",
    "re": "Mạch có thể bị hư hỏng hoặc hoạt động không ổn định"
  },
  {
    "con": "Tần số của tín hiệu đầu vào nằm trong dải tần số hoạt động của bộ lọc:",
    "re": "Tín hiệu sẽ được truyền qua bộ lọc mà không bị suy giảm"
  },
  {
    "con": "Điện trở tải của mạch bằng với điện trở nội của nguồn:",
    "re": "Công suất tối đa sẽ được truyền từ nguồn đến tải"
  },
  {
    "con": "Dòng điện trong mạch vượt quá giá trị định mức của linh kiện:",
    "re": "Linh kiện có thể bị quá nhiệt và hư hỏng"
  },
  {
    "con": "Tụ điện được kết nối đúng chiều trong mạch:",
    "re": "Tụ điện sẽ hoạt động hiệu quả và không bị hư hỏng"
  },
  {
    "con": "Mạch điện được thiết kế với các linh kiện có thông số kỹ thuật tương thích:",
    "re": "Mạch sẽ hoạt động ổn định và hiệu quả"
  },
  {
    "con": "Tần số dao động của mạch LC được tính toán chính xác:",
    "re": "Mạch sẽ dao động tại tần số mong muốn"
  },
  {
    "con": "Điện áp đầu ra của bộ chuyển đổi DC-DC được điều chỉnh đúng cách:",
    "re": "Điện áp đầu ra sẽ ổn định và đáp ứng yêu cầu tải"
  },
  {
    "con": "Mạch điện được bảo vệ bằng cầu chì hoặc thiết bị bảo vệ quá dòng:",
    "re": "Mạch sẽ được bảo vệ khỏi hư hỏng do quá dòng"
  },
  {
    "con": "Theo sơ đồ tương đương của mạch khuếch đại hình 18, trở kháng RA của mạch là: (giả thiết r_{ce} vô cùng lớn)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp đầu vào của mạch khuếch đại vượt quá ngưỡng bão hòa của transistor",
    "re": "Mạch sẽ không khuếch đại tín hiệu đầu vào nữa"
  },
  {
    "con": "Nếu điện trở tải của mạch thấp hơn điện trở nội của nguồn điện",
    "re": "Công suất tiêu thụ sẽ tăng lên"
  },
  {
    "con": "Khi tần số của tín hiệu đầu vào vượt quá tần số cắt của bộ lọc",
    "re": "Tín hiệu đầu ra sẽ giảm mạnh"
  },
  {
    "con": "Nếu điện áp trên tụ điện đạt đến giá trị tối đa cho phép",
    "re": "Tụ điện có thể bị hỏng hoặc nổ"
  },
  {
    "con": "Khi dòng điện chạy qua cuộn dây thay đổi nhanh chóng",
    "re": "Sẽ xuất hiện điện áp tự cảm trong cuộn dây"
  },
  {
    "con": "Nếu mạch điện có trở kháng tổng hợp bằng 0",
    "re": "Dòng điện sẽ đạt giá trị cực đại"
  },
  {
    "con": "Khi sử dụng biến trở trong mạch điều chỉnh ánh sáng",
    "re": "Cường độ ánh sáng sẽ thay đổi theo vị trí của biến trở"
  },
  {
    "con": "Nếu điện áp giữa hai đầu tụ điện không đổi",
    "re": "Tụ điện sẽ không tích lũy thêm điện tích"
  },
  {
    "con": "Khi sử dụng diode trong mạch chỉnh lưu",
    "re": "Dòng điện chỉ cho phép chảy theo một chiều"
  },
  {
    "con": "Theo sơ đồ tương đương của mạch khuếch đại hình 18, trở kháng vào của mạch là: (giả thiết r_{ce} vô cùng lớn)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp đầu vào của mạch RLC song song vượt quá điện áp ngưỡng của các linh kiện",
    "re": "Mạch có thể bị hỏng do quá tải"
  },
  {
    "con": "Nếu tần số của tín hiệu đầu vào tăng lên trong mạch LC",
    "re": "Độ lợi của mạch sẽ giảm xuống"
  },
  {
    "con": "Khi điện trở của một mạch giảm xuống trong khi điện áp giữ nguyên",
    "re": "Dòng điện trong mạch sẽ tăng lên theo định luật Ohm"
  },
  {
    "con": "Nếu một tụ điện được nạp đầy và sau đó được ngắt kết nối khỏi nguồn điện",
    "re": "Tụ điện sẽ giữ lại điện tích trong một thời gian nhất định"
  },
  {
    "con": "Khi sử dụng biến áp, nếu số vòng dây ở cuộn sơ cấp gấp đôi cuộn thứ cấp",
    "re": "Điện áp ở cuộn sơ cấp sẽ gấp đôi điện áp ở cuộn thứ cấp"
  },
  {
    "con": "Nếu một mạch điện có trở kháng tổng hợp bằng 0",
    "re": "Dòng điện trong mạch sẽ đạt giá trị cực đại"
  },
  {
    "con": "Khi một diode được kết nối ngược chiều với nguồn điện",
    "re": "Diode sẽ không dẫn điện và có thể gây ra hỏng hóc nếu điện áp vượt quá giới hạn"
  },
  {
    "con": "Nếu tần số của dòng điện xoay chiều tăng lên",
    "re": "Trở kháng của cuộn cảm sẽ tăng lên"
  },
  {
    "con": "Khi một mạch điện có nhiều nguồn điện song song",
    "re": "Điện áp trên mỗi nguồn sẽ bằng nhau"
  },
  {
    "con": "Hệ số khuếch đại điện áp của mạch khuếch đại hình 18 được xác định có trị tuyệt đối xấp xỉ: (với r_{ce} vô cùng lớn, R_{E}>>r_{e})",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện trở tương đương của mạch nối tiếp được tính bằng tổng các điện trở trong mạch",
    "re": "Giá trị điện trở tương đương là chính xác"
  },
  {
    "con": "Nếu tần số của tín hiệu tăng lên trong mạch LC thì độ lợi của mạch sẽ thay đổi",
    "re": "Độ lợi có thể giảm hoặc tăng tùy thuộc vào cấu hình mạch"
  },
  {
    "con": "Nếu điện áp đầu vào của mạch khuếch đại vượt quá điện áp cung cấp thì mạch sẽ bị bão hòa",
    "re": "Mạch không thể khuếch đại tín hiệu chính xác"
  },
  {
    "con": "Nếu điện trở tải giảm trong mạch khuếch đại thì dòng điện qua mạch sẽ tăng lên",
    "re": "Điều này có thể dẫn đến quá tải cho mạch"
  },
  {
    "con": "Nếu tần số của tín hiệu trong mạch RLC bằng tần số cộng hưởng thì điện trở tương đương sẽ đạt giá trị tối thiểu",
    "re": "Mạch sẽ có độ lợi tối đa"
  },
  {
    "con": "Nếu điện áp trên tụ điện trong mạch RC đạt đến giá trị tối đa thì dòng điện qua mạch sẽ bằng 0",
    "re": "Tụ điện đã được sạc đầy"
  },
  {
    "con": "Nếu một cuộn dây được kết nối với nguồn điện xoay chiều thì nó sẽ tạo ra từ trường biến đổi",
    "re": "Điều này có thể gây ra hiện tượng cảm ứng điện từ"
  },
  {
    "con": "Nếu điện áp đầu vào của một bộ chuyển đổi DC-DC tăng lên thì điện áp đầu ra cũng sẽ tăng lên",
    "re": "Điều này phụ thuộc vào tỷ lệ biến đổi của bộ chuyển đổi"
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn hơn thì dòng điện chạy qua mạch sẽ nhỏ hơn",
    "re": "Định luật Ohm được áp dụng"
  },
  {
    "con": "Trong mạch phân cực phân áp ở hình, tại sao điện áp tại điểm nối R1 và R2 được xem là độc lập với dòng Base IB của BJT.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp trên một tụ điện tăng lên, thì dòng điện qua tụ điện sẽ giảm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện trở trong mạch giảm, thì dòng điện qua mạch sẽ tăng lên theo định luật Ohm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi tần số của tín hiệu AC tăng, thì điện trở của cuộn cảm sẽ tăng lên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có nhiều nhánh song song, thì điện áp trên mỗi nhánh sẽ bằng nhau.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một diode được phân cực thuận, thì nó sẽ dẫn điện.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn, thì công suất tiêu thụ sẽ giảm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi điện áp nguồn tăng, thì công suất tiêu thụ của tải sẽ tăng nếu điện trở không đổi.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tụ điện được nạp đầy, thì nó sẽ không cho dòng điện đi qua.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một transistor hoạt động trong vùng bão hòa, thì nó sẽ dẫn điện tối đa.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hệ số khuếch đại điện áp của toàn mạch khuếch đại nhiều tầng sẽ bằng với:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện trở của một mạch điện sẽ giảm khi:",
    "re": "các điện trở được nối song song"
  },
  {
    "con": "Công suất tiêu thụ của một thiết bị điện sẽ tăng khi:",
    "re": "điện áp cung cấp tăng lên trong khi điện trở không đổi"
  },
  {
    "con": "Tần số của dòng điện xoay chiều sẽ ảnh hưởng đến:",
    "re": "điện dung và điện cảm trong mạch"
  },
  {
    "con": "Nếu một mạch điện có điện trở không đổi và điện áp tăng lên:",
    "re": "dòng điện trong mạch sẽ tăng lên theo định luật Ohm"
  },
  {
    "con": "Hiệu điện thế giữa hai đầu một tụ điện sẽ tăng khi:",
    "re": "năng lượng lưu trữ trong tụ điện tăng lên"
  },
  {
    "con": "Nếu một cuộn dây có điện cảm lớn hơn, thì:",
    "re": "nó sẽ có khả năng chống lại sự thay đổi dòng điện tốt hơn"
  },
  {
    "con": "Công thức tính công suất trong mạch điện xoay chiều sẽ là:",
    "re": "P = VIcosφ, với φ là góc pha giữa điện áp và dòng điện"
  },
  {
    "con": "Nếu một mạch điện có điện trở và điện cảm, thì:",
    "re": "dòng điện sẽ bị trễ pha so với điện áp"
  },
  {
    "con": "Khi điện áp trong một mạch điện tăng lên gấp đôi, thì:",
    "re": "công suất tiêu thụ sẽ tăng lên gấp bốn lần nếu điện trở không đổi"
  },
  {
    "con": "Trở kháng vào của toàn bộ mạch khuếch đại nhiều tầng được xác định:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở tỉ lệ thuận với dòng điện qua nó:",
    "re": "Định luật Ohm được áp dụng"
  },
  {
    "con": "Tần số của tín hiệu trong mạch RLC được xác định:",
    "re": "Mạch sẽ có hiện tượng cộng hưởng"
  },
  {
    "con": "Công suất tiêu thụ của một thiết bị điện được tính toán:",
    "re": "Cần biết điện áp và dòng điện sử dụng"
  },
  {
    "con": "Mạch điện có nhiều nhánh song song được phân tích:",
    "re": "Tổng trở kháng sẽ nhỏ hơn trở kháng của từng nhánh"
  },
  {
    "con": "Tín hiệu đầu vào của bộ khuếch đại được điều chỉnh:",
    "re": "Đầu ra sẽ có biên độ lớn hơn đầu vào"
  },
  {
    "con": "Điện trở của dây dẫn được tính toán dựa trên chiều dài và tiết diện:",
    "re": "Điện trở sẽ tăng khi chiều dài tăng hoặc tiết diện giảm"
  },
  {
    "con": "Mạch điện xoay chiều có tần số cao được thiết kế:",
    "re": "Cần chú ý đến hiện tượng điện dung và điện cảm"
  },
  {
    "con": "Tín hiệu số được chuyển đổi từ tín hiệu tương tự:",
    "re": "Cần sử dụng bộ chuyển đổi tương tự-số (ADC)"
  },
  {
    "con": "Mạch điện có tụ điện được nạp đầy:",
    "re": "Điện áp trên tụ sẽ đạt đến giá trị tối đa và dòng điện sẽ giảm về 0"
  },
  {
    "con": "Trở kháng ra của toàn bộ mạch khuếch đại nhiều tầng được xác định:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở trong mạch nối tiếp được tính bằng cách nhân dòng điện với giá trị điện trở:",
    "re": "Điện áp trên điện trở được xác định"
  },
  {
    "con": "Tần số của tín hiệu AC tăng lên:",
    "re": "Độ lớn của điện trở cảm kháng sẽ tăng"
  },
  {
    "con": "Mạch điện có điện trở và tụ điện nối tiếp được phân tích:",
    "re": "Thời gian phản hồi của mạch sẽ được xác định"
  },
  {
    "con": "Công suất tiêu thụ trong một mạch điện được tính bằng cách nhân điện áp với dòng điện:",
    "re": "Công suất tiêu thụ sẽ được xác định"
  },
  {
    "con": "Một mạch điện có điện trở không đổi và điện áp thay đổi:",
    "re": "Dòng điện trong mạch sẽ thay đổi theo điện áp"
  },
  {
    "con": "Tụ điện được nạp đầy:",
    "re": "Điện áp trên tụ sẽ đạt giá trị tối đa"
  },
  {
    "con": "Mạch điện có nhiều nguồn điện song song:",
    "re": "Điện áp trên các nhánh sẽ bằng nhau"
  },
  {
    "con": "Một mạch điện có điện trở và cuộn cảm nối tiếp được phân tích:",
    "re": "Tần số cắt sẽ được xác định"
  },
  {
    "con": "Khi điện áp tăng lên trong một mạch điện xoay chiều:",
    "re": "Dòng điện sẽ thay đổi theo quy luật của định luật Ohm"
  },
  {
    "con": "Điện trở của một mạch điện tỉ lệ nghịch với dòng điện chạy qua nó",
    "re": "Điện áp trên mạch điện sẽ tăng lên"
  },
  {
    "con": "Khi tần số của dòng điện xoay chiều tăng",
    "re": "Điện trở của cuộn cảm sẽ tăng"
  },
  {
    "con": "Khi điện áp trên một tụ điện tăng",
    "re": "Năng lượng lưu trữ trong tụ điện cũng tăng"
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn",
    "re": "Dòng điện chạy qua mạch sẽ nhỏ"
  },
  {
    "con": "Khi sử dụng biến áp để giảm điện áp",
    "re": "Dòng điện sẽ tăng lên nếu công suất được giữ nguyên"
  },
  {
    "con": "Nếu một mạch điện có nhiều nhánh song song",
    "re": "Tổng điện trở của mạch sẽ giảm"
  },
  {
    "con": "Khi nhiệt độ của một vật liệu dẫn điện tăng",
    "re": "Điện trở của vật liệu đó sẽ tăng"
  },
  {
    "con": "Nếu một tụ điện được nạp đầy",
    "re": "Nó sẽ không cho dòng điện chạy qua"
  },
  {
    "con": "Khi một mạch điện có điện áp không đổi",
    "re": "Công suất tiêu thụ sẽ tỉ lệ thuận với dòng điện"
  },
  {
    "con": "Nếu một động cơ điện hoạt động ở tải nặng",
    "re": "Nó sẽ tiêu thụ nhiều năng lượng hơn"
  },
  {
    "con": "Điện áp vượt quá mức cho phép của thiết bị",
    "re": "Có thể gây hư hỏng thiết bị và giảm tuổi thọ"
  },
  {
    "con": "Dòng điện chạy qua một dây dẫn có điện trở",
    "re": "Sẽ tạo ra nhiệt lượng theo định luật Joule"
  },
  {
    "con": "Sử dụng tụ điện trong mạch AC",
    "re": "Sẽ tạo ra độ lệch pha giữa điện áp và dòng điện"
  },
  {
    "con": "Tăng tần số của tín hiệu trong mạch",
    "re": "Sẽ làm giảm độ lớn của điện trở tương đương của tụ điện"
  },
  {
    "con": "Khi một mạch điện có nhiều nhánh song song",
    "re": "Tổng điện trở của mạch sẽ nhỏ hơn điện trở của bất kỳ nhánh nào"
  },
  {
    "con": "Sử dụng biến áp trong hệ thống điện",
    "re": "Sẽ giúp thay đổi điện áp mà không làm thay đổi công suất"
  },
  {
    "con": "Khi tải trên một mạch điện tăng lên",
    "re": "Dòng điện trong mạch cũng sẽ tăng theo"
  },
  {
    "con": "Sử dụng diode trong mạch chỉnh lưu",
    "re": "Sẽ cho phép dòng điện chỉ chảy theo một chiều"
  },
  {
    "con": "Khi một mạch điện có điện trở lớn",
    "re": "Dòng điện sẽ giảm theo định luật Ohm"
  },
  {
    "con": "Khi sử dụng mạch RLC",
    "re": "Sẽ có hiện tượng cộng hưởng tại tần số nhất định"
  },
  {
    "con": "Các mạch khuếch đại ghép trực tiếp có ưu điểm hơn so với mạch khuếch đại ghép R_{C} là\nchúng có thể khuếch đại:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở trong mạch nối tiếp sẽ giảm khi điện trở đó tăng lên:",
    "re": "Điện áp trên điện trở đó sẽ giảm"
  },
  {
    "con": "Nếu tần số của tín hiệu tăng lên trong một mạch LC thì độ lợi của mạch sẽ giảm:",
    "re": "Điều này dẫn đến giảm khả năng khuếch đại"
  },
  {
    "con": "Khi một tụ điện được nạp đầy, dòng điện qua tụ sẽ bằng 0:",
    "re": "Điều này có nghĩa là tụ điện đã đạt đến điện áp tối đa"
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn hơn thì dòng điện chạy qua mạch sẽ nhỏ hơn:",
    "re": "Điều này tuân theo định luật Ohm"
  },
  {
    "con": "Khi điện áp nguồn tăng lên trong một mạch điện, nếu điện trở không thay đổi thì dòng điện sẽ tăng lên:",
    "re": "Điều này cũng theo định luật Ohm"
  },
  {
    "con": "Nếu một mạch điện có nhiều điện trở nối song song thì điện trở tương đương sẽ nhỏ hơn bất kỳ điện trở nào trong mạch:",
    "re": "Điều này làm tăng dòng điện tổng trong mạch"
  },
  {
    "con": "Khi một cuộn dây được kết nối với nguồn điện xoay chiều, từ trường tạo ra sẽ thay đổi theo tần số của nguồn:",
    "re": "Điều này dẫn đến hiện tượng cảm ứng điện từ"
  },
  {
    "con": "Nếu một mạch điện có điện áp không đổi và điện trở giảm, thì dòng điện sẽ tăng:",
    "re": "Điều này cũng theo định luật Ohm"
  },
  {
    "con": "Khi một diode được phân cực thuận, nó sẽ cho phép dòng điện chạy qua:",
    "re": "Điều này cho phép diode hoạt động như một công tắc"
  },
  {
    "con": "Điện áp tăng lên trong một mạch điện kín khi điện trở giảm",
    "re": "Dòng điện sẽ tăng theo định luật Ohm"
  },
  {
    "con": "Khi một cuộn dây được kết nối với nguồn điện xoay chiều",
    "re": "Nó sẽ tạo ra một từ trường biến đổi theo thời gian"
  },
  {
    "con": "Nếu một mạch điện có điện trở lớn",
    "re": "Thì dòng điện chạy qua mạch sẽ nhỏ"
  },
  {
    "con": "Khi tần số của dòng điện xoay chiều tăng",
    "re": "Thì điện trở của cuộn cảm sẽ tăng"
  },
  {
    "con": "Nếu một tụ điện được nạp đầy",
    "re": "Thì nó sẽ không cho dòng điện chạy qua"
  },
  {
    "con": "Khi một mạch điện có nhiều nguồn điện song song",
    "re": "Thì điện áp trên mỗi nguồn sẽ bằng nhau"
  },
  {
    "con": "Nếu một thiết bị điện tiêu thụ công suất lớn",
    "re": "Thì nó sẽ cần một nguồn điện có khả năng cung cấp đủ công suất"
  },
  {
    "con": "Khi một mạch điện có điện trở thấp",
    "re": "Thì nó sẽ có khả năng dẫn điện tốt hơn"
  },
  {
    "con": "Nếu một động cơ điện hoạt động ở tải nặng",
    "re": "Thì nó sẽ tiêu tốn nhiều năng lượng hơn"
  },
  {
    "con": "Khi một mạch điện có điện áp cao",
    "re": "Thì nguy cơ gây ra điện giật cũng tăng lên"
  },
  {
    "con": "Một trong những nhược điểm chính của việc sử dụng ghép biến áp giữa các tầng là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mạch khuếch đại Kaskode có đặc điểm:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp đầu vào của mạch khuếch đại vượt quá mức cho phép:",
    "re": "Mạch có thể bị hỏng hoặc hoạt động không ổn định"
  },
  {
    "con": "Tần số của tín hiệu đầu vào tăng lên trong mạch lọc thông thấp:",
    "re": "Tín hiệu đầu ra sẽ giảm dần"
  },
  {
    "con": "Điện trở tải của mạch giảm xuống:",
    "re": "Dòng điện qua mạch sẽ tăng lên"
  },
  {
    "con": "Mạch điện có điện trở và cảm kháng bằng nhau:",
    "re": "Mạch sẽ có pha điện áp và dòng điện lệch nhau 45 độ"
  },
  {
    "con": "Tăng cường độ dòng điện trong mạch điện một chiều:",
    "re": "Nhiệt độ của các thành phần trong mạch sẽ tăng lên"
  },
  {
    "con": "Sử dụng tụ điện trong mạch điện xoay chiều:",
    "re": "Tụ điện sẽ tạo ra độ lệch pha giữa điện áp và dòng điện"
  },
  {
    "con": "Mạch điện có nhiều nhánh song song:",
    "re": "Điện áp trên mỗi nhánh sẽ bằng nhau"
  },
  {
    "con": "Tăng tần số trong mạch cộng hưởng:",
    "re": "Mạch sẽ đạt được điểm cộng hưởng tại tần số nhất định"
  },
  {
    "con": "Sử dụng biến trở trong mạch điện:",
    "re": "Có thể điều chỉnh điện trở và do đó điều chỉnh dòng điện trong mạch"
  },
  {
    "con": "Cho hình 20, Q1 có \\beta 1=150, Q2 có \\beta 2=100 thì dòng mối quan hệ giữa I_{E2} của Q2 và I_{B1} của Q1 như thế nào.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu điện áp đầu vào của một mạch khuếch đại thấp hơn điện áp ngưỡng thì mạch sẽ không hoạt động.",
    "re": "Mạch không khuếch đại tín hiệu"
  },
  {
    "con": "Nếu điện trở của một mạch giảm thì dòng điện chạy qua mạch sẽ tăng lên theo định luật Ohm.",
    "re": "Dòng điện tăng lên"
  },
  {
    "con": "Nếu tần số của tín hiệu đầu vào tăng thì độ lợi của mạch khuếch đại có thể giảm xuống do hiện tượng suy giảm tần số.",
    "re": "Độ lợi giảm"
  },
  {
    "con": "Nếu một tụ điện được nạp đầy thì nó sẽ không thể nạp thêm điện cho đến khi nó được xả.",
    "re": "Tụ điện không hoạt động"
  },
  {
    "con": "Nếu một cuộn dây được kết nối với nguồn điện xoay chiều thì nó sẽ tạo ra từ trường biến đổi.",
    "re": "Tạo ra từ trường biến đổi"
  },
  {
    "con": "Nếu điện áp trên một điện trở tăng thì công suất tiêu thụ của điện trở cũng sẽ tăng theo.",
    "re": "Công suất tiêu thụ tăng"
  },
  {
    "con": "Nếu một mạch điện có nhiều nhánh song song thì điện áp trên mỗi nhánh sẽ bằng nhau.",
    "re": "Điện áp đồng nhất"
  },
  {
    "con": "Nếu một transistor hoạt động trong vùng bão hòa thì nó sẽ hoạt động như một công tắc.",
    "re": "Hoạt động như công tắc"
  },
  {
    "con": "Nếu tần số của tín hiệu đầu vào vượt quá tần số cắt của bộ lọc thì tín hiệu sẽ bị suy giảm.",
    "re": "Tín hiệu bị suy giảm"
  },
  {
    "con": "Mạch khuếch đại Darlington có đặc điểm:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điện áp trên một điện trở tỉ lệ thuận với dòng điện qua nó:",
    "re": "Định luật Ohm được áp dụng"
  },
  {
    "con": "Mạch điện xoay chiều có tần số cao hơn tần số cắt của bộ lọc:",
    "re": "Tín hiệu sẽ bị giảm thiểu"
  },
  {
    "con": "Một tụ điện được nạp đầy:",
    "re": "Dòng điện qua tụ sẽ giảm về 0"
  },
  {
    "con": "Mạch điện có điện trở tương đương thấp hơn khi các điện trở được mắc song song:",
    "re": "Điện trở tổng sẽ giảm"
  },
  {
    "con": "Một cuộn cảm trong mạch điện xoay chiều sẽ tạo ra điện áp ngược chiều với dòng điện:",
    "re": "Hiện tượng cảm ứng điện từ xảy ra"
  },
  {
    "con": "Khi nhiệt độ của một chất dẫn điện tăng lên:",
    "re": "Điện trở của chất đó sẽ tăng"
  },
  {
    "con": "Mạch điện có điện áp không đổi và điện trở thay đổi:",
    "re": "Dòng điện sẽ thay đổi theo điện trở"
  },
  {
    "con": "Khi một diode được phân cực thuận:",
    "re": "Nó sẽ cho phép dòng điện đi qua"
  },
  {
    "con": "Một mạch điện có công suất tiêu thụ lớn hơn công suất cung cấp:",
    "re": "Mạch sẽ không hoạt động ổn định"
  }
]