[
  {
    "con": "Quá trình chuyển pha rắn thành pha hơi có:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một nguyên tố có số proton bằng số electron:",
    "re": "Nguyên tố đó là trung hòa về điện"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học có tính chất tỏa nhiệt:",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Một dung dịch có pH < 7:",
    "re": "Dung dịch đó là axit"
  },
  {
    "con": "Khi một chất bị hòa tan trong nước:",
    "re": "Chất đó sẽ phân tán thành các ion hoặc phân tử"
  },
  {
    "con": "Số mol của một chất được tính bằng:",
    "re": "Khối lượng chất chia cho khối lượng mol của chất đó"
  },
  {
    "con": "Khi nhiệt độ giảm xuống, áp suất của khí trong một bình kín:",
    "re": "Áp suất sẽ giảm theo định luật Boyle"
  },
  {
    "con": "Một phản ứng hóa học xảy ra khi:",
    "re": "Các liên kết hóa học giữa các nguyên tử bị phá vỡ và hình thành liên kết mới"
  },
  {
    "con": "Khi một chất có độ hòa tan cao trong nước:",
    "re": "Chất đó thường là ion hoặc phân cực"
  },
  {
    "con": "Khi một phản ứng hóa học đạt đến trạng thái cân bằng:",
    "re": "Tốc độ phản ứng thuận và phản ứng nghịch bằng nhau"
  },
  {
    "con": "Chọn phát biểu đúng: Phản ứng H_{2} (k) + \\frac{1}{2}O_{2} (k) ⇄ H_{2}O (k) có \\Delta G^{0}_{298}= -54,64 kcal. Tính Kp ở điều kiện chuẩn. Cho R = 1,987 cal/mol.K",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch có thể làm giảm hằng số cân bằng Kc",
    "re": "Câu phát biểu đúng với phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi nồng độ của một chất trong phản ứng tăng lên, tốc độ phản ứng sẽ tăng lên",
    "re": "Điều này đúng theo định luật tốc độ phản ứng"
  },
  {
    "con": "Nếu một chất điện ly hoàn toàn trong nước, thì nó sẽ tạo ra các ion tự do trong dung dịch",
    "re": "Điều này đúng với các axit và bazơ mạnh"
  },
  {
    "con": "Khi pH của dung dịch giảm, nồng độ ion H+ trong dung dịch tăng lên",
    "re": "Điều này đúng theo định nghĩa về pH"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao, thì thể tích sản phẩm sẽ giảm",
    "re": "Điều này đúng với phản ứng có số mol khí sản phẩm ít hơn số mol khí phản ứng"
  },
  {
    "con": "Khi thêm chất xúc tác vào một phản ứng, tốc độ phản ứng sẽ tăng mà không làm thay đổi hằng số cân bằng",
    "re": "Điều này đúng với vai trò của chất xúc tác"
  },
  {
    "con": "Nếu một dung dịch có nồng độ ion OH- cao, thì nó sẽ có pH lớn hơn 7",
    "re": "Điều này đúng với tính chất của dung dịch bazơ"
  },
  {
    "con": "Khi nhiệt độ giảm trong một phản ứng hấp thụ nhiệt, hằng số cân bằng Kc sẽ tăng",
    "re": "Điều này đúng theo nguyên tắc Le Chatelier"
  },
  {
    "con": "Nếu một chất có độ hòa tan thấp trong nước, thì nó sẽ có khả năng tạo thành dung dịch bão hòa",
    "re": "Điều này đúng với các chất ít tan"
  },
  {
    "con": "Chọn phương án đúng: Cho biết độ tan trong nước của Pb(IO_{3})_{2} là 4´10^{-5} mol/l ở 25^{o}C. Hãy tính tích số tan của Pb(IO_{3})_{2} ở nhiệt độ trên:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất có điểm nóng chảy thấp hơn 0°C thì chất đó có thể tồn tại ở trạng thái lỏng ở nhiệt độ phòng.",
    "re": "Chất đó có thể tồn tại ở trạng thái lỏng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ và áp suất không đổi, thì năng lượng tự do Gibbs của hệ sẽ giảm.",
    "re": "Phản ứng sẽ xảy ra theo chiều thuận"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là axit.",
    "re": "Dung dịch đó có tính axit"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, thì nguyên tố đó là carbon.",
    "re": "Nguyên tố đó là carbon"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O, thì hợp chất đó là nước.",
    "re": "Hợp chất đó là nước"
  },
  {
    "con": "Nếu một phản ứng hóa học tỏa nhiệt, thì phản ứng đó được gọi là phản ứng tỏa nhiệt.",
    "re": "Phản ứng đó tỏa nhiệt"
  },
  {
    "con": "Nếu nồng độ mol của một dung dịch tăng lên, thì áp suất hơi của dung dịch đó sẽ giảm.",
    "re": "Áp suất hơi của dung dịch đó sẽ giảm"
  },
  {
    "con": "Nếu một chất có độ dẫn điện cao, thì chất đó có khả năng chứa các ion tự do.",
    "re": "Chất đó có khả năng dẫn điện"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra với sự tham gia của chất xúc tác, thì tốc độ phản ứng sẽ tăng lên.",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Chọn phương án đúng: Trong đa số trường hợp độ điện ly a của chất điện ly:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch:",
    "re": "Phản ứng thuận sẽ bị đẩy về phía sản phẩm"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên:",
    "re": "Tốc độ phản ứng hóa học sẽ tăng lên"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7:",
    "re": "Chất đó được coi là axit"
  },
  {
    "con": "Khi một chất điện ly hoàn toàn trong nước:",
    "re": "Nó sẽ phân ly thành các ion"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao:",
    "re": "Phản ứng sẽ có xu hướng tạo ra ít sản phẩm hơn"
  },
  {
    "con": "Khi nhiệt độ giảm trong một phản ứng hóa học tỏa nhiệt:",
    "re": "Sự cân bằng sẽ dịch chuyển về phía sản phẩm"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng:",
    "re": "Chất đó có thể có đồng phân quang học"
  },
  {
    "con": "Khi một chất có độ hòa tan cao trong nước:",
    "re": "Chất đó thường là chất điện ly"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng oxi hóa khử:",
    "re": "Có sự chuyển giao electron giữa các chất"
  },
  {
    "con": "Chọn phương án đúng: Hòa tan 0,08mol ZnCl_{2} vào 1ℓ nước nguyên chất được dung dịch, đông đặc ở -0,4^{o}C. Xác định độ điện ly biểu kiến của ZnCl_{2} trong dung dịch. Cho biết hằng số nghiệm đông của nước kđ = 1,86 độ/mol",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch",
    "re": "Phản ứng sẽ dịch chuyển theo chiều thuận nếu phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên",
    "re": "Tốc độ phản ứng sẽ tăng lên theo định luật tốc độ phản ứng"
  },
  {
    "con": "Khi pH của dung dịch axit giảm",
    "re": "Nồng độ ion H+ trong dung dịch sẽ tăng lên"
  },
  {
    "con": "Khi một chất rắn tan trong dung dịch",
    "re": "Sẽ tạo ra dung dịch đồng nhất nếu chất đó hòa tan hoàn toàn"
  },
  {
    "con": "Khi nhiệt độ của một chất khí tăng lên",
    "re": "Thể tích của chất khí sẽ tăng theo định luật Charles nếu áp suất không đổi"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện áp suất cao",
    "re": "Phản ứng sẽ dịch chuyển theo chiều có ít phân tử khí hơn"
  },
  {
    "con": "Khi một chất điện ly mạnh được hòa tan trong nước",
    "re": "Nó sẽ phân ly hoàn toàn thành ion trong dung dịch"
  },
  {
    "con": "Khi có sự hiện diện của chất xúc tác trong phản ứng hóa học",
    "re": "Tốc độ phản ứng sẽ tăng lên mà không làm thay đổi trạng thái cân bằng"
  },
  {
    "con": "Khi một dung dịch có nồng độ ion OH- cao",
    "re": "Dung dịch đó sẽ có tính kiềm mạnh"
  },
  {
    "con": "Chọn phương án đúng: Phản ứng CaCO_{3} (r) -> CaO (r) + CO2 (k) là phản ứng thu nhiệt mạnh. Xét dấu \\DeltaH^{o}, \\DeltaS^{o}, \\DeltaG^{o} của phản ứng này ở 25oC:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nồng độ mol của dung dịch được tính bằng số mol chất tan chia cho thể tích dung dịch tính bằng lít:",
    "re": "Nồng độ mol là một đại lượng quan trọng trong hóa học"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện nhiệt độ và áp suất không đổi:",
    "re": "Năng lượng tự do Gibbs của hệ sẽ quyết định tính khả thi của phản ứng"
  },
  {
    "con": "Nếu một chất có độ pH nhỏ hơn 7:",
    "re": "Chất đó được coi là axit"
  },
  {
    "con": "Khi một ion kim loại phản ứng với dung dịch axit:",
    "re": "Ion kim loại sẽ giải phóng khí hidro"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng thuận nghịch:",
    "re": "Thì nó có thể diễn ra theo cả hai chiều"
  },
  {
    "con": "Khi nhiệt độ của một hệ tăng lên trong một phản ứng thu nhiệt:",
    "re": "Thì sự cân bằng của phản ứng sẽ dịch chuyển sang bên sản phẩm"
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn điểm sôi của nước:",
    "re": "Chất đó sẽ tồn tại ở trạng thái lỏng dưới áp suất khí quyển"
  },
  {
    "con": "Khi một dung dịch có nồng độ ion H+ cao:",
    "re": "Dung dịch đó sẽ có tính axit mạnh"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra với sự tham gia của chất xúc tác:",
    "re": "Thì tốc độ phản ứng sẽ tăng lên mà không làm thay đổi trạng thái của chất xúc tác"
  },
  {
    "con": "Chọn câu đúng. Phản ứng : 2A(r) + B(ℓ) = 2C(r) + D(ℓ) có:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất nào có công thức hóa học là H2O:",
    "re": "Là nước"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C ở áp suất 1 atm:",
    "re": "Chất đó có thể là một chất lỏng dễ bay hơi"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kiềm:",
    "re": "Thì pH của dung dịch sẽ lớn hơn 7"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6:",
    "re": "Thì nguyên tố đó là Carbon"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol là 1M:",
    "re": "Thì có 1 mol chất tan trong 1 lít dung môi"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt:",
    "re": "Thì năng lượng được giải phóng ra môi trường"
  },
  {
    "con": "Nếu một chất có tính axit mạnh:",
    "re": "Thì nó sẽ có khả năng cho proton (H+) dễ dàng"
  },
  {
    "con": "Nếu một hợp chất có công thức C2H6:",
    "re": "Thì hợp chất đó là Ethane"
  },
  {
    "con": "Nếu một nguyên tử có số electron bằng số proton:",
    "re": "Thì nguyên tử đó là trung hòa về điện"
  },
  {
    "con": "Chọn phương án đúng: Để phản ứng hóa học xảy ra, hệ phải tiêu tốn một công 210kJ và nội năng của hệ giảm 20kJ. Hiệu ứng nhiệt đẳng áp của phản ứng có giá trị:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất được đun nóng, nhiệt độ của chất đó sẽ tăng lên.",
    "re": "Năng lượng nhiệt được cung cấp cho chất"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ và áp suất không đổi, thì năng lượng tự do Gibbs của hệ sẽ giảm.",
    "re": "Phản ứng sẽ xảy ra tự phát"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên, thì tốc độ phản ứng hóa học cũng sẽ tăng.",
    "re": "Do có nhiều phân tử va chạm hơn"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước, thì nó sẽ dễ dàng hòa tan trong dung môi này.",
    "re": "Tạo thành dung dịch đồng nhất"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7, thì dung dịch đó được coi là axit.",
    "re": "Có khả năng cho proton (H+) vào dung dịch"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì nhiệt độ của môi trường xung quanh sẽ tăng lên.",
    "re": "Năng lượng được giải phóng ra ngoài"
  },
  {
    "con": "Khi một chất rắn được hòa tan trong dung môi, thì các phân tử của chất rắn sẽ tách rời nhau.",
    "re": "Tạo thành dung dịch"
  },
  {
    "con": "Nếu một phản ứng hóa học có năng lượng kích hoạt cao, thì tốc độ phản ứng sẽ chậm.",
    "re": "Cần nhiều năng lượng để bắt đầu phản ứng"
  },
  {
    "con": "Khi một chất bị oxi hóa, thì nó sẽ mất electron.",
    "re": "Trở thành ion dương hoặc giảm hóa trị"
  },
  {
    "con": "Chọn phát biểu đúng: Đối với phản ứng một chiều, tốc độ phản ứng sẽ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhiệt độ tăng lên, tốc độ phản ứng hóa học sẽ:",
    "re": "Tăng lên do năng lượng va chạm giữa các phân tử tăng"
  },
  {
    "con": "Nếu nồng độ của một chất phản ứng tăng lên, thì:",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Khi áp suất tăng trong một phản ứng khí, thì:",
    "re": "Tốc độ phản ứng sẽ tăng nếu số mol khí sản phẩm nhiều hơn số mol khí phản ứng"
  },
  {
    "con": "Nếu một chất xúc tác được thêm vào phản ứng, thì:",
    "re": "Tốc độ phản ứng sẽ tăng mà không làm thay đổi trạng thái cân bằng"
  },
  {
    "con": "Khi pH của dung dịch axit giảm, thì:",
    "re": "Nồng độ ion H+ trong dung dịch sẽ tăng"
  },
  {
    "con": "Nếu một phản ứng là phản ứng tỏa nhiệt, thì:",
    "re": "Nhiệt độ của môi trường xung quanh sẽ tăng lên"
  },
  {
    "con": "Khi một chất tan trong nước, nếu nhiệt độ tăng, thì:",
    "re": "Độ hòa tan của chất đó thường sẽ tăng lên"
  },
  {
    "con": "Nếu một phản ứng xảy ra trong điều kiện yếm khí, thì:",
    "re": "Sản phẩm của phản ứng có thể khác so với điều kiện có oxy"
  },
  {
    "con": "Khi một ion dương và một ion âm gặp nhau, thì:",
    "re": "Chúng sẽ tạo thành một liên kết ion"
  },
  {
    "con": "Chọn phương án đúng: Tính nồng độ Pb^{2+} bão hòa trong dung dịch KI 0,1M. Biết tích số tan của PbI2 bằng 1,4.10^{-8}",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nắm vững quy tắc bảo toàn khối lượng trong phản ứng hóa học",
    "re": "Tổng khối lượng các chất phản ứng bằng tổng khối lượng các sản phẩm"
  },
  {
    "con": "Sử dụng định luật Boyle cho khí lý tưởng",
    "re": "Khi nhiệt độ không đổi, áp suất và thể tích của khí tỉ lệ nghịch với nhau"
  },
  {
    "con": "Áp dụng định luật Avogadro",
    "re": "Ở cùng nhiệt độ và áp suất, các thể tích khí khác nhau chứa cùng số mol phân tử"
  },
  {
    "con": "Biết cách tính nồng độ mol của dung dịch",
    "re": "Nồng độ mol bằng số mol chất tan chia cho thể tích dung dịch (lít)"
  },
  {
    "con": "Hiểu về phản ứng oxi hóa - khử",
    "re": "Chất bị oxi hóa mất electron, trong khi chất bị khử nhận electron"
  },
  {
    "con": "Nắm rõ khái niệm pH trong dung dịch",
    "re": "pH < 7 là dung dịch axit, pH = 7 là dung dịch trung tính, pH > 7 là dung dịch bazơ"
  },
  {
    "con": "Sử dụng quy tắc octet trong hóa học",
    "re": "Nguyên tử sẽ tham gia phản ứng để đạt được cấu hình electron giống khí hiếm, thường là 8 electron ở lớp ngoài cùng"
  },
  {
    "con": "Biết cách xác định loại liên kết hóa học",
    "re": "Liên kết ion xảy ra giữa kim loại và phi kim, trong khi liên kết cộng hóa trị xảy ra giữa hai phi kim"
  },
  {
    "con": "Áp dụng định luật Hess",
    "re": "Năng lượng tổng cộng của phản ứng hóa học không phụ thuộc vào con đường phản ứng mà chỉ phụ thuộc vào trạng thái đầu và trạng thái cuối"
  },
  {
    "con": "Quá trình phản ứng hóa học xảy ra khi các chất phản ứng tương tác với nhau và tạo ra sản phẩm mới.",
    "re": "Sản phẩm có thể có tính chất khác biệt so với các chất phản ứng ban đầu."
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thường làm tăng tốc độ phản ứng.",
    "re": "Điều này xảy ra do các phân tử có năng lượng cao hơn, dẫn đến nhiều va chạm hơn."
  },
  {
    "con": "Khi một dung dịch bão hòa được làm nguội, các tinh thể có thể hình thành.",
    "re": "Điều này xảy ra do sự giảm khả năng hòa tan của chất trong dung môi."
  },
  {
    "con": "Nếu một chất có độ pH dưới 7, thì chất đó được coi là axit.",
    "re": "Axit có khả năng cho proton (H+) vào dung dịch."
  },
  {
    "con": "Khi một phản ứng hóa học đạt đến trạng thái cân bằng, thì tốc độ phản ứng thuận và phản ứng nghịch bằng nhau.",
    "re": "Nồng độ của các chất phản ứng và sản phẩm không thay đổi theo thời gian."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng, thì chất đó có thể tồn tại dưới dạng đồng phân quang học.",
    "re": "Điều này có nghĩa là chất đó có thể tồn tại dưới hai dạng hình học khác nhau."
  },
  {
    "con": "Khi một chất điện ly hoàn toàn trong nước, thì nó sẽ phân ly thành các ion.",
    "re": "Điều này dẫn đến sự gia tăng khả năng dẫn điện của dung dịch."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì nó sẽ giải phóng năng lượng dưới dạng nhiệt.",
    "re": "Điều này có thể làm tăng nhiệt độ của môi trường xung quanh."
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên, thì áp suất hơi của dung dịch sẽ giảm.",
    "re": "Điều này xảy ra do sự gia tăng tương tác giữa các phân tử trong dung dịch."
  },
  {
    "con": "Chọn câu đúng. Quá trình hoà tan tinh thể KOH trong nước xảy ra kèm theo sự thay đổi entropi chuyển pha (DScp) và entropi solvat hóa (DSs) như sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hệ có tính chất giống nhau tại các điểm khác nhau của hệ. Hệ được cấu tạo bởi một pha duy nhất là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất rắn có cấu trúc phân tử chặt chẽ và không thể thay đổi hình dạng dễ dàng:",
    "re": "Chất rắn có hình dạng xác định"
  },
  {
    "con": "Khi nhiệt độ tăng, năng lượng động học của các phân tử trong chất lỏng sẽ tăng:",
    "re": "Chất lỏng sẽ có xu hướng bay hơi nhanh hơn"
  },
  {
    "con": "Khi một chất hòa tan vào dung môi, nếu nồng độ của chất hòa tan tăng lên:",
    "re": "Độ hòa tan của chất có thể giảm xuống"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng sẽ bằng tổng khối lượng của các sản phẩm:",
    "re": "Định luật bảo toàn khối lượng được áp dụng"
  },
  {
    "con": "Nếu một chất có độ pH nhỏ hơn 7:",
    "re": "Chất đó được coi là axit"
  },
  {
    "con": "Khi một chất bị oxi hóa, nó sẽ mất electron:",
    "re": "Chất đó sẽ tăng số oxi hóa"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ và áp suất không đổi:",
    "re": "Năng lượng tự do Gibbs sẽ quyết định tính khả thi của phản ứng"
  },
  {
    "con": "Khi một dung dịch có nồng độ ion H+ cao:",
    "re": "Dung dịch đó có tính axit mạnh"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước:",
    "re": "Chất đó sẽ bay hơi nhanh hơn khi tiếp xúc với nước"
  },
  {
    "con": "Hiệu ứng nhiệt của phản ứng thuận (\\Delta HT) và hiệu ứng nhiệt của phản ứng nghịch (\\DeltaHN):",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất có điểm nóng chảy thấp hơn điểm sôi:",
    "re": "Chất đó sẽ tồn tại ở trạng thái khí ở nhiệt độ cao hơn điểm nóng chảy"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng:",
    "re": "Tốc độ phản ứng hóa học sẽ tăng lên"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao:",
    "re": "Thì tốc độ phản ứng sẽ thường nhanh hơn so với điều kiện nhiệt độ thấp"
  },
  {
    "con": "Khi pH của dung dịch giảm:",
    "re": "Dung dịch đó trở nên axit hơn"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước:",
    "re": "Chất đó sẽ dễ dàng phân tán trong dung dịch"
  },
  {
    "con": "Khi một phản ứng hóa học đạt đến trạng thái cân bằng:",
    "re": "Tốc độ phản ứng thuận và phản ứng nghịch sẽ bằng nhau"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử phức tạp:",
    "re": "Chất đó có thể có nhiều tính chất hóa học khác nhau"
  },
  {
    "con": "Khi nhiệt độ của một hệ thống tăng lên:",
    "re": "Năng lượng động học của các phân tử trong hệ thống cũng tăng lên"
  },
  {
    "con": "Nếu một chất là chất điện ly mạnh:",
    "re": "Chất đó sẽ phân ly hoàn toàn trong dung dịch"
  },
  {
    "con": "Khi đun sôi một ấm nước, nhiệt được cung cấp vào hệ, hệ mất vật chất ra môi trường ngoài dưới dạng hơi nước. Quá trình xảy ra thuộc:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất tan trong nước, nó phân tán thành các ion hoặc phân tử nhỏ hơn, dẫn đến sự hình thành dung dịch.",
    "re": "Dung dịch được tạo ra"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên, động năng của các phân tử trong chất đó cũng tăng theo.",
    "re": "Chất sẽ có xu hướng chuyển từ trạng thái rắn sang lỏng hoặc khí"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, năng lượng có thể được giải phóng hoặc hấp thụ, dẫn đến sự thay đổi nhiệt độ của hệ.",
    "re": "Phản ứng có thể là tỏa nhiệt hoặc thu nhiệt"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên, tốc độ phản ứng hóa học thường cũng sẽ tăng theo.",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Khi một chất có độ pH thấp hơn 7, nó được coi là axit.",
    "re": "Chất đó có khả năng cho proton (H+) vào dung dịch"
  },
  {
    "con": "Khi một chất có độ pH cao hơn 7, nó được coi là bazơ.",
    "re": "Chất đó có khả năng nhận proton (H+) từ dung dịch"
  },
  {
    "con": "Khi một phản ứng hóa học đạt đến trạng thái cân bằng, tốc độ phản ứng thuận và phản ứng nghịch bằng nhau.",
    "re": "Nồng độ các chất tham gia và sản phẩm không thay đổi theo thời gian"
  },
  {
    "con": "Khi một chất bị oxi hóa, nó mất electron.",
    "re": "Chất đó tăng số oxi hóa"
  },
  {
    "con": "Khi một chất bị khử, nó nhận electron.",
    "re": "Chất đó giảm số oxi hóa"
  },
  {
    "con": "Khi đun một ấm nước trên bếp điện từ 20oC đến 100oC nước bốc hơi. Thuộc hệ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất rắn được nung nóng, thể tích của nó thường tăng lên. Thuộc hệ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một dung dịch axit được pha loãng bằng nước, nồng độ axit giảm. Thuộc hệ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm. Thuộc hệ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhiệt độ của một khí tăng lên, áp suất của nó cũng tăng nếu thể tích không đổi. Thuộc hệ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất hòa tan trong nước, nó tạo thành dung dịch. Thuộc hệ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, năng lượng có thể được giải phóng hoặc hấp thụ. Thuộc hệ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất có độ pH dưới 7, nó được coi là axit. Thuộc hệ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất có độ pH trên 7, nó được coi là bazơ. Thuộc hệ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi các nguyên tử kết hợp với nhau, chúng tạo thành phân tử. Thuộc hệ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan các muối NaCl, (NH_{4})_{2}SO_{4}, AlCl_{3}, K_2SO_4.Al_2(SO_4).24H_2O, BaSO_4, AgN0_3 vào nước cất thì dung dịch nào có môi trường pH < 7:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi đun nóng nước đến 100 độ C ở áp suất khí quyển thì nước sẽ chuyển thành hơi nước.",
    "re": "Quá trình bay hơi xảy ra"
  },
  {
    "con": "Khi một nguyên tố có số hiệu nguyên tử lớn hơn 92 thì nó được coi là nguyên tố phóng xạ.",
    "re": "Nguyên tố đó có khả năng phân rã phóng xạ"
  },
  {
    "con": "Khi một dung dịch có nồng độ ion H+ cao hơn 1 x 10^-7 M thì dung dịch đó có tính axit.",
    "re": "Dung dịch có pH < 7"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra mà không có sự thay đổi về khối lượng thì phản ứng đó tuân theo định luật bảo toàn khối lượng.",
    "re": "Khối lượng các chất phản ứng bằng khối lượng các sản phẩm"
  },
  {
    "con": "Khi một hợp chất ion được hòa tan trong nước thì các ion sẽ tách rời nhau và phân tán trong dung dịch.",
    "re": "Dung dịch sẽ dẫn điện tốt hơn"
  },
  {
    "con": "Khi nhiệt độ của một khí tăng lên trong khi thể tích không đổi thì áp suất của khí sẽ tăng.",
    "re": "Định luật Gay-Lussac được áp dụng"
  },
  {
    "con": "Khi một chất rắn tan trong dung môi mà không tạo ra nhiệt thì quá trình đó được gọi là quá trình tan thu nhiệt.",
    "re": "Nhiệt độ của dung dịch không thay đổi"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện không có oxy thì đó được gọi là phản ứng yếm khí.",
    "re": "Sản phẩm phản ứng có thể khác so với phản ứng có oxy"
  },
  {
    "con": "Khi một nguyên tố có khả năng nhận electron thì nó được gọi là chất oxi hóa.",
    "re": "Chất đó có khả năng làm tăng mức oxi hóa của các chất khác"
  },
  {
    "con": "Nhiệt sinh của một đơn chất bền ở điều kiện chuẩn:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một hợp chất ion được hình thành từ sự kết hợp của kim loại và phi kim:",
    "re": "Hợp chất đó có tính chất dẫn điện trong dung dịch"
  },
  {
    "con": "Số nguyên tử trong một phân tử nước là 3:",
    "re": "Phân tử nước có công thức hóa học H2O"
  },
  {
    "con": "Nhiệt độ sôi của nước là 100 độ C ở áp suất 1 atm:",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Một phản ứng hóa học xảy ra khi các chất phản ứng tương tác với nhau:",
    "re": "Sẽ tạo ra các sản phẩm mới với tính chất khác biệt"
  },
  {
    "con": "Khối lượng mol của một chất là khối lượng của một mol phân tử của chất đó:",
    "re": "Giá trị này được tính bằng đơn vị gam/mol"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng:",
    "re": "Điều này xảy ra do các phân tử có năng lượng cao hơn và va chạm nhiều hơn"
  },
  {
    "con": "Một dung dịch có pH < 7 được coi là axit:",
    "re": "Dung dịch đó có khả năng cho proton (H+) vào môi trường"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có cùng số electron hóa trị:",
    "re": "Chúng có tính chất hóa học tương tự nhau"
  },
  {
    "con": "Khi một chất bị oxi hóa, nó sẽ mất electron:",
    "re": "Chất đó sẽ tăng số oxi hóa của mình"
  },
  {
    "con": "Ở cùng điều kiện, trong số các chất sau, chất nào có entropi lớn nhất? Chất (1): O (k) ; Chất (2): O_2(k) ; Chất (3): O_3 (k)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhiệt độ tăng, áp suất của một khí lý tưởng trong một bình kín không thay đổi",
    "re": "Thể tích của khí sẽ tăng"
  },
  {
    "con": "Khi một chất tan trong nước, nếu nhiệt độ của dung dịch tăng lên",
    "re": "Thì khả năng hòa tan của chất đó có thể tăng hoặc giảm tùy thuộc vào bản chất của chất tan"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện tiêu chuẩn và có ΔH < 0",
    "re": "Phản ứng đó là phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên, nếu nhiệt độ không thay đổi",
    "re": "Thì áp suất của hơi trên bề mặt dung dịch sẽ tăng"
  },
  {
    "con": "Nếu một chất có độ âm điện cao hơn một chất khác",
    "re": "Thì chất đó có khả năng thu hút electron mạnh hơn"
  },
  {
    "con": "Khi một ion dương và một ion âm kết hợp với nhau để tạo thành một hợp chất",
    "re": "Thì năng lượng mạng lưới sẽ được giải phóng"
  },
  {
    "con": "Nếu pH của một dung dịch axit giảm xuống dưới 7",
    "re": "Thì dung dịch đó trở nên axit hơn"
  },
  {
    "con": "Khi một chất rắn hòa tan trong dung môi, nếu quá trình này là thuận nghịch",
    "re": "Thì có thể xảy ra sự cân bằng giữa chất tan và chất rắn không tan"
  },
  {
    "con": "Nếu một phản ứng hóa học có ΔG < 0",
    "re": "Thì phản ứng đó là tự phát"
  },
  {
    "con": "Ở 8500C phản ứng: H_2O(k) + CO(k)  \\rightarrow  H_2(k) + CO_2(k). Phản ứng có hệ số cân bằng là 1. Ở nhiệt độ đó nếu trộn 1 mol CO + 1 mol H_2O + 1 mol CO_2 + 2 mol H_2 vào bình dung tích 10l thì phản ứng sẽ tự xảy ra",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học C_6H_{12}O_6 thì nó là glucose",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu pH của dung dịch là 7 thì dung dịch đó được coi là trung tính",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số proton là 6 thì nó là carbon",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch, thì phản ứng sẽ dịch chuyển theo chiều tỏa nhiệt",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol là 1M thì trong 1 lít dung dịch có 1 mol chất tan",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí, thì sản phẩm có thể khác so với điều kiện có oxy",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất ion có điện tích dương thì nó được gọi là cation",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra với sự tham gia của chất xúc tác, thì tốc độ phản ứng sẽ tăng lên",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số oxi hóa là +1 trong hợp chất, thì nó có thể là natri trong natri clorua (NaCl)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Ở 200C áp suất hơi nước bão hòa là 17,5 mmHg. Tìm áp suất hơi bão hòa của dung dịch chứa 0,2 mol đường hòa tan trong 450 gam nước",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhiệt độ tăng, năng lượng động học của các phân tử trong chất lỏng cũng tăng",
    "re": "Chất lỏng sẽ có xu hướng bay hơi nhiều hơn"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước, thì chất đó thường là chất ion hoặc phân cực",
    "re": "Chất đó sẽ dễ dàng hòa tan trong nước"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7, thì dung dịch đó được coi là axit",
    "re": "Dung dịch sẽ có tính axit mạnh hơn"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng sẽ tăng lên",
    "re": "Phản ứng sẽ diễn ra nhanh hơn"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng, thì áp suất hơi của dung dịch sẽ giảm",
    "re": "Điều này xảy ra do hiệu ứng Raoult"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp, thì chất đó thường có lực liên kết yếu giữa các phân tử",
    "re": "Chất đó sẽ dễ dàng chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Khi một chất phản ứng với một chất khác để tạo thành sản phẩm mới, thì năng lượng có thể được giải phóng hoặc hấp thụ",
    "re": "Phản ứng đó có thể là phản ứng tỏa nhiệt hoặc phản ứng thu nhiệt"
  },
  {
    "con": "Nếu một dung dịch có nồng độ ion H+ cao, thì dung dịch đó sẽ có pH thấp",
    "re": "Dung dịch sẽ có tính axit mạnh"
  },
  {
    "con": "Khi một chất rắn hòa tan trong dung môi, thì các phân tử của chất rắn sẽ tách rời và phân tán trong dung môi",
    "re": "Dung dịch sẽ trở nên đồng nhất"
  },
  {
    "con": "Phản ứng được thực hiện trong bình cầu thông với khí quyển bên ngoài",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất có nhiệt độ nóng chảy thấp hơn nhiệt độ phòng",
    "re": "Sẽ tồn tại ở trạng thái lỏng hoặc khí"
  },
  {
    "con": "Một chất có độ pH dưới 7",
    "re": "Được coi là axit"
  },
  {
    "con": "Một phản ứng hóa học xảy ra giữa hai chất",
    "re": "Sẽ tạo ra sản phẩm mới"
  },
  {
    "con": "Năng lượng được cung cấp cho một phản ứng endoterm",
    "re": "Sẽ làm tăng nhiệt độ của hệ thống"
  },
  {
    "con": "Sự hòa tan của muối trong nước",
    "re": "Sẽ tạo ra dung dịch điện ly"
  },
  {
    "con": "Một nguyên tố có số proton bằng số electron",
    "re": "Sẽ có điện tích trung hòa"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học",
    "re": "Sẽ thường tăng lên"
  },
  {
    "con": "Một hợp chất ion được tạo thành từ kim loại và phi kim",
    "re": "Sẽ có điểm nóng chảy cao"
  },
  {
    "con": "Khi nồng độ của một chất trong phản ứng tăng",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Phản ứng phân huỷ Clo phân tử thành Clo nguyên tử có K_C = 4. 10^-4. Nồng độ nguyên tử Clo khi cân bằng là 0,04 mol/l. Phần trăm Clo đã bị phân huỷ là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nồng độ ion H+ trong dung dịch axit mạnh là 0,1 mol/l. pH của dung dịch này sẽ là:",
    "re": "1"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hoá học thường sẽ tăng lên. Điều này xảy ra do:",
    "re": "Các phân tử có năng lượng cao hơn và va chạm nhiều hơn"
  },
  {
    "con": "Trong phản ứng oxi hoá khử, nếu một chất bị oxi hoá thì:",
    "re": "Chất đó sẽ mất electron"
  },
  {
    "con": "Khi nồng độ của một chất trong phản ứng cân bằng tăng lên, theo nguyên tắc Le Chatelier, hệ thống sẽ:",
    "re": "Dịch chuyển về phía phản ứng tiêu thụ chất đó"
  },
  {
    "con": "Nếu một dung dịch có pH = 7, thì dung dịch đó được coi là:",
    "re": "Trung tính"
  },
  {
    "con": "Khi một chất rắn tan trong nước, nếu nhiệt độ tăng lên, độ tan của chất đó thường sẽ:",
    "re": "Tăng lên"
  },
  {
    "con": "Trong phản ứng tổng hợp, nếu hai chất A và B phản ứng để tạo ra C, thì:",
    "re": "C là sản phẩm của phản ứng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ ion OH- là 0,01 mol/l, thì pOH của dung dịch đó sẽ là:",
    "re": "2"
  },
  {
    "con": "Khi một phản ứng hoá học xảy ra trong điều kiện áp suất cao, theo nguyên tắc Le Chatelier, hệ thống sẽ:",
    "re": "Dịch chuyển về phía có ít phân tử khí hơn"
  },
  {
    "con": "Quá trình biến đổi được thực hiện trong điều kiện T = const là quá trình:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước, thì chất đó sẽ bay hơi ở nhiệt độ phòng.",
    "re": "Chất đó có thể tồn tại ở trạng thái khí trong điều kiện bình thường."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kín, thì tổng khối lượng của các chất phản ứng sẽ bằng tổng khối lượng của các sản phẩm.",
    "re": "Đây là định luật bảo toàn khối lượng."
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là axit.",
    "re": "Dung dịch đó có khả năng cho proton (H+) vào môi trường."
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên, thì động năng của các phân tử trong chất đó cũng sẽ tăng.",
    "re": "Chất đó sẽ có xu hướng chuyển động nhanh hơn."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng, thì chất đó có thể có đồng phân quang học.",
    "re": "Chất đó có khả năng quay mặt phẳng của ánh sáng phân cực."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra với sự giải phóng nhiệt, thì phản ứng đó được gọi là phản ứng tỏa nhiệt.",
    "re": "Nhiệt độ của môi trường xung quanh có thể tăng lên."
  },
  {
    "con": "Nếu nồng độ của một chất trong dung dịch tăng lên, thì tốc độ phản ứng hóa học có thể tăng lên.",
    "re": "Điều này xảy ra do tần suất va chạm giữa các phân tử tăng."
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước, thì chất đó thường là ion hoặc phân cực.",
    "re": "Chất đó có khả năng tương tác tốt với phân tử nước."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao, thì thể tích của các chất tham gia phản ứng có thể giảm.",
    "re": "Điều này có thể dẫn đến sự chuyển dịch cân bằng phản ứng theo hướng tạo ra ít phân tử hơn."
  },
  {
    "con": "Tại nhiệt độ xác định phản ứng 2A(k) D B(k) có hệ số cân bằng là 0,25. Cho nồng độ ban đầu của A là 4M. Vậy nồng độ các chất lúc cân bằng là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có số oxi hóa cao hơn trong phản ứng oxi hóa khử, thì chất đó sẽ bị khử.",
    "re": "Chất đó sẽ mất electron"
  },
  {
    "con": "Nếu nhiệt độ tăng trong một phản ứng tỏa nhiệt, thì tốc độ phản ứng sẽ tăng lên.",
    "re": "Sự chuyển hóa của chất phản ứng sẽ nhanh hơn"
  },
  {
    "con": "Nếu nồng độ của một chất trong dung dịch tăng lên, thì áp suất hơi của dung dịch sẽ giảm.",
    "re": "Điều này xảy ra do hiệu ứng Raoult"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là axit.",
    "re": "Dung dịch đó có khả năng cho proton"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện không có không khí, thì sản phẩm phản ứng sẽ không bị oxi hóa.",
    "re": "Sản phẩm sẽ giữ nguyên tính chất ban đầu"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C, thì chất đó có thể bay hơi ở nhiệt độ phòng.",
    "re": "Chất đó có thể tồn tại dưới dạng hơi"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì có thể xảy ra cả phản ứng tiến và phản ứng lùi.",
    "re": "Hệ thống sẽ đạt đến trạng thái cân bằng"
  },
  {
    "con": "Nếu một ion dương kết hợp với một ion âm, thì chúng sẽ tạo thành một hợp chất ion.",
    "re": "Hợp chất này sẽ có tính chất điện ly trong nước"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử phức tạp, thì nó có thể có nhiều đồng phân.",
    "re": "Điều này dẫn đến sự đa dạng trong tính chất hóa học"
  },
  {
    "con": "Tính năng lượng liên kết của CH_3OH:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học tỏa nhiệt:",
    "re": "Phản ứng sẽ diễn ra nhanh hơn"
  },
  {
    "con": "Số mol của một chất trong dung dịch được tính bằng nồng độ nhân với thể tích:",
    "re": "Kết quả sẽ cho biết số mol của chất đó"
  },
  {
    "con": "Một nguyên tố có số proton khác nhau sẽ tạo ra các đồng vị:",
    "re": "Các đồng vị này sẽ có tính chất hóa học tương tự nhau"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7:",
    "re": "Dung dịch trở nên axit hơn"
  },
  {
    "con": "Khi một phản ứng hóa học đạt trạng thái cân bằng:",
    "re": "Tốc độ phản ứng thuận và phản ứng nghịch bằng nhau"
  },
  {
    "con": "Khi nhiệt độ của một chất khí tăng lên trong một bình kín:",
    "re": "Áp suất của chất khí sẽ tăng"
  },
  {
    "con": "Khi một ion dương kết hợp với một ion âm:",
    "re": "Chúng sẽ tạo thành một hợp chất ion"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước:",
    "re": "Dung dịch sẽ có nồng độ của chất hòa tan"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong môi trường không có oxy:",
    "re": "Phản ứng sẽ là phản ứng yếm khí"
  },
  {
    "con": "Tính DH của phản ứng: C_2H_4(K) + H_2(K) → C_2H_6(K) ở 298^0K biết nhiệt sinh của các chất như sau: C_2H_4(K): + 52,30(kJ/mol); C_2H_6(K): -84,68 (kJ/mol)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng thường tăng lên",
    "re": "Điều này xảy ra do năng lượng va chạm giữa các phân tử tăng lên"
  },
  {
    "con": "Nếu nồng độ của một chất trong phản ứng tăng lên thì tốc độ phản ứng sẽ tăng lên",
    "re": "Điều này xảy ra do có nhiều phân tử hơn tham gia vào va chạm"
  },
  {
    "con": "Nếu một chất xúc tác được thêm vào phản ứng thì năng lượng kích hoạt của phản ứng sẽ giảm",
    "re": "Điều này giúp tăng tốc độ phản ứng mà không làm thay đổi sản phẩm"
  },
  {
    "con": "Nếu pH của dung dịch axit giảm thì nồng độ ion H+ trong dung dịch sẽ tăng lên",
    "re": "Điều này dẫn đến tính axit mạnh hơn của dung dịch"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch thì có thể xảy ra cả phản ứng tiến và phản ứng lùi",
    "re": "Điều này cho phép hệ thống đạt đến trạng thái cân bằng"
  },
  {
    "con": "Nếu nhiệt độ của một hệ thống tăng lên trong một phản ứng tỏa nhiệt thì cân bằng sẽ dịch chuyển sang bên sản phẩm",
    "re": "Điều này theo nguyên tắc Le Chatelier"
  },
  {
    "con": "Nếu một dung dịch có nồng độ ion OH- cao thì dung dịch đó sẽ có tính kiềm",
    "re": "Điều này có thể được xác định bằng pH lớn hơn 7"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước thì nó sẽ dễ dàng phân tán trong dung dịch",
    "re": "Điều này giúp tăng cường khả năng phản ứng của chất đó"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao thì thể tích của sản phẩm có thể giảm",
    "re": "Điều này có thể dẫn đến việc tăng cường hiệu suất của phản ứng"
  },
  {
    "con": "Tính pH của dd NH_3 0,1M, biết Kb của NH_3 = 1,8.10^-5 và bỏ qua sự phân li của nước",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biết rằng nước là dung môi phân cực, khi hòa tan NaCl vào nước, ion Na+ và Cl- sẽ tách ra",
    "re": "Quá trình phân li xảy ra"
  },
  {
    "con": "Khi nhiệt độ tăng, nếu áp suất không đổi, thì thể tích của khí sẽ tăng theo định luật Charles",
    "re": "Thể tích khí tăng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ và áp suất không đổi, thì năng lượng tự do Gibbs sẽ quyết định tính khả thi của phản ứng",
    "re": "Phản ứng có thể xảy ra"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng, nếu nhiệt độ không thay đổi, thì áp suất hơi của dung dịch sẽ giảm",
    "re": "Áp suất hơi giảm"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước, thì nó sẽ dễ dàng phân li thành ion trong dung dịch",
    "re": "Chất sẽ tạo ra dung dịch điện ly tốt"
  },
  {
    "con": "Khi một chất rắn tan trong dung môi, nếu nhiệt độ của dung môi tăng, thì tốc độ hòa tan của chất rắn sẽ tăng",
    "re": "Tốc độ hòa tan tăng"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì nhiệt độ của hệ thống sẽ tăng lên",
    "re": "Nhiệt độ hệ thống tăng"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7, thì dung dịch đó được coi là axit",
    "re": "Dung dịch axit"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng, thì nó có khả năng quay vòng ánh sáng phân cực",
    "re": "Chất là quang hoạt"
  },
  {
    "con": "Tính lượng nhiệt cần cung cấp cho 2 mol nước khi nhiệt độ tăng từ 10^0C đến 20^0C trong điều kiện áp suất không đổi. Biết Cp = 95,3 J/mol.K.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O, thì nó là nước.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử là 6, thì nó là carbon.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu pH của một dung dịch là 7, thì dung dịch đó được coi là trung tính.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng thường tăng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước, thì nó sẽ bay hơi ở nhiệt độ phòng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol là 1M, thì có 1 mol chất tan trong 1 lít dung môi.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có cấu hình electron là 1s2 2s2 2p6, thì nó là khí hiếm neon.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì nó giải phóng năng lượng dưới dạng nhiệt.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất ion có công thức NaCl, thì nó được hình thành từ ion natri và ion clorua.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tính khối lượng nguyên chất NaOH cần lấy để pha thành 0,1 lít dd NaOH 0,100N. (Biết: Na:23; O:16; H:1)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biết rằng nước có khối lượng riêng là 1 g/ml, thì 1 lít nước có khối lượng là 1000 g",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước, thì chất đó sẽ bay hơi ở nhiệt độ phòng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng sẽ tăng lên",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu nồng độ của một dung dịch tăng, thì khả năng phản ứng của các phân tử trong dung dịch cũng tăng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7, thì chất đó được coi là axit",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có độ pH trên 7, thì chất đó được coi là bazơ",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì nó có thể diễn ra theo cả hai chiều",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử lớn hơn 92, thì nó được coi là nguyên tố phóng xạ",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao, thì nó có khả năng dẫn điện tốt hơn so với dung dịch có nồng độ mol thấp",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Viết sơ đồ các pin (nguyên tố Gavani) tương ứng với phản ứng và nêu rõ anot, catot, dấu điện cực. 2Ag+ + Cu0 D 2Ag0 + Cu^{2+}",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Xác định số nguyên tử trong một phân tử nước (H2O) là 2 hydro và 1 oxy",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sử dụng công thức hóa học để tính khối lượng mol của NaCl (natri clorua) là 58.44 g/mol",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biết rằng pH của dung dịch axit mạnh là dưới 7, nếu pH = 3 thì dung dịch đó là axit",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng sẽ tăng lên",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi thêm nước vào dung dịch muối, nếu nồng độ giảm thì dung dịch đó được gọi là loãng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C, thì chất đó có thể tồn tại ở trạng thái lỏng ở nhiệt độ phòng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một nguyên tố có số oxi hóa dương, nếu nó tham gia phản ứng khử thì nó sẽ bị giảm số oxi hóa",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol là 1M, thì trong 1 lít dung dịch có 1 mol chất tan",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì có thể xảy ra cả phản ứng tiến và phản ứng lùi",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Xét phản ứng diễn ra trong bình kín V = 1lit N2O4(k) D 2NO2. Ban đầu có 0,02mol N2O4 lúc cân bằng có 0,015mol N2O4. Vậy",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có nhiệt độ cao hơn nhiệt độ sôi của nó, thì",
    "re": "chất đó sẽ chuyển sang trạng thái khí"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì",
    "re": "dung dịch đó được coi là axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện tiêu chuẩn (STP), thì",
    "re": "mỗi mol khí chiếm thể tích 22,4 lít"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước, thì",
    "re": "chất đó có khả năng hòa tan tốt trong dung môi nước"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì",
    "re": "có thể xảy ra cả hai chiều phản ứng"
  },
  {
    "con": "Nếu nồng độ của một chất trong dung dịch tăng lên, thì",
    "re": "tốc độ phản ứng có thể tăng lên theo định luật tốc độ"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử cao hơn, thì",
    "re": "nguyên tố đó có nhiều proton hơn trong hạt nhân"
  },
  {
    "con": "Nếu một hợp chất có liên kết ion, thì",
    "re": "hợp chất đó thường có điểm nóng chảy cao và dẫn điện khi hòa tan trong nước"
  },
  {
    "con": "Nếu một phản ứng hóa học tỏa nhiệt, thì",
    "re": "nó được gọi là phản ứng tỏa nhiệt (exothermic)"
  },
  {
    "con": "\\Delta H^0_{298} ghi trong các phản ứng sau:\n MgO(r) + CO_2(k) = MgCO_3(r) \\Delta H^0_{298} = a(kJ)\n 2H_2(k) + O_2(k) = 2H_2O(l) \\Delta H^0_{298} = b(kJ)\n H2(k) + \\frac{1}{2}O_2(k) = H_2O(l) \\Delta H^0_{298} = c(kJ)\n Nhiệt tạo thành:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các nguyên tố hóa học được sắp xếp theo thứ tự tăng dần của số nguyên tử trong bảng tuần hoàn",
    "re": "Thì chúng có tính chất hóa học tương tự nhau trong cùng một nhóm"
  },
  {
    "con": "Một phản ứng hóa học xảy ra trong điều kiện nhiệt độ và áp suất nhất định",
    "re": "Thì tốc độ phản ứng sẽ phụ thuộc vào nồng độ của các chất phản ứng"
  },
  {
    "con": "Nếu một chất có độ âm điện cao",
    "re": "Thì nó có khả năng thu hút electron mạnh hơn trong liên kết hóa học"
  },
  {
    "con": "Khi nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch",
    "re": "Thì cân bằng phản ứng sẽ dịch chuyển theo hướng hấp thụ nhiệt"
  },
  {
    "con": "Nếu một dung dịch có pH < 7",
    "re": "Thì dung dịch đó được coi là axit"
  },
  {
    "con": "Khi một chất bị oxi hóa",
    "re": "Thì nó sẽ mất electron và tăng số oxi hóa"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt",
    "re": "Thì nó sẽ giải phóng năng lượng dưới dạng nhiệt"
  },
  {
    "con": "Khi một ion dương và một ion âm kết hợp với nhau",
    "re": "Thì chúng sẽ tạo thành một hợp chất ion"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước",
    "re": "Thì chất đó sẽ bay hơi ở nhiệt độ phòng"
  },
  {
    "con": "Cho các phản ứng:\n (1) N_2 (k) + O_2 (k) à 2NO (k), DHo > 0\n (2) N_2 (k) + 3H_2 (k) à 2NH_3 (k), DHo < 0\n (3) CaCO_3 (r) à CaO (r) + CO_2 (k), DHo > 0\n Với phản ứng nào ta nên dùng nhiệt độ cao và áp suất thấp để cân bằng chuyển dịch theo chiều thuận.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước và tạo ra dung dịch, thì chất đó được gọi là chất tan.",
    "re": "Chất tan sẽ làm tăng độ dẫn điện của dung dịch."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng thường tăng lên.",
    "re": "Điều này do năng lượng va chạm giữa các phân tử tăng lên."
  },
  {
    "con": "Nếu pH của dung dịch axit thấp hơn 7, thì dung dịch đó có tính axit.",
    "re": "Tính axit của dung dịch có thể được xác định bằng chỉ số pH."
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước, thì chất đó sẽ bay hơi nhanh hơn trong điều kiện bình thường.",
    "re": "Điều này có thể dẫn đến sự mất mát chất trong quá trình thí nghiệm."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì nhiệt độ của môi trường xung quanh sẽ tăng lên.",
    "re": "Điều này có thể được đo bằng nhiệt kế."
  },
  {
    "con": "Nếu nồng độ của một chất trong dung dịch tăng lên, thì tốc độ phản ứng hóa học có thể tăng lên.",
    "re": "Điều này do số lượng phân tử va chạm tăng lên."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử đối xứng, thì nó có thể không có hoạt tính quang học.",
    "re": "Điều này có nghĩa là nó không quay ánh sáng phân cực."
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước, thì nó có thể được sử dụng để tạo ra dung dịch.",
    "re": "Dung dịch này có thể được sử dụng trong nhiều ứng dụng hóa học."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kín, thì áp suất có thể thay đổi do sự thay đổi thể tích.",
    "re": "Điều này có thể được giải thích bằng định luật Boyle."
  },
  {
    "con": "Cho 3 dung dịch nước (dd) BaCl_2, Na_2CO_3, NaCl và nước nguyên chất. BaCO_3 tan nhiều hơn cả trong:A. dd BaCl_2B. H_2OC. dd Na_2CO_3D. dd NaCl\n 1) Không chỉ có những hợp chất ion khi hòa tan trong nước mới bị điện ly.\n 2) Độ điện ly a phụ thuộc nồng độ.\n 3) Độ điện ly a tăng khi nồng độ của chất điện ly giảm.\n 4) Độ điện ly a không thể lớn hơn 1.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất khí CO2 được hòa tan trong nước.",
    "re": "Tạo thành dung dịch axit carbonic (H2CO3)."
  },
  {
    "con": "Nhiệt độ tăng lên trong phản ứng hóa học.",
    "re": "Thường làm tăng tốc độ phản ứng."
  },
  {
    "con": "Một chất điện ly mạnh được hòa tan trong nước.",
    "re": "Sẽ hoàn toàn phân ly thành ion."
  },
  {
    "con": "Nồng độ của dung dịch axit tăng.",
    "re": "Độ pH của dung dịch sẽ giảm."
  },
  {
    "con": "Cho một chất rắn vào dung dịch nước.",
    "re": "Chất rắn có thể tan hoặc không tan tùy thuộc vào tính chất của nó."
  },
  {
    "con": "Khi một chất phản ứng với oxy.",
    "re": "Sẽ tạo ra sản phẩm oxit."
  },
  {
    "con": "Một phản ứng hóa học xảy ra trong điều kiện áp suất cao.",
    "re": "Có thể làm tăng tốc độ phản ứng và thay đổi cân bằng hóa học."
  },
  {
    "con": "Khi nồng độ của một chất trong phản ứng cân bằng thay đổi.",
    "re": "Hệ thống sẽ điều chỉnh để đạt được trạng thái cân bằng mới."
  },
  {
    "con": "Khi một dung dịch có nồng độ ion H+ cao.",
    "re": "Dung dịch đó sẽ có tính axit mạnh."
  },
  {
    "con": "Cho các số liệu nhiệt động (nhiệt sinh) của một số phản ứng sau ở 298oK. Hãy tính nhiệt tạo thành của NH3. Biết:\n 2NH_3 + 3N_2O -> \\Delta 4N_2 + 3H_2O \\Delta H1= -1011KJ/mol\n N_2O + 3H_2 -> \\Delta N2H4 + H2O \\Delta H2= -317KJ/mol\n 2NH_3 + 0,5O_2 ->\\Delta N_2H_4 + H_2O \\Delta H3= -143KJ/mol\n H_2 + 0,5O_2 -> \\Delta H_2O \\Delta H4= -286KJ/mol",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có nhiệt độ nóng chảy thấp hơn nhiệt độ phòng thì chất đó sẽ tồn tại ở trạng thái lỏng.",
    "re": "Chất đó sẽ tồn tại ở trạng thái lỏng."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao thì tốc độ phản ứng sẽ tăng lên.",
    "re": "Tốc độ phản ứng sẽ tăng lên."
  },
  {
    "con": "Nếu một dung dịch có pH < 7 thì dung dịch đó được coi là axit.",
    "re": "Dung dịch đó được coi là axit."
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước thì chất đó được gọi là chất tan.",
    "re": "Chất đó được gọi là chất tan."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt thì năng lượng được giải phóng ra môi trường.",
    "re": "Năng lượng được giải phóng ra môi trường."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử đối xứng thì chất đó có thể không có tính chiral.",
    "re": "Chất đó có thể không có tính chiral."
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử cao hơn thì nó có nhiều proton hơn trong hạt nhân.",
    "re": "Nó có nhiều proton hơn trong hạt nhân."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kiềm thì sản phẩm tạo ra có thể là muối và nước.",
    "re": "Sản phẩm tạo ra có thể là muối và nước."
  },
  {
    "con": "Nếu một chất có tính oxi hóa mạnh thì nó có khả năng nhận electron từ chất khác.",
    "re": "Nó có khả năng nhận electron từ chất khác."
  },
  {
    "con": "Cho các phản ứng xảy ra ở điều kiện chuẩn. Vậy nhiệt sinh chuẩn của PCl_5 là:\n 2P + 3Cl_2 = 2PCl_3 \\Delta H = x(kJ)\n PCl_3 + Cl_2 = PCl_5 \\Delta H = y(kJ).",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm nóng chảy thấp hơn nhiệt độ phòng, thì chất đó sẽ tồn tại ở trạng thái lỏng hoặc khí ở nhiệt độ phòng.",
    "re": "Chất đó có thể dễ dàng bay hơi hoặc chảy."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kín, thì tổng khối lượng của các chất phản ứng sẽ bằng tổng khối lượng của các sản phẩm.",
    "re": "Đây là định luật bảo toàn khối lượng."
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là axit.",
    "re": "Dung dịch đó có khả năng dẫn điện tốt hơn do sự hiện diện của ion H+."
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước, thì chất đó thường là ion hoặc phân cực.",
    "re": "Chất đó sẽ dễ dàng hòa tan trong dung môi nước."
  },
  {
    "con": "Nếu nhiệt độ của một khí tăng lên trong một bình kín, thì áp suất của khí đó cũng sẽ tăng lên.",
    "re": "Điều này được mô tả bởi định luật Gay-Lussac."
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì nó có thể xảy ra theo cả hai chiều.",
    "re": "Tốc độ phản ứng sẽ đạt đến trạng thái cân bằng."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng, thì chất đó có thể có đồng phân quang học.",
    "re": "Chất đó có thể quay ánh sáng phân cực."
  },
  {
    "con": "Nếu một ion mang điện tích dương, thì nó được gọi là cation.",
    "re": "Cation thường được hình thành khi một nguyên tử mất electron."
  },
  {
    "con": "Nếu một phản ứng hóa học tỏa nhiệt, thì nó được gọi là phản ứng tỏa nhiệt.",
    "re": "Nhiệt độ của môi trường xung quanh sẽ tăng lên."
  },
  {
    "con": "Cho biết entropi tiêu chuẩn từng chất, tính biến thiên entropi tiêu chuẩn của phản ứng sau:\n                        CaCO_3 (r) = CaO (r) + CO_2 (k)\nS^0_{298}     22,16                9,5             51,06         (cal.K^-1.mol^-1)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biết rằng nước có nhiệt độ sôi 100 độ C ở áp suất 1 atm,",
    "re": "nước sẽ chuyển từ trạng thái lỏng sang trạng thái khí."
  },
  {
    "con": "Khi một chất được hòa tan trong nước, nếu chất đó là muối,",
    "re": "thì dung dịch sẽ dẫn điện tốt."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao,",
    "re": "thì tốc độ phản ứng thường tăng lên."
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7,",
    "re": "thì dung dịch đó được coi là axit."
  },
  {
    "con": "Nếu một chất có điểm nóng chảy thấp hơn nhiệt độ phòng,",
    "re": "thì chất đó sẽ tồn tại ở trạng thái lỏng ở nhiệt độ phòng."
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn các phản ứng,",
    "re": "thì phản ứng đó sẽ tỏa nhiệt."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng,",
    "re": "thì chất đó có thể có tính quang hoạt."
  },
  {
    "con": "Khi một dung dịch bão hòa được làm nguội,",
    "re": "thì một phần chất tan có thể kết tinh ra ngoài."
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước,",
    "re": "thì chất đó sẽ dễ dàng hòa tan trong dung môi nước."
  },
  {
    "con": "Chọn phương án đúng: Căn cứ trên dấu của 2 phản ứng sau:\nPbO_2 (r) + Pb (r) = 2PbO (r) \\Delta G^0_{298}< 0\nSnO_2 (r) + Sn (r) = 2SnO (r) \\Delta G^0_{298}> 0\nTrạng thái oxy hóa dương bền hơn đối với các kim loại chì và thiếc là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch có thể làm giảm nồng độ của sản phẩm thì",
    "re": "Phản ứng sẽ chuyển dịch sang phía phản ứng nghịch"
  },
  {
    "con": "Khi nồng độ của một chất phản ứng tăng lên trong một phản ứng hóa học thì",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7 thì",
    "re": "Chất đó được coi là axit"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện áp suất cao thì",
    "re": "Phản ứng sẽ chuyển dịch về phía có ít phân tử khí hơn"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện trong dung dịch thì",
    "re": "Chất đó là một chất điện ly"
  },
  {
    "con": "Khi nhiệt độ giảm trong một phản ứng hóa học tỏa nhiệt thì",
    "re": "Phản ứng sẽ chuyển dịch sang phía sản phẩm"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng thì",
    "re": "Chất đó có thể có tính quang hoạt"
  },
  {
    "con": "Khi một ion kim loại bị oxy hóa thì",
    "re": "Ion đó sẽ mất electron"
  },
  {
    "con": "Nếu một dung dịch có nồng độ ion H+ cao thì",
    "re": "Dung dịch đó có tính axit mạnh"
  },
  {
    "con": "Chọn phương án đúng: Từ các giá trị \\Delta H ở cùng điều kiện của các phản ứng:\n (1) As_2O_3(r) + O_2(k)  \\rightarrow As_2O_5(r) \\Delta H = -260,68kJ\n (2) 3As_2O_3(r) + 2O_3(k)  \\rightarrow 3As_2O_5(r) \\Delta H = -1067,97 kJ\n Hãy tính giá trị DH ở cùng điều kiện đó của phản ứng sau: \\frac{3}{2}O_2(k) = O_3(k)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất hóa học bị đun nóng đến nhiệt độ cao, nó sẽ có khả năng phản ứng với các chất khác",
    "re": "Tăng khả năng phản ứng hóa học"
  },
  {
    "con": "Nếu một dung dịch có pH < 7 thì",
    "re": "Dung dịch đó là axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín và không có chất nào bị mất đi",
    "re": "Thì tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên",
    "re": "Tốc độ phản ứng hóa học thường tăng lên"
  },
  {
    "con": "Nếu một chất có điện tích dương thì",
    "re": "Chất đó là cation"
  },
  {
    "con": "Khi nhiệt độ của một hệ thống tăng lên trong một phản ứng hóa học hấp thụ nhiệt",
    "re": "Phản ứng sẽ diễn ra nhanh hơn"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch",
    "re": "Thì nó có thể diễn ra theo cả hai chiều"
  },
  {
    "con": "Khi một chất rắn hòa tan trong dung môi",
    "re": "Thì nó tạo thành dung dịch"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử Z",
    "re": "Thì nó có Z proton trong hạt nhân"
  },
  {
    "con": "Chọn phát biểu đúng:\n 1) Không chỉ có những hợp chất ion khi hòa tan trong nước mới bị điện ly.\n 2) Độ điện ly a phụ thuộc nồng độ.\n 3) Độ điện ly a tăng khi nồng độ của chất điện ly giảm\n 4) Độ điện ly a không thể lớn hơn 1",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên",
    "re": "Tốc độ phản ứng hóa học thường tăng lên"
  },
  {
    "con": "Chất xúc tác được thêm vào phản ứng",
    "re": "Tốc độ phản ứng sẽ tăng mà không làm thay đổi trạng thái cân bằng"
  },
  {
    "con": "Nồng độ của các chất phản ứng tăng",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Phản ứng hóa học xảy ra trong môi trường nước",
    "re": "Các ion sẽ di chuyển tự do hơn, làm tăng khả năng phản ứng"
  },
  {
    "con": "Chất điện ly mạnh được hòa tan trong nước",
    "re": "Nó sẽ phân ly hoàn toàn thành ion"
  },
  {
    "con": "Chất điện ly yếu được hòa tan trong nước",
    "re": "Nó sẽ chỉ phân ly một phần thành ion"
  },
  {
    "con": "Sự thay đổi năng lượng trong phản ứng hóa học được đo",
    "re": "Nó sẽ cho biết liệu phản ứng là tỏa nhiệt hay thu nhiệt"
  },
  {
    "con": "Khối lượng của các chất tham gia phản ứng được đo",
    "re": "Khối lượng của sản phẩm sẽ bằng tổng khối lượng của các chất phản ứng (định luật bảo toàn khối lượng)"
  },
  {
    "con": "Sự thay đổi pH của dung dịch được quan sát",
    "re": "Nó sẽ cho biết tính axit hoặc bazơ của dung dịch"
  },
  {
    "con": "Chọn phương án đúng:\n Tính hiệu ứng nhiệt \\Delta H0 của phản ứng: B  \\rightarrow A, biết hiệu ứng nhiệt của các phản ứng sau:\n C  \\rightarrow A \\Delta H_1\n D  \\rightarrow C \\Delta H_2\n D  \\rightarrow B \\Delta H_3",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng thường tăng lên.",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Nếu nồng độ của một chất phản ứng tăng lên thì tốc độ phản ứng cũng sẽ tăng lên.",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín thì áp suất tăng lên sẽ làm dịch chuyển cân bằng phản ứng theo hướng giảm số mol khí.",
    "re": "Cân bằng phản ứng dịch chuyển"
  },
  {
    "con": "Nếu pH của dung dịch axit giảm thì nồng độ ion H+ trong dung dịch tăng lên.",
    "re": "Nồng độ ion H+ tăng"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước thì nó sẽ dễ dàng hòa tan trong dung môi này.",
    "re": "Chất hòa tan tốt"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt thì năng lượng được giải phóng ra môi trường.",
    "re": "Năng lượng giải phóng"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử phức tạp thì nó thường có tính chất hóa học đa dạng hơn.",
    "re": "Tính chất hóa học đa dạng"
  },
  {
    "con": "Nếu nhiệt độ của một chất lỏng tăng lên thì độ nhớt của chất lỏng đó thường giảm.",
    "re": "Độ nhớt giảm"
  },
  {
    "con": "Nếu một chất là chất điện ly mạnh thì nó sẽ phân ly hoàn toàn trong dung môi.",
    "re": "Phân ly hoàn toàn"
  },
  {
    "con": "Chọn câu đúng:\n Xét hệ cân bằng\n CO (k) + Cl_2 (k)  \\rightarrow COCl_2 (k) , \\Delta H < 0\n Sự thay đổi nào dưới đây dẫn đến cân bằng chuyển dịch theo chiều thuận:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng tỏa nhiệt",
    "re": "Cân bằng sẽ chuyển dịch sang trái"
  },
  {
    "con": "Khi nồng độ của một chất phản ứng tăng lên trong một phản ứng cân bằng",
    "re": "Cân bằng sẽ chuyển dịch theo chiều thuận"
  },
  {
    "con": "Khi áp suất tăng lên trong một phản ứng có sự thay đổi số mol khí",
    "re": "Cân bằng sẽ chuyển dịch về phía có ít mol khí hơn"
  },
  {
    "con": "Khi thêm một chất xúc tác vào một phản ứng cân bằng",
    "re": "Tốc độ phản ứng sẽ tăng lên nhưng vị trí cân bằng không thay đổi"
  },
  {
    "con": "Khi nồng độ của sản phẩm tăng lên trong một phản ứng cân bằng",
    "re": "Cân bằng sẽ chuyển dịch sang trái"
  },
  {
    "con": "Khi nhiệt độ giảm trong một phản ứng thu nhiệt",
    "re": "Cân bằng sẽ chuyển dịch sang phải"
  },
  {
    "con": "Khi một phản ứng xảy ra trong dung dịch, và nồng độ ion tăng lên",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, năng lượng được giải phóng hoặc hấp thụ",
    "re": "Phản ứng đó có thể là tỏa nhiệt hoặc thu nhiệt"
  },
  {
    "con": "Khi một chất bị phân hủy thành các sản phẩm đơn giản hơn",
    "re": "Phản ứng đó được gọi là phản ứng phân hủy"
  },
  {
    "con": "Chọn phương án đúng: Trộn các dung dịch:\n (1) 100ml dung dịch AgNO_3 10^–3M với 100ml dung dịch HCl 10^–3M\n (2) 100ml dung dịch AgNO_3 10^–4M với 100ml dung dịch NaCl 10^–4M\n(3) 100ml dung dịch AgNO_3 10^–4M với 100ml dung dịch HCl 10^–5 M\nTrong trường hợp nào có sự tạo thành kết tủa AgCl? Cho biết T_{AgCl }= 10^–9,6.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "Tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Sự hiện diện của chất xúc tác trong một phản ứng hóa học",
    "re": "Tốc độ phản ứng sẽ tăng mà không làm thay đổi trạng thái cân bằng"
  },
  {
    "con": "Nồng độ của các chất phản ứng tăng lên",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Sự thay đổi pH của dung dịch",
    "re": "Có thể ảnh hưởng đến sự hòa tan của các muối và sự hoạt động của enzyme"
  },
  {
    "con": "Trộn các dung dịch axit và bazơ",
    "re": "Sẽ xảy ra phản ứng trung hòa tạo ra muối và nước"
  },
  {
    "con": "Sự gia tăng áp suất trong một phản ứng khí",
    "re": "Có thể làm dịch chuyển cân bằng về phía có ít phân tử khí hơn"
  },
  {
    "con": "Sự thay đổi nhiệt độ trong một phản ứng tỏa nhiệt",
    "re": "Cân bằng phản ứng sẽ dịch chuyển sang bên trái"
  },
  {
    "con": "Sự hòa tan của một chất rắn trong dung môi",
    "re": "Sẽ tạo ra dung dịch nếu nồng độ chất rắn không vượt quá độ hòa tan của nó"
  },
  {
    "con": "Sự hiện diện của ion kim loại trong dung dịch",
    "re": "Có thể dẫn đến sự hình thành kết tủa nếu nồng độ vượt quá giá trị hòa tan"
  },
  {
    "con": "Lập công thức tính hiệu ứng nhiệt (\\Delta H_0 ) của phản ứng 2A  \\rightarrow B , thông qua hiệu ứng nhiệt của các phản ứng sau:\n A  \\rightarrow C \\Delta H_1\n A \\rightarrow D \\Delta H_2\n D + C\\rightarrow E \\Delta H_3\n E \\rightarrow B \\Delta H_4",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sử dụng quy tắc bảo toàn khối lượng trong phản ứng hóa học",
    "re": "Tổng khối lượng các chất phản ứng bằng tổng khối lượng các sản phẩm"
  },
  {
    "con": "Áp dụng định luật Avogadro cho các khí ở cùng nhiệt độ và áp suất",
    "re": "Các thể tích khí khác nhau chứa cùng số mol phân tử sẽ có cùng thể tích"
  },
  {
    "con": "Sử dụng bảng tuần hoàn để xác định số electron hóa trị của nguyên tố",
    "re": "Số electron hóa trị quyết định tính chất hóa học của nguyên tố"
  },
  {
    "con": "Phân tích phản ứng axit-bazơ theo thuyết Brønsted-Lowry",
    "re": "Axit là chất cho proton, bazơ là chất nhận proton"
  },
  {
    "con": "Sử dụng quy tắc octet trong việc xác định cấu trúc phân tử",
    "re": "Nguyên tử sẽ cố gắng đạt được cấu hình electron giống như khí hiếm gần nhất"
  },
  {
    "con": "Áp dụng định luật Boyle cho khí lý tưởng",
    "re": "Khi nhiệt độ không đổi, áp suất của một khối khí tỉ lệ nghịch với thể tích của nó"
  },
  {
    "con": "Sử dụng phương trình trạng thái khí lý tưởng PV=nRT",
    "re": "Có thể tính toán mối quan hệ giữa áp suất, thể tích, số mol và nhiệt độ của khí"
  },
  {
    "con": "Phân tích phản ứng oxi hóa-khử",
    "re": "Chất bị oxi hóa sẽ mất electron, trong khi chất bị khử sẽ nhận electron"
  },
  {
    "con": "Sử dụng phương pháp cân bằng hóa học để dự đoán hướng phản ứng",
    "re": "Phản ứng sẽ tiến về phía có ít chất hơn trong điều kiện cân bằng"
  },
  {
    "con": "Phản ứng N2(k) + 3H2(k) = 2NH3(k) đang ở trạng thái cân bằng và có ΔH < 0. Muốn phản ứng dịch chuyển theo chiều thuận thì:\n 1/Tăng áp suất của hệ\n 2/Thêm NH3 vào\n 3/Hạ nhiệt độ của hệ",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có nhiệt độ nóng chảy thấp hơn nhiệt độ phòng thì chất đó sẽ tồn tại ở trạng thái lỏng hoặc khí ở nhiệt độ phòng.",
    "re": "Chất đó có thể dễ dàng bay hơi hoặc chảy."
  },
  {
    "con": "Nếu một dung dịch có pH < 7 thì dung dịch đó được coi là axit.",
    "re": "Dung dịch đó có khả năng gây ăn mòn và phản ứng với bazơ."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện không có oxy thì phản ứng đó có thể là phản ứng khử.",
    "re": "Sản phẩm của phản ứng có thể chứa carbon hoặc hydro."
  },
  {
    "con": "Nếu nhiệt độ của một hệ thống tăng lên trong một phản ứng hóa học hấp thụ nhiệt thì phản ứng sẽ dịch chuyển theo chiều thuận.",
    "re": "Sản phẩm tạo ra sẽ có năng lượng cao hơn."
  },
  {
    "con": "Nếu nồng độ của một chất trong phản ứng tăng lên thì tốc độ phản ứng sẽ tăng.",
    "re": "Điều này dẫn đến việc sản phẩm được tạo ra nhanh hơn."
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước thì chất đó thường là ion hoặc phân cực.",
    "re": "Chất đó sẽ dễ dàng hòa tan và tạo thành dung dịch."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra với sự giải phóng khí thì có thể có sự thay đổi về thể tích của hệ.",
    "re": "Điều này có thể dẫn đến việc tăng áp suất trong hệ thống."
  },
  {
    "con": "Nếu một chất có khối lượng mol lớn hơn thì nó sẽ có mật độ cao hơn khi ở cùng trạng thái.",
    "re": "Chất đó sẽ nặng hơn trong cùng một thể tích so với chất có khối lượng mol nhỏ hơn."
  },
  {
    "con": "Nếu một phản ứng hóa học có ΔG < 0 thì phản ứng đó là tự phát.",
    "re": "Phản ứng sẽ xảy ra mà không cần cung cấp năng lượng bên ngoài."
  },
  {
    "con": "Tính nhiệt tạo thành tiêu chuẩn của CH3OH(l), biết: C(r) + O2(k) D CO2 (k) , DH = -94 kcal/mol\n H_2(k) + ½ O_2(k) \\rightarrow \\Delta H_2O (l) , \\Delta H = -68,5 kcal/mol\n CH_3OH (l) + 1,5O_2(k) \\rightarrow \\DeltaCO_2(k) + 2H_2O(l)  \\Delta H = -171 kcal/mol",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Có một dung dịch axit mạnh, như HCl, thì pH của dung dịch đó sẽ nhỏ hơn 7"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước, thì chất đó sẽ bay hơi nhanh hơn nước ở cùng nhiệt độ"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Nếu nồng độ của một chất trong dung dịch tăng lên, thì tốc độ phản ứng giữa chất đó và chất khác cũng sẽ tăng lên"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử đối xứng, thì nó có khả năng không có hoạt tính quang học"
  },
  {
    "con": "Nếu một chất có liên kết hydro, thì nó sẽ có điểm nóng chảy và điểm sôi cao hơn so với các chất không có liên kết hydro"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì nó có thể xảy ra theo cả hai chiều"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước, thì nó sẽ dễ dàng hòa tan trong dung môi nước"
  },
  {
    "con": "Nếu nhiệt độ của một hệ thống tăng lên, thì áp suất của khí trong hệ thống đó cũng sẽ tăng lên theo định luật Gay-Lussac"
  },
  {
    "con": "Chọn biện pháp đúng. Phản ứng tỏa nhiệt dưới đây đã đạt trạng thái cân bằng:\n 2 A(k) + B(k) \\rightarrow 4D (k)\n Để dịch chuyển cân bằng của phản ứng theo chiều hướng tạo thêm sản phẩm, một số biện pháp sau đây đã được sử dụng:\n 1) Tăng nhiệt độ\n 2) Thêm chất D",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nâng nhiệt độ của một phản ứng hóa học tỏa nhiệt",
    "re": "Cân bằng phản ứng sẽ dịch chuyển sang bên trái, giảm sản phẩm"
  },
  {
    "con": "Giảm áp suất trong một phản ứng hóa học có sự tham gia của khí",
    "re": "Cân bằng phản ứng sẽ dịch chuyển về phía có nhiều phân tử khí hơn"
  },
  {
    "con": "Thêm một chất xúc tác vào phản ứng hóa học",
    "re": "Tốc độ phản ứng sẽ tăng lên mà không làm thay đổi vị trí cân bằng"
  },
  {
    "con": "Tăng nồng độ của một chất phản ứng trong hệ thống",
    "re": "Cân bằng phản ứng sẽ dịch chuyển về phía sản phẩm để tiêu thụ chất đó"
  },
  {
    "con": "Giảm nồng độ của sản phẩm trong một phản ứng hóa học",
    "re": "Cân bằng phản ứng sẽ dịch chuyển về phía sản phẩm để tạo ra nhiều hơn"
  },
  {
    "con": "Thay đổi nhiệt độ trong một phản ứng hóa học thu nhiệt",
    "re": "Cân bằng phản ứng sẽ dịch chuyển sang bên phải, tăng sản phẩm"
  },
  {
    "con": "Sử dụng nước để hòa tan một chất rắn trong phản ứng hóa học",
    "re": "Tăng khả năng phản ứng của chất rắn đó với các chất khác"
  },
  {
    "con": "Thêm ion kim loại vào dung dịch chứa ion không kim loại",
    "re": "Có thể xảy ra phản ứng trao đổi ion, tạo ra kết tủa"
  },
  {
    "con": "Sử dụng pH để điều chỉnh môi trường phản ứng",
    "re": "Có thể làm thay đổi tốc độ và hướng của phản ứng hóa học"
  },
  {
    "con": "Chọn phương án đúng: Cho biết số electron tối đa và số lượng tử chính n của các lớp lượng tử K và M:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tử có số proton bằng 6 thì nguyên tử đó là carbon.",
    "re": "Nguyên tử carbon có số proton là 6"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O thì đó là nước.",
    "re": "Nước là hợp chất của hydro và oxy"
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên thì động năng của các phân tử trong chất đó cũng tăng lên.",
    "re": "Động năng của phân tử tăng khi nhiệt độ tăng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện thích hợp thì các chất phản ứng sẽ chuyển hóa thành sản phẩm.",
    "re": "Chất phản ứng biến đổi thành sản phẩm trong phản ứng hóa học"
  },
  {
    "con": "Nếu pH của một dung dịch nhỏ hơn 7 thì dung dịch đó là axit.",
    "re": "Dung dịch axit có pH nhỏ hơn 7"
  },
  {
    "con": "Nếu một nguyên tố có số electron ở lớp ngoài cùng là 8 thì nguyên tố đó có tính ổn định cao.",
    "re": "Nguyên tố ổn định thường có 8 electron ở lớp ngoài cùng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C thì chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng.",
    "re": "Chất có điểm sôi thấp hơn 100 độ C thường ở trạng thái khí"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt thì năng lượng được giải phóng ra môi trường.",
    "re": "Phản ứng tỏa nhiệt giải phóng năng lượng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao thì khả năng dẫn điện của dung dịch đó cũng cao.",
    "re": "Dung dịch nồng độ mol cao dẫn điện tốt hơn"
  },
  {
    "con": "Chọn phương án sai:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất có nhiệt độ sôi thấp:",
    "re": "Có thể tồn tại ở trạng thái khí ở nhiệt độ phòng"
  },
  {
    "con": "Một phản ứng hóa học xảy ra:",
    "re": "Các chất phản ứng sẽ biến đổi thành các sản phẩm mới"
  },
  {
    "con": "Số nguyên tử trong một phân tử nước (H2O):",
    "re": "Là 3 (2 hydro và 1 oxy)"
  },
  {
    "con": "Một dung dịch có pH < 7:",
    "re": "Là dung dịch axit"
  },
  {
    "con": "Khi nhiệt độ tăng:",
    "re": "Độ hòa tan của nhiều chất rắn trong nước cũng tăng"
  },
  {
    "con": "Một nguyên tố có số proton khác nhau:",
    "re": "Sẽ tạo ra các đồng vị khác nhau"
  },
  {
    "con": "Khi một chất bị oxi hóa:",
    "re": "Nó sẽ mất electron"
  },
  {
    "con": "Một phản ứng hóa học có thể xảy ra nhanh hơn:",
    "re": "Khi có mặt của chất xúc tác"
  },
  {
    "con": "Khối lượng của một nguyên tử được đo bằng:",
    "re": "Đơn vị Dalton (u)"
  },
  {
    "con": "Chọn phương án sai: Số lượng tử từ mℓ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sử dụng công thức hóa học đúng:",
    "re": "Có thể xác định được thành phần và tỷ lệ của các nguyên tố trong hợp chất"
  },
  {
    "con": "Biết rằng nước là hợp chất của hydro và oxy:",
    "re": "Có thể dự đoán rằng nước sẽ có tính chất hóa học đặc trưng của cả hai nguyên tố"
  },
  {
    "con": "Thực hiện phản ứng hóa học trong điều kiện thích hợp:",
    "re": "Sẽ tạo ra sản phẩm với hiệu suất cao hơn"
  },
  {
    "con": "Sử dụng bảng tuần hoàn để xác định vị trí của nguyên tố:",
    "re": "Có thể suy ra tính chất hóa học và vật lý của nguyên tố đó"
  },
  {
    "con": "Biết rằng các nguyên tố trong cùng một nhóm có tính chất tương tự:",
    "re": "Có thể dự đoán tính chất của nguyên tố chưa biết trong nhóm đó"
  },
  {
    "con": "Thực hiện thí nghiệm với các chất hóa học khác nhau:",
    "re": "Có thể quan sát được các phản ứng hóa học khác nhau"
  },
  {
    "con": "Sử dụng pH để đo độ axit hoặc bazơ của dung dịch:",
    "re": "Có thể xác định tính chất hóa học của dung dịch đó"
  },
  {
    "con": "Biết rằng nhiệt độ ảnh hưởng đến tốc độ phản ứng:",
    "re": "Có thể điều chỉnh nhiệt độ để tăng hoặc giảm tốc độ phản ứng"
  },
  {
    "con": "Sử dụng phương pháp cân bằng hóa học:",
    "re": "Có thể dự đoán được hướng chuyển dịch của phản ứng khi thay đổi điều kiện"
  },
  {
    "con": "Chọn phương án đúng: Trạng thái của electron ở lớp ngoài cùng trong nguyên tử có Z = 29 được đặc trưng bằng các số lượng tử (quy ước electron điền vào các ocbitan theo thứ tự mℓ từ +ℓ đến –ℓ):",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O thì nó là nước.",
    "re": "Hợp chất này có tính chất lỏng ở nhiệt độ phòng."
  },
  {
    "con": "Nếu một nguyên tố có số proton là 6 thì nó là carbon.",
    "re": "Nguyên tố này có khả năng tạo ra nhiều hợp chất hữu cơ."
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên thì động năng của các phân tử trong chất đó cũng tăng lên.",
    "re": "Chất đó có thể chuyển từ trạng thái rắn sang trạng thái lỏng hoặc khí."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ và áp suất tiêu chuẩn thì nó có thể được mô tả bằng phương trình hóa học.",
    "re": "Phương trình này sẽ thể hiện mối quan hệ giữa các chất phản ứng và sản phẩm."
  },
  {
    "con": "Nếu một dung dịch có pH < 7 thì dung dịch đó là axit.",
    "re": "Dung dịch này có khả năng dẫn điện tốt hơn so với dung dịch trung tính."
  },
  {
    "con": "Nếu một nguyên tử có số electron bằng số proton thì nó là một nguyên tử trung hòa.",
    "re": "Nguyên tử này không có điện tích tổng thể."
  },
  {
    "con": "Nếu một hợp chất ion được hình thành từ sự kết hợp giữa kim loại và phi kim thì nó có thể dẫn điện khi hòa tan trong nước.",
    "re": "Hợp chất này thường có điểm nóng chảy cao."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt thì năng lượng được giải phóng ra ngoài môi trường.",
    "re": "Phản ứng này thường có thể tự xảy ra mà không cần cung cấp năng lượng bên ngoài."
  },
  {
    "con": "Nếu một chất có khối lượng mol lớn hơn 100 g/mol thì nó thường có tính chất hóa học khác biệt so với các chất có khối lượng mol nhỏ hơn.",
    "re": "Chất này có thể có nhiều liên kết hóa học phức tạp hơn."
  },
  {
    "con": "Chọn phát biểu sai về phương pháp MO:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một nguyên tử có số proton bằng số electron:",
    "re": "Nguyên tử đó trung hòa về điện"
  },
  {
    "con": "Nhiệt độ tăng trong một phản ứng hóa học:",
    "re": "Thường làm tăng tốc độ phản ứng"
  },
  {
    "con": "Chất điện ly mạnh trong dung dịch:",
    "re": "Phân ly hoàn toàn thành ion"
  },
  {
    "con": "Số mol của một chất trong một dung dịch:",
    "re": "Tính bằng nồng độ nhân với thể tích"
  },
  {
    "con": "Khi một phản ứng hóa học đạt trạng thái cân bằng:",
    "re": "Tốc độ phản ứng thuận bằng tốc độ phản ứng nghịch"
  },
  {
    "con": "Khối lượng mol của một chất:",
    "re": "Bằng tổng khối lượng của tất cả các nguyên tử trong phân tử"
  },
  {
    "con": "Khi pH của dung dịch giảm:",
    "re": "Nồng độ ion H+ trong dung dịch tăng"
  },
  {
    "con": "Phản ứng hóa học tỏa nhiệt:",
    "re": "Giải phóng năng lượng ra môi trường"
  },
  {
    "con": "Trong một phản ứng oxi hóa khử:",
    "re": "Chất bị oxi hóa mất electron"
  },
  {
    "con": "Chọn phương án đúng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất có cấu trúc phân tử ổn định:",
    "re": "Có thể tồn tại lâu dài trong tự nhiên"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học:",
    "re": "Thường làm tăng tốc độ phản ứng"
  },
  {
    "con": "Một dung dịch có pH < 7:",
    "re": "Được coi là dung dịch axit"
  },
  {
    "con": "Khi một chất phản ứng với oxy:",
    "re": "Sẽ tạo ra sản phẩm oxit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín:",
    "re": "Khối lượng tổng thể của hệ thống sẽ không thay đổi"
  },
  {
    "con": "Khi nồng độ của một chất tăng lên trong dung dịch:",
    "re": "Tốc độ phản ứng có thể tăng lên"
  },
  {
    "con": "Một nguyên tố có số nguyên tử lớn hơn 92:",
    "re": "Được coi là nguyên tố phóng xạ"
  },
  {
    "con": "Khi một ion dương và một ion âm kết hợp:",
    "re": "Sẽ tạo thành một hợp chất ion"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp:",
    "re": "Thì nó thường có lực liên kết yếu giữa các phân tử"
  },
  {
    "con": "Chọn phương án đúng: Nguyên tố có cấu hình electron 1s^22s^22p^63s^23p^63d^{10}4s^24p^64d^{10}5s^25p^64f^{12}6s^2 thuộc:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nồng độ mol của dung dịch được tính bằng số mol chất tan chia cho thể tích dung dịch tính bằng lít:",
    "re": "Nồng độ mol là một đại lượng quan trọng trong hóa học"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng lên:",
    "re": "Điều này xảy ra do các phân tử có năng lượng cao hơn và va chạm nhiều hơn"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước, thì chất đó sẽ bay hơi ở nhiệt độ phòng:",
    "re": "Chất đó có thể được coi là dễ bay hơi"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7, thì dung dịch đó được coi là axit:",
    "re": "Điều này có thể ảnh hưởng đến tính chất hóa học của các chất trong dung dịch"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện không có không khí, thì sản phẩm của phản ứng có thể khác với phản ứng xảy ra trong không khí:",
    "re": "Điều này cho thấy tầm quan trọng của môi trường trong phản ứng hóa học"
  },
  {
    "con": "Khi một nguyên tố có số electron bằng số proton, thì nguyên tố đó là trung hòa về điện:",
    "re": "Điều này có nghĩa là nó không mang điện tích"
  },
  {
    "con": "Nếu hai chất phản ứng với nhau tạo ra một sản phẩm mới, thì phản ứng đó được gọi là phản ứng hóa học:",
    "re": "Phản ứng hóa học có thể thay đổi tính chất của các chất ban đầu"
  },
  {
    "con": "Khi một dung dịch có nồng độ ion H+ cao, thì dung dịch đó có tính axit mạnh:",
    "re": "Điều này có thể dẫn đến sự ăn mòn các vật liệu khác"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử phức tạp, thì nó có thể có nhiều tính chất hóa học khác nhau:",
    "re": "Điều này cho thấy sự đa dạng trong hóa học hữu cơ"
  },
  {
    "con": "Chọn phương án đúng: Trong hợp chất H_2O2, số oxy hóa và hoá trị của Oxy lần lượt là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng sẽ:",
    "re": "Tăng lên"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion thì chất đó được gọi là:",
    "re": "Chất điện ly"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín thì khối lượng tổng thể của hệ thống sẽ:",
    "re": "Giữ nguyên"
  },
  {
    "con": "Khi pH của dung dịch giảm thì nồng độ ion H+ trong dung dịch sẽ:",
    "re": "Tăng lên"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn nước thì chất đó sẽ:",
    "re": "Bay hơi dễ dàng hơn trong điều kiện thường"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn các phản ứng thì phản ứng đó được gọi là:",
    "re": "Phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử cao hơn thì số proton trong hạt nhân của nó sẽ:",
    "re": "Tăng lên"
  },
  {
    "con": "Khi một dung dịch có nồng độ mol cao hơn dung dịch khác thì dung dịch đó sẽ:",
    "re": "Có áp suất thẩm thấu cao hơn"
  },
  {
    "con": "Nếu một hợp chất có liên kết ion thì nó sẽ có tính chất:",
    "re": "Dễ tan trong nước và dẫn điện khi tan chảy"
  },
  {
    "con": "Chọn phương án đúng: Số liên kết cộng hóa trị tối đa một nguyên tố có:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nguyên tử có số proton bằng số electron:",
    "re": "Nguyên tử đó là trung hòa về điện"
  },
  {
    "con": "Nếu một hợp chất có liên kết ion:",
    "re": "Hợp chất đó thường có điểm nóng chảy cao"
  },
  {
    "con": "Khi nhiệt độ tăng lên:",
    "re": "Độ hòa tan của nhiều chất rắn trong nước thường tăng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín:",
    "re": "Khối lượng tổng thể của hệ thống sẽ không thay đổi"
  },
  {
    "con": "Nếu pH của dung dịch nhỏ hơn 7:",
    "re": "Dung dịch đó được coi là axit"
  },
  {
    "con": "Khi một nguyên tố có số oxi hóa dương:",
    "re": "Nguyên tố đó có khả năng mất electron"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng:",
    "re": "Chất đó có thể có tính quang hoạt"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra với sự giải phóng năng lượng:",
    "re": "Phản ứng đó được gọi là phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao:",
    "re": "Dung dịch đó có khả năng dẫn điện tốt hơn"
  },
  {
    "con": "Chọn phương án đúng: Electron cuối của nguyên tử A có bộ các số lượng tử sau (quy ước electron điền vào các ocbitan theo thứ tự mℓ từ +ℓ đến –ℓ): n = 3, ℓ = 2, mℓ = +1, ms = +½. Xác định số thứ tự trong bảng hệ thống tuần hoàn và công thức electron nguyên tử của A ở trạng thái cơ bản:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nguyên tử có số proton bằng số electron thì nguyên tử đó ở trạng thái trung hòa về điện.",
    "re": "Nguyên tử không mang điện tích"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là CxHy thì nó có thể là một hydrocarbon.",
    "re": "Hợp chất này có thể tham gia phản ứng cháy"
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên, thì động năng của các phân tử trong chất đó cũng tăng lên.",
    "re": "Chất có thể chuyển từ trạng thái rắn sang trạng thái lỏng hoặc khí"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện tiêu chuẩn, thì áp suất khí sản phẩm sẽ được tính theo định luật Boyle.",
    "re": "Áp suất và thể tích của khí có mối quan hệ tỉ lệ nghịch"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử Z, thì nó có Z proton trong hạt nhân.",
    "re": "Nguyên tố đó thuộc về một vị trí cụ thể trong bảng tuần hoàn"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là axit.",
    "re": "Dung dịch có khả năng dẫn điện tốt hơn"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì năng lượng được giải phóng ra môi trường.",
    "re": "Nhiệt độ của môi trường xung quanh có thể tăng lên"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước, thì nó có thể là một muối hoặc đường.",
    "re": "Chất này có khả năng tạo thành dung dịch đồng nhất"
  },
  {
    "con": "Nếu một nguyên tử có nhiều electron hơn proton, thì nguyên tử đó mang điện tích âm.",
    "re": "Nguyên tử đó được gọi là ion âm"
  },
  {
    "con": "Chọn phương án đúng: Dãy nguyên tử _6O, _7F, _{14}Si, _{16}S có bán kính R tăng dần theo dãy:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng thường tăng lên.",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước thì chất đó thường là chất ion hoặc phân cực.",
    "re": "Chất đó dễ hòa tan"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao thì phản ứng đó có thể chuyển dịch theo hướng tạo ra ít phân tử hơn.",
    "re": "Phản ứng có thể tăng hiệu suất"
  },
  {
    "con": "Nếu pH của dung dịch giảm thì nồng độ ion H+ trong dung dịch tăng.",
    "re": "Dung dịch trở nên axit hơn"
  },
  {
    "con": "Nếu một nguyên tố có điện tích dương thì nguyên tố đó có khả năng mất electron.",
    "re": "Nguyên tố trở thành ion dương"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp thì lực liên kết giữa các phân tử của chất đó yếu.",
    "re": "Chất dễ bay hơi"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt thì năng lượng được giải phóng ra ngoài.",
    "re": "Nhiệt độ môi trường xung quanh tăng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao thì áp suất thẩm thấu của dung dịch đó cũng cao.",
    "re": "Áp suất thẩm thấu tăng"
  },
  {
    "con": "Nếu một chất có cấu trúc mạng tinh thể thì chất đó thường có tính chất vật lý ổn định.",
    "re": "Chất có độ cứng cao"
  },
  {
    "con": "Chọn phương án đúng: Bốn orbital lai hóa sp^3 có đặc điểm:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một nguyên tử có số proton bằng số electron:",
    "re": "Nguyên tử đó là trung hòa về điện"
  },
  {
    "con": "Khi nhiệt độ tăng lên, tốc độ phản ứng hóa học:",
    "re": "Thường tăng lên do năng lượng va chạm giữa các phân tử tăng"
  },
  {
    "con": "Nếu một dung dịch có pH < 7:",
    "re": "Dung dịch đó được coi là axit"
  },
  {
    "con": "Khi một nguyên tố có số electron hóa trị bằng 1:",
    "re": "Nguyên tố đó thường thuộc nhóm 1 trong bảng tuần hoàn"
  },
  {
    "con": "Nếu hai nguyên tố có cùng số electron hóa trị:",
    "re": "Chúng có thể có tính chất hóa học tương tự nhau"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và năng lượng được giải phóng:",
    "re": "Phản ứng đó được gọi là phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một hợp chất có liên kết ion:",
    "re": "Hợp chất đó thường có điểm nóng chảy cao và dẫn điện khi hòa tan trong nước"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên:",
    "re": "Khả năng xảy ra phản ứng hóa học giữa các chất cũng tăng lên"
  },
  {
    "con": "Nếu một nguyên tử có số lượng neutron khác nhau so với số proton:",
    "re": "Nguyên tử đó là đồng vị của nguyên tố đó"
  },
  {
    "con": "Nguyên tử có số proton bằng số electron",
    "re": "Nguyên tử đó trung hòa về điện"
  },
  {
    "con": "Chọn phương án đúng: Các nguyên tố trong cùng một nhóm có cùng số electron hóa trị",
    "re": "Chúng có tính chất hóa học tương tự nhau"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "Tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Chọn phương án đúng: Nước là dung môi phổ biến nhất trong hóa học",
    "re": "Nước có khả năng hòa tan nhiều chất"
  },
  {
    "con": "Khi pH của dung dịch giảm",
    "re": "Dung dịch trở nên axit hơn"
  },
  {
    "con": "Chọn phương án đúng: Các phản ứng hóa học có thể được phân loại thành phản ứng tổng hợp, phân hủy và trao đổi",
    "re": "Đây là ba loại phản ứng chính trong hóa học"
  },
  {
    "con": "Khi một chất bị oxi hóa",
    "re": "Chất đó mất electron"
  },
  {
    "con": "Chọn phương án đúng: Các nguyên tố kim loại thường có tính dẫn điện tốt",
    "re": "Chúng có cấu trúc tinh thể cho phép electron di chuyển tự do"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng",
    "re": "Khả năng phản ứng của chất đó cũng tăng lên"
  },
  {
    "con": "Chọn phương án đúng: Các đồng vị của một nguyên tố có số neutron khác nhau",
    "re": "Chúng có cùng số proton nhưng khác nhau về khối lượng"
  },
  {
    "con": "Chọn phương án đúng: Ocbital 1s của nguyên tử H có dạng hình cầu, nghĩa là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một nguyên tử mất electron, nó trở thành ion dương, nghĩa là:",
    "re": "Nguyên tử đó có điện tích dương"
  },
  {
    "con": "Nếu hai nguyên tử chia sẻ một cặp electron, nghĩa là:",
    "re": "Chúng tạo thành liên kết cộng hóa trị"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên, năng lượng động học của các phân tử trong chất đó cũng tăng, nghĩa là:",
    "re": "Chất đó có thể chuyển từ trạng thái rắn sang lỏng hoặc khí"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện không có oxy, nghĩa là:",
    "re": "Phản ứng đó có thể là phản ứng lên men hoặc phản ứng khử"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7, nghĩa là:",
    "re": "Dung dịch đó trở nên axit"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước, nghĩa là:",
    "re": "Chất đó có thể là một chất điện ly mạnh"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn các phản ứng ban đầu, nghĩa là:",
    "re": "Phản ứng đó là phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, nghĩa là:",
    "re": "Nguyên tố đó là carbon"
  },
  {
    "con": "Khi một dung dịch có nồng độ mol cao hơn dung dịch khác, nghĩa là:",
    "re": "Dung dịch đó có khả năng tạo ra áp suất thẩm thấu cao hơn"
  },
  {
    "con": "Chọn phương án đúng: Orbital 5f có các số lượng tử n, ℓ và số electron tối đa lần lượt là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng thường tăng lên",
    "re": "Điều này xảy ra do năng lượng của các phân tử tăng lên"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion thì chất đó được gọi là chất điện ly",
    "re": "Chất điện ly có khả năng dẫn điện trong dung dịch"
  },
  {
    "con": "Nếu pH của dung dịch nhỏ hơn 7 thì dung dịch đó được coi là axit",
    "re": "Axit có khả năng cho proton (H+) vào dung dịch"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, nếu năng lượng tự do Gibbs giảm thì phản ứng đó là thuận lợi",
    "re": "Điều này có nghĩa là phản ứng có thể xảy ra tự phát"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C thì chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng",
    "re": "Điều này cho thấy chất đó dễ bay hơi"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên thì khả năng xảy ra va chạm giữa các phân tử cũng tăng lên",
    "re": "Điều này dẫn đến tốc độ phản ứng tăng lên"
  },
  {
    "con": "Nếu một hợp chất có cấu trúc phân tử không đối xứng thì nó có thể có đồng phân quang học",
    "re": "Điều này có nghĩa là hợp chất đó có thể tồn tại dưới dạng hai dạng đồng phân khác nhau"
  },
  {
    "con": "Khi một chất phản ứng với oxy thì sản phẩm thường là oxit",
    "re": "Điều này xảy ra trong quá trình oxi hóa"
  },
  {
    "con": "Nếu một dung dịch có nồng độ ion H+ cao thì dung dịch đó có tính axit mạnh",
    "re": "Điều này có thể dẫn đến sự ăn mòn các vật liệu khác"
  },
  {
    "con": "Chọn phương án đúng: Cho các nguyên tử 20Ca, 26Fe, 33As, 50Sn, 53I. Các ion có cấu hình khí trơ gần nó nhất là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nguyên tử có số proton bằng số electron sẽ có điện tích tổng thể bằng 0",
    "re": "Nguyên tử đó là trung hòa điện"
  },
  {
    "con": "Nếu một hợp chất có liên kết ion, thì nó sẽ có điểm nóng chảy cao",
    "re": "Hợp chất đó thường là chất rắn ở nhiệt độ phòng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng sẽ tăng lên",
    "re": "Phản ứng sẽ diễn ra nhanh hơn"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là axit",
    "re": "Dung dịch đó có tính axit"
  },
  {
    "con": "Nếu một nguyên tử có số electron ở lớp ngoài cùng là 8, thì nguyên tử đó ổn định",
    "re": "Nguyên tử đó có cấu hình electron bão hòa"
  },
  {
    "con": "Nếu một chất có tính chất dẫn điện khi hòa tan trong nước, thì chất đó có khả năng tạo ion",
    "re": "Chất đó là chất điện ly"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì năng lượng được giải phóng ra môi trường",
    "re": "Phản ứng đó sẽ làm tăng nhiệt độ của môi trường xung quanh"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử lớn hơn 92, thì nó được coi là nguyên tố phóng xạ",
    "re": "Nguyên tố đó không ổn định và có thể phân rã"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là CnH2n+2, thì hợp chất đó là ankan",
    "re": "Hợp chất đó là một loại hydrocarbon bão hòa"
  },
  {
    "con": "Chọn phương án đúng: Nguyên tố X thuộc chu kỳ 4, phân nhóm phụ nhóm 4 có cấu hình electron là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch",
    "re": "Phản ứng sẽ dịch chuyển theo hướng sinh ra nhiều sản phẩm hơn"
  },
  {
    "con": "Một chất có độ pH nhỏ hơn 7",
    "re": "Chất đó được coi là axit"
  },
  {
    "con": "Khi một nguyên tố mất electron",
    "re": "Nguyên tố đó trở thành ion dương"
  },
  {
    "con": "Khi hai nguyên tố kết hợp để tạo thành một hợp chất",
    "re": "Hợp chất đó sẽ có tính chất khác biệt so với các nguyên tố ban đầu"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao",
    "re": "Phản ứng sẽ có xu hướng tạo ra ít phân tử hơn"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên",
    "re": "Tốc độ phản ứng hóa học sẽ tăng lên"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước",
    "re": "Chất đó sẽ bay hơi ở nhiệt độ thường"
  },
  {
    "con": "Khi một nguyên tử có số electron bằng số proton",
    "re": "Nguyên tử đó sẽ trung hòa về điện"
  },
  {
    "con": "Nếu một phản ứng hóa học là tỏa nhiệt",
    "re": "Nó sẽ giải phóng năng lượng ra môi trường xung quanh"
  },
  {
    "con": "Chọn phương án đúng: Nhiệt độ nóng chảy của dãy các hợp chất AH4 của các nguyên tố p phân nhóm IVA khi đi từ trên xuống:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nồng độ mol của dung dịch được tính bằng số mol chất tan trên thể tích dung dịch tính bằng lít:",
    "re": "Nồng độ mol sẽ tăng nếu số mol chất tan tăng hoặc thể tích dung dịch giảm"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng:",
    "re": "Điều này xảy ra do năng lượng va chạm giữa các phân tử tăng lên"
  },
  {
    "con": "Nếu một hợp chất có liên kết ion, thì:",
    "re": "Hợp chất đó sẽ có điểm nóng chảy và điểm sôi cao hơn so với hợp chất có liên kết covalent"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7:",
    "re": "Dung dịch đó sẽ trở thành dung dịch axit"
  },
  {
    "con": "Nếu một nguyên tố có số oxi hóa cao nhất là +7, thì:",
    "re": "Nguyên tố đó có khả năng tạo ra nhiều hợp chất khác nhau với các nguyên tố khác"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện áp suất cao:",
    "re": "Phản ứng sẽ có xu hướng chuyển dịch về phía có ít phân tử khí hơn"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước:",
    "re": "Chất đó thường là một chất ion hoặc có khả năng tạo liên kết hydro"
  },
  {
    "con": "Khi một dung dịch bão hòa được làm nguội:",
    "re": "Chất tan có thể kết tinh ra ngoài dung dịch"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch:",
    "re": "Thì nó có thể diễn ra theo cả hai chiều, tạo ra sản phẩm và tái tạo lại chất phản ứng"
  },
  {
    "con": "Hợp chất nào dưới đây có liên kết cộng hóa trị: (1) HCl; (2) NaH; (3) BH_3; (4) CH_3Cl",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thường làm tăng tốc độ phản ứng",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7 thì chất đó được coi là axit",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là NaCl thì nó là muối",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử là 6 thì nó là carbon",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường nước thì nó được gọi là phản ứng thủy phân",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện trong dung dịch thì chất đó là ion",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có liên kết ion thì nó thường có điểm nóng chảy cao",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch thì nó có thể diễn ra theo cả hai chiều",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng thì nó có thể có đồng phân quang học",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chọn phương án đúng: Trong cùng chu kỳ, bán kính ion của các nguyên tố phân nhóm VIA lớn hơn bán kính ion đẳng electron của các nguyên tố phân nhóm VIIA, do các nguyên tố phân nhóm VIA có:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng lên",
    "re": "do năng lượng va chạm giữa các phân tử tăng lên"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước, thì chất đó thường là chất ion hoặc phân cực",
    "re": "do sự tương tác giữa các phân tử nước và các ion hoặc phân tử phân cực"
  },
  {
    "con": "Khi pH của dung dịch giảm, thì nồng độ ion H+ trong dung dịch tăng lên",
    "re": "do pH là thang đo nồng độ ion H+"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao, thì thể tích sản phẩm có thể giảm",
    "re": "do các nguyên tắc của định luật Boyle"
  },
  {
    "con": "Khi một chất bị oxi hóa, thì nó mất electron",
    "re": "do quá trình oxi hóa liên quan đến sự mất electron"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao, thì khả năng dẫn điện của dung dịch đó thường cao",
    "re": "do sự hiện diện của nhiều ion tự do trong dung dịch"
  },
  {
    "con": "Khi một chất có nhiệt độ nóng chảy thấp, thì nó thường có cấu trúc phân tử không chặt chẽ",
    "re": "do lực liên kết giữa các phân tử yếu"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì sản phẩm có thể chuyển đổi trở lại thành phản ứng ban đầu",
    "re": "do sự cân bằng giữa các phản ứng tiến và lùi"
  },
  {
    "con": "Khi một nguyên tố có điện tích dương, thì nó được gọi là cation",
    "re": "do sự mất electron tạo ra điện tích dương"
  },
  {
    "con": "Chọn phương án sai theo thuyết cơ học lượng tử:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch:",
    "re": "Phản ứng sẽ dịch chuyển theo chiều phản ứng ngược"
  },
  {
    "con": "Số mol của một chất trong một dung dịch được tính bằng:",
    "re": "Khối lượng chất chia cho khối lượng mol của chất đó"
  },
  {
    "con": "Khi pH của dung dịch giảm:",
    "re": "Nồng độ ion H+ trong dung dịch tăng lên"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao:",
    "re": "Phản ứng sẽ dịch chuyển theo chiều có ít phân tử khí hơn"
  },
  {
    "con": "Khi nhiệt độ của một chất lỏng tăng lên:",
    "re": "Áp suất hơi của chất lỏng cũng tăng lên"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước:",
    "re": "Chất đó thường là chất ion hoặc phân cực"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn phản ứng:",
    "re": "Phản ứng đó là phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một dung dịch có nồng độ ion OH- cao:",
    "re": "Dung dịch đó có tính kiềm"
  },
  {
    "con": "Khi một chất bị oxi hóa:",
    "re": "Chất đó mất electron"
  },
  {
    "con": "Chọn phương án đúng: Ái lực electron của nguyên tố:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nguyên tử có số proton bằng số electron:",
    "re": "Nguyên tử đó trung hòa về điện"
  },
  {
    "con": "Chất có nhiệt độ sôi thấp hơn nhiệt độ phòng:",
    "re": "Chất đó thường ở trạng thái khí tại nhiệt độ phòng"
  },
  {
    "con": "Phản ứng hóa học xảy ra khi các liên kết hóa học bị phá vỡ:",
    "re": "Sản phẩm mới được hình thành"
  },
  {
    "con": "Chọn phương án đúng: Đơn vị đo khối lượng nguyên tử là:",
    "re": "u (đơn vị khối lượng nguyên tử)"
  },
  {
    "con": "Chất điện ly trong nước tạo ra ion:",
    "re": "Chất đó có khả năng dẫn điện"
  },
  {
    "con": "Nhiệt độ tăng lên làm tăng tốc độ phản ứng hóa học:",
    "re": "Phản ứng xảy ra nhanh hơn"
  },
  {
    "con": "Chọn phương án đúng: Nguyên tố có cùng số proton nhưng khác số neutron:",
    "re": "Đó là đồng vị của nguyên tố"
  },
  {
    "con": "Chất rắn có cấu trúc tinh thể:",
    "re": "Có điểm nóng chảy xác định"
  },
  {
    "con": "Phản ứng oxi hóa khử liên quan đến sự thay đổi số oxi hóa:",
    "re": "Một chất bị oxi hóa và một chất bị khử"
  },
  {
    "con": "Chọn phương án đúng: Ocbital nguyên tử là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch",
    "re": "thì tốc độ phản ứng thuận có thể tăng lên"
  },
  {
    "con": "Một chất có điểm sôi thấp hơn điểm sôi của nước",
    "re": "thì chất đó có thể bay hơi dễ dàng hơn ở nhiệt độ thường"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên",
    "re": "thì khả năng xảy ra phản ứng hóa học cũng tăng lên"
  },
  {
    "con": "Nếu một phản ứng hóa học tỏa nhiệt",
    "re": "thì nó có thể được coi là phản ứng exothermic"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7",
    "re": "thì dung dịch đó trở nên axit hơn"
  },
  {
    "con": "Nếu một nguyên tố có số electron hóa trị là 1",
    "re": "thì nó có khả năng tạo thành liên kết ion với các nguyên tố khác"
  },
  {
    "con": "Khi một chất bị phân hủy thành các chất đơn giản hơn",
    "re": "thì đó được gọi là phản ứng phân hủy"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao",
    "re": "thì nó có khả năng dẫn điện tốt hơn"
  },
  {
    "con": "Khi hai chất phản ứng với nhau tạo thành sản phẩm mới",
    "re": "thì đó được gọi là phản ứng hóa học"
  },
  {
    "con": "Chọn phương án đúng: Cho các nguyên tố: _{15}P, _{22}Ti, _{24}Cr, _{25}Mn, _{47}Ag. Ở trạng thái cơ bản nguyên tố có nhiều và ít electron độc thân nhất lần lượt là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một nguyên tố có số proton lớn hơn số electron thì",
    "re": "nguyên tố đó mang điện tích dương"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O thì",
    "re": "hợp chất đó là nước"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường",
    "re": "tăng lên do các phân tử có năng lượng cao hơn"
  },
  {
    "con": "Nếu một nguyên tố có số lượng electron ở lớp ngoài cùng là 8 thì",
    "re": "nguyên tố đó thường ổn định và ít phản ứng"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn các phản ứng ban đầu thì",
    "re": "phản ứng đó là phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một dung dịch có pH < 7 thì",
    "re": "dung dịch đó được coi là axit"
  },
  {
    "con": "Khi một nguyên tố có số lượng neutron khác nhau nhưng cùng số proton thì",
    "re": "các nguyên tố đó được gọi là đồng vị"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao thì",
    "re": "phản ứng có thể chuyển dịch theo hướng tạo ra ít phân tử hơn"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước tạo thành dung dịch thì",
    "re": "chất đó được gọi là chất tan"
  },
  {
    "con": "Phân tử nước (H2O) có cấu trúc hình học:",
    "re": "Hình chữ V"
  },
  {
    "con": "Chất rắn có cấu trúc tinh thể sẽ:",
    "re": "Có điểm nóng chảy xác định"
  },
  {
    "con": "Khi nhiệt độ tăng, áp suất của khí trong một bình kín sẽ:",
    "re": "Tăng lên"
  },
  {
    "con": "Phản ứng hóa học xảy ra khi:",
    "re": "Có sự tái sắp xếp các nguyên tử"
  },
  {
    "con": "Chất điện phân là chất:",
    "re": "Có khả năng dẫn điện khi hòa tan trong nước"
  },
  {
    "con": "Khi một axit phản ứng với một bazơ, sản phẩm tạo thành sẽ:",
    "re": "Là muối và nước"
  },
  {
    "con": "Số nguyên tử trong một phân tử CO2 là:",
    "re": "Ba nguyên tử"
  },
  {
    "con": "Khi một chất bị oxi hóa, nó sẽ:",
    "re": "Mất electron"
  },
  {
    "con": "Trong bảng tuần hoàn, các nguyên tố cùng nhóm có:",
    "re": "Tính chất hóa học tương tự"
  },
  {
    "con": "Khi pH của dung dịch giảm, tính axit của dung dịch sẽ:",
    "re": "Tăng lên"
  },
  {
    "con": "Chọn trường hợp đúng:\n Dựa vào các tính chất của liên kết cộng hóa trị theo phương pháp VB, hãy dự đoán phân tử không thể tồn tại trong số các phân tử sau: SF_6, BrF_7, IF_7, ClF_3, NCl_5, I_7F",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên",
    "re": "Tốc độ phản ứng hóa học sẽ tăng lên"
  },
  {
    "con": "Sự có mặt của chất xúc tác",
    "re": "Tốc độ phản ứng sẽ được tăng cường mà không làm thay đổi trạng thái cân bằng"
  },
  {
    "con": "Tăng nồng độ của các phản ứng",
    "re": "Tốc độ phản ứng sẽ tăng lên do có nhiều phân tử phản ứng hơn"
  },
  {
    "con": "Giảm thể tích của hệ thống phản ứng khí",
    "re": "Áp suất sẽ tăng lên, có thể làm thay đổi trạng thái cân bằng"
  },
  {
    "con": "Chất điện ly mạnh trong dung dịch",
    "re": "Sẽ phân ly hoàn toàn thành ion, dẫn đến tăng tính dẫn điện"
  },
  {
    "con": "Sự thay đổi pH của dung dịch",
    "re": "Có thể ảnh hưởng đến sự hòa tan của các muối và sự hoạt động của enzyme"
  },
  {
    "con": "Sự có mặt của ion kim loại trong dung dịch",
    "re": "Có thể tạo ra các phản ứng kết tủa với các ion khác"
  },
  {
    "con": "Sự tăng nhiệt độ trong phản ứng tỏa nhiệt",
    "re": "Có thể làm giảm tốc độ phản ứng do làm giảm nồng độ của các chất phản ứng"
  },
  {
    "con": "Sự thay đổi cấu trúc của phân tử",
    "re": "Có thể ảnh hưởng đến tính chất hóa học và vật lý của chất"
  },
  {
    "con": "Chọn phương án đúng:\n Trong dãy hợp chất với hydro của các nguyên tố nhóm VIA: H_2O, H_2S, H_2Se, H_2Te, nhiệt độ sôi các chất biến thiên như sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ sôi của nước cao hơn so với các hợp chất khác của hydro với các nguyên tố nhóm VIA",
    "re": "Nước có liên kết hydro mạnh hơn"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion dương và ion âm",
    "re": "Chất đó được coi là chất điện ly"
  },
  {
    "con": "Khi pH của dung dịch nhỏ hơn 7",
    "re": "Dung dịch đó được coi là axit"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và năng lượng được giải phóng",
    "re": "Phản ứng đó được gọi là phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi nhiệt độ tăng trong một phản ứng hóa học",
    "re": "Tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Khi một nguyên tố có số electron hóa trị cao hơn",
    "re": "Nguyên tố đó có khả năng tạo liên kết hóa học mạnh hơn"
  },
  {
    "con": "Khi một chất có độ hòa tan cao trong nước",
    "re": "Chất đó thường là chất ion hoặc phân cực"
  },
  {
    "con": "Khi một phản ứng hóa học đạt đến trạng thái cân bằng",
    "re": "Tốc độ phản ứng thuận và phản ứng nghịch bằng nhau"
  },
  {
    "con": "Khi một nguyên tố có cấu trúc electron đầy đủ",
    "re": "Nguyên tố đó thường ít phản ứng hơn"
  },
  {
    "con": "Chọn câu chính xác nhất:\n Trong ion NH_4^+ có 4 liên kết cộng hóa trị gồm:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion,",
    "re": "chất đó được gọi là chất điện ly."
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên,",
    "re": "thì động năng của các phân tử trong chất đó cũng tăng lên."
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra,",
    "re": "thì các liên kết hóa học trong các chất phản ứng bị phá vỡ và các liên kết mới được hình thành."
  },
  {
    "con": "Nếu một chất có độ pH nhỏ hơn 7,",
    "re": "thì chất đó được coi là axit."
  },
  {
    "con": "Khi một nguyên tử mất electron,",
    "re": "thì nó trở thành ion dương."
  },
  {
    "con": "Nếu hai nguyên tố kết hợp với nhau để tạo thành hợp chất,",
    "re": "thì chúng sẽ có tỉ lệ khối lượng xác định."
  },
  {
    "con": "Khi một chất bay hơi,",
    "re": "thì các phân tử của nó chuyển từ trạng thái lỏng sang trạng thái khí."
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch,",
    "re": "thì sản phẩm của phản ứng có thể chuyển đổi trở lại thành các chất phản ứng."
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên,",
    "re": "thì khả năng xảy ra phản ứng hóa học cũng tăng lên."
  },
  {
    "con": "Chọn trường hợp đúng:\n Số orbital tối đa có thể có tương ứng với ký hiệu sau: 2p_x, 3d_{x^2-y^2} , 4d, n=2, n=5.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng thường tăng lên.",
    "re": "Điều này xảy ra do năng lượng va chạm giữa các phân tử tăng lên."
  },
  {
    "con": "Nếu một chất có độ pH dưới 7 thì chất đó được coi là axit.",
    "re": "Điều này có nghĩa là chất đó có khả năng giải phóng ion H+ trong dung dịch."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao thì thể tích sản phẩm thường giảm.",
    "re": "Điều này xảy ra do sự giảm thể tích khí theo định luật Boyle."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng thì chất đó có thể có đồng phân quang học.",
    "re": "Điều này có nghĩa là chất đó có thể tồn tại dưới dạng hai dạng đồng phân khác nhau."
  },
  {
    "con": "Nếu một ion mang điện tích dương thì nó được gọi là cation.",
    "re": "Điều này có nghĩa là ion đó đã mất electron."
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng thì chất đó thường tồn tại ở trạng thái khí.",
    "re": "Điều này có thể thấy ở nhiều hợp chất hữu cơ như metan."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt thì năng lượng được giải phóng ra môi trường.",
    "re": "Điều này có thể làm tăng nhiệt độ của môi trường xung quanh."
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao thì khả năng dẫn điện của dung dịch đó thường cao.",
    "re": "Điều này xảy ra do sự hiện diện của nhiều ion tự do trong dung dịch."
  },
  {
    "con": "Nếu một chất có liên kết ion thì nó thường có điểm nóng chảy cao.",
    "re": "Điều này là do lực hút mạnh giữa các ion trái dấu."
  },
  {
    "con": "Chọn phương án đúng:\n Sắp các ion sau: _3Li^+, _{11}Na^+, _{17}Cl^-, _{19}K^+, _{35}Br^-, _{53}I^- theo chiều tăng dần bán kính.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nâng nhiệt độ của một chất lỏng thì",
    "re": "độ hòa tan của nhiều chất rắn trong chất lỏng đó sẽ tăng lên"
  },
  {
    "con": "Thêm axit vào dung dịch kiềm thì",
    "re": "pH của dung dịch sẽ giảm"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao thì",
    "re": "tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Nếu một chất có độ âm điện cao thì",
    "re": "chất đó có khả năng thu hút electron mạnh hơn"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên thì",
    "re": "tốc độ phản ứng hóa học có thể tăng lên"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng thì",
    "re": "chất đó có thể có tính quang hoạt"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước thì",
    "re": "các ion của chất đó sẽ phân tán trong dung dịch"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch thì",
    "re": "có thể xảy ra cả hai chiều phản ứng"
  },
  {
    "con": "Khi áp suất của một khí tăng lên thì",
    "re": "thể tích của khí đó sẽ giảm nếu nhiệt độ không đổi"
  },
  {
    "con": "Chọn phương án đúng:\n Ở trạng thái tinh thể, hợp chất CH_3COONa có những loại liên kết nào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất được hòa tan trong nước và tạo ra ion, thì chất đó được gọi là:",
    "re": "Chất điện ly"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra mà không có sự thay đổi về khối lượng, thì:",
    "re": "Nguyên lý bảo toàn khối lượng được áp dụng"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên, thì động năng của các phân tử trong chất đó:",
    "re": "Tăng lên"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học C_2H_6, thì nó thuộc loại:",
    "re": "Hydrocarbon bão hòa"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7, thì dung dịch đó:",
    "re": "Có tính axit"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 12, thì nguyên tố đó là:",
    "re": "Magie (Mg)"
  },
  {
    "con": "Khi một chất tham gia phản ứng oxi hóa, thì nó:",
    "re": "Mất electron"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol là 1M, thì trong 1 lít dung dịch có:",
    "re": "1 mol chất tan"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện áp suất cao, thì tốc độ phản ứng thường:",
    "re": "Tăng lên"
  },
  {
    "con": "Ion X_4^+ có cấu hình e phân lớp cuối cùng là 3p^6. Vậy giá trị của 4 số lượng tử của e cuối cùng của nguyên tử X là (qui ước mℓ có giá trị từ -ℓ đến +ℓ)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O, thì nó là nước",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử là 6, thì nó là carbon",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu pH của một dung dịch là 7, thì dung dịch đó được coi là trung tính",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng thường tăng lên",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tử có số lượng electron bằng số lượng proton, thì nguyên tử đó là trung hòa về điện",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất ion được hình thành từ kim loại và phi kim, thì nó thường có điểm nóng chảy cao",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol là 1M, thì có 1 mol chất tan trong 1 lít dung môi",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì nó có thể diễn ra theo cả hai chiều",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố thuộc nhóm 1 trong bảng tuần hoàn, thì nó là một kim loại kiềm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Dự đoán điện tích hạt nhân của nguyên tố kim loại kiềm (chưa phát hiện) ở chu kỳ 8 của bảng HTTH, biết nguyên tố 87Fr là kim loại kiềm thuộc chu kỳ 7.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ của một phản ứng hóa học tăng lên, biết rằng phản ứng đó là phản ứng tỏa nhiệt.",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Một dung dịch có pH < 7, biết rằng pH là thang đo độ axit hoặc bazơ.",
    "re": "Dung dịch đó là axit"
  },
  {
    "con": "Một nguyên tố có số hiệu nguyên tử 6, biết rằng số hiệu nguyên tử xác định số proton trong hạt nhân.",
    "re": "Nguyên tố đó là carbon"
  },
  {
    "con": "Một hợp chất có công thức hóa học H2O, biết rằng nó là một chất lỏng ở nhiệt độ phòng.",
    "re": "Chất đó là nước"
  },
  {
    "con": "Một phản ứng hóa học xảy ra trong điều kiện yếm khí, biết rằng không có oxy tham gia.",
    "re": "Phản ứng đó có thể là lên men"
  },
  {
    "con": "Một nguyên tố có khả năng dẫn điện tốt, biết rằng nó nằm trong nhóm kim loại.",
    "re": "Nguyên tố đó có thể là đồng hoặc nhôm"
  },
  {
    "con": "Một dung dịch có nồng độ mol cao, biết rằng nồng độ mol là số mol chất tan trong một lít dung dịch.",
    "re": "Dung dịch đó sẽ có khả năng dẫn điện tốt hơn"
  },
  {
    "con": "Một phản ứng hóa học xảy ra với sự tham gia của chất xúc tác, biết rằng chất xúc tác không bị tiêu hao trong phản ứng.",
    "re": "Tốc độ phản ứng sẽ tăng mà không làm thay đổi sản phẩm"
  },
  {
    "con": "Một nguyên tố có cấu trúc electron 1s² 2s² 2p⁶, biết rằng cấu trúc này đầy đủ.",
    "re": "Nguyên tố đó là khí hiếm neon"
  },
  {
    "con": "X(3s^23p^1) và Y(2s^22p^4). Công thức phân tử của hợp chất giữa X và Y có dạng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước (H2O) có cấu trúc phân tử gồm hai nguyên tử hydro và một nguyên tử oxy.",
    "re": "Nước là một hợp chất hóa học"
  },
  {
    "con": "Một nguyên tố có số proton bằng 6.",
    "re": "Nguyên tố đó là Carbon"
  },
  {
    "con": "Một phản ứng hóa học xảy ra mà không có sự thay đổi về khối lượng tổng thể.",
    "re": "Đó là một nguyên tắc bảo toàn khối lượng"
  },
  {
    "con": "Một dung dịch có pH < 7.",
    "re": "Dung dịch đó là axit"
  },
  {
    "con": "Một nguyên tử có số electron bằng số proton.",
    "re": "Nguyên tử đó là trung hòa về điện"
  },
  {
    "con": "Khi nhiệt độ tăng, áp suất của khí trong một bình kín cũng tăng.",
    "re": "Đó là định luật Gay-Lussac"
  },
  {
    "con": "Một hợp chất ion được hình thành từ sự kết hợp giữa một kim loại và một phi kim.",
    "re": "Hợp chất đó có tính chất điện ly trong nước"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước và tạo ra dung dịch trong suốt.",
    "re": "Chất đó là chất tan"
  },
  {
    "con": "Một phản ứng hóa học xảy ra với sự hấp thụ nhiệt.",
    "re": "Đó là phản ứng thu nhiệt"
  },
  {
    "con": "Chọn phát biểu sai:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng:",
    "re": "Áp suất của khí trong một bình kín sẽ tăng"
  },
  {
    "con": "Chất tan hòa tan trong dung môi:",
    "re": "Tạo thành dung dịch"
  },
  {
    "con": "Số nguyên tử trong phân tử nước:",
    "re": "Là 3 (2 H và 1 O)"
  },
  {
    "con": "Chất rắn có cấu trúc tinh thể:",
    "re": "Có điểm nóng chảy xác định"
  },
  {
    "con": "Phản ứng hóa học xảy ra:",
    "re": "Năng lượng có thể được hấp thụ hoặc giải phóng"
  },
  {
    "con": "Ion dương và ion âm kết hợp:",
    "re": "Tạo thành hợp chất ion"
  },
  {
    "con": "Chất khí có thể nén lại:",
    "re": "Thể tích của nó sẽ giảm"
  },
  {
    "con": "Phản ứng oxi hóa khử xảy ra:",
    "re": "Có sự chuyển giao electron giữa các chất"
  },
  {
    "con": "Nồng độ mol của dung dịch tăng:",
    "re": "Sẽ làm tăng khả năng phản ứng của các chất trong dung dịch"
  },
  {
    "con": "Cho _9F, _{17}Cl, _{35}Br, _{53}I.\n Sắp xếp theo thứ tự độ dài liên kết tăng dần trong số các phân tử sau: ICℓ, IBr, BrCℓ, FCℓ.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi cao hơn chất khác,",
    "re": "thì chất đó có lực liên kết giữa các phân tử mạnh hơn."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao,",
    "re": "thì tốc độ phản ứng thường tăng lên."
  },
  {
    "con": "Nếu một dung dịch có pH < 7,",
    "re": "thì dung dịch đó được coi là axit."
  },
  {
    "con": "Nếu một nguyên tố có số oxi hóa cao nhất là +7,",
    "re": "thì nguyên tố đó có khả năng oxy hóa mạnh."
  },
  {
    "con": "Nếu một hợp chất có liên kết ion,",
    "re": "thì nó thường có điểm nóng chảy và điểm sôi cao."
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước,",
    "re": "thì chất đó thường là ion hoặc phân cực."
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch,",
    "re": "thì sản phẩm có thể chuyển đổi trở lại thành phản ứng ban đầu."
  },
  {
    "con": "Nếu một nguyên tử có nhiều electron ở lớp ngoài cùng,",
    "re": "thì nó có xu hướng tham gia vào phản ứng hóa học để đạt được cấu hình bền."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử phức tạp,",
    "re": "thì nó có thể có nhiều tính chất hóa học khác nhau."
  },
  {
    "con": "So sánh góc liên kết trong các hợp chất cộng hóa trị sau:\n 1) NH_3; 2) NF_3 ;3) NI_3; 4) CO_2",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Xác định số electron hóa trị của nguyên tố carbon (C)",
    "re": "Có 4 electron hóa trị"
  },
  {
    "con": "Nêu định nghĩa về hợp chất ion",
    "re": "Hợp chất ion là hợp chất được hình thành từ sự kết hợp của các ion dương và ion âm"
  },
  {
    "con": "So sánh tính axit của HCl và H2SO4",
    "re": "H2SO4 mạnh hơn HCl"
  },
  {
    "con": "Mô tả sự chuyển đổi từ chất rắn sang chất lỏng",
    "re": "Quá trình này gọi là nóng chảy"
  },
  {
    "con": "Nêu quy tắc bảo toàn khối lượng trong phản ứng hóa học",
    "re": "Tổng khối lượng các chất phản ứng bằng tổng khối lượng các sản phẩm"
  },
  {
    "con": "Xác định trạng thái của nước ở 0 độ C và áp suất 1 atm",
    "re": "Nước có thể tồn tại dưới dạng rắn (băng) và lỏng"
  },
  {
    "con": "Mô tả sự khác biệt giữa phản ứng hóa học và phản ứng vật lý",
    "re": "Phản ứng hóa học tạo ra các chất mới, trong khi phản ứng vật lý không thay đổi bản chất của chất"
  },
  {
    "con": "Nêu định nghĩa về mol trong hóa học",
    "re": "Mol là đơn vị đo lường số lượng chất, tương đương với 6.022 x 10^23 hạt"
  },
  {
    "con": "So sánh độ pH của dung dịch axit và bazơ",
    "re": "Dung dịch axit có độ pH dưới 7, trong khi dung dịch bazơ có độ pH trên 7"
  },
  {
    "con": "Chọn phương án đúng:\n Cho các nguyên tố _{11}Na, _{12}Mg, _{13}Al_{15}P,_{ 16}S thuộc chu kỳ 3, năng lượng ion hóa thứ nhất I1 của các nguyên tố trên tuân theo trật tự nào sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nồng độ mol của dung dịch được tính bằng số mol chất tan trên thể tích dung dịch (lít),",
    "re": "thì nồng độ mol càng cao thì khả năng phản ứng hóa học càng lớn."
  },
  {
    "con": "Khi nhiệt độ tăng lên, tốc độ phản ứng hóa học thường tăng lên,",
    "re": "thì năng lượng va chạm giữa các phân tử cũng tăng lên."
  },
  {
    "con": "Nếu một chất có độ pH < 7,",
    "re": "thì chất đó được coi là axit."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín và không có chất nào bị mất đi,",
    "re": "thì khối lượng tổng của các chất phản ứng bằng khối lượng tổng của các sản phẩm."
  },
  {
    "con": "Nếu một nguyên tố có số electron hóa trị là 1,",
    "re": "thì nguyên tố đó có khả năng tạo thành liên kết ion với các nguyên tố khác."
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion,",
    "re": "thì chất đó được gọi là chất điện ly."
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch,",
    "re": "thì có thể xảy ra cả phản ứng tiến và phản ứng lùi."
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C ở áp suất 1 atm,",
    "re": "thì chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng."
  },
  {
    "con": "Nếu một dung dịch có nồng độ ion H+ cao,",
    "re": "thì dung dịch đó có tính axit mạnh."
  },
  {
    "con": "Chọn phương án sai:\n Dấu của hàm sóng được biểu diễn trên hình dạng của các AO như sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "thường làm tăng tốc độ phản ứng"
  },
  {
    "con": "Số mol của chất trong một dung dịch được tính bằng",
    "re": "nồng độ mol nhân với thể tích dung dịch"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion",
    "re": "chất đó được gọi là chất điện ly"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao",
    "re": "thì sản phẩm khí có thể bị nén lại"
  },
  {
    "con": "Khi pH của dung dịch giảm",
    "re": "thì nồng độ ion H+ trong dung dịch tăng lên"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước",
    "re": "thì chất đó sẽ bay hơi nhanh hơn khi đun nóng"
  },
  {
    "con": "Khi một phản ứng hóa học đạt đến trạng thái cân bằng",
    "re": "tốc độ phản ứng thuận và phản ứng nghịch bằng nhau"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử cao",
    "re": "thì nó có nhiều proton hơn trong hạt nhân"
  },
  {
    "con": "Khi một dung dịch có nồng độ ion OH- cao",
    "re": "thì dung dịch đó có tính kiềm"
  },
  {
    "con": "Chọn phương án đúng:\n Số liên kết cộng hóa trị tối đa một nguyên tố có thể đạt được:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì",
    "re": "tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Một chất có độ pH dưới 7 thì",
    "re": "chất đó được coi là axit"
  },
  {
    "con": "Khi một nguyên tố mất electron thì",
    "re": "nguyên tố đó trở thành ion dương"
  },
  {
    "con": "Nếu hai chất phản ứng với nhau và tạo ra sản phẩm mới thì",
    "re": "phản ứng hóa học đã xảy ra"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên thì",
    "re": "tốc độ phản ứng có thể tăng lên"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao thì",
    "re": "phản ứng có thể chuyển dịch theo hướng tạo ra ít phân tử hơn"
  },
  {
    "con": "Khi một chất hòa tan trong nước tạo ra ion thì",
    "re": "chất đó được gọi là chất điện ly"
  },
  {
    "con": "Nếu một nguyên tố có số electron bằng số proton thì",
    "re": "nguyên tố đó có điện tích bằng 0"
  },
  {
    "con": "Khi nhiệt độ giảm trong một phản ứng tỏa nhiệt thì",
    "re": "phản ứng có thể bị chậm lại"
  },
  {
    "con": "Chọn phát biểu sai:\nNguyên tố X có cấu hình e lớp cuối cùng là 2s^22p^6.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch.",
    "re": "Thì cân bằng sẽ dịch chuyển về phía phản ứng tỏa nhiệt."
  },
  {
    "con": "Chất A có độ tan trong nước cao.",
    "re": "Thì chất A có khả năng là một chất điện ly mạnh."
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7.",
    "re": "Thì dung dịch đó trở thành dung dịch axit."
  },
  {
    "con": "Nguyên tử có số proton bằng số electron.",
    "re": "Thì nguyên tử đó là trung hòa về điện."
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, năng lượng được giải phóng.",
    "re": "Thì phản ứng đó có thể là phản ứng tỏa nhiệt."
  },
  {
    "con": "Chất rắn có cấu trúc tinh thể.",
    "re": "Thì chất đó có thể có điểm nóng chảy xác định."
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên.",
    "re": "Thì khả năng xảy ra phản ứng hóa học cũng tăng lên."
  },
  {
    "con": "Chất khí có thể nén lại dễ dàng.",
    "re": "Thì khoảng cách giữa các phân tử trong chất khí lớn."
  },
  {
    "con": "Khi một chất bị oxi hóa.",
    "re": "Thì chất đó mất electron."
  },
  {
    "con": "Chọn phương án đúng:\n Trong liên kết Van der Waals của hợp chất CH_4 thì tương tác nào là đáng kể:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng sẽ tăng lên.",
    "re": "Điều này xảy ra do năng lượng của các phân tử tăng lên, dẫn đến nhiều va chạm hơn."
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên thì tốc độ phản ứng cũng sẽ tăng lên.",
    "re": "Điều này xảy ra do có nhiều phân tử hơn để va chạm và phản ứng."
  },
  {
    "con": "Nếu một chất có độ pH thấp hơn 7 thì chất đó được coi là axit.",
    "re": "Điều này có nghĩa là chất đó có khả năng giải phóng ion H+ trong dung dịch."
  },
  {
    "con": "Khi một chất rắn tan trong nước thì nó sẽ tạo ra dung dịch.",
    "re": "Điều này xảy ra khi các phân tử nước tương tác với các phân tử của chất rắn."
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch thì nó có thể diễn ra theo cả hai chiều.",
    "re": "Điều này có nghĩa là sản phẩm có thể chuyển đổi trở lại thành reactant."
  },
  {
    "con": "Khi nhiệt độ giảm xuống thì độ hòa tan của khí trong chất lỏng thường tăng lên.",
    "re": "Điều này xảy ra do giảm năng lượng của phân tử khí, giúp chúng dễ dàng hòa tan hơn."
  },
  {
    "con": "Nếu một hợp chất có cấu trúc phân tử không đối xứng thì nó có thể có đồng phân quang học.",
    "re": "Điều này có nghĩa là hợp chất đó có thể tồn tại dưới dạng hai dạng đồng phân khác nhau."
  },
  {
    "con": "Khi một chất bị oxi hóa thì nó sẽ mất electron.",
    "re": "Điều này có thể dẫn đến sự tăng cường số oxi hóa của chất đó."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao thì nó có thể làm tăng tốc độ phản ứng.",
    "re": "Điều này xảy ra do tăng cường mật độ phân tử, dẫn đến nhiều va chạm hơn."
  },
  {
    "con": "Chọn phương án sai theo thuyết cơ học lượng tử áp dụng cho nguyên tử đa electron:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sử dụng công thức PV=nRT cho một khí lý tưởng:",
    "re": "Có thể tính toán áp suất, thể tích hoặc số mol của khí"
  },
  {
    "con": "Biết rằng nước có điểm sôi 100 độ C ở áp suất 1 atm:",
    "re": "Điểm sôi của nước sẽ thay đổi khi áp suất thay đổi"
  },
  {
    "con": "Thực hiện phản ứng hóa học giữa axit và bazơ:",
    "re": "Sẽ tạo ra muối và nước"
  },
  {
    "con": "Sử dụng định luật bảo toàn khối lượng trong phản ứng hóa học:",
    "re": "Tổng khối lượng các chất phản ứng bằng tổng khối lượng các sản phẩm"
  },
  {
    "con": "Biết rằng nguyên tử carbon có 4 electron ở lớp ngoài cùng:",
    "re": "Carbon có khả năng tạo ra 4 liên kết hóa học"
  },
  {
    "con": "Thực hiện phản ứng oxi hóa khử:",
    "re": "Một chất sẽ bị oxi hóa và một chất sẽ bị khử"
  },
  {
    "con": "Sử dụng bảng tuần hoàn để xác định tính chất của nguyên tố:",
    "re": "Có thể dự đoán tính chất hóa học và vật lý của nguyên tố đó"
  },
  {
    "con": "Biết rằng ion dương có điện tích dương:",
    "re": "Ion dương được hình thành khi nguyên tử mất electron"
  },
  {
    "con": "Thực hiện phản ứng giữa hai chất lỏng không hòa tan:",
    "re": "Có thể tạo ra một lớp phân cách giữa hai chất"
  },
  {
    "con": "Chọn phương án đúng:\n Xác định trạng thái lai hóa của các nguyên tử cacbon trong phân tử sau (từ trái qua phải): CH3─CH═CH─C≡C─CHO",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nâng cao nhiệt độ của một phản ứng hóa học",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Giảm áp suất trong một hệ thống khí",
    "re": "Thể tích của khí sẽ tăng lên theo định luật Boyle"
  },
  {
    "con": "Thêm chất xúc tác vào một phản ứng hóa học",
    "re": "Tốc độ phản ứng sẽ tăng mà không làm thay đổi trạng thái cân bằng"
  },
  {
    "con": "Tăng nồng độ của một chất trong phản ứng cân bằng",
    "re": "Phản ứng sẽ dịch chuyển theo hướng tiêu thụ chất đó"
  },
  {
    "con": "Thay đổi pH của dung dịch axit",
    "re": "Tính axit hoặc bazơ của dung dịch sẽ thay đổi"
  },
  {
    "con": "Sử dụng nước để hòa tan muối",
    "re": "Muối sẽ phân ly thành các ion trong dung dịch"
  },
  {
    "con": "Thêm nhiệt vào một phản ứng endoterm",
    "re": "Phản ứng sẽ diễn ra mạnh mẽ hơn"
  },
  {
    "con": "Giảm nhiệt độ của một phản ứng hóa học tỏa nhiệt",
    "re": "Tốc độ phản ứng sẽ giảm"
  },
  {
    "con": "Thực hiện phản ứng giữa axit và bazơ",
    "re": "Sẽ tạo ra muối và nước"
  },
  {
    "con": "Chọn phương án đúng: Hợp chất nào có moment lưỡng cực bằng không:\n 1) trans-ClHC=CHCl; 2) CH_3Cl; 3) CS_2; 4) NO_2",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch",
    "re": "Thì cân bằng sẽ dịch chuyển về phía phản ứng thu nhiệt"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên",
    "re": "Thì tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7",
    "re": "Thì chất đó được coi là axit"
  },
  {
    "con": "Nếu một hợp chất có liên kết ion",
    "re": "Thì nó sẽ có điểm nóng chảy cao và dẫn điện trong trạng thái lỏng"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong môi trường kín",
    "re": "Thì tổng khối lượng của các chất phản ứng và sản phẩm sẽ không thay đổi"
  },
  {
    "con": "Nếu một nguyên tố có số oxi hóa cao nhất là +7",
    "re": "Thì nguyên tố đó có khả năng oxy hóa mạnh"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao",
    "re": "Thì nó sẽ có khả năng dẫn điện tốt hơn"
  },
  {
    "con": "Khi một chất khí được nén lại",
    "re": "Thì áp suất của nó sẽ tăng lên theo định luật Boyle"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt",
    "re": "Thì nó sẽ giải phóng năng lượng dưới dạng nhiệt"
  },
  {
    "con": "Chọn nguyên tử trung tâm Z thích hợp trong số các nguyên tử sau 6C, 7N, 16S để các phân tử hoặc ion sau đây tồn tại thực và có dạng tương ứng:\n 1) [OZO] thẳng hàng.\n 2) [ZO_3]^- tam giác phẳng.\n 3) [ZO_3]^{2-} tháp tam giác.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sử dụng quy tắc octet cho các nguyên tử trong phân tử, nếu nguyên tử có 8 electron ở lớp ngoài cùng thì nguyên tử đó ổn định.",
    "re": "Nguyên tử đó ổn định"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng sẽ tăng lên.",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là axit.",
    "re": "Dung dịch đó được coi là axit"
  },
  {
    "con": "Nếu một nguyên tố có số electron hóa trị là 1, thì nó có khả năng tạo thành liên kết ion với nguyên tố có số electron hóa trị là 7.",
    "re": "Nó có khả năng tạo thành liên kết ion"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C, thì chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng.",
    "re": "Chất đó có thể tồn tại ở trạng thái khí"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì năng lượng được giải phóng trong quá trình phản ứng.",
    "re": "Năng lượng được giải phóng"
  },
  {
    "con": "Nếu một ion mang điện tích dương, thì nó được gọi là cation.",
    "re": "Nó được gọi là cation"
  },
  {
    "con": "Nếu một chất có tính chất hóa học tương tự với một nguyên tố khác trong cùng một nhóm của bảng tuần hoàn, thì chúng có thể có tính chất tương tự.",
    "re": "Chúng có thể có tính chất tương tự"
  },
  {
    "con": "Nếu một phân tử có liên kết đôi, thì nó có thể tham gia vào phản ứng cộng.",
    "re": "Nó có thể tham gia vào phản ứng cộng"
  },
  {
    "con": "Chọn phương án đúng: Cho: _1H, _4Be,_6C, _7N, _8O, _{16}S, _{17}Cl. Trong các tiểu phân sau, tiểu phân nào có cấu trúc dạng đường thẳng: CO_2, BeCl_2, H_2S, NH_2^-, COS (với C là nguyên tử trung tâm), NO_2",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Có một dung dịch axit mạnh, nồng độ cao",
    "re": "pH của dung dịch sẽ thấp hơn 1"
  },
  {
    "con": "Nhiệt độ tăng trong một phản ứng hóa học thuận nghịch",
    "re": "Phản ứng sẽ dịch chuyển theo chiều tỏa nhiệt"
  },
  {
    "con": "Một nguyên tố có số hiệu nguyên tử Z",
    "re": "Số proton trong hạt nhân của nguyên tố đó sẽ là Z"
  },
  {
    "con": "Một hợp chất ion được hình thành từ kim loại và phi kim",
    "re": "Hợp chất đó sẽ có tính chất dẫn điện khi hòa tan trong nước"
  },
  {
    "con": "Khi một chất rắn hòa tan trong dung môi",
    "re": "Nồng độ của chất rắn trong dung dịch sẽ tăng lên cho đến khi đạt đến điểm bão hòa"
  },
  {
    "con": "Một phản ứng hóa học xảy ra trong điều kiện áp suất cao",
    "re": "Thể tích sản phẩm sẽ nhỏ hơn thể tích của các phản ứng ban đầu nếu phản ứng có số mol sản phẩm lớn hơn số mol phản ứng"
  },
  {
    "con": "Khi một chất khí được làm lạnh",
    "re": "Áp suất của chất khí sẽ giảm nếu thể tích không thay đổi"
  },
  {
    "con": "Một dung dịch có nồng độ mol cao",
    "re": "Sẽ có khả năng tạo ra nhiều ion hơn trong dung dịch"
  },
  {
    "con": "Khi một nguyên tố có điện tích dương",
    "re": "Nguyên tố đó sẽ có khả năng thu hút electron từ các nguyên tố khác"
  },
  {
    "con": "Chọn phương án đúng:\nIon M^{3+} và ion X^{2-} có phân lớp cuối cùng lần lượt là 2p^6 và 4p^6.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các nguyên tử có cùng số proton nhưng khác số neutron sẽ tạo thành đồng vị.",
    "re": "Chúng có tính chất hóa học tương tự nhau."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao,",
    "re": "thì tốc độ phản ứng thường tăng lên."
  },
  {
    "con": "Nếu một dung dịch có pH < 7,",
    "re": "thì dung dịch đó được coi là axit."
  },
  {
    "con": "Nếu hai chất phản ứng với nhau tạo ra sản phẩm mới,",
    "re": "thì phản ứng hóa học đã xảy ra."
  },
  {
    "con": "Nếu một nguyên tố có số electron hóa trị là 1,",
    "re": "thì nguyên tố đó có khả năng tạo liên kết ion với nguyên tố khác."
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước,",
    "re": "thì chất đó sẽ bay hơi nhanh hơn trong điều kiện bình thường."
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch,",
    "re": "thì sản phẩm có thể chuyển đổi trở lại thành phản ứng ban đầu."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng,",
    "re": "thì chất đó có thể có nhiều đồng phân hình học."
  },
  {
    "con": "Nếu một nguyên tố có độ âm điện cao,",
    "re": "thì nó có xu hướng thu hút electron trong liên kết hóa học."
  },
  {
    "con": "Cho _5B, _9F. Chọn phương án đúng: Phân tử BF_3 có đặc điểm cấu tạo:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử Z, thì số proton trong hạt nhân của nguyên tố đó là Z.",
    "re": "Số proton bằng số hiệu nguyên tử"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O, thì nó là nước.",
    "re": "Hợp chất này có tính chất của nước"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng thường tăng lên.",
    "re": "Tốc độ phản ứng tăng do năng lượng va chạm lớn hơn"
  },
  {
    "con": "Nếu một nguyên tố có cấu hình electron là 1s2 2s2 2p6, thì nó là nguyên tố khí hiếm.",
    "re": "Nguyên tố này là khí hiếm"
  },
  {
    "con": "Nếu pH của dung dịch là 7, thì dung dịch đó được coi là trung tính.",
    "re": "Dung dịch trung tính không có tính axit hay bazơ"
  },
  {
    "con": "Nếu một hợp chất ion được tạo thành từ kim loại và phi kim, thì nó thường có tính chất dẫn điện khi hòa tan trong nước.",
    "re": "Hợp chất ion dẫn điện trong dung dịch"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì năng lượng được giải phóng ra môi trường.",
    "re": "Năng lượng giải phóng làm tăng nhiệt độ môi trường"
  },
  {
    "con": "Nếu một nguyên tố có độ âm điện cao, thì nó có khả năng thu hút electron mạnh.",
    "re": "Nguyên tố này có tính oxi hóa mạnh"
  },
  {
    "con": "Nếu một dung dịch có nồng độ molarity cao, thì số mol chất tan trong một lít dung dịch là lớn.",
    "re": "Nồng độ molarity cao tương ứng với nhiều chất tan hơn"
  },
  {
    "con": "Chọn phương án đúng:\n Các electron có cùng số lượng tử chính chịu tác dụng chắn yếu nhất là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch thì",
    "re": "phản ứng thuận sẽ tăng tốc độ"
  },
  {
    "con": "Khi nồng độ của một chất trong phản ứng tăng lên thì",
    "re": "tốc độ phản ứng sẽ tăng"
  },
  {
    "con": "Nếu một chất có độ pH nhỏ hơn 7 thì",
    "re": "chất đó được coi là axit"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước thì",
    "re": "nó tạo thành dung dịch"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao thì",
    "re": "phản ứng sẽ có xu hướng chuyển dịch về phía có ít phân tử khí hơn"
  },
  {
    "con": "Khi nhiệt độ giảm trong một phản ứng hóa học tỏa nhiệt thì",
    "re": "phản ứng sẽ có xu hướng chuyển dịch về phía sản phẩm"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện trong dung dịch thì",
    "re": "chất đó là một chất điện ly"
  },
  {
    "con": "Khi một nguyên tố có số electron hóa trị cao thì",
    "re": "nó có khả năng tạo liên kết hóa học mạnh hơn"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kiềm thì",
    "re": "các sản phẩm có thể khác so với trong môi trường trung tính"
  },
  {
    "con": "Chọn trường hợp đúng:\n Xác định cấu hình electron hóa trị của nguyên tố có số thứ tự 31 trong bảng hệ thống tuần hoàn các nguyên tố.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biết rằng nước là một hợp chất được tạo thành từ hai nguyên tố là hydro và oxy.",
    "re": "Nước có công thức hóa học là H2O"
  },
  {
    "con": "Xác định số nguyên tử trong một mol bất kỳ chất nào.",
    "re": "Số nguyên tử là 6.022 x 10^23"
  },
  {
    "con": "Nắm vững quy tắc bảo toàn khối lượng trong phản ứng hóa học.",
    "re": "Khối lượng tổng của các chất phản ứng bằng khối lượng tổng của các sản phẩm"
  },
  {
    "con": "Hiểu rằng pH là thang đo độ axit hoặc bazơ của dung dịch.",
    "re": "Dung dịch có pH < 7 là axit, pH = 7 là trung tính, pH > 7 là bazơ"
  },
  {
    "con": "Biết rằng các nguyên tố trong cùng một nhóm của bảng tuần hoàn có tính chất hóa học tương tự.",
    "re": "Các nguyên tố trong cùng một nhóm có cùng số electron hóa trị"
  },
  {
    "con": "Xác định loại liên kết hóa học giữa hai nguyên tố khác nhau.",
    "re": "Liên kết ion xảy ra giữa nguyên tố kim loại và phi kim"
  },
  {
    "con": "Nắm vững khái niệm về nhiệt độ sôi của chất lỏng.",
    "re": "Nhiệt độ sôi là nhiệt độ tại đó áp suất hơi của chất lỏng bằng áp suất bên ngoài"
  },
  {
    "con": "Hiểu rằng phản ứng hóa học có thể được phân loại thành phản ứng tổng hợp, phân hủy, và trao đổi.",
    "re": "Mỗi loại phản ứng có đặc điểm và cơ chế riêng"
  },
  {
    "con": "Biết rằng các chất điện ly trong dung dịch dẫn điện.",
    "re": "Chất điện ly phân ly thành ion trong dung dịch"
  },
  {
    "con": "Tìm vị trí của nguyên tố X trong bảng hệ thống tuần hoàn có 4 lớp electron và có tổng spin theo qui tắc Hund là +3.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biết rằng nước có công thức hóa học H2O và là một hợp chất,",
    "re": "Nước được tạo thành từ hai nguyên tử hydro và một nguyên tử oxy."
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và không có nguyên liệu nào bị mất đi,",
    "re": "Khối lượng tổng của các sản phẩm bằng khối lượng tổng của các phản ứng."
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 12,",
    "re": "Nguyên tố đó là Magie (Mg)."
  },
  {
    "con": "Khi một dung dịch có pH nhỏ hơn 7,",
    "re": "Dung dịch đó được coi là axit."
  },
  {
    "con": "Nếu một nguyên tử có số electron bằng số proton,",
    "re": "Nguyên tử đó là trung hòa về điện."
  },
  {
    "con": "Khi một hợp chất ion được hình thành từ một kim loại và một phi kim,",
    "re": "Hợp chất đó thường có tính chất dẫn điện khi hòa tan trong nước."
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên,",
    "re": "Động năng của các phân tử trong chất đó cũng tăng lên."
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện nhiệt độ và áp suất không đổi,",
    "re": "Năng lượng tự do Gibbs của hệ thống sẽ thay đổi."
  },
  {
    "con": "Nếu một nguyên tố có khả năng tạo thành nhiều đồng vị,",
    "re": "Nguyên tố đó có thể có các tính chất vật lý khác nhau."
  },
  {
    "con": "Chọn trường hợp đúng:\n So sánh năng lượng ion hóa thứ nhất I_1 của _{11}Na(1); _{12}Mg(2); _{13}Al(3); _{15}P(4) và _{16}S(5):",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nâng cao nhiệt độ của một chất lỏng:",
    "re": "Áp suất hơi của chất lỏng sẽ tăng"
  },
  {
    "con": "Thêm một chất tan vào dung dịch:",
    "re": "Điểm sôi của dung dịch sẽ tăng lên"
  },
  {
    "con": "Giảm thể tích của một khí trong một bình kín:",
    "re": "Áp suất của khí sẽ tăng theo định luật Boyle"
  },
  {
    "con": "Tăng nồng độ của một chất trong phản ứng hóa học:",
    "re": "Tốc độ phản ứng sẽ tăng theo định luật tốc độ phản ứng"
  },
  {
    "con": "Thực hiện phản ứng giữa axit và bazơ:",
    "re": "Sẽ tạo ra muối và nước"
  },
  {
    "con": "Thêm nhiệt vào một phản ứng hóa học thuận nghịch:",
    "re": "Phản ứng sẽ dịch chuyển theo chiều thuận hoặc nghịch tùy thuộc vào nhiệt độ"
  },
  {
    "con": "Sử dụng chất xúc tác trong một phản ứng hóa học:",
    "re": "Tốc độ phản ứng sẽ tăng mà không làm thay đổi trạng thái cân bằng"
  },
  {
    "con": "Thay đổi pH của dung dịch:",
    "re": "Sẽ ảnh hưởng đến trạng thái ion hóa của các chất trong dung dịch"
  },
  {
    "con": "Thực hiện phản ứng oxi hóa khử:",
    "re": "Sẽ có sự chuyển giao electron giữa các chất tham gia"
  },
  {
    "con": "Độ dài liên kết trong các tiểu phân NO, NO+ và NO- tăng dần theo thứ tự:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên sẽ làm tăng tốc độ phản ứng hóa học:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sự hòa tan của một chất rắn trong nước thường tăng khi nhiệt độ nước tăng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu pH của dung dịch giảm, thì nồng độ ion H+ trong dung dịch tăng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có độ âm điện cao, thì nó có khả năng thu hút electron mạnh hơn:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong một phản ứng oxi hóa khử, electron được chuyển từ chất khử sang chất oxi hóa:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu nồng độ của một chất trong dung dịch tăng, thì tốc độ phản ứng hóa học cũng sẽ tăng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có tính chất hóa học tương tự nhau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng, thì nó có khả năng quay ánh sáng phân cực:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chọn câu sai trong các phát biểu sau về hợp chất ion:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số nguyên tử tăng dần:",
    "re": "Tính chất hóa học của chúng có xu hướng thay đổi theo nhóm và chu kỳ"
  },
  {
    "con": "Một phản ứng hóa học xảy ra khi các liên kết hóa học bị phá vỡ và hình thành lại:",
    "re": "Năng lượng có thể được giải phóng hoặc hấp thụ trong quá trình này"
  },
  {
    "con": "Nồng độ mol của dung dịch được tính bằng số mol chất tan trên thể tích dung dịch tính bằng lít:",
    "re": "Nồng độ mol là một cách để biểu thị mức độ hòa tan của chất trong dung dịch"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng lên:",
    "re": "Do các phân tử có nhiều năng lượng hơn và va chạm nhiều hơn"
  },
  {
    "con": "Hợp chất hữu cơ thường chứa carbon và hydro:",
    "re": "Chúng có thể chứa các nguyên tố khác như oxy, nitơ, lưu huỳnh và phốt pho"
  },
  {
    "con": "Sự cân bằng hóa học xảy ra khi tốc độ phản ứng thuận và phản ứng nghịch bằng nhau:",
    "re": "Nồng độ của các chất phản ứng và sản phẩm không thay đổi theo thời gian"
  },
  {
    "con": "Các nguyên tử có cùng số proton nhưng khác số neutron được gọi là đồng vị:",
    "re": "Chúng có tính chất hóa học tương tự nhưng có khối lượng khác nhau"
  },
  {
    "con": "Khi một chất tan trong nước, nó có thể tạo ra ion:",
    "re": "Điều này làm cho dung dịch có khả năng dẫn điện"
  },
  {
    "con": "Phản ứng oxi hóa khử liên quan đến sự chuyển giao electron giữa các chất:",
    "re": "Một chất bị oxi hóa trong khi chất khác bị khử"
  },
  {
    "con": "Chọn phương án đúng:\nXác định trạng thái lai hóa của các nguyên tử cacbon trong phân tử sau (từ trái qua phải): CH3─CH═CH─C≡CH.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch",
    "re": "Thì tốc độ phản ứng thuận sẽ tăng lên"
  },
  {
    "con": "Thêm axit vào dung dịch kiềm",
    "re": "Thì pH của dung dịch sẽ giảm"
  },
  {
    "con": "Khi một nguyên tố có số oxi hóa cao hơn trong phản ứng hóa học",
    "re": "Thì nó sẽ bị khử"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên",
    "re": "Thì tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Khi một chất rắn tan trong dung môi",
    "re": "Thì nó sẽ tạo ra dung dịch"
  },
  {
    "con": "Khi nhiệt độ giảm trong một phản ứng hóa học tỏa nhiệt",
    "re": "Thì sự cân bằng phản ứng sẽ dịch chuyển sang bên sản phẩm"
  },
  {
    "con": "Khi một nguyên tử có nhiều electron hơn proton",
    "re": "Thì nó sẽ mang điện tích âm"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện áp suất cao",
    "re": "Thì thể tích sản phẩm có thể giảm"
  },
  {
    "con": "Khi một chất có độ pH dưới 7",
    "re": "Thì nó được coi là axit"
  },
  {
    "con": "Chọn câu đúng.\n Sự thêm electron vào ocbitan phân tử phản liên kết dẫn đến hệ quả:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì",
    "re": "tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7 thì",
    "re": "chất đó được coi là axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín thì",
    "re": "khối lượng tổng thể của hệ thống không thay đổi"
  },
  {
    "con": "Khi nồng độ của một chất phản ứng tăng lên thì",
    "re": "tốc độ phản ứng cũng sẽ tăng lên"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng thì",
    "re": "chất đó có thể có tính quang hoạt"
  },
  {
    "con": "Nếu một ion dương và một ion âm kết hợp với nhau thì",
    "re": "chúng sẽ tạo thành một hợp chất ion"
  },
  {
    "con": "Nếu nhiệt độ của một chất khí giảm thì",
    "re": "áp suất của chất khí đó cũng sẽ giảm nếu thể tích không đổi"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch thì",
    "re": "có thể xảy ra theo cả hai chiều"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước thì",
    "re": "chất đó sẽ bay hơi ở nhiệt độ phòng"
  },
  {
    "con": "Chọn phương án đúng:\n Trong dãy các chất sau: HF, HCl, HBr, HI, chất bị ion hóa nhiều nhất khi cho vào nước là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì",
    "re": "tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Khi nồng độ của một chất phản ứng tăng lên thì",
    "re": "tốc độ phản ứng cũng sẽ tăng lên"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7 thì",
    "re": "chất đó được coi là axit"
  },
  {
    "con": "Khi một chất bị ion hóa hoàn toàn trong nước thì",
    "re": "nó sẽ tạo ra các ion tự do"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín thì",
    "re": "khối lượng tổng thể của hệ thống sẽ không thay đổi"
  },
  {
    "con": "Khi nhiệt độ giảm xuống trong một phản ứng hóa học tỏa nhiệt thì",
    "re": "phản ứng có thể bị chậm lại"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước thì",
    "re": "chất đó sẽ bay hơi nhanh hơn khi tiếp xúc với nước"
  },
  {
    "con": "Khi một dung dịch có nồng độ ion H+ cao thì",
    "re": "dung dịch đó có tính axit mạnh"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử đối xứng thì",
    "re": "chất đó có thể không có tính phân cực"
  },
  {
    "con": "Chọn phát biểu sai:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất có thể tồn tại ở ba trạng thái khác nhau (rắn, lỏng, khí):",
    "re": "Chất đó có thể chuyển đổi giữa các trạng thái này khi nhiệt độ hoặc áp suất thay đổi"
  },
  {
    "con": "Các nguyên tử trong một phân tử được liên kết với nhau bằng liên kết hóa học:",
    "re": "Sự liên kết này có thể là liên kết ion, liên kết cộng hóa trị hoặc liên kết kim loại"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng:",
    "re": "Điều này xảy ra do các phân tử có năng lượng cao hơn và va chạm nhiều hơn"
  },
  {
    "con": "Một dung dịch có pH < 7:",
    "re": "Dung dịch đó được coi là axit"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion:",
    "re": "Chất đó được gọi là chất điện ly"
  },
  {
    "con": "Phản ứng hóa học có thể được biểu diễn bằng phương trình hóa học:",
    "re": "Phương trình này thể hiện mối quan hệ giữa các chất phản ứng và sản phẩm"
  },
  {
    "con": "Khối lượng của một nguyên tử được đo bằng đơn vị amu:",
    "re": "1 amu tương đương với 1/12 khối lượng của nguyên tử carbon-12"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số nguyên tử tăng dần:",
    "re": "Điều này giúp xác định tính chất hóa học của các nguyên tố"
  },
  {
    "con": "Năng lượng cần thiết để phá vỡ liên kết hóa học được gọi là năng lượng liên kết:",
    "re": "Năng lượng này ảnh hưởng đến độ bền của các phân tử"
  },
  {
    "con": "Dự đoán điện tích hạt nhân của nguyên tố kim loại kiềm (chưa phát hiện) ở chu kỳ 8 của bảng HTTH, biết nguyên tố _{87}Fr là kim loại kiềm thuộc chu kỳ 7.\n Cho hai nguyên tử với các phân lớp e ngoài cùng là: X(3s^23p^1) và Y(2s^22p^4). Công thức phân tử của hợp chất giữa X và Y có dạng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử Z, thì số proton trong hạt nhân của nguyên tố đó là Z.",
    "re": "Số proton bằng số hiệu nguyên tử"
  },
  {
    "con": "Nếu một hợp chất có công thức phân tử C_nH_m, thì tỷ lệ giữa số nguyên tử carbon và số nguyên tử hydro trong hợp chất đó là n:m.",
    "re": "Tỷ lệ nguyên tử carbon và hydro là n:m"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng thường tăng lên.",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là axit.",
    "re": "Dung dịch là axit"
  },
  {
    "con": "Nếu một nguyên tố có cấu hình electron là [Xe]6s^2, thì nguyên tố đó thuộc nhóm kim loại kiềm thổ.",
    "re": "Nguyên tố là kim loại kiềm thổ"
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn điểm sôi của nước, thì chất đó có thể tồn tại ở trạng thái lỏng ở nhiệt độ phòng.",
    "re": "Chất tồn tại ở trạng thái lỏng"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì năng lượng được giải phóng trong quá trình phản ứng.",
    "re": "Năng lượng được giải phóng"
  },
  {
    "con": "Nếu một nguyên tử có số electron bằng số proton, thì nguyên tử đó là trung hòa về điện.",
    "re": "Nguyên tử trung hòa về điện"
  },
  {
    "con": "Nếu một chất có khả năng hòa tan trong nước, thì chất đó được gọi là chất tan.",
    "re": "Chất được gọi là chất tan"
  },
  {
    "con": "Sắp xếp các hợp chất VCl_3, VCl_2, VCl_4 và VCl_5 theo sự tăng dần tính cộng hóa trị của liên kết.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nâng cao nhiệt độ của một phản ứng hóa học trong điều kiện không thay đổi áp suất.",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Thêm một chất xúc tác vào phản ứng hóa học.",
    "re": "Tốc độ phản ứng sẽ tăng mà không làm thay đổi trạng thái cân bằng"
  },
  {
    "con": "Giảm nồng độ của một trong các phản ứng trong phản ứng cân bằng.",
    "re": "Hệ thống sẽ dịch chuyển về phía sản phẩm để cân bằng lại"
  },
  {
    "con": "Tăng áp suất trong một phản ứng hóa học có sự tham gia của khí.",
    "re": "Hệ thống sẽ dịch chuyển về phía có ít phân tử khí hơn"
  },
  {
    "con": "Sử dụng nước để hòa tan muối NaCl.",
    "re": "NaCl sẽ phân ly thành các ion Na+ và Cl- trong dung dịch"
  },
  {
    "con": "Thực hiện phản ứng giữa axit và bazơ.",
    "re": "Sẽ tạo ra muối và nước"
  },
  {
    "con": "Sắp xếp các nguyên tố theo thứ tự tăng dần độ điện âm.",
    "re": "Thứ tự đúng sẽ là: Li, Na, K, Rb"
  },
  {
    "con": "Thêm nhiệt vào một chất rắn trong trạng thái rắn.",
    "re": "Chất rắn sẽ chuyển sang trạng thái lỏng nếu đạt đến điểm nóng chảy"
  },
  {
    "con": "Thực hiện phản ứng oxi hóa khử.",
    "re": "Một chất sẽ bị oxi hóa và một chất sẽ bị khử"
  },
  {
    "con": "Chọn câu đúng. Cho: _3Li, _{12}Mg, _{13}Al, _{26}Fe, _{27}Co, _{29}Cu.\n So sánh tác dụng phân cực của các cặp ion:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất được hòa tan trong nước và tạo ra ion,",
    "re": "chất đó được gọi là chất điện ly"
  },
  {
    "con": "Nếu một nguyên tố có số proton bằng số electron,",
    "re": "nguyên tố đó sẽ trung hòa về điện"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng lên,",
    "re": "do các phân tử có năng lượng cao hơn và va chạm nhiều hơn"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao,",
    "re": "thì sản phẩm phản ứng có thể khác so với điều kiện áp suất thấp"
  },
  {
    "con": "Khi một chất có độ pH dưới 7,",
    "re": "chất đó được coi là axit"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch,",
    "re": "thì nó có thể diễn ra theo cả hai chiều"
  },
  {
    "con": "Khi một nguyên tố có số lượng electron hóa trị là 8,",
    "re": "nguyên tố đó được coi là ổn định và không dễ phản ứng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao,",
    "re": "thì khả năng dẫn điện của dung dịch đó sẽ tăng"
  },
  {
    "con": "Khi các nguyên tử chia sẻ electron trong liên kết hóa học,",
    "re": "thì liên kết đó được gọi là liên kết cộng hóa trị"
  },
  {
    "con": "Nguyên tử có số proton bằng số electron thì nguyên tử đó trung hòa điện.",
    "re": "Nguyên tử không mang điện tích."
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O thì hợp chất đó là nước.",
    "re": "Nước là một chất lỏng cần thiết cho sự sống."
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên thì động năng của các phân tử trong chất đó cũng tăng lên.",
    "re": "Chất có thể chuyển từ trạng thái rắn sang lỏng hoặc khí."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện thích hợp thì các chất phản ứng sẽ biến đổi thành các sản phẩm mới.",
    "re": "Phản ứng hóa học có thể tạo ra năng lượng dưới dạng nhiệt hoặc ánh sáng."
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử lớn hơn 92 thì nó được coi là nguyên tố phóng xạ.",
    "re": "Nguyên tố phóng xạ có thể phát ra bức xạ ion hóa."
  },
  {
    "con": "Nếu pH của dung dịch nhỏ hơn 7 thì dung dịch đó được coi là axit.",
    "re": "Dung dịch axit có khả năng dẫn điện tốt hơn nước tinh khiết."
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C thì chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng.",
    "re": "Chất khí có thể dễ dàng nén lại và mở rộng."
  },
  {
    "con": "Nếu một ion có điện tích dương thì nó được gọi là cation.",
    "re": "Cation thường được hình thành khi nguyên tử mất electron."
  },
  {
    "con": "Nếu một hợp chất có liên kết ion thì nó thường có điểm nóng chảy cao.",
    "re": "Hợp chất ion thường tan trong nước và dẫn điện khi hòa tan."
  },
  {
    "con": "Chọn trường hợp đúng:\n Nguyên tố A có 4 lượng tử của electron cuối cùng là n = 3 ; ℓ = 2 ; mℓ = -1 ; ms = +1/2. (Quy ước các ocbitan được sắp xếp mℓ theo thứ tự từ -ℓ đến +ℓ). Nguyên tố A có:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chọn phương án đúng:\n Sắp xếp theo thứ tự tăng dần về bán kính của các ion sau: O^{2-}, Al^{3}, F^-, Mg^{2+}, Na^+ (biết rằng _8O, _{13}Al, _9F, _{12}Mg, _{11}Na)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nâng nhiệt độ của một chất lỏng thì",
    "re": "độ hòa tan của nhiều chất rắn trong chất lỏng đó sẽ tăng lên"
  },
  {
    "con": "Tăng áp suất trong một phản ứng hóa học xảy ra trong thể khí thì",
    "re": "phản ứng sẽ chuyển dịch theo hướng giảm số mol khí"
  },
  {
    "con": "Thêm chất xúc tác vào một phản ứng hóa học thì",
    "re": "tốc độ phản ứng sẽ tăng mà không làm thay đổi trạng thái cân bằng"
  },
  {
    "con": "Giảm nhiệt độ của một phản ứng tỏa nhiệt thì",
    "re": "trạng thái cân bằng sẽ dịch chuyển về phía sản phẩm"
  },
  {
    "con": "Sử dụng dung dịch axit mạnh để trung hòa dung dịch bazơ thì",
    "re": "sẽ tạo ra muối và nước"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước thì",
    "re": "nó sẽ tạo ra dung dịch đồng nhất nếu chất đó tan tốt"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên thì",
    "re": "độ dẫn điện của dung dịch đó cũng sẽ tăng lên"
  },
  {
    "con": "Khi một ion dương và một ion âm gặp nhau trong dung dịch thì",
    "re": "chúng có thể tạo thành một hợp chất không tan"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong môi trường nước thì",
    "re": "nước có thể tham gia vào phản ứng như một chất phản ứng hoặc dung môi"
  },
  {
    "con": "Các nguyên tử được cấu tạo từ proton, neutron và electron",
    "re": "Nguyên tử là đơn vị cơ bản của vật chất"
  },
  {
    "con": "Chất rắn có cấu trúc phân tử chặt chẽ và không thay đổi hình dạng",
    "re": "Chất rắn có thể duy trì hình dạng của nó"
  },
  {
    "con": "Nhiệt độ tăng lên sẽ làm tăng năng lượng động học của các phân tử",
    "re": "Các phân tử sẽ chuyển động nhanh hơn"
  },
  {
    "con": "Phản ứng hóa học xảy ra khi các liên kết hóa học bị phá vỡ và hình thành lại",
    "re": "Sản phẩm mới được tạo ra từ các chất phản ứng"
  },
  {
    "con": "Chất điện phân là chất có khả năng dẫn điện khi hòa tan trong nước",
    "re": "Chất điện phân phân ly thành ion trong dung dịch"
  },
  {
    "con": "Khối lượng của một nguyên tử được đo bằng đơn vị Dalton",
    "re": "1 Dalton tương đương với 1/12 khối lượng của nguyên tử carbon-12"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số nguyên tử tăng dần",
    "re": "Các tính chất hóa học của chúng có xu hướng thay đổi theo chu kỳ"
  },
  {
    "con": "Hóa học hữu cơ chủ yếu nghiên cứu các hợp chất chứa carbon",
    "re": "Hóa học hữu cơ là lĩnh vực quan trọng trong hóa học"
  },
  {
    "con": "Sự hòa tan là quá trình mà một chất (chất tan) phân tán trong một chất khác (chất dung môi)",
    "re": "Kết quả là một dung dịch đồng nhất"
  },
  {
    "con": "Chọn phát biểu sai trong các phát biểu sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chọn phương án đúng:\n Ở trạng thái tinh thể, hợp chất Na_2SO_4 có những loại liên kết nào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất được hòa tan trong nước và tạo ra ion, thì chất đó được gọi là:",
    "re": "Chất điện ly"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng:",
    "re": "Có thể tăng lên"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7, thì dung dịch đó được coi là:",
    "re": "Axit"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, thì nguyên tố đó là:",
    "re": "Cacbon (C)"
  },
  {
    "con": "Khi một hợp chất có liên kết ion, thì nó thường có điểm nóng chảy:",
    "re": "Cao"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì nó có thể:",
    "re": "Diễn ra theo cả hai chiều"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên, thì áp suất hơi của dung dịch:",
    "re": "Giảm"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng, thì chất đó được gọi là:",
    "re": "Chất bay hơi"
  },
  {
    "con": "Khi một phản ứng hóa học giải phóng năng lượng, thì phản ứng đó được gọi là:",
    "re": "Phản ứng tỏa nhiệt"
  },
  {
    "con": "Chọn phương án đúng: Liên kết ion có các đặc trưng cơ bản là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì",
    "re": "tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Một chất có điểm sôi thấp hơn điểm sôi của nước thì",
    "re": "chất đó sẽ bay hơi nhanh hơn ở nhiệt độ phòng"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7 thì",
    "re": "dung dịch đó trở nên axit"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6 thì",
    "re": "nguyên tố đó là carbon"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện kín thì",
    "re": "khối lượng tổng thể của hệ thống sẽ không thay đổi"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học C2H6 thì",
    "re": "hợp chất đó là etan"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên thì",
    "re": "độ dẫn điện của dung dịch cũng sẽ tăng lên"
  },
  {
    "con": "Nếu một chất có tính chất oxi hóa mạnh thì",
    "re": "chất đó có khả năng nhận electron từ chất khác"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra tỏa nhiệt thì",
    "re": "phản ứng đó được gọi là phản ứng tỏa nhiệt"
  },
  {
    "con": "Chọn trường hợp đúng: So sánh nhiệt độ nóng chảy của H_2O và HF:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nâng cao nhiệt độ đến điểm sôi của nước:",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Thêm muối vào nước:",
    "re": "Điểm đóng băng của nước sẽ giảm"
  },
  {
    "con": "Sử dụng quỳ tím để thử nghiệm pH của dung dịch:",
    "re": "Dung dịch axit sẽ chuyển quỳ tím thành màu đỏ"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra:",
    "re": "Các liên kết hóa học trong các chất phản ứng sẽ bị phá vỡ và hình thành các liên kết mới"
  },
  {
    "con": "Khi tăng nồng độ của một chất trong dung dịch:",
    "re": "Tốc độ phản ứng hóa học có thể tăng lên"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước:",
    "re": "Chất đó sẽ phân tán thành các ion hoặc phân tử trong dung dịch"
  },
  {
    "con": "Khi nhiệt độ tăng lên trong một phản ứng hóa học:",
    "re": "Tốc độ phản ứng thường sẽ tăng lên"
  },
  {
    "con": "Khi một chất có độ pH lớn hơn 7:",
    "re": "Chất đó được coi là kiềm"
  },
  {
    "con": "Khi một phản ứng hóa học đạt đến trạng thái cân bằng:",
    "re": "Tốc độ phản ứng thuận và phản ứng nghịch bằng nhau"
  },
  {
    "con": "Chọn phương án đúng:\n Ion M^{3+} và ion X^{2-} có phân lớp cuối cùng lần lượt là 2p6 và 4p6. Hãy xác định vị trí của các nguyên tử M và X trong bảng phân loại tuần hoàn và có tính kim loại hay phi kim.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tử có số electron bằng số proton thì nguyên tử đó trung hòa về điện.",
    "re": "Nguyên tử đó không mang điện tích."
  },
  {
    "con": "Nếu một hợp chất có liên kết ion, thì nó thường được hình thành giữa một kim loại và một phi kim.",
    "re": "Hợp chất đó có khả năng dẫn điện khi hòa tan trong nước."
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên, thì động năng của các phân tử trong chất đó cũng tăng lên.",
    "re": "Chất đó có thể chuyển từ trạng thái rắn sang trạng thái lỏng hoặc khí."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín, thì tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm.",
    "re": "Định luật bảo toàn khối lượng được áp dụng."
  },
  {
    "con": "Nếu một nguyên tố có số oxi hóa cao nhất là +7, thì nó có khả năng tạo ra nhiều hợp chất khác nhau.",
    "re": "Nguyên tố đó thường là một phi kim mạnh."
  },
  {
    "con": "Nếu pH của dung dịch giảm xuống dưới 7, thì dung dịch đó trở nên axit.",
    "re": "Dung dịch đó có khả năng tác dụng với các bazơ."
  },
  {
    "con": "Nếu một chất có điểm sôi thấp, thì nó thường có lực liên kết giữa các phân tử yếu.",
    "re": "Chất đó có thể dễ dàng bay hơi."
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì nó có thể xảy ra theo cả hai chiều.",
    "re": "Sản phẩm có thể chuyển đổi trở lại thành các chất phản ứng."
  },
  {
    "con": "Nếu một nguyên tử có nhiều lớp electron, thì nó có thể tham gia vào các phản ứng hóa học phức tạp hơn.",
    "re": "Nguyên tử đó có thể tạo ra nhiều liên kết hóa học."
  },
  {
    "con": "Chọn phương án đúng: Hợp chất nào dưới đây chỉ có liên kết cộng hóa trị:\n (1) NH_4Cl ;(2) H_2S ;(3) NF_3 ;(4) CCl_4",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng sẽ tăng lên",
    "re": "Điều này đúng do năng lượng va chạm giữa các phân tử tăng"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7 thì chất đó được coi là axit",
    "re": "Điều này đúng vì pH dưới 7 chỉ ra tính axit"
  },
  {
    "con": "Nếu một hợp chất có công thức phân tử C_nH_{2n+2} thì hợp chất đó là ankan",
    "re": "Điều này đúng vì đây là công thức chung của ankan"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường nước thì nó được gọi là phản ứng thủy phân",
    "re": "Điều này đúng vì nước tham gia vào phản ứng"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện trong dung dịch thì chất đó là muối, axit hoặc bazơ",
    "re": "Điều này đúng vì các chất này phân ly thành ion trong nước"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử Z thì nó có Z proton trong hạt nhân",
    "re": "Điều này đúng vì số hiệu nguyên tử xác định số proton"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch thì nó có thể diễn ra theo cả hai chiều",
    "re": "Điều này đúng vì phản ứng có thể tạo ra sản phẩm và quay lại nguyên liệu"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C thì nó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng",
    "re": "Điều này đúng vì điểm sôi thấp cho thấy chất dễ bay hơi"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao thì nó có khả năng phản ứng mạnh hơn",
    "re": "Điều này đúng vì nồng độ cao tăng khả năng va chạm giữa các phân tử"
  },
  {
    "con": "Chọn phương án đúng: Chuỗi nào sau đây gọi là hydrogenoid:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất được gọi là hợp chất khi nó được tạo thành từ hai nguyên tố hóa học trở lên kết hợp với nhau theo tỷ lệ nhất định.",
    "re": "Hợp chất có tính chất khác biệt so với các nguyên tố cấu thành."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao và áp suất cao,",
    "re": "thì tốc độ phản ứng thường tăng lên."
  },
  {
    "con": "Khi một dung dịch có pH < 7,",
    "re": "thì dung dịch đó được coi là axit."
  },
  {
    "con": "Nếu một nguyên tử có số electron bằng số proton,",
    "re": "thì nguyên tử đó là trung hòa về điện."
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước tạo thành dung dịch,",
    "re": "thì chất đó được gọi là chất tan."
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch,",
    "re": "thì sản phẩm có thể chuyển đổi trở lại thành phản ứng ban đầu."
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên,",
    "re": "thì năng lượng động học của các phân tử trong chất đó cũng tăng lên."
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6,",
    "re": "thì nguyên tố đó là carbon."
  },
  {
    "con": "Khi một dung dịch có nồng độ mol cao,",
    "re": "thì khả năng phản ứng của các ion trong dung dịch đó cũng cao."
  },
  {
    "con": "Chọn so sánh đúng về góc liên kết:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biết rằng nguyên tử có số proton bằng số electron:",
    "re": "Nguyên tử trung hòa về điện"
  },
  {
    "con": "Nắm rõ quy tắc octet:",
    "re": "Nguyên tử sẽ có xu hướng tạo liên kết để đạt được cấu hình electron ổn định"
  },
  {
    "con": "Hiểu rằng nhiệt độ tăng lên:",
    "re": "Tốc độ phản ứng hóa học thường tăng"
  },
  {
    "con": "Biết rằng chất xúc tác được sử dụng:",
    "re": "Tốc độ phản ứng sẽ tăng mà không làm thay đổi sản phẩm cuối cùng"
  },
  {
    "con": "Nhận biết rằng pH dưới 7:",
    "re": "Dung dịch được coi là axit"
  },
  {
    "con": "Hiểu rằng phản ứng hóa học xảy ra khi có sự va chạm giữa các phân tử:",
    "re": "Cần có năng lượng kích hoạt để phản ứng xảy ra"
  },
  {
    "con": "Biết rằng các nguyên tố trong cùng một nhóm của bảng tuần hoàn:",
    "re": "Có tính chất hóa học tương tự nhau"
  },
  {
    "con": "Nắm rõ rằng nước là dung môi phổ biến:",
    "re": "Nhiều phản ứng hóa học xảy ra trong môi trường nước"
  },
  {
    "con": "Hiểu rằng các liên kết ion hình thành giữa các ion mang điện tích trái dấu:",
    "re": "Tạo ra các hợp chất ion"
  },
  {
    "con": "Chọn phương án đúng: Trong quang phổ phát xạ của nguyên tử hydro:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nguyên tử có số proton bằng số electron:",
    "re": "Nguyên tử trung hòa về điện"
  },
  {
    "con": "Khi nhiệt độ tăng:",
    "re": "Độ hòa tan của khí trong chất lỏng giảm"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra:",
    "re": "Các liên kết hóa học trong các chất phản ứng bị phá vỡ và hình thành liên kết mới"
  },
  {
    "con": "Chọn phương án đúng: Định luật bảo toàn khối lượng:",
    "re": "Khối lượng tổng của các chất phản ứng bằng khối lượng tổng của các sản phẩm"
  },
  {
    "con": "Khi pH của dung dịch giảm:",
    "re": "Nồng độ ion hydro (H+) tăng lên"
  },
  {
    "con": "Trong một phản ứng oxi hóa khử:",
    "re": "Một chất bị oxi hóa và một chất bị khử"
  },
  {
    "con": "Khi nồng độ chất tan trong dung dịch tăng:",
    "re": "Áp suất thẩm thấu của dung dịch tăng"
  },
  {
    "con": "Chọn phương án đúng: Các nguyên tố trong cùng một nhóm của bảng tuần hoàn:",
    "re": "Có cùng số electron ở lớp ngoài cùng"
  },
  {
    "con": "Khi một chất rắn tan trong dung dịch:",
    "re": "Các phân tử của chất rắn tách rời và phân tán trong dung dịch"
  },
  {
    "con": "Chọn phát biểu sai:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất có thể tồn tại ở ba trạng thái khác nhau (rắn, lỏng, khí):",
    "re": "Chất đó có thể chuyển đổi giữa các trạng thái này khi thay đổi nhiệt độ hoặc áp suất"
  },
  {
    "con": "Các nguyên tử trong một phân tử được liên kết với nhau bằng liên kết hóa học:",
    "re": "Sự liên kết này có thể là liên kết ion, liên kết cộng hóa trị hoặc liên kết kim loại"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng:",
    "re": "Điều này xảy ra do các phân tử có năng lượng cao hơn và va chạm nhiều hơn"
  },
  {
    "con": "Một dung dịch có pH < 7:",
    "re": "Dung dịch đó được coi là axit"
  },
  {
    "con": "Khi một chất tham gia phản ứng hóa học:",
    "re": "Nó có thể tạo ra các sản phẩm mới với tính chất khác biệt"
  },
  {
    "con": "Khối lượng của một nguyên tử được đo bằng đơn vị amu (atomic mass unit):",
    "re": "1 amu tương đương với 1/12 khối lượng của nguyên tử carbon-12"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số nguyên tử tăng dần:",
    "re": "Điều này giúp xác định tính chất hóa học và xu hướng của các nguyên tố"
  },
  {
    "con": "Khi một chất hòa tan trong nước:",
    "re": "Chất đó có thể tạo ra ion hoặc phân tử trong dung dịch"
  },
  {
    "con": "Phản ứng hóa học có thể được biểu diễn bằng phương trình hóa học:",
    "re": "Phương trình này cho thấy các chất phản ứng và sản phẩm tạo ra"
  },
  {
    "con": "Ion X^{3-} có cấu hình lớp ngoài cùng là 2p^6. Vậy nguyên tố X có vị trí trong bảng hệ thống tuần hoàn và các tính chất đặc trưng như sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O, thì hợp chất đó là nước và có tính chất là chất lỏng ở nhiệt độ phòng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, thì nguyên tố đó là carbon và có khả năng tạo ra nhiều hợp chất hữu cơ.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao và áp suất lớn, thì tốc độ phản ứng có thể tăng lên đáng kể.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là axit.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có cấu hình electron là 1s^2 2s^2 2p^6 3s^2 3p^5, thì nguyên tố đó là clo và thuộc nhóm halogen.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất ion được hình thành từ một kim loại và một phi kim, thì hợp chất đó thường có tính chất dẫn điện khi hòa tan trong nước.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì năng lượng được giải phóng trong quá trình phản ứng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có độ âm điện cao, thì nguyên tố đó có xu hướng thu hút electron trong phản ứng hóa học.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có liên kết đôi trong cấu trúc phân tử, thì hợp chất đó có thể tham gia vào phản ứng cộng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chọn phương án đúng:\nNguyên tử X có tổng số hạt proton, nơtron và electron là 36, số hạt không mang điện bằng nửa số hạt mang điện. Cấu hình e của nguyên tử X là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O,",
    "re": "thì nó là nước."
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6,",
    "re": "thì nó là carbon."
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên,",
    "re": "thì động năng của các phân tử trong chất đó cũng tăng lên."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện không có không khí,",
    "re": "thì nó được gọi là phản ứng yếm khí."
  },
  {
    "con": "Nếu pH của một dung dịch là 7,",
    "re": "thì dung dịch đó được coi là trung tính."
  },
  {
    "con": "Nếu một nguyên tử có số electron bằng số proton,",
    "re": "thì nguyên tử đó là trung hòa về điện."
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước,",
    "re": "thì nó sẽ bay hơi nhanh hơn nước ở cùng điều kiện."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt,",
    "re": "thì nó sẽ giải phóng năng lượng dưới dạng nhiệt."
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol là 1M,",
    "re": "thì trong 1 lít dung dịch có 1 mol chất tan."
  },
  {
    "con": "Chọn phương án đúng:\n Ion X2+ có phân lớp e cuối cùng là 3d^5. Electron cuối cùng được xếp vào nguyên tử X có bộ 4 số lượng tử là: (Qui ước mℓ từ -ℓ đến +ℓ)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nguyên tử có số proton bằng số electron thì",
    "re": "Nguyên tử đó trung hòa về điện"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O thì",
    "re": "Hợp chất đó là nước"
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên thì",
    "re": "Động năng của các phân tử trong chất đó cũng tăng lên"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện không có không khí thì",
    "re": "Phản ứng đó có thể là phản ứng oxi hóa khử"
  },
  {
    "con": "Nếu pH của dung dịch là 7 thì",
    "re": "Dung dịch đó là trung tính"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử là 6 thì",
    "re": "Nguyên tố đó là carbon"
  },
  {
    "con": "Nếu một hợp chất ion được tạo thành từ kim loại và phi kim thì",
    "re": "Hợp chất đó thường có tính chất điện ly trong nước"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch thì",
    "re": "Phản ứng có thể diễn ra theo cả hai chiều"
  },
  {
    "con": "Nếu một chất có điểm sôi cao thì",
    "re": "Chất đó có liên kết hydro mạnh hoặc lực tương tác giữa các phân tử lớn"
  },
  {
    "con": "Chọn câu sai:\n Ngược lại với NaCl, LiI tan nhiều trong rượu, tan ít trong nước, nhiệt độ nóng chảy thấp. Lí do là vì:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch thì",
    "re": "phản ứng sẽ dịch chuyển theo chiều tỏa nhiệt"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên thì",
    "re": "tốc độ phản ứng hóa học sẽ tăng lên"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7 thì",
    "re": "chất đó được coi là axit"
  },
  {
    "con": "Khi một kim loại phản ứng với axit thì",
    "re": "sẽ sinh ra khí hidro và muối"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao thì",
    "re": "phản ứng sẽ có xu hướng dịch chuyển về phía có ít phân tử khí hơn"
  },
  {
    "con": "Khi nhiệt độ giảm trong một phản ứng tỏa nhiệt thì",
    "re": "phản ứng sẽ dịch chuyển theo chiều sinh nhiệt"
  },
  {
    "con": "Nếu một dung dịch có nồng độ ion hydroxide (OH-) cao thì",
    "re": "dung dịch đó có tính kiềm"
  },
  {
    "con": "Khi một chất rắn tan trong nước thì",
    "re": "các phân tử nước sẽ bao quanh các ion của chất rắn đó"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường không có oxy thì",
    "re": "phản ứng sẽ được gọi là phản ứng yếm khí"
  },
  {
    "con": "Chọn phát biểu đúng về orbitan nguyên tử:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một nguyên tử có số proton bằng số electron:",
    "re": "Nguyên tử đó trung hòa về điện"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học:",
    "re": "Tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Một hợp chất ion được hình thành từ nguyên tử kim loại và phi kim:",
    "re": "Hợp chất đó có tính chất dẫn điện trong dung dịch"
  },
  {
    "con": "Khi pH của dung dịch giảm:",
    "re": "Dung dịch trở nên axit hơn"
  },
  {
    "con": "Sự chuyển đổi từ chất rắn sang chất lỏng xảy ra khi:",
    "re": "Nhiệt độ đạt đến điểm nóng chảy"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện kín:",
    "re": "Tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm"
  },
  {
    "con": "Một nguyên tố có số nguyên tử lớn hơn 92:",
    "re": "Nguyên tố đó được coi là nguyên tố phóng xạ"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên:",
    "re": "Tốc độ phản ứng có thể tăng lên nếu phản ứng là bậc 1"
  },
  {
    "con": "Một phản ứng hóa học xảy ra khi:",
    "re": "Các liên kết hóa học giữa các nguyên tử bị phá vỡ và hình thành liên kết mới"
  },
  {
    "con": "Chọn phương án sai:\n 1) Độ dài liên kết là khoảng cách giữa hai hạt nhân nguyên tử trong liên kết (đơn vị A^0).\n 2) Năng lượng liên kết là năng lượng cần tiêu tốn để phá vỡ liên kết (đơn vị kJ/mol hay kcal/mol).\n 3) Góc hóa trị là một đại lượng đặc trưng cho tất cả các loại phân tử.\n 4) Mọi loại liên kết hóa học đều có bản chất điện.\n 5) Độ phân cực một phân tử bằng tổng độ phân cực của các liên kết có trong phân tử đó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nguyên tử có số proton khác nhau sẽ tạo ra các nguyên tố hóa học khác nhau.",
    "re": "Đúng"
  },
  {
    "con": "Phân tử nước (H2O) có cấu trúc phân tử không đối xứng.",
    "re": "Đúng"
  },
  {
    "con": "Năng lượng ion hóa là năng lượng cần thiết để loại bỏ một electron khỏi nguyên tử ở trạng thái khí.",
    "re": "Đúng"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có tính chất hóa học tương tự nhau.",
    "re": "Đúng"
  },
  {
    "con": "Liên kết ion hình thành giữa các ion mang điện tích trái dấu.",
    "re": "Đúng"
  },
  {
    "con": "Nhiệt độ sôi của một chất phụ thuộc vào áp suất môi trường xung quanh.",
    "re": "Đúng"
  },
  {
    "con": "Phản ứng hóa học có thể xảy ra mà không cần năng lượng kích thích.",
    "re": "Sai"
  },
  {
    "con": "Sự bảo toàn khối lượng trong phản ứng hóa học có nghĩa là tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm.",
    "re": "Đúng"
  },
  {
    "con": "Các phản ứng hóa học có thể được phân loại thành phản ứng tổng hợp, phản ứng phân hủy, và phản ứng trao đổi.",
    "re": "Đúng"
  },
  {
    "con": "Nguyên tử của nguyên tố X có 6 proton và 6 neutron.",
    "re": "X là nguyên tố carbon."
  },
  {
    "con": "Chất A có công thức hóa học H2O.",
    "re": "Chất A là nước."
  },
  {
    "con": "Một phản ứng hóa học xảy ra giữa axit và bazơ.",
    "re": "Sẽ tạo ra muối và nước."
  },
  {
    "con": "Nếu nhiệt độ của một chất khí tăng lên trong khi thể tích không đổi.",
    "re": "Áp suất của chất khí sẽ tăng."
  },
  {
    "con": "Chất B có cấu trúc phân tử C2H5OH.",
    "re": "Chất B là ethanol."
  },
  {
    "con": "Nếu một nguyên tố có số electron hóa trị là 7.",
    "re": "Nguyên tố đó có khả năng tạo ra nhiều liên kết hóa học."
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước và tạo ra dung dịch.",
    "re": "Chất đó được gọi là chất tan."
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch.",
    "re": "Phản ứng có thể diễn ra theo cả hai chiều."
  },
  {
    "con": "Khi pH của dung dịch nhỏ hơn 7.",
    "re": "Dung dịch đó được coi là axit."
  },
  {
    "con": "Nếu một nguyên tố có số oxi hóa -2 trong hợp chất.",
    "re": "Nguyên tố đó thường là oxy."
  },
  {
    "con": "Chọn phát biểu đúng:\n 1) Trong cùng một nguyên tử, orbital 2s có kích thước lớn hơn orbital 1s.\n 2) Trong nguyên tử 1e, năng lượng của electron trên AO 2p lớn hơn năng lượng của electron trên AO 2s.\n 3) Xác suất gặp electron của AO 3d_{xy} lớn nhất trên trục x và trục y.\n 4) Năng lượng của electron trên AO 2p_z lớn hơn năng lượng electron trên AO 2p_x.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu nhiệt độ tăng thì tốc độ phản ứng hóa học thường tăng.",
    "re": "Điều này xảy ra do năng lượng của các phân tử tăng lên, dẫn đến nhiều va chạm hơn."
  },
  {
    "con": "Nếu một chất có độ pH dưới 7 thì chất đó được coi là axit.",
    "re": "Điều này có nghĩa là chất đó có khả năng giải phóng ion H+ trong dung dịch."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kín thì khối lượng tổng quát của hệ thống sẽ không thay đổi.",
    "re": "Điều này phù hợp với định luật bảo toàn khối lượng."
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn chất khác thì chất đó có thể dễ dàng bay hơi hơn.",
    "re": "Điều này cho thấy rằng lực liên kết giữa các phân tử của chất đó yếu hơn."
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử cao hơn thì nó có nhiều proton hơn trong hạt nhân.",
    "re": "Điều này cũng đồng nghĩa với việc số electron trong nguyên tử đó cũng tăng lên."
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao hơn thì khả năng dẫn điện của dung dịch đó thường cao hơn.",
    "re": "Điều này là do số lượng ion tự do trong dung dịch tăng lên."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt thì năng lượng được giải phóng ra môi trường.",
    "re": "Điều này có thể làm tăng nhiệt độ của môi trường xung quanh."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng thì nó có thể có tính quang hoạt.",
    "re": "Điều này có nghĩa là chất đó có khả năng quay vòng ánh sáng phân cực."
  },
  {
    "con": "Nếu một nguyên tố có tính kim loại cao thì nó thường có khả năng dẫn điện tốt.",
    "re": "Điều này là do cấu trúc electron của nguyên tố đó cho phép electron di chuyển tự do."
  },
  {
    "con": "Chọn phát biểu đúng:\n 1) Mọi hợp chất có liên kết ion đều bền hơn hợp chất có liên kết cộng hóa trị.\n 2) Không có hợp chất nào chứa 100% là liên kết ion.\n 3) Ở trạng thái tinh thể NaCl dẫn điện rất kém.\n 4) Liên kết giữa kim loại và phi kim luôn là liên kết ion.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng thường tăng lên.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7 thì chất đó được coi là axit.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường nước thì nó được gọi là phản ứng thủy phân.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học CnH2n+2 thì nó là một ankan.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện trong dung dịch thì chất đó là chất điện ly.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử lớn hơn 92 thì nó được coi là nguyên tố phóng xạ.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt thì năng lượng được giải phóng ra môi trường.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước thì nó sẽ bay hơi ở nhiệt độ phòng.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một hợp chất có liên kết đôi giữa các nguyên tử carbon thì nó được gọi là anken.",
    "re": "Điều này đúng"
  },
  {
    "con": "Chọn phương án sai:\n 1) Có thể đồng thời xác định chính xác vị trí và tốc độ của electron.\n 2) Electron vừa có tính chất hạt vừa có tính chất sóng.\n 3) Electron luôn chuyển động trên một quỹ đạo xác định trong nguyên tử.\n 4) Không có hàm sóng nào có thể mô tả trạng thái của electron trong nguyên tử.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học,\n 1) Tốc độ phản ứng sẽ tăng lên.\n 2) Tốc độ phản ứng sẽ giảm xuống.\n 3) Phản ứng sẽ không xảy ra.\n 4) Năng lượng hoạt hóa sẽ giảm.",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Khi một chất tan trong nước,\n 1) Chất đó sẽ tạo ra dung dịch đồng nhất.\n 2) Chất đó sẽ không hòa tan.\n 3) Chất đó sẽ tạo ra kết tủa.\n 4) Chất đó sẽ không thay đổi trạng thái.",
    "re": "Chất đó sẽ tạo ra dung dịch đồng nhất"
  },
  {
    "con": "Khi pH của dung dịch giảm,\n 1) Nồng độ ion H+ tăng lên.\n 2) Nồng độ ion OH- tăng lên.\n 3) Dung dịch trở nên kiềm hơn.\n 4) Dung dịch trở nên trung tính.",
    "re": "Nồng độ ion H+ tăng lên"
  },
  {
    "con": "Khi một phản ứng hóa học đạt trạng thái cân bằng,\n 1) Tốc độ phản ứng thuận và phản ứng nghịch bằng nhau.\n 2) Chỉ có phản ứng thuận xảy ra.\n 3) Chỉ có phản ứng nghịch xảy ra.\n 4) Nồng độ của các chất phản ứng không thay đổi.",
    "re": "Tốc độ phản ứng thuận và phản ứng nghịch bằng nhau"
  },
  {
    "con": "Khi một nguyên tố có số hiệu nguyên tử cao hơn,\n 1) Nó có nhiều electron hơn.\n 2) Nó có ít electron hơn.\n 3) Nó không có electron.\n 4) Nó có số proton không đổi.",
    "re": "Nó có nhiều electron hơn"
  },
  {
    "con": "Khi một chất có độ hòa tan cao trong nước,\n 1) Chất đó thường là ion hoặc phân cực.\n 2) Chất đó thường là không phân cực.\n 3) Chất đó không hòa tan.\n 4) Chất đó sẽ tạo ra kết tủa.",
    "re": "Chất đó thường là ion hoặc phân cực"
  },
  {
    "con": "Khi một phản ứng hóa học tỏa nhiệt,\n 1) Năng lượng được giải phóng ra môi trường.\n 2) Năng lượng được hấp thụ từ môi trường.\n 3) Phản ứng sẽ không xảy ra.\n 4) Nồng độ của sản phẩm sẽ giảm.",
    "re": "Năng lượng được giải phóng ra môi trường"
  },
  {
    "con": "Khi một nguyên tử mất electron,\n 1) Nó trở thành ion dương.\n 2) Nó trở thành ion âm.\n 3) Nó không thay đổi điện tích.\n 4) Nó trở thành nguyên tử trung hòa.",
    "re": "Nó trở thành ion dương"
  },
  {
    "con": "Khi một chất có điểm sôi cao,\n 1) Chất đó có lực liên kết mạnh giữa các phân tử.\n 2) Chất đó có lực liên kết yếu.\n 3) Chất đó không có lực liên kết.\n 4) Chất đó sẽ bay hơi nhanh chóng.",
    "re": "Chất đó có lực liên kết mạnh giữa các phân tử"
  },
  {
    "con": "Chọn phương án đúng:\n Chọn tất cả các bộ ba số lượng tử được chấp nhận trong các bộ sau:\n 1) n = 4, ℓ = 3, mℓ = -3\n 2) n = 4, ℓ = 2, mℓ = +3\n 3) n = 4, ℓ = 1, mℓ = 2\n 4) n = 4, ℓ = 0, mℓ = 0",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nồng độ mol của dung dịch được tính bằng cách chia số mol chất tan cho thể tích dung dịch tính bằng lít",
    "re": "Nồng độ mol được xác định chính xác"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ và áp suất không đổi, thì năng lượng tự do Gibbs sẽ quyết định tính khả thi của phản ứng",
    "re": "Phản ứng có thể xảy ra nếu ΔG < 0"
  },
  {
    "con": "Nếu một chất có điểm nóng chảy thấp hơn nhiệt độ môi trường, thì chất đó sẽ tồn tại ở trạng thái rắn",
    "re": "Chất sẽ ở trạng thái rắn"
  },
  {
    "con": "Nếu một ion mang điện tích dương, thì nó được gọi là cation",
    "re": "Ion đó là cation"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì năng lượng được giải phóng ra môi trường",
    "re": "Phản ứng đó là phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu hai chất phản ứng với nhau và tạo ra sản phẩm mới, thì phản ứng hóa học đã xảy ra",
    "re": "Sản phẩm mới được hình thành"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7, thì chất đó được coi là axit",
    "re": "Chất đó là axit"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, thì nguyên tố đó là carbon",
    "re": "Nguyên tố đó là carbon"
  },
  {
    "con": "Nếu một dung dịch có nồng độ ion H+ cao, thì dung dịch đó có tính axit mạnh",
    "re": "Dung dịch có tính axit mạnh"
  },
  {
    "con": "Các phát biểu nào sau đây là không chính xác hoặc không đầy đủ\n 1) Đa số các nguyên tố kim loại có độ âm điện nhỏ hơn các nguyên tố phi kim.\n 2) Chênh lệch độ âm điện giữa A và B càng lớn thì liên kết A – B càng ít phân cực.\n 3) Trong tất cả các chu kì, độ âm điện luôn tăng đều đặn từ trái qua phải.\n 4) Trong một chu kì, kim loại kiềm có độ âm điện nhỏ nhất.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm có cùng số electron ở lớp ngoài cùng",
    "re": "Chúng có tính chất hóa học tương tự nhau"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thường làm tăng tốc độ phản ứng",
    "re": "Điều này là do các phân tử có năng lượng cao hơn và va chạm nhiều hơn"
  },
  {
    "con": "Khi một chất tan trong nước, nếu nó tạo ra ion, thì nó được gọi là chất điện ly",
    "re": "Chất điện ly có khả năng dẫn điện trong dung dịch"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện tiêu chuẩn, thì sản phẩm và phản ứng sẽ có thể được đo lường chính xác",
    "re": "Điều này giúp xác định định luật bảo toàn khối lượng"
  },
  {
    "con": "Khi pH của dung dịch giảm, thì nồng độ ion H+ trong dung dịch tăng",
    "re": "Điều này cho thấy dung dịch trở nên axit hơn"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử cao hơn, thì nó có nhiều proton hơn trong hạt nhân",
    "re": "Điều này cũng có nghĩa là nó có nhiều electron hơn trong trạng thái trung hòa"
  },
  {
    "con": "Khi hai nguyên tố kết hợp để tạo thành một hợp chất, nếu chúng có độ âm điện khác nhau, thì liên kết giữa chúng sẽ có tính phân cực",
    "re": "Điều này dẫn đến sự hình thành các phân tử có tính chất hóa học đặc biệt"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì nó có thể diễn ra theo cả hai chiều",
    "re": "Điều này có nghĩa là sản phẩm có thể chuyển đổi trở lại thành phản ứng ban đầu"
  },
  {
    "con": "Khi một chất bị oxi hóa, thì nó mất electron",
    "re": "Điều này làm tăng số oxi hóa của chất đó"
  },
  {
    "con": "Chọn phương án đúng:\n Số electron độc thân của các nguyên tử ở trạng thái cơ bản có cấu hình electron hóa trị như sau lần lượt là:\n 1) 4f^{7}5d^{1}6s^{2}; 2) 5f^{14}6d^{7}7s^{2}; 3) 3d^{5}4s^{1}; 4) 4f^{8}6s^{2}",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng thường tăng lên.",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước thì chất đó thường là chất ion hoặc phân cực.",
    "re": "Chất đó dễ hòa tan"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao thì phản ứng đó có thể chuyển dịch theo hướng tạo ra ít phân tử hơn.",
    "re": "Phản ứng có thể chuyển dịch"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử cao thì nó thường có nhiều electron hơn và có thể có nhiều lớp electron.",
    "re": "Nguyên tố đó có cấu trúc electron phức tạp hơn"
  },
  {
    "con": "Nếu một chất có tính acid mạnh thì nó sẽ có khả năng giải phóng ion H+ nhiều hơn trong dung dịch.",
    "re": "Chất đó có tính acid mạnh"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt thì năng lượng được giải phóng ra ngoài môi trường.",
    "re": "Phản ứng đó tỏa nhiệt"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử đối xứng thì nó thường không có tính phân cực.",
    "re": "Chất đó không phân cực"
  },
  {
    "con": "Nếu một dung dịch có pH < 7 thì dung dịch đó được coi là acid.",
    "re": "Dung dịch đó acid"
  },
  {
    "con": "Nếu một nguyên tử có số electron hóa trị là 8 thì nguyên tử đó thường ổn định và không dễ dàng tham gia phản ứng hóa học.",
    "re": "Nguyên tử đó ổn định"
  },
  {
    "con": "Chọn trường hợp đúng:\n Cho cấu hình electron của các nguyên tử X , Y, Z , T như sau:\n X: 1s^22s^22p^63s^23p^63d^{10}4s^24p^64d^{10}5s^25p^64f^56s^2\n Y: 1s^22s^22p^63s^23p^63d^{10}4s^24p^3\n Z: 1s^22s^22p^63s^23p^63d^{10}4s^24p^64d^{10}5s^1\n T: 1s^22s^22p^63s^23p^63d^{10}4s2",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nguyên tử có số proton bằng số electron",
    "re": "Nguyên tử đó là trung hòa về điện"
  },
  {
    "con": "Nếu một hợp chất có liên kết ion",
    "re": "Hợp chất đó thường có điểm nóng chảy cao và dẫn điện khi hòa tan trong nước"
  },
  {
    "con": "Nếu một nguyên tố có cấu hình electron đầy đủ",
    "re": "Nguyên tố đó thường là một khí hiếm"
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên",
    "re": "Động năng của các phân tử trong chất đó cũng tăng lên"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao",
    "re": "Phản ứng có thể chuyển dịch theo hướng tạo ra ít phân tử hơn"
  },
  {
    "con": "Nếu pH của dung dịch nhỏ hơn 7",
    "re": "Dung dịch đó được coi là axit"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước",
    "re": "Chất đó thường là một chất điện ly"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch",
    "re": "Phản ứng có thể diễn ra theo cả hai chiều"
  },
  {
    "con": "Nếu một nguyên tố có số oxi hóa cao nhất",
    "re": "Nguyên tố đó có khả năng nhận electron mạnh"
  },
  {
    "con": "Nước là một hợp chất được hình thành từ hai nguyên tố là hydro và oxy.",
    "re": "Nước có công thức hóa học là H2O"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có tính chất hóa học tương tự nhau.",
    "re": "Điều này là do chúng có cùng số electron ở lớp ngoài cùng"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm.",
    "re": "Đây là định luật bảo toàn khối lượng"
  },
  {
    "con": "Các ion dương được gọi là cation và các ion âm được gọi là anion.",
    "re": "Cation được hình thành khi nguyên tử mất electron, còn anion khi nguyên tử nhận electron"
  },
  {
    "con": "Nhiệt độ ảnh hưởng đến tốc độ phản ứng hóa học.",
    "re": "Tăng nhiệt độ thường làm tăng tốc độ phản ứng"
  },
  {
    "con": "Các hợp chất ion thường có điểm nóng chảy cao hơn so với các hợp chất covalent.",
    "re": "Điều này là do lực tương tác giữa các ion rất mạnh"
  },
  {
    "con": "Phản ứng oxi hóa khử liên quan đến sự chuyển giao electron giữa các chất.",
    "re": "Chất bị oxi hóa mất electron, trong khi chất bị khử nhận electron"
  },
  {
    "con": "Độ pH của dung dịch cho biết tính axit hoặc bazơ của nó.",
    "re": "Dung dịch có pH < 7 là axit, pH = 7 là trung tính, và pH > 7 là bazơ"
  },
  {
    "con": "Các nguyên tố có cấu hình electron ngoài cùng là ns^2np^5 là halogen.",
    "re": "Halogen rất dễ phản ứng và thường tạo thành muối với kim loại"
  },
  {
    "con": "Các phản ứng hóa học có thể được biểu diễn bằng phương trình hóa học.",
    "re": "Phương trình hóa học phải được cân bằng để tuân thủ định luật bảo toàn khối lượng"
  },
  {
    "con": "Chọn phương án đúng: Trong phân tử CO\n 1) Hóa trị của O là 3\n 2) Số oxi hóa của O là -2\n 3) Số oxi hóa của O là -3\n 4) Phân tử CO có cực",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Có mặt của nước trong phản ứng hóa học",
    "re": "Có thể tạo ra sản phẩm mới"
  },
  {
    "con": "Nhiệt độ tăng trong phản ứng hóa học",
    "re": "Tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Chất xúc tác được thêm vào phản ứng",
    "re": "Tốc độ phản ứng sẽ tăng mà không làm thay đổi sản phẩm"
  },
  {
    "con": "Số nguyên tử trong một phân tử nước (H2O)",
    "re": "Có tổng cộng 3 nguyên tử"
  },
  {
    "con": "Chọn phương án đúng: Trong phản ứng giữa axit và bazơ\n 1) Sản phẩm là muối và nước\n 2) Không có sản phẩm nào được tạo ra\n 3) Chỉ tạo ra muối\n 4) Chỉ tạo ra nước",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khối lượng của một nguyên tử carbon (C)",
    "re": "Khoảng 12 u (đơn vị khối lượng nguyên tử)"
  },
  {
    "con": "Sự hòa tan của muối trong nước",
    "re": "Tạo ra dung dịch điện ly"
  },
  {
    "con": "Chọn phương án đúng: Trong phản ứng phân hủy\n 1) Chất phản ứng chỉ có một sản phẩm\n 2) Chất phản ứng có thể tạo ra nhiều sản phẩm\n 3) Không có sản phẩm nào được tạo ra\n 4) Chất phản ứng không thay đổi",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Số oxi hóa của nguyên tử hydro (H) trong hợp chất",
    "re": "Thường là +1 trừ khi kết hợp với kim loại"
  },
  {
    "con": "Chọn phát biểu đúng:\n 1) Tính chất hóa học của một nguyên tố hóa học phụ thuộc vào số khối.\n 2) Khối lượng của nguyên tử phần lớn tập trung ở lớp vỏ điện tử.\n 3) Không thể tồn tại nguyên tử mà hạt nhân nguyên tử không có neutron.\n 4) Nguyên tử của các nguyên tố hóa học khác nhau thì điện tích hạt nhân khác nhau.\n 5) Các nguyên tử của hai hay nhiều nguyên tố có thể kết hợp theo một tỷ lệ xác định để tạo thành hợp chất.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nồng độ của dung dịch tăng lên khi lượng chất tan trong dung môi tăng lên.",
    "re": "Dung dịch trở nên đậm đặc hơn"
  },
  {
    "con": "Nhiệt độ tăng lên khi phản ứng hóa học tỏa nhiệt.",
    "re": "Năng lượng được giải phóng"
  },
  {
    "con": "Khi một nguyên tố hóa học mất electron, nó trở thành ion dương.",
    "re": "Điện tích của nguyên tử tăng lên"
  },
  {
    "con": "Khi hai nguyên tố hóa học kết hợp với nhau, chúng có thể tạo thành một hợp chất mới.",
    "re": "Tính chất hóa học của hợp chất khác với tính chất của các nguyên tố ban đầu"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín, thì khối lượng tổng của các chất phản ứng bằng khối lượng tổng của các sản phẩm.",
    "re": "Định luật bảo toàn khối lượng được áp dụng"
  },
  {
    "con": "Khi pH của dung dịch giảm, nồng độ ion H+ trong dung dịch tăng lên.",
    "re": "Dung dịch trở nên axit hơn"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn chất khác, thì nó sẽ bay hơi nhanh hơn khi được đun nóng.",
    "re": "Chất đó có khả năng bay hơi cao hơn"
  },
  {
    "con": "Khi một nguyên tử hấp thụ năng lượng, electron có thể chuyển từ mức năng lượng thấp lên mức năng lượng cao.",
    "re": "Nguyên tử trở nên kích thích"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì sản phẩm có thể chuyển đổi trở lại thành các chất phản ứng.",
    "re": "Phản ứng có thể xảy ra theo cả hai chiều"
  },
  {
    "con": "Chọn phát biểu đúng về hợp chất H_2SO_4\n 1) Trong phân tử H_2SO_4 tồn tại liên kết cộng hóa trị và liên kết ion.\n 2) S là nguyên tử trung tâm trong hợp chất và có trạng thái lai hóa là sp^3.\n 3) Số oxi hóa của các nguyên tố trong hợp chất lần lượt là: H: +1; S: +6; O: -2.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là dung môi phổ biến trong hóa học và có khả năng hòa tan nhiều chất.",
    "re": "Nước được gọi là dung môi phổ quát."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao và áp suất cao,",
    "re": "thì tốc độ phản ứng thường tăng lên do năng lượng va chạm giữa các phân tử tăng."
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước,",
    "re": "thì chất đó sẽ bay hơi nhanh hơn khi được đun nóng."
  },
  {
    "con": "Nếu một hợp chất có cấu trúc phân tử không đối xứng,",
    "re": "thì hợp chất đó có thể có tính quang hoạt."
  },
  {
    "con": "Nếu một nguyên tố có số electron hóa trị là 1,",
    "re": "thì nguyên tố đó thường thuộc nhóm 1 trong bảng tuần hoàn."
  },
  {
    "con": "Nếu pH của dung dịch axit nhỏ hơn 7,",
    "re": "thì dung dịch đó có tính axit."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt,",
    "re": "thì năng lượng được giải phóng ra môi trường xung quanh."
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước,",
    "re": "thì chất đó thường là ion hoặc phân cực."
  },
  {
    "con": "Nếu một nguyên tố có số oxi hóa thay đổi trong phản ứng hóa học,",
    "re": "thì nguyên tố đó tham gia vào phản ứng oxi hóa-khử."
  },
  {
    "con": "Chọn phương án đúng:\n Trong bảng hệ thống tuần hoàn, các nguyên tố nằm trong phân nhóm phụ có các đặc điểm sau:\n (1) Chỉ có số oxy hóa dương.\n (2) Đều là nguyên tố d.\n (3) Cation tương ứng đều có cấu hình e khác khí trơ.\n (4) Đều là kim loại.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có cùng số electron ở lớp ngoài cùng.",
    "re": "Chúng có tính chất hóa học tương tự nhau."
  },
  {
    "con": "Khi một nguyên tố phản ứng với oxy, nếu nguyên tố đó là kim loại, thì",
    "re": "sản phẩm tạo thành thường là oxit kim loại."
  },
  {
    "con": "Nếu một hợp chất có chứa ion hydroxide (OH-), thì",
    "re": "hợp chất đó có thể được coi là một bazơ."
  },
  {
    "con": "Khi nhiệt độ tăng, nếu áp suất không đổi, thì",
    "re": "thể tích của khí sẽ tăng theo định luật Charles."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín, thì",
    "re": "khối lượng của các chất phản ứng sẽ bằng khối lượng của các sản phẩm."
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì",
    "re": "dung dịch đó được coi là axit."
  },
  {
    "con": "Khi một nguyên tố có số electron hóa trị cao, thì",
    "re": "nó có khả năng tạo liên kết hóa học mạnh hơn."
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước, thì",
    "re": "chất đó sẽ bay hơi nhanh hơn khi ở nhiệt độ phòng."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì",
    "re": "nhiệt độ của môi trường xung quanh sẽ tăng lên."
  },
  {
    "con": "Chọn phát biểu đúng:\n (1) Trong cùng một nguyên tử, ocbitan np có kích thước lớn hơn ocbitan (n-1)p.\n (2) Trong cùng một nguyên tử, năng lượng của electron trên AO ns lớn hơn năng lượng của electron trên AO (n-1)s.\n (3) Xác suất gặp electron của một AO 4f ở mọi hướng là như nhau.\n (4) Năng lượng của electron trên AO 3d_{zx} lớn hơn năng lượng của electron trên AO 3d_{xy}.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Năng lượng của electron trong nguyên tử tăng khi số lượng proton trong hạt nhân tăng.",
    "re": "Điều này dẫn đến việc năng lượng ion hóa cũng tăng."
  },
  {
    "con": "Nếu một hợp chất có liên kết ion, thì nó thường có điểm nóng chảy cao.",
    "re": "Điều này là do lực hút tĩnh điện mạnh giữa các ion."
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là axit.",
    "re": "Điều này có nghĩa là nồng độ ion H+ trong dung dịch cao hơn nồng độ ion OH-."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng thường tăng.",
    "re": "Điều này là do năng lượng của các phân tử tăng lên, dẫn đến nhiều va chạm hơn."
  },
  {
    "con": "Nếu một nguyên tố có số electron hóa trị là 1, thì nó thường thuộc nhóm kim loại kiềm.",
    "re": "Điều này có nghĩa là nó có xu hướng mất electron để tạo thành ion dương."
  },
  {
    "con": "Nếu một hợp chất có cấu trúc phân tử không đối xứng, thì nó có thể có đồng phân quang học.",
    "re": "Điều này có nghĩa là nó có thể tồn tại dưới dạng hai dạng đồng phân khác nhau."
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì nó có thể đi theo cả hai chiều.",
    "re": "Điều này có nghĩa là sản phẩm có thể chuyển đổi trở lại thành phản ứng ban đầu."
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước, thì nó thường là chất ion hoặc phân cực.",
    "re": "Điều này là do khả năng tương tác với phân tử nước."
  },
  {
    "con": "Nếu một nguyên tố có cấu hình electron đầy đủ, thì nó thường không phản ứng với các nguyên tố khác.",
    "re": "Điều này có nghĩa là nó là một khí hiếm và ổn định."
  },
  {
    "con": "Chọn phát biểu sai:\n (1) Độ dài liên kết là khoảng cách giữa hai hạt nhân nguyên tử liên kết (đơn vị angstrom).\n (2) Góc hóa trị là một đại lượng đặc trưng cho tất cả các loại phân tử.\n (3) Chỉ có liên kết ion mới có bản chất điện.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng thường tăng lên.",
    "re": "Điều này đúng vì nhiệt độ cao hơn cung cấp nhiều năng lượng hơn cho các phân tử, làm tăng khả năng va chạm hiệu quả."
  },
  {
    "con": "Một chất có thể tồn tại ở ba trạng thái: rắn, lỏng và khí thì nó có thể chuyển đổi giữa các trạng thái này khi thay đổi nhiệt độ và áp suất.",
    "re": "Điều này đúng vì các trạng thái của chất phụ thuộc vào điều kiện nhiệt độ và áp suất."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kín thì khối lượng của các chất phản ứng và sản phẩm sẽ không thay đổi.",
    "re": "Điều này đúng theo định luật bảo toàn khối lượng."
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6 thì nó là carbon.",
    "re": "Điều này đúng vì carbon có số hiệu nguyên tử 6 trong bảng tuần hoàn."
  },
  {
    "con": "Nếu một dung dịch có pH < 7 thì nó được coi là axit.",
    "re": "Điều này đúng vì pH dưới 7 chỉ ra tính axit của dung dịch."
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước thì nó sẽ bay hơi ở nhiệt độ phòng.",
    "re": "Điều này đúng vì chất có điểm sôi thấp hơn sẽ chuyển sang trạng thái khí ở nhiệt độ phòng."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt thì nó sẽ giải phóng năng lượng dưới dạng nhiệt.",
    "re": "Điều này đúng vì phản ứng tỏa nhiệt làm tăng nhiệt độ của môi trường xung quanh."
  },
  {
    "con": "Nếu một ion mang điện tích dương thì nó được gọi là cation.",
    "re": "Điều này đúng vì cation là ion mất electron và mang điện tích dương."
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O thì nó là nước.",
    "re": "Điều này đúng vì H2O là công thức hóa học của nước."
  },
  {
    "con": "Chọn phương án đúng: Trong phân tử CO\n (1) Hóa trị của O là 3\n (2) Số oxi hóa của O là -2\n (3) Số oxi hóa của O là -3\n (4) Phân tử CO có cực",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "Tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Một chất có điểm sôi thấp hơn 100 độ C",
    "re": "Chất đó có thể tồn tại ở trạng thái lỏng ở nhiệt độ phòng"
  },
  {
    "con": "Một dung dịch có pH < 7",
    "re": "Dung dịch đó được coi là axit"
  },
  {
    "con": "Một phản ứng hóa học xảy ra trong điều kiện kín",
    "re": "Khối lượng tổng thể của hệ thống sẽ không thay đổi"
  },
  {
    "con": "Một nguyên tố có số proton bằng 6",
    "re": "Nguyên tố đó là Carbon"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion",
    "re": "Chất đó được gọi là chất điện ly"
  },
  {
    "con": "Một phản ứng hóa học có năng lượng tự do Gibbs âm",
    "re": "Phản ứng đó có khả năng xảy ra tự phát"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên",
    "re": "Tốc độ phản ứng có thể tăng lên nếu phản ứng là bậc nhất"
  },
  {
    "con": "Một hợp chất có công thức hóa học C2H6",
    "re": "Hợp chất đó là Ethane"
  },
  {
    "con": "Chọn câu đúng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Có một chất có công thức hóa học là H2O:",
    "re": "Chất đó là nước"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học:",
    "re": "Tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Một nguyên tố có số proton là 6:",
    "re": "Nguyên tố đó là carbon"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion dương và ion âm:",
    "re": "Chất đó là chất điện ly"
  },
  {
    "con": "Số mol của một chất được tính bằng khối lượng chia cho khối lượng mol:",
    "re": "Kết quả là số mol của chất đó"
  },
  {
    "con": "Khi pH của dung dịch giảm:",
    "re": "Dung dịch trở nên axit hơn"
  },
  {
    "con": "Một phản ứng hóa học xảy ra khi các liên kết hóa học bị phá vỡ và hình thành lại:",
    "re": "Sản phẩm mới được tạo ra"
  },
  {
    "con": "Khi nhiệt độ giảm trong một phản ứng tỏa nhiệt:",
    "re": "Phản ứng có thể bị chậm lại"
  },
  {
    "con": "Một hợp chất có công thức hóa học là NaCl:",
    "re": "Hợp chất đó là muối ăn"
  },
  {
    "con": "Electron cuối cùng của nguyên tử _{17}Cl có bộ các số lượng tử sau (quy ước electron điền vào các ocbitan theo thứ tự mℓ từ –ℓ đến +ℓ)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch",
    "re": "Phản ứng sẽ chuyển dịch theo chiều thuận nếu phản ứng tỏa nhiệt"
  },
  {
    "con": "Một dung dịch có pH < 7",
    "re": "Dung dịch đó được coi là axit"
  },
  {
    "con": "Một nguyên tử có số proton bằng số electron",
    "re": "Nguyên tử đó là trung hòa về điện"
  },
  {
    "con": "Khi một chất rắn tan trong nước và tạo ra ion",
    "re": "Chất đó được gọi là chất điện ly"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao",
    "re": "Phản ứng sẽ có xu hướng chuyển dịch về phía có ít mol khí hơn"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên",
    "re": "Động năng của các phân tử trong chất đó cũng tăng lên"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử Z",
    "re": "Nguyên tố đó có Z proton trong hạt nhân"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn các chất phản ứng",
    "re": "Phản ứng đó là phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng",
    "re": "Chất đó có thể có tính quang hoạt"
  },
  {
    "con": "Chọn phát biểu sai về phương pháp MO:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng:",
    "re": "Chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng"
  },
  {
    "con": "Các nguyên tử trong cùng một nhóm của bảng tuần hoàn:",
    "re": "Có tính chất hóa học tương tự nhau"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra:",
    "re": "Năng lượng có thể được giải phóng hoặc hấp thụ"
  },
  {
    "con": "Một dung dịch có pH < 7:",
    "re": "Dung dịch đó là axit"
  },
  {
    "con": "Khi nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch:",
    "re": "Phản ứng sẽ chuyển dịch theo chiều tỏa nhiệt"
  },
  {
    "con": "Một hợp chất ion được hình thành từ:",
    "re": "Sự kết hợp giữa cation và anion"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên:",
    "re": "Tốc độ phản ứng có thể tăng lên nếu phản ứng là bậc 1"
  },
  {
    "con": "Sự phân ly của một muối trong nước:",
    "re": "Tạo ra các ion tự do trong dung dịch"
  },
  {
    "con": "Khi một chất bị oxi hóa:",
    "re": "Chất đó mất electron"
  },
  {
    "con": "Chọn phương án đúng: Chọn các chất có thể tan nhiều trong nước: CO_2, SO_2, NH_3, CCl_4, CS_2, NO_2, HCl, N_2, CH_4.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học có thể làm tăng tốc độ phản ứng.",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Chất điện ly mạnh sẽ phân ly hoàn toàn trong dung dịch.",
    "re": "Tạo ra ion tự do trong dung dịch"
  },
  {
    "con": "Khi pH của dung dịch giảm, nồng độ ion H+ trong dung dịch tăng.",
    "re": "Dung dịch trở nên axit hơn"
  },
  {
    "con": "Khi một phản ứng hóa học đạt đến trạng thái cân bằng, tốc độ phản ứng thuận và phản ứng nghịch bằng nhau.",
    "re": "Nồng độ các chất không thay đổi theo thời gian"
  },
  {
    "con": "Chọn phương án đúng: Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có tính chất hóa học tương tự.",
    "re": "Tính chất hóa học tương đồng"
  },
  {
    "con": "Khi nhiệt độ giảm, khả năng hòa tan của khí trong chất lỏng thường tăng lên.",
    "re": "Khí hòa tan nhiều hơn trong chất lỏng"
  },
  {
    "con": "Khi một chất phản ứng với oxy, nó thường tạo ra nhiệt và ánh sáng.",
    "re": "Phản ứng tỏa nhiệt"
  },
  {
    "con": "Chất rắn có cấu trúc tinh thể thường có điểm nóng chảy xác định.",
    "re": "Điểm nóng chảy rõ ràng"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng, áp suất hơi của dung dịch giảm.",
    "re": "Áp suất hơi giảm"
  },
  {
    "con": "Chọn trường hợp đúng: Các electron có cùng số lượng tử chính bị chắn yếu nhất là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một nguyên tử mất electron, nó trở thành:",
    "re": "ion dương"
  },
  {
    "con": "Nếu hai nguyên tố có cùng số lượng electron ở lớp ngoài cùng, thì:",
    "re": "chúng có tính chất hóa học tương tự"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường:",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một hợp chất có liên kết ion, thì:",
    "re": "nó thường có điểm nóng chảy cao"
  },
  {
    "con": "Khi pH của dung dịch giảm, thì:",
    "re": "nồng độ ion H+ tăng lên"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín, thì:",
    "re": "khối lượng tổng thể của hệ thống không thay đổi"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion, thì:",
    "re": "chất đó được gọi là chất điện ly"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì:",
    "re": "các sản phẩm có thể chuyển đổi trở lại thành phản ứng ban đầu"
  },
  {
    "con": "Khi một nguyên tử có số electron không bằng số proton, thì:",
    "re": "nguyên tử đó là ion"
  },
  {
    "con": "Ion A^{4+} có cấu hình e phân lớp cuối cùng là 3p^6. Vị trí của A trong bảng hệ thống tuần hoàn là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước (H2O) có cấu trúc phân tử là phân tử có hai nguyên tử hydro và một nguyên tử oxy. Tính chất của nước là:",
    "re": "Chất lỏng ở nhiệt độ phòng và có khả năng hòa tan nhiều chất"
  },
  {
    "con": "Một nguyên tố có số hiệu nguyên tử là 12. Nguyên tố này thuộc nhóm nào trong bảng tuần hoàn:",
    "re": "Nhóm 2 (Kim loại kiềm thổ)"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm. Nguyên lý này được gọi là:",
    "re": "Định luật bảo toàn khối lượng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là C6H12O6, thì hợp chất này được biết đến là:",
    "re": "Glucose"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường:",
    "re": "Tăng lên do các phân tử có năng lượng cao hơn"
  },
  {
    "con": "Nếu một ion có điện tích -1 và có 17 electron, thì số proton của ion đó là:",
    "re": "16 proton"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước và tạo ra dung dịch, hiện tượng này được gọi là:",
    "re": "Quá trình hòa tan"
  },
  {
    "con": "Nếu một nguyên tố có cấu hình electron là [Ne] 3s^2 3p^5, thì nguyên tố này là:",
    "re": "Clor (Cl)"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra mà không có sự thay đổi về năng lượng, phản ứng đó được gọi là:",
    "re": "Phản ứng đồng hóa"
  },
  {
    "con": "Chọn phương án đúng: Nguyên tử _{15}P trong phân tử PCl_5 ở trạng thái lai hóa:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch:",
    "re": "Phản ứng sẽ dịch chuyển theo hướng sinh ra nhiều sản phẩm hơn"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên:",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Nếu một nguyên tố có số oxi hóa cao nhất là +7:",
    "re": "Nó có khả năng nhận electron và trở thành chất khử"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7:",
    "re": "Dung dịch trở thành axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao:",
    "re": "Phản ứng sẽ có xu hướng dịch chuyển về phía có ít phân tử khí hơn"
  },
  {
    "con": "Khi một chất rắn tan trong dung môi:",
    "re": "Nó tạo thành dung dịch đồng nhất"
  },
  {
    "con": "Nếu một nguyên tử có số electron bằng số proton:",
    "re": "Nguyên tử đó là trung hòa về điện"
  },
  {
    "con": "Khi nhiệt độ của một chất khí tăng lên trong một bình kín:",
    "re": "Áp suất của chất khí sẽ tăng lên"
  },
  {
    "con": "Nếu một phản ứng hóa học là tỏa nhiệt:",
    "re": "Nó sẽ giải phóng năng lượng dưới dạng nhiệt"
  },
  {
    "con": "Chọn phương án sai:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất có cấu trúc phân tử ổn định:",
    "re": "Có thể tồn tại ở trạng thái rắn, lỏng hoặc khí"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học:",
    "re": "Thường làm tăng tốc độ phản ứng"
  },
  {
    "con": "Một dung dịch có pH < 7:",
    "re": "Được coi là dung dịch axit"
  },
  {
    "con": "Khi một nguyên tố mất electron:",
    "re": "Nó trở thành ion dương"
  },
  {
    "con": "Số nguyên tử trong một phân tử nước (H2O):",
    "re": "Là 3 (2 hydro và 1 oxy)"
  },
  {
    "con": "Khi một chất phản ứng với oxy:",
    "re": "Sẽ tạo ra năng lượng dưới dạng nhiệt hoặc ánh sáng"
  },
  {
    "con": "Một chất điện ly mạnh:",
    "re": "Hoàn toàn phân ly thành ion trong dung dịch"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng:",
    "re": "Khả năng phản ứng của chất đó cũng tăng lên"
  },
  {
    "con": "Phản ứng hóa học xảy ra khi:",
    "re": "Các liên kết hóa học giữa các nguyên tử bị phá vỡ và hình thành liên kết mới"
  },
  {
    "con": "Chọn phương án sai theo thuyết cơ học lượng tử áp dụng cho nguyên tử đa electron:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sử dụng công thức hóa học đúng:",
    "re": "Có thể xác định được thành phần và tỉ lệ của các nguyên tố trong hợp chất"
  },
  {
    "con": "Biết rằng nước là một hợp chất có công thức H2O:",
    "re": "Có thể hiểu được rằng mỗi phân tử nước gồm hai nguyên tử hydro và một nguyên tử oxy"
  },
  {
    "con": "Thực hiện phản ứng hóa học trong điều kiện thích hợp:",
    "re": "Sẽ tạo ra sản phẩm với hiệu suất cao hơn"
  },
  {
    "con": "Áp dụng định luật bảo toàn khối lượng trong phản ứng hóa học:",
    "re": "Tổng khối lượng của các phản ứng sẽ bằng tổng khối lượng của các sản phẩm"
  },
  {
    "con": "Sử dụng bảng tuần hoàn để xác định tính chất của nguyên tố:",
    "re": "Có thể dự đoán được tính chất hóa học và vật lý của nguyên tố đó"
  },
  {
    "con": "Biết rằng pH dưới 7 cho thấy dung dịch có tính axit:",
    "re": "Có thể xác định được tính chất của dung dịch đó"
  },
  {
    "con": "Thực hiện thí nghiệm với các hóa chất độc hại mà không có biện pháp bảo vệ:",
    "re": "Có nguy cơ cao về an toàn cho bản thân và môi trường"
  },
  {
    "con": "Sử dụng phương pháp phân tích định lượng:",
    "re": "Có thể xác định chính xác nồng độ của các chất trong mẫu"
  },
  {
    "con": "Nắm vững các quy tắc về an toàn trong phòng thí nghiệm:",
    "re": "Giảm thiểu rủi ro và tai nạn trong quá trình thực hiện thí nghiệm"
  },
  {
    "con": "Biết C (Z = 6), N (Z = 7). Theo phương pháp MO, xác định bậc liên kết và từ tính của ion CN^-:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biết rằng nước (H2O) là một hợp chất phân cực:",
    "re": "Nước có khả năng hòa tan tốt các chất ion và phân cực khác."
  },
  {
    "con": "Biết rằng nhiệt độ tăng lên làm tăng năng lượng động học của các phân tử:",
    "re": "Tốc độ phản ứng hóa học sẽ tăng lên."
  },
  {
    "con": "Biết rằng pH của dung dịch axit mạnh là dưới 7:",
    "re": "Dung dịch này có tính axit và có khả năng dẫn điện tốt."
  },
  {
    "con": "Biết rằng các nguyên tố trong cùng một nhóm của bảng tuần hoàn có tính chất hóa học tương tự:",
    "re": "Chúng có cùng số electron ở lớp ngoài cùng."
  },
  {
    "con": "Biết rằng phản ứng hóa học xảy ra khi có sự va chạm giữa các phân tử:",
    "re": "Cần có năng lượng kích hoạt để phản ứng xảy ra."
  },
  {
    "con": "Biết rằng các ion dương và ion âm có xu hướng kết hợp với nhau:",
    "re": "Chúng tạo thành các hợp chất ion."
  },
  {
    "con": "Biết rằng các phản ứng oxi hóa khử liên quan đến sự chuyển giao electron:",
    "re": "Một chất bị oxi hóa trong khi chất khác bị khử."
  },
  {
    "con": "Biết rằng nhiệt độ sôi của một chất phụ thuộc vào áp suất:",
    "re": "Nhiệt độ sôi sẽ tăng khi áp suất tăng."
  },
  {
    "con": "Biết rằng các hợp chất hữu cơ thường chứa carbon:",
    "re": "Chúng có thể có cấu trúc phức tạp và đa dạng."
  },
  {
    "con": "Chọn phát biểu sai theo thuyết MO:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất có điểm sôi thấp hơn điểm sôi của nước:",
    "re": "Chất đó sẽ bay hơi dễ dàng hơn nước"
  },
  {
    "con": "Một phản ứng hóa học xảy ra giữa hai chất phản ứng:",
    "re": "Sẽ tạo ra sản phẩm mới với tính chất khác biệt"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch:",
    "re": "Phản ứng sẽ dịch chuyển theo chiều phản ứng ngược"
  },
  {
    "con": "Một dung dịch có pH < 7:",
    "re": "Dung dịch đó được coi là axit"
  },
  {
    "con": "Sự tăng nồng độ của một chất trong phản ứng hóa học:",
    "re": "Sẽ làm tăng tốc độ phản ứng"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước:",
    "re": "Nó sẽ tạo ra dung dịch đồng nhất"
  },
  {
    "con": "Một nguyên tố có số proton khác nhau:",
    "re": "Sẽ tạo ra các đồng vị khác nhau"
  },
  {
    "con": "Khi một chất bị oxi hóa:",
    "re": "Chất đó sẽ mất electron"
  },
  {
    "con": "Một phản ứng hóa học tỏa nhiệt:",
    "re": "Sẽ làm tăng nhiệt độ của môi trường xung quanh"
  },
  {
    "con": "Chọn phương án đúng: Dãy nguyên tử _4Be, _7N, _{11}Na, _{12}Mg có bán kính R tăng dần theo dãy:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng thường tăng lên.",
    "re": "Phản ứng xảy ra nhanh hơn"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước thì chất đó thường là chất ion hoặc phân cực.",
    "re": "Chất dễ hòa tan trong nước"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao thì thể tích sản phẩm thường nhỏ hơn thể tích phản ứng ban đầu.",
    "re": "Phản ứng có thể xảy ra thuận lợi hơn"
  },
  {
    "con": "Nếu một nguyên tố có điện tích dương cao thì khả năng thu hút electron của nó cũng cao.",
    "re": "Nguyên tố có tính oxi hóa mạnh"
  },
  {
    "con": "Nếu pH của dung dịch giảm xuống dưới 7 thì dung dịch đó trở thành axit.",
    "re": "Dung dịch có tính axit"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C thì chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng.",
    "re": "Chất có thể ở dạng khí"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt thì năng lượng được giải phóng ra môi trường.",
    "re": "Phản ứng có thể tự xảy ra"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao thì khả năng dẫn điện của dung dịch đó cũng cao.",
    "re": "Dung dịch có tính dẫn điện tốt"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử phức tạp thì thường có nhiều tính chất hóa học khác nhau.",
    "re": "Chất có thể tham gia vào nhiều phản ứng khác nhau"
  },
  {
    "con": "Chọn phương án đúng: Ở trạng thái tinh thể, hợp chất Na_2SO_4 có những loại liên kết nào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion, thì chất đó được gọi là chất điện ly.",
    "re": "Chất điện ly"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra mà không có sự thay đổi về khối lượng, thì nguyên lý bảo toàn khối lượng được áp dụng.",
    "re": "Nguyên lý bảo toàn khối lượng"
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên, thì động năng của các phân tử trong chất đó cũng tăng lên.",
    "re": "Động năng tăng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học C_nH_{2n+2}, thì hợp chất đó là ankan.",
    "re": "Hợp chất ankan"
  },
  {
    "con": "Nếu pH của dung dịch nhỏ hơn 7, thì dung dịch đó được coi là axit.",
    "re": "Dung dịch axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng thường tăng lên.",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước, thì nó có khả năng tạo ra dung dịch bão hòa.",
    "re": "Dung dịch bão hòa"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử Z, thì nó có Z proton trong hạt nhân.",
    "re": "Z proton"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì nó có thể diễn ra theo cả hai chiều.",
    "re": "Phản ứng thuận nghịch"
  },
  {
    "con": "Chọn phương án sai:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất có cấu trúc phân tử ổn định:",
    "re": "Có thể tồn tại lâu dài trong tự nhiên"
  },
  {
    "con": "Nhiệt độ tăng lên:",
    "re": "Tốc độ phản ứng hóa học thường tăng"
  },
  {
    "con": "Một dung dịch có pH < 7:",
    "re": "Là dung dịch axit"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra:",
    "re": "Năng lượng có thể được giải phóng hoặc hấp thụ"
  },
  {
    "con": "Số nguyên tử trong một phân tử nước (H2O):",
    "re": "Là 3 (2 hydro và 1 oxy)"
  },
  {
    "con": "Khi một chất bị oxi hóa:",
    "re": "Nó mất electron"
  },
  {
    "con": "Một hợp chất ion:",
    "re": "Được hình thành từ các ion dương và ion âm"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng:",
    "re": "Khả năng phản ứng của chất đó cũng tăng"
  },
  {
    "con": "Một nguyên tố có số proton bằng 6:",
    "re": "Là nguyên tố carbon"
  },
  {
    "con": "Chọn phương án đúng: Cho: _3Li, _4Be, _9F, _{11}Na, _{19}K. Hãy sắp xếp các phân tử sau đây theo chiều tăng dần tác dụng phân cực của ion dương: \n1) LiF; 2) NaF; 3) KF; 4) BeF_2",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng thường tăng lên.",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước thì nó thường là chất ion hoặc phân cực.",
    "re": "Chất đó dễ hòa tan trong nước"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao thì phản ứng đó có thể chuyển dịch theo hướng tạo ra ít phân tử hơn.",
    "re": "Phản ứng có thể chuyển dịch theo hướng tạo ra ít phân tử hơn"
  },
  {
    "con": "Nếu một chất có độ pH thấp thì nó được coi là axit.",
    "re": "Chất đó là axit"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử đối xứng thì nó thường không có tính phân cực.",
    "re": "Chất đó không có tính phân cực"
  },
  {
    "con": "Nếu một ion dương có điện tích cao thì nó có khả năng hút electron mạnh hơn.",
    "re": "Ion đó có khả năng hút electron mạnh hơn"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt thì năng lượng được giải phóng ra môi trường.",
    "re": "Năng lượng được giải phóng"
  },
  {
    "con": "Nếu một chất có điểm sôi cao thì nó thường có lực liên kết giữa các phân tử mạnh.",
    "re": "Lực liên kết giữa các phân tử mạnh"
  },
  {
    "con": "Nếu một chất có tính oxi hóa mạnh thì nó có khả năng nhận electron từ chất khác.",
    "re": "Chất đó có khả năng nhận electron"
  },
  {
    "con": "Chọn phương án đúng: Dự đoán nguyên tử số của nguyên tố kim loại kiềm (chưa phát hiện) ở chu kỳ 8 của bảng HTTH.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biết rằng nước là hợp chất của hydro và oxy.",
    "re": "Nước có công thức hóa học là H2O"
  },
  {
    "con": "Sử dụng quy tắc octet cho các nguyên tố phi kim.",
    "re": "Nguyên tố phi kim thường có xu hướng nhận electron để đạt cấu hình electron ổn định"
  },
  {
    "con": "Thực hiện phản ứng giữa axit và bazơ.",
    "re": "Sẽ tạo ra muối và nước"
  },
  {
    "con": "Xác định nguyên tử khối của một nguyên tố từ bảng tuần hoàn.",
    "re": "Nguyên tử khối là trung bình khối lượng của tất cả các đồng vị của nguyên tố đó"
  },
  {
    "con": "Biết rằng các nguyên tố trong cùng một nhóm có tính chất hóa học tương tự.",
    "re": "Chúng có cùng số electron ở lớp ngoài cùng"
  },
  {
    "con": "Thực hiện thí nghiệm với dung dịch kiềm và phenolphtalein.",
    "re": "Dung dịch sẽ chuyển sang màu hồng khi có kiềm"
  },
  {
    "con": "Sử dụng định luật bảo toàn khối lượng trong phản ứng hóa học.",
    "re": "Tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm"
  },
  {
    "con": "Biết rằng nhiệt độ ảnh hưởng đến tốc độ phản ứng hóa học.",
    "re": "Tăng nhiệt độ sẽ làm tăng tốc độ phản ứng"
  },
  {
    "con": "Sử dụng phương pháp phân tích định lượng.",
    "re": "Có thể xác định nồng độ của một chất trong dung dịch"
  },
  {
    "con": "Chọn câu đúng.\n (1) Ái lực electron là năng lượng cần tiêu tốn để kết hợp electron vào nguyên tử ở thể khí không bị kích thích.\n (2) Trong một chu kỳ từ trái qua phải, thế ion hóa thứ nhất của nguyên tố đứng sau luôn cao hơn thế ion hóa của nguyên tố đứng trước.\n (3) Trong một phân nhóm chính độ âm điện giảm dần từ trên xuống.\n (4) Sự sai biệt giữa hai độ âm điện của A và B càng lớn thì liên kết A – B càng có cực.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng thường tăng lên.",
    "re": "Phản ứng xảy ra nhanh hơn"
  },
  {
    "con": "Nếu nồng độ của một chất phản ứng tăng lên thì tốc độ phản ứng cũng sẽ tăng lên.",
    "re": "Phản ứng xảy ra nhanh hơn"
  },
  {
    "con": "Nếu một chất có độ âm điện cao hơn một chất khác thì chất đó sẽ có xu hướng thu hút electron mạnh hơn.",
    "re": "Liên kết có tính cực hơn"
  },
  {
    "con": "Nếu một nguyên tử có số electron bằng số proton thì nguyên tử đó sẽ trung hòa về điện.",
    "re": "Nguyên tử không mang điện"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao thì thể tích sản phẩm thường nhỏ hơn thể tích phản ứng ban đầu.",
    "re": "Phản ứng có thể xảy ra hiệu quả hơn"
  },
  {
    "con": "Nếu một dung dịch có pH < 7 thì dung dịch đó được coi là axit.",
    "re": "Dung dịch có tính axit"
  },
  {
    "con": "Nếu một nguyên tố có số lượng electron hóa trị là 1 thì nó thường có xu hướng mất electron để tạo thành ion dương.",
    "re": "Nguyên tố dễ dàng tạo ion dương"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch thì có thể xảy ra cả hai chiều: từ chất phản ứng sang sản phẩm và ngược lại.",
    "re": "Phản ứng có thể cân bằng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước thì chất đó sẽ bay hơi ở nhiệt độ phòng.",
    "re": "Chất dễ bay hơi"
  },
  {
    "con": "Chọn dãy các chất có cùng trạng thái lai hóa của nguyên tử trung tâm.\n (1) CH_2Cl_2, NF_3, ClOF, SO_4^{2-}\n (2) SO_2Cl_2, H_2O, NH_4^+, O(C_2H_5)_2\n (3) NO_2, NO_3^-, SO_2, O_3\n (4) H_2CO, OC(NH_2)_2, CO_3^{2-}, CO(CH_3)_2",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chọn dãy các chất có cùng số electron hóa trị.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức phân tử C_nH_{2n+2} thì hợp chất đó là ankan.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu nhiệt độ tăng thì áp suất của khí trong một bình kín cũng sẽ tăng theo định luật Gay-Lussac.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu pH của dung dịch giảm thì nồng độ ion H^+ trong dung dịch tăng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao thì tốc độ phản ứng thường tăng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước thì chất đó thường là ion hoặc phân cực.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có điện tích dương thì nguyên tố đó đã mất electron.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng oxi hóa khử thì có sự chuyển giao electron giữa các chất.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao thì khả năng dẫn điện của dung dịch đó cũng cao.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chọn đáp án đúng. So sánh bán kính (R) nguyên tử và ion sau:\n(1) Fe > Fe^{2+} > Fe^{3+}\n(2) N^{3-} > O^{2-} > F^-\n(3) K^+ > Ca^{2+} > Sr^{2+}\n(4) Fe^2+ > Co^{3+} > Ni^{4+}",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch",
    "re": "thì cân bằng phản ứng sẽ dịch chuyển về phía phản ứng thu nhiệt"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion",
    "re": "thì chất đó được gọi là chất điện ly"
  },
  {
    "con": "Nếu một nguyên tử có số electron bằng số proton",
    "re": "thì nguyên tử đó là trung hòa về điện"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7",
    "re": "thì dung dịch đó trở nên axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao",
    "re": "thì phản ứng sẽ có xu hướng dịch chuyển về phía có ít phân tử khí hơn"
  },
  {
    "con": "Khi một nguyên tố có số oxi hóa cao nhất",
    "re": "thì nó có khả năng oxy hóa mạnh hơn"
  },
  {
    "con": "Nếu một dung dịch có nồng độ ion H^+ cao",
    "re": "thì dung dịch đó có tính axit mạnh"
  },
  {
    "con": "Khi nhiệt độ của một chất rắn tăng lên",
    "re": "thì động năng của các phân tử trong chất rắn cũng tăng lên"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt",
    "re": "thì năng lượng được giải phóng ra môi trường xung quanh"
  },
  {
    "con": "Chọn phương án đúng:\n 1) Điện tích hạt nhân nguyên tử của bất kì nguyên tố nào về trị số bằng số thứ tự của nguyên tố đó trong bảng hệ thống tuần hoàn.\n 2) Tính chất của đơn chất, thành phần và tính chất các hợp chất biến thiên tuần hoàn theo chiều tăng của điện tích hạt nhân.\n 3) Trong bảng hệ thống tuần hoàn, phân nhóm IIIB là phân nhóm chứa nhiều nguyên tố nhất.\n 4) Chu kì (ngoại trừ chu kỳ 1) là một dãy các nguyên tố, mở đầu là một kim loại kiềm và kết thúc là một khí hiếm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng hệ thống tuần hoàn có cùng số electron ở lớp ngoài cùng.",
    "re": "Chúng có tính chất hóa học tương tự nhau."
  },
  {
    "con": "Nhiệt độ và áp suất ảnh hưởng đến trạng thái của chất.",
    "re": "Chất có thể chuyển từ trạng thái rắn sang lỏng hoặc khí khi nhiệt độ tăng."
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm.",
    "re": "Đây là định luật bảo toàn khối lượng."
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử lớn hơn 92, thì nó được coi là nguyên tố phóng xạ.",
    "re": "Nguyên tố đó không ổn định và có thể phân rã."
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7, thì dung dịch đó trở thành axit.",
    "re": "Dung dịch axit có khả năng dẫn điện tốt hơn."
  },
  {
    "con": "Nếu một hợp chất chứa ion kim loại kiềm, thì nó thường có tính chất bazơ.",
    "re": "Hợp chất đó có thể phản ứng với axit để tạo ra muối và nước."
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng lên.",
    "re": "Điều này là do các phân tử có năng lượng cao hơn và va chạm nhiều hơn."
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước, thì nó được coi là chất tan.",
    "re": "Chất tan có thể tạo ra dung dịch đồng nhất với nước."
  },
  {
    "con": "Khi một nguyên tố có điện tích dương, thì nó được gọi là cation.",
    "re": "Cation thường được hình thành khi nguyên tố mất electron."
  },
  {
    "con": "Chọn phương án sai:\n 1)Năng lượng của orbital 2p_x khác năng lượng của orbital 2p_z vì chúng định hướng trong không gian khác nhau.\n 2)Năng lượng của orbital 1s của oxy bằng năng lượng của orbital 1s của flor.\n 3)Năng lượng của các phân lớp trong cùng một lớp lượng tử của nguyên tử Hydro thì khác nhau.\n 4)Năng lượng của các orbital trong cùng một phân lớp thì khác nhau.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch",
    "re": "Thì cân bằng phản ứng sẽ dịch chuyển về phía sản phẩm nếu phản ứng tỏa nhiệt."
  },
  {
    "con": "Nồng độ của một dung dịch axit tăng lên",
    "re": "Thì pH của dung dịch sẽ giảm."
  },
  {
    "con": "Khi một nguyên tố có số oxi hóa cao hơn trong một phản ứng hóa học",
    "re": "Thì nó sẽ có xu hướng bị khử."
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong môi trường nước",
    "re": "Thì các ion sẽ được phân tán và có thể dẫn điện."
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước",
    "re": "Thì nó sẽ dễ dàng hòa tan và tạo thành dung dịch."
  },
  {
    "con": "Khi nhiệt độ của một khí tăng lên trong một bình kín",
    "re": "Thì áp suất của khí sẽ tăng theo định luật Gay-Lussac."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra với sự tham gia của chất xúc tác",
    "re": "Thì tốc độ phản ứng sẽ tăng mà không làm thay đổi trạng thái cân bằng."
  },
  {
    "con": "Khi một dung dịch có pH = 7",
    "re": "Thì dung dịch đó được coi là trung tính."
  },
  {
    "con": "Nếu một nguyên tử có số electron bằng số proton",
    "re": "Thì nguyên tử đó sẽ trung hòa về điện."
  },
  {
    "con": "Chọn phương án đúng:\n Trong các hiện tượng kể sau đây, hiện tượng nào là hiện tượng hóa học:\n 1) Hòa tan đồng (II) sunfat khan màu trắng vào nước tạo dung dịch màu lam và nóng lên.\n 2) Đun nóng Iot tinh thể ở áp suất thường.\n 3) Khí cacbonic thoát ra khi đun nóng cốc nước uống Coca – Cola.\n 4) Oxy thoát ra ở anod khi cho dòng điện chạy qua dung dịch nước của đồng (II) sunfat.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng sẽ tăng lên.",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước thì nó sẽ tạo thành dung dịch.",
    "re": "Dung dịch hình thành"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí thì sản phẩm tạo ra có thể khác với phản ứng xảy ra trong điều kiện có oxy.",
    "re": "Sản phẩm khác nhau"
  },
  {
    "con": "Nếu nồng độ của các chất phản ứng tăng lên thì tốc độ phản ứng sẽ tăng.",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Khi một chất bị oxi hóa thì nó sẽ mất electron.",
    "re": "Mất electron"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7 thì chất đó được coi là axit.",
    "re": "Chất axit"
  },
  {
    "con": "Nếu một chất có độ pH trên 7 thì chất đó được coi là bazơ.",
    "re": "Chất bazơ"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, năng lượng có thể được giải phóng hoặc hấp thụ.",
    "re": "Năng lượng thay đổi"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng thì nó có thể có tính quang hoạt.",
    "re": "Tính quang hoạt"
  },
  {
    "con": "Chọn phát biểu đúng: Ion X^{2−} có phân lớp electron ngoài cùng là 3p^6.\n 1) Cấu hình electron hóa trị của X là 3s^23p^4.\n 2) X^{2−} có điện tích hạt nhân Z = 18.\n 3) X thuộc chu kỳ 3, phân nhóm chính VIA trong bảng hệ thống tuần hoàn.\n 4) X có số oxy hóa −2.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O thì nó là nước.",
    "re": "Hợp chất này có tính chất lỏng ở nhiệt độ phòng."
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử Z = 6 thì nó là carbon.",
    "re": "Carbon có khả năng tạo ra nhiều hợp chất hữu cơ."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao và áp suất lớn thì nó có thể tạo ra sản phẩm khác nhau.",
    "re": "Phản ứng có thể diễn ra theo nhiều cơ chế khác nhau."
  },
  {
    "con": "Nếu một dung dịch có pH < 7 thì nó là dung dịch axit.",
    "re": "Dung dịch này có khả năng dẫn điện tốt hơn dung dịch trung tính."
  },
  {
    "con": "Nếu một nguyên tố thuộc nhóm VIIA trong bảng tuần hoàn thì nó là halogen.",
    "re": "Halogen có tính chất dễ dàng nhận electron để tạo thành ion âm."
  },
  {
    "con": "Nếu một hợp chất có liên kết ion thì nó thường có điểm nóng chảy cao.",
    "re": "Hợp chất này thường tan trong nước và dẫn điện khi hòa tan."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt thì nó giải phóng năng lượng.",
    "re": "Năng lượng giải phóng có thể được sử dụng để làm nóng môi trường xung quanh."
  },
  {
    "con": "Nếu một nguyên tố có cấu hình electron 1s^2 2s^2 2p^6 3s^2 3p^1 thì nó là nhôm.",
    "re": "Nhôm có khả năng tạo thành hợp chất với oxy để tạo ra oxit nhôm."
  },
  {
    "con": "Nếu một chất có khối lượng mol nhỏ hơn 18 g/mol thì nó có thể là khí ở nhiệt độ phòng.",
    "re": "Chất này có thể là oxy hoặc nitơ."
  },
  {
    "con": "Chọn phương án đúng. Nguyên tố X là kim loại, ở trạng thái oxi hóa dương cao nhất nó tạo được oxit có dạng X_2O_7. Trong nguyên tử X có 4 lớp electron. Xác định số thứ tự của X trong bảng hệ thống tuần hoàn:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nguyên tử của một nguyên tố có số proton bằng 6 và số neutron bằng 6:",
    "re": "Nguyên tố đó là Carbon"
  },
  {
    "con": "Khi một hợp chất ion được hình thành từ một kim loại và một phi kim, trong đó kim loại mất electron và phi kim nhận electron:",
    "re": "Hợp chất đó sẽ có tính chất điện ly trong nước"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao và áp suất cao:",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7:",
    "re": "Dung dịch đó sẽ trở thành axit"
  },
  {
    "con": "Nếu một nguyên tố có cấu hình electron là 1s² 2s² 2p⁶ 3s² 3p⁵:",
    "re": "Nguyên tố đó là Clo"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước và tạo ra dung dịch trong suốt:",
    "re": "Chất đó có thể là muối hoặc đường"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch và đạt đến trạng thái cân bằng:",
    "re": "Tốc độ phản ứng thuận và phản ứng nghịch sẽ bằng nhau"
  },
  {
    "con": "Khi một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng:",
    "re": "Chất đó sẽ tồn tại ở trạng thái khí trong điều kiện bình thường"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử là 8:",
    "re": "Nguyên tố đó là Oxy"
  },
  {
    "con": "Chọn phương án đúng: Ái lực electron của nguyên tố:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nguyên tử có số proton bằng số electron:",
    "re": "Nguyên tử đó là trung hòa điện"
  },
  {
    "con": "Chọn phương án đúng: Nước là hợp chất được hình thành từ:",
    "re": "Hai nguyên tử hydrogen và một nguyên tử oxygen"
  },
  {
    "con": "Nhiệt độ tăng lên trong phản ứng hóa học:",
    "re": "Thường làm tăng tốc độ phản ứng"
  },
  {
    "con": "Chọn phương án đúng: Đơn vị đo khối lượng nguyên tử là:",
    "re": "u (đơn vị nguyên tử)"
  },
  {
    "con": "Khi một nguyên tố mất electron:",
    "re": "Nó trở thành ion dương"
  },
  {
    "con": "Chọn phương án đúng: Phản ứng hóa học xảy ra khi:",
    "re": "Các liên kết hóa học bị phá vỡ và hình thành liên kết mới"
  },
  {
    "con": "Trong một phản ứng hóa học cân bằng:",
    "re": "Tốc độ phản ứng thuận và phản ứng nghịch bằng nhau"
  },
  {
    "con": "Chọn phương án đúng: Các nguyên tố trong cùng một nhóm của bảng tuần hoàn:",
    "re": "Có tính chất hóa học tương tự nhau"
  },
  {
    "con": "Khi pH của dung dịch giảm:",
    "re": "Dung dịch trở nên axit hơn"
  },
  {
    "con": "Chọn phương án sai:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất có cấu trúc phân tử ổn định:",
    "re": "Có thể tồn tại lâu dài trong tự nhiên"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học:",
    "re": "Thường làm tăng tốc độ phản ứng"
  },
  {
    "con": "Số nguyên tử trong một phân tử nước (H2O):",
    "re": "Là 3 (2 hydro và 1 oxy)"
  },
  {
    "con": "Chất điện ly trong dung dịch:",
    "re": "Tạo ra các ion tự do"
  },
  {
    "con": "Phản ứng hóa học xảy ra khi:",
    "re": "Có sự tái sắp xếp các nguyên tử"
  },
  {
    "con": "Khối lượng của một nguyên tử được đo bằng:",
    "re": "Đơn vị Dalton (u)"
  },
  {
    "con": "Khi pH của dung dịch giảm:",
    "re": "Nồng độ ion H+ tăng lên"
  },
  {
    "con": "Một hợp chất ion được hình thành từ:",
    "re": "Sự kết hợp giữa cation và anion"
  },
  {
    "con": "Khi một chất bị oxi hóa:",
    "re": "Nó mất electron"
  },
  {
    "con": "Chọn phương án sai:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất có cấu trúc phân tử ổn định:",
    "re": "Có thể tồn tại lâu dài trong tự nhiên"
  },
  {
    "con": "Nhiệt độ tăng lên:",
    "re": "Tốc độ phản ứng hóa học thường tăng"
  },
  {
    "con": "Một dung dịch có pH < 7:",
    "re": "Là dung dịch axit"
  },
  {
    "con": "Số nguyên tử trong một phân tử nước (H2O):",
    "re": "Là 3 (2 hydro và 1 oxy)"
  },
  {
    "con": "Khi một chất bị oxi hóa:",
    "re": "Nó mất electron"
  },
  {
    "con": "Sự hòa tan của muối trong nước:",
    "re": "Tạo ra ion trong dung dịch"
  },
  {
    "con": "Một phản ứng hóa học xảy ra:",
    "re": "Có sự thay đổi về năng lượng"
  },
  {
    "con": "Khối lượng của một nguyên tử carbon:",
    "re": "Khoảng 12 u (đơn vị khối lượng nguyên tử)"
  },
  {
    "con": "Khi nồng độ của một chất tăng:",
    "re": "Tốc độ phản ứng có thể tăng lên"
  },
  {
    "con": "Chọn phương án đúng: Orbital 5f có các số lượng tử n, ℓ và số electron tối đa lần lượt là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng thường tăng lên",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Một chất có độ pH dưới 7 thì chất đó được coi là axit",
    "re": "Chất đó có tính axit"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion thì chất đó được gọi là chất điện ly",
    "re": "Chất đó có khả năng điện ly"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao thì phản ứng sẽ có xu hướng chuyển dịch về phía có ít mol khí hơn",
    "re": "Phản ứng chuyển dịch về phía có ít mol khí"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng thì chất đó có khả năng quay vòng ánh sáng phân cực",
    "re": "Chất đó là quang hoạt"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên thì độ dẫn điện của dung dịch thường tăng theo",
    "re": "Độ dẫn điện tăng"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch thì có thể xảy ra cả hai chiều",
    "re": "Phản ứng có thể diễn ra theo cả hai chiều"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn nước thì chất đó sẽ bay hơi nhanh hơn nước ở cùng nhiệt độ",
    "re": "Chất đó bay hơi nhanh hơn"
  },
  {
    "con": "Khi một chất rắn tan trong dung môi thì quá trình này thường làm giảm nhiệt độ của dung dịch",
    "re": "Nhiệt độ dung dịch giảm"
  },
  {
    "con": "Chọn phương án đúng, cho biết số electron tối đa và số lượng tử chính n của các lớp lượng tử O và Q:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một nguyên tử mất electron, thì nguyên tử đó trở thành ion dương.",
    "re": "Nguyên tử trở thành ion dương"
  },
  {
    "con": "Nếu hai nguyên tố có số electron hóa trị giống nhau, thì chúng có thể có tính chất hóa học tương tự.",
    "re": "Tính chất hóa học tương tự"
  },
  {
    "con": "Khi nhiệt độ tăng, thì tốc độ phản ứng hóa học thường tăng lên.",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Nếu một hợp chất có liên kết ion, thì nó thường có điểm nóng chảy cao.",
    "re": "Điểm nóng chảy cao"
  },
  {
    "con": "Khi pH của dung dịch giảm, thì dung dịch trở nên axit hơn.",
    "re": "Dung dịch axit hơn"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín, thì khối lượng tổng thể của hệ thống không thay đổi.",
    "re": "Khối lượng tổng thể không thay đổi"
  },
  {
    "con": "Khi một chất hòa tan trong nước, thì nó có thể tạo ra ion trong dung dịch.",
    "re": "Tạo ra ion trong dung dịch"
  },
  {
    "con": "Nếu một nguyên tố có số lượng proton lớn hơn số lượng electron, thì nguyên tố đó mang điện tích dương.",
    "re": "Nguyên tố mang điện tích dương"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, thì năng lượng có thể được giải phóng hoặc hấp thụ.",
    "re": "Năng lượng được giải phóng hoặc hấp thụ"
  },
  {
    "con": "Chọn phương án đúng, nguyên tố A có cấu trúc electron phân lớp ngoài cùng là 4s^1.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một hợp chất có công thức hóa học là H2O.",
    "re": "Hợp chất đó là nước"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng.",
    "re": "Phản ứng xảy ra nhanh hơn"
  },
  {
    "con": "Một nguyên tố có số proton bằng 6.",
    "re": "Nguyên tố đó là carbon"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7.",
    "re": "Dung dịch đó trở nên axit"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion dương và ion âm.",
    "re": "Chất đó là chất điện ly"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm.",
    "re": "Đây là định luật bảo toàn khối lượng"
  },
  {
    "con": "Khi một nguyên tố có số electron bằng số proton.",
    "re": "Nguyên tố đó là trung hòa về điện"
  },
  {
    "con": "Khi một hợp chất có liên kết ion.",
    "re": "Hợp chất đó thường có điểm nóng chảy cao"
  },
  {
    "con": "Khi một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng.",
    "re": "Chất đó thường tồn tại ở trạng thái khí ở nhiệt độ phòng"
  },
  {
    "con": "Chọn phương án đúng: Khả năng tạo số liên kết cộng hóa trị cực đại của nguyên tố được quyết định bởi:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nguyên tử có số electron ở lớp ngoài cùng là 8 thì",
    "re": "Nguyên tử đó ổn định và ít có khả năng tham gia phản ứng hóa học"
  },
  {
    "con": "Chọn phương án đúng: Nhiệt độ tăng thì",
    "re": "Tốc độ phản ứng hóa học thường tăng lên"
  },
  {
    "con": "Chọn phương án đúng: Khi pH của dung dịch giảm thì",
    "re": "Dung dịch trở nên axit hơn"
  },
  {
    "con": "Chọn phương án đúng: Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có",
    "re": "Tính chất hóa học tương tự nhau"
  },
  {
    "con": "Chọn phương án đúng: Khi một phản ứng hóa học xảy ra, năng lượng thường",
    "re": "Được hấp thụ hoặc giải phóng"
  },
  {
    "con": "Chọn phương án đúng: Sự hòa tan của một chất rắn trong dung môi thường",
    "re": "Phụ thuộc vào nhiệt độ và áp suất"
  },
  {
    "con": "Chọn phương án đúng: Khi một chất bị oxi hóa thì",
    "re": "Chất đó mất electron"
  },
  {
    "con": "Chọn phương án đúng: Các ion dương và ion âm trong dung dịch sẽ",
    "re": "Tương tác với nhau để tạo thành các hợp chất mới"
  },
  {
    "con": "Chọn phương án đúng: Khi nồng độ của các phản ứng tăng thì",
    "re": "Tốc độ phản ứng hóa học cũng tăng lên"
  },
  {
    "con": "Chọn phương án đúng: _{26}Fe, _{27}Co và _{28}Ni thuộc phân nhóm VIIIB nên có:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch thì",
    "re": "phản ứng sẽ dịch chuyển theo hướng tỏa nhiệt"
  },
  {
    "con": "Một chất có điểm sôi thấp hơn điểm sôi của nước thì",
    "re": "chất đó sẽ bay hơi nhanh hơn khi ở nhiệt độ phòng"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên thì",
    "re": "tốc độ phản ứng hóa học sẽ tăng lên"
  },
  {
    "con": "Nếu một nguyên tố có số oxi hóa cao nhất là +7 thì",
    "re": "nguyên tố đó có khả năng oxy hóa mạnh"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7 thì",
    "re": "dung dịch đó trở thành axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao thì",
    "re": "phản ứng sẽ có xu hướng tạo ra ít phân tử hơn"
  },
  {
    "con": "Khi một chất điện ly hoàn toàn trong nước thì",
    "re": "chất đó sẽ tạo ra các ion tự do trong dung dịch"
  },
  {
    "con": "Nếu một hợp chất có liên kết ion thì",
    "re": "hợp chất đó sẽ có điểm nóng chảy cao"
  },
  {
    "con": "Khi nhiệt độ giảm xuống trong một phản ứng hóa học tỏa nhiệt thì",
    "re": "phản ứng sẽ dịch chuyển theo hướng sinh nhiệt"
  },
  {
    "con": "Chọn phương án đúng: Các orbital lai hóa sp có đặc điểm:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học H2O và là dung môi phổ biến nhất:",
    "re": "Nước có khả năng hòa tan nhiều chất"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có cùng số electron hóa trị:",
    "re": "Chúng có tính chất hóa học tương tự nhau"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng lên:",
    "re": "Do các phân tử có năng lượng cao hơn và va chạm nhiều hơn"
  },
  {
    "con": "Khi một chất tan trong nước, nó sẽ phân ly thành ion:",
    "re": "Chất đó được gọi là chất điện ly"
  },
  {
    "con": "Phản ứng hóa học có thể được biểu diễn bằng phương trình hóa học:",
    "re": "Phương trình này thể hiện mối quan hệ giữa các chất phản ứng và sản phẩm"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7:",
    "re": "Dung dịch đó trở nên axit"
  },
  {
    "con": "Trong phản ứng oxi hóa khử, một chất bị oxi hóa sẽ mất electron:",
    "re": "Chất đó sẽ tăng số oxi hóa"
  },
  {
    "con": "Các nguyên tử có cùng số proton nhưng khác số neutron được gọi là đồng vị:",
    "re": "Chúng có tính chất hóa học tương tự nhau nhưng khối lượng khác nhau"
  },
  {
    "con": "Khi một chất rắn hòa tan trong dung môi, nó sẽ tạo thành dung dịch đồng nhất:",
    "re": "Chất rắn đó được gọi là chất tan"
  },
  {
    "con": "Chọn phương án đúng: Liên kết ion có các đặc trưng cơ bản khác với liên kết cộng hóa trị là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Có mặt của nguyên tử carbon trong phân tử thì phân tử đó có thể là hữu cơ.",
    "re": "Phân tử đó thuộc nhóm hợp chất hữu cơ."
  },
  {
    "con": "Nhiệt độ tăng lên thì tốc độ phản ứng hóa học thường tăng.",
    "re": "Phản ứng xảy ra nhanh hơn."
  },
  {
    "con": "Có mặt của chất xúc tác trong phản ứng hóa học thì năng lượng kích hoạt cần thiết sẽ giảm.",
    "re": "Phản ứng sẽ diễn ra nhanh hơn mà không làm thay đổi sản phẩm."
  },
  {
    "con": "Số nguyên tử trong một phân tử nước (H2O) là 3 thì tổng số nguyên tố có trong phân tử đó là 2.",
    "re": "Phân tử nước bao gồm 2 nguyên tố là hydro và oxy."
  },
  {
    "con": "Khi pH của dung dịch giảm thì nồng độ ion H+ trong dung dịch tăng.",
    "re": "Dung dịch trở nên axit hơn."
  },
  {
    "con": "Khi một chất hòa tan trong nước thì nó sẽ tạo ra dung dịch.",
    "re": "Dung dịch này có thể dẫn điện nếu chất hòa tan là ion."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yên tĩnh thì sản phẩm phản ứng có thể khác so với khi có sự khuấy trộn.",
    "re": "Điều kiện phản ứng ảnh hưởng đến sản phẩm cuối cùng."
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn nước thì chất đó sẽ bay hơi nhanh hơn khi ở nhiệt độ phòng.",
    "re": "Chất đó dễ bay hơi."
  },
  {
    "con": "Khi một chất bị oxi hóa thì nó sẽ mất electron.",
    "re": "Chất đó trở thành chất oxi hóa."
  },
  {
    "con": "Chọn phương án đúng: Xét các hợp chất dạng H_2X của các nguyên tố phân nhóm VIA: O, S, Se, Te.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch.",
    "re": "Phản ứng sẽ dịch chuyển theo hướng tạo ra nhiều sản phẩm hơn."
  },
  {
    "con": "Sử dụng chất xúc tác trong một phản ứng hóa học.",
    "re": "Tốc độ phản ứng sẽ tăng lên mà không làm thay đổi trạng thái cân bằng."
  },
  {
    "con": "Tăng nồng độ của một chất trong phản ứng hóa học.",
    "re": "Tốc độ phản ứng sẽ tăng lên do có nhiều phân tử va chạm hơn."
  },
  {
    "con": "Giảm thể tích của một hệ thống phản ứng khí.",
    "re": "Áp suất trong hệ thống sẽ tăng lên, làm dịch chuyển cân bằng về phía có ít phân tử khí hơn."
  },
  {
    "con": "Thêm nhiệt vào một phản ứng hóa học tỏa nhiệt.",
    "re": "Cân bằng phản ứng sẽ dịch chuyển về phía phản ứng nghịch."
  },
  {
    "con": "Chọn một dung môi có độ phân cực cao cho phản ứng ion.",
    "re": "Phản ứng sẽ diễn ra nhanh hơn do sự hòa tan tốt hơn của các ion."
  },
  {
    "con": "Sử dụng pH thấp trong phản ứng axit-bazơ.",
    "re": "Phản ứng sẽ có xu hướng tạo ra nhiều sản phẩm bazơ hơn."
  },
  {
    "con": "Thay đổi nhiệt độ trong phản ứng hóa học không thuận nghịch.",
    "re": "Nhiệt độ sẽ ảnh hưởng đến tốc độ phản ứng nhưng không làm thay đổi vị trí cân bằng."
  },
  {
    "con": "Thêm một chất ức chế vào phản ứng hóa học.",
    "re": "Tốc độ phản ứng sẽ giảm xuống do sự cản trở của chất ức chế."
  },
  {
    "con": "Chọn phương án đúng: Cho: _3Li, _4Be, _5B, _6C, _7N, _8O, _9F, _{12}Mg, _{17}Cl, _{20}Ca, _{23}V, _{35}Br, _{53}I. Các dãy sắp xếp theo tính cộng hóa trị giảm dần là:\n1) BeCl_2 , MgCl_2 , CaCl_2\n2) V_2O_5 , VO_2 , V_2O_3 , VO\n3) Li_2O , B_2O_3 ,CO_2 ,N_2O_5\n4) BF_3, BCl_3, BBr_3, BI_3",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có cùng số electron ở lớp ngoài cùng",
    "re": "Chúng có tính chất hóa học tương tự nhau"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thường làm tăng tốc độ phản ứng",
    "re": "Phản ứng xảy ra nhanh hơn"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion, nó được gọi là chất điện ly",
    "re": "Chất đó có khả năng dẫn điện"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao",
    "re": "Phản ứng sẽ có xu hướng chuyển dịch về phía có ít phân tử khí hơn"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7",
    "re": "Dung dịch đó trở nên axit"
  },
  {
    "con": "Nếu một chất có độ âm điện cao",
    "re": "Chất đó có khả năng thu hút electron mạnh mẽ"
  },
  {
    "con": "Khi một nguyên tố có số oxi hóa dương",
    "re": "Nguyên tố đó có khả năng mất electron"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch",
    "re": "Phản ứng có thể diễn ra theo cả hai chiều"
  },
  {
    "con": "Khi một dung dịch bão hòa được làm nguội",
    "re": "Có thể xảy ra hiện tượng kết tinh"
  }
]