[
  {
    "con": "Năng lượng tối thiểu của một vi hạt chuyển động trong hố thế sâu vô hạn một chiều có bề rộng a là 10 ev. Hãy xác định những vị trí tại đó dễ tìm thấy hạt nhất khi hạt ở trạng thái có năng lượng 90 ev:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật thể chịu tác dụng của lực không đổi trong một khoảng thời gian nhất định,",
    "re": "thì vận tốc của vật thể sẽ thay đổi theo thời gian."
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v,",
    "re": "thì động năng của vật đó được tính bằng công thức 1/2 mv^2."
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h,",
    "re": "thì thời gian rơi của vật phụ thuộc vào độ cao và gia tốc trọng trường."
  },
  {
    "con": "Nếu một sóng âm có tần số f và vận tốc v,",
    "re": "thì bước sóng λ của sóng âm được tính bằng công thức λ = v/f."
  },
  {
    "con": "Nếu một điện tích q đặt trong một điện trường E,",
    "re": "thì lực tác dụng lên điện tích đó được tính bằng công thức F = qE."
  },
  {
    "con": "Nếu một vật thể quay quanh trục với vận tốc góc ω,",
    "re": "thì gia tốc hướng tâm của vật thể được tính bằng công thức a = ω^2r."
  },
  {
    "con": "Nếu một chất rắn được nung nóng,",
    "re": "thì thể tích của chất đó sẽ tăng lên do sự giãn nở nhiệt."
  },
  {
    "con": "Nếu một dòng điện I chạy qua một dây dẫn có điện trở R,",
    "re": "thì công suất tiêu thụ điện được tính bằng công thức P = I^2R."
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển theo quỹ đạo tròn với bán kính r,",
    "re": "thì lực hướng tâm cần thiết để giữ vật trên quỹ đạo được tính bằng công thức F = mv^2/r."
  },
  {
    "con": "Một vi hạt chuyển động trong giếng thế một chiều, có năng lượng bằng 16eV ở trạng thái n = 3. Năng lượng ứng với trạng thái n = 4 bằng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h, thì vận tốc của vật khi chạm đất sẽ bằng:",
    "re": "v = √(2gh)"
  },
  {
    "con": "Nếu một lực F tác dụng lên một vật có khối lượng m, thì gia tốc a của vật sẽ được tính bằng:",
    "re": "a = F/m"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí, nếu tần số f tăng lên, thì bước sóng λ sẽ:",
    "re": "giảm xuống"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động năng K của vật sẽ được tính bằng:",
    "re": "K = 1/2 mv²"
  },
  {
    "con": "Khi một vật chịu tác dụng của lực đàn hồi, nếu độ biến dạng x tăng lên, thì lực đàn hồi F sẽ:",
    "re": "tăng lên theo định luật Hooke: F = -kx"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một trường điện E, thì công W thực hiện bởi trường điện sẽ được tính bằng:",
    "re": "W = qEd"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác, nếu chỉ số khúc xạ n tăng lên, thì tốc độ ánh sáng v trong môi trường đó sẽ:",
    "re": "giảm xuống"
  },
  {
    "con": "Nếu một vật quay quanh một trục với bán kính r và có vận tốc góc ω, thì gia tốc hướng tâm a sẽ được tính bằng:",
    "re": "a = ω²r"
  },
  {
    "con": "Khi một sóng điện từ truyền trong chân không, nếu tần số f của sóng tăng lên, thì năng lượng E của photon sẽ:",
    "re": "tăng lên theo công thức E = hf"
  },
  {
    "con": "Cho biết giới hạn quang điện của đồng là 0,3\\mum. Hiện tượng quang điện sẽ không xảy ra khi chiếu vào mặt một tấm đồng chùm sáng đơn sắc có bước sóng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m và được thả rơi tự do từ độ cao h. Vật sẽ đạt vận tốc tối đa khi chạm đất.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một lực F tác dụng lên một vật có khối lượng m, thì vật sẽ có gia tốc a được tính theo công thức a = F/m.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính r và vận tốc v, thì lực hướng tâm tác dụng lên vật sẽ được tính bằng công thức F = mv^2/r.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sóng âm có tần số f và tốc độ truyền sóng v, thì bước sóng λ sẽ được tính bằng công thức λ = v/f.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật chịu tác dụng của hai lực cân bằng, thì vật sẽ không có gia tốc và sẽ đứng yên hoặc chuyển động thẳng đều.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật được ném lên với vận tốc ban đầu v0 và góc ném θ, thì độ cao cực đại mà vật đạt được sẽ được tính bằng công thức h = (v0^2 * sin^2(θ)) / (2g).",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau, thì hiện tượng khúc xạ sẽ xảy ra.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có năng lượng động năng K và khối lượng m, thì vận tốc của vật sẽ được tính bằng công thức v = sqrt(2K/m).",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một điện tích q di chuyển trong một từ trường B với vận tốc v, thì lực Lorentz tác dụng lên điện tích sẽ được tính bằng công thức F = q(v x B).",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cho biết giới hạn quang điện của đồng là 0,3μm. Hiện tượng quang điện sẽ xảy ra khi chiếu vào mặt một tấm đồng chùm sáng đơn sắc có bước sóng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m và được thả rơi tự do từ độ cao h. Vận tốc của vật khi chạm đất sẽ phụ thuộc vào",
    "re": "chiều cao h và gia tốc trọng trường g"
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m, nếu lực này không thay đổi, thì gia tốc a của vật sẽ",
    "re": "tỉ lệ thuận với lực F và tỉ lệ nghịch với khối lượng m"
  },
  {
    "con": "Nếu một sóng âm có tần số f và tốc độ v, thì bước sóng λ của sóng âm sẽ được tính bằng công thức",
    "re": "λ = v / f"
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính r và vận tốc v, thì gia tốc hướng tâm a sẽ được tính bằng",
    "re": "a = v^2 / r"
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cân bằng, thì vật đó sẽ",
    "re": "không thay đổi trạng thái chuyển động"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác, nếu tốc độ ánh sáng trong môi trường đầu tiên là v1 và trong môi trường thứ hai là v2, thì hiện tượng khúc xạ sẽ xảy ra khi",
    "re": "tốc độ ánh sáng thay đổi"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một trường điện đều E, thì công W thực hiện bởi lực điện sẽ được tính bằng",
    "re": "W = qEd"
  },
  {
    "con": "Khi một vật dao động điều hòa với tần số f, thì chu kỳ T của dao động sẽ được tính bằng",
    "re": "T = 1 / f"
  },
  {
    "con": "Nếu một vật có năng lượng động năng K và khối lượng m, thì vận tốc v của vật sẽ được tính bằng",
    "re": "v = √(2K/m)"
  },
  {
    "con": "Xác định giới hạn quang điện của kali biết công thoát của quang electron ra khỏi kali là 2,15eV",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Áp dụng định luật Newton thứ nhất cho một vật thể không chịu lực tác động",
    "re": "Vật thể sẽ giữ nguyên trạng thái chuyển động của nó"
  },
  {
    "con": "Sử dụng công thức F = ma để tính lực tác dụng lên một vật có khối lượng 5kg và gia tốc 2m/s²",
    "re": "Lực tác dụng là 10N"
  },
  {
    "con": "Đo chiều dài của một vật bằng thước kẻ có độ chia nhỏ nhất là 1mm",
    "re": "Kết quả đo cần được ghi chính xác đến 1mm"
  },
  {
    "con": "Xác định công của một lực tác dụng lên một vật di chuyển theo phương của lực",
    "re": "Công được tính bằng tích của lực và quãng đường di chuyển"
  },
  {
    "con": "Sử dụng định luật bảo toàn năng lượng trong một hệ kín",
    "re": "Tổng năng lượng trong hệ sẽ không thay đổi theo thời gian"
  },
  {
    "con": "Tính toán áp suất trong một chất lỏng ở độ sâu 10m với mật độ 1000kg/m³",
    "re": "Áp suất là 100kPa"
  },
  {
    "con": "Xác định tần số của sóng âm có bước sóng 0,5m trong không khí với tốc độ âm thanh là 340m/s",
    "re": "Tần số là 680Hz"
  },
  {
    "con": "Sử dụng định luật Hooke để tính độ biến dạng của lò xo với độ cứng 200N/m khi chịu lực 100N",
    "re": "Độ biến dạng là 0,5m"
  },
  {
    "con": "Phân tích chuyển động của một vật rơi tự do trong môi trường không có sức cản",
    "re": "Vật sẽ gia tốc đều với gia tốc 9,81m/s²"
  },
  {
    "con": "Xác định giới hạn quang điện của kim loại Potassium, biết công thoát của quang electron ra khỏi potassium là 2eV.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2 kg và được tác dụng một lực 10 N trong 5 giây.",
    "re": "Vật sẽ có vận tốc 25 m/s"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20 m.",
    "re": "Thời gian rơi sẽ khoảng 2,02 giây"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz và tốc độ truyền sóng là 340 m/s.",
    "re": "Chiều dài sóng sẽ là 0,773 m"
  },
  {
    "con": "Một điện trở có giá trị 10 ohm và dòng điện chạy qua là 2 A.",
    "re": "Điện áp trên điện trở sẽ là 20 V"
  },
  {
    "con": "Một vật có khối lượng 5 kg di chuyển với vận tốc 10 m/s.",
    "re": "Động năng của vật sẽ là 250 J"
  },
  {
    "con": "Một lò xo có độ cứng 200 N/m bị nén 0,1 m.",
    "re": "Năng lượng tiềm năng trong lò xo sẽ là 1 J"
  },
  {
    "con": "Một vật có khối lượng 1 kg và được nâng lên cao 10 m.",
    "re": "Năng lượng thế của vật sẽ là 98 J"
  },
  {
    "con": "Một quả cầu lăn trên mặt phẳng nghiêng với góc 30 độ.",
    "re": "Quả cầu sẽ có gia tốc 4,9 m/s²"
  },
  {
    "con": "Một điện tích điểm 5 μC đặt trong điện trường có cường độ 2000 N/C.",
    "re": "Lực tác dụng lên điện tích sẽ là 10 N"
  },
  {
    "con": "Công thoát A của electron đối với kim loại Cs trong hiện tượng quang điện là 1,9eV. Xác định bước sóng giới hạn độ quang điện của Cs",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m và được thả rơi tự do từ độ cao h. Tính vận tốc của vật khi chạm đất",
    "re": "Vận tốc của vật là v = √(2gh)"
  },
  {
    "con": "Một lực F tác dụng lên một vật có khối lượng m. Nếu lực F không đổi và hướng tác dụng không thay đổi, thì gia tốc a của vật sẽ là",
    "re": "a = F/m"
  },
  {
    "con": "Một sóng âm có tần số f và tốc độ v. Nếu tốc độ sóng không đổi, thì bước sóng λ sẽ là",
    "re": "λ = v/f"
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính r và vận tốc góc ω. Nếu vận tốc góc tăng, thì lực hướng tâm F sẽ",
    "re": "F = mω²r"
  },
  {
    "con": "Một điện tích q đặt trong điện trường E. Nếu điện trường E tăng lên, thì lực tác dụng lên điện tích q sẽ",
    "re": "F = qE"
  },
  {
    "con": "Một vật có khối lượng m rơi tự do trong không khí. Nếu khối lượng m tăng lên, thì lực cản không khí sẽ",
    "re": "Tăng lên nhưng không tỉ lệ thuận với khối lượng"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo dài một khoảng x. Nếu độ cứng k tăng, thì lực phục hồi F sẽ",
    "re": "F = -kx, và sẽ lớn hơn"
  },
  {
    "con": "Một mạch điện có điện trở R và hiệu điện thế U. Nếu điện trở R giảm, thì dòng điện I trong mạch sẽ",
    "re": "Tăng lên theo định luật Ohm I = U/R"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Nếu vận tốc v tăng gấp đôi, thì động năng K của vật sẽ",
    "re": "Tăng gấp bốn lần, K = 1/2 mv²"
  },
  {
    "con": "Ban đầu có N0 hạt nhân của mẫu chất phóng xạ nguyên chất có chu kỳ bán rã T. Sau khoảng thời gian t= 3T, số hạt nhân chưa bị phân rã của mẫu chất phóng xạ là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v. Sau khoảng thời gian t, quãng đường mà vật đi được là",
    "re": "s = v * t"
  },
  {
    "con": "Một lực F tác dụng lên một vật có khối lượng m. Gia tốc a của vật sẽ được tính bằng",
    "re": "a = F / m"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Thời gian rơi t sẽ được tính bằng",
    "re": "t = √(2h/g) với g là gia tốc trọng trường"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí, tần số f của sóng sẽ không thay đổi khi",
    "re": "sóng truyền qua các môi trường khác nhau"
  },
  {
    "con": "Một điện tích q đặt trong điện trường E sẽ chịu lực F được tính bằng",
    "re": "F = q * E"
  },
  {
    "con": "Khi một vật dao động điều hòa với biên độ A và tần số f, năng lượng cơ học của vật sẽ được tính bằng",
    "re": "E = (1/2) * k * A^2 với k là hệ số đàn hồi"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, góc khúc xạ θ2 sẽ được tính bằng",
    "re": "n1 * sin(θ1) = n2 * sin(θ2) với n1 và n2 là chỉ số khúc xạ của không khí và nước"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v va chạm hoàn toàn đàn hồi với một vật khác có khối lượng M. Vận tốc sau va chạm của vật m sẽ được tính bằng",
    "re": "v' = (m - M)/(m + M) * v"
  },
  {
    "con": "Khi một điện trở R được nối với một nguồn điện có hiệu điện thế U, dòng điện I chạy qua điện trở sẽ được tính bằng",
    "re": "I = U / R"
  },
  {
    "con": "Bản chất của tia phóng xạ \\alpha là gì.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi.",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt.",
    "re": "Năng lượng tổng luôn được bảo toàn"
  },
  {
    "con": "Một vật rơi tự do trong trường hấp dẫn.",
    "re": "Vật sẽ có gia tốc không đổi hướng xuống dưới"
  },
  {
    "con": "Ánh sáng đi qua một môi trường khác nhau.",
    "re": "Ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Một vật có khối lượng lớn hơn sẽ có trọng lực lớn hơn.",
    "re": "Lực hấp dẫn giữa hai vật tỷ lệ thuận với khối lượng của chúng"
  },
  {
    "con": "Một sóng âm truyền qua không khí.",
    "re": "Sóng âm sẽ có tốc độ phụ thuộc vào nhiệt độ không khí"
  },
  {
    "con": "Một điện tích dương và một điện tích âm gần nhau.",
    "re": "Chúng sẽ hút nhau"
  },
  {
    "con": "Một vật có nhiệt độ cao hơn sẽ truyền nhiệt cho vật có nhiệt độ thấp hơn.",
    "re": "Nhiệt sẽ luôn di chuyển từ nơi có nhiệt độ cao sang nơi có nhiệt độ thấp"
  },
  {
    "con": "Một lò xo bị nén hoặc kéo.",
    "re": "Lực phục hồi sẽ tỷ lệ thuận với độ biến dạng của lò xo"
  },
  {
    "con": "Bản chất của tia phóng xạ \\gamma là gì.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì vận tốc của nó không thay đổi.",
    "re": "Vật đó di chuyển với tốc độ không đổi"
  },
  {
    "con": "Lực tác dụng lên một vật thì vật đó sẽ có gia tốc.",
    "re": "Gia tốc tỷ lệ thuận với lực và tỷ lệ nghịch với khối lượng"
  },
  {
    "con": "Năng lượng không thể tự sinh ra hoặc mất đi.",
    "re": "Năng lượng chỉ có thể chuyển đổi từ dạng này sang dạng khác"
  },
  {
    "con": "Một vật rơi tự do trong trường hấp dẫn thì gia tốc của nó là hằng số.",
    "re": "Gia tốc này bằng gia tốc trọng trường"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác thì nó sẽ bị khúc xạ.",
    "re": "Góc khúc xạ phụ thuộc vào chỉ số khúc xạ của hai môi trường"
  },
  {
    "con": "Nếu một vật có khối lượng lớn thì lực hấp dẫn mà nó tạo ra cũng lớn.",
    "re": "Lực hấp dẫn tỷ lệ thuận với khối lượng của vật"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên thì năng lượng động học của các phân tử trong vật đó cũng tăng.",
    "re": "Điều này dẫn đến sự gia tăng nhiệt độ của vật"
  },
  {
    "con": "Nếu một sóng âm có tần số cao thì âm thanh sẽ có cao độ cao.",
    "re": "Tần số và cao độ có mối quan hệ tỷ lệ thuận"
  },
  {
    "con": "Khi một vật quay quanh một trục thì nó sẽ có động năng quay.",
    "re": "Động năng quay phụ thuộc vào khối lượng và tốc độ góc của vật"
  },
  {
    "con": "Trong các tia phóng xạ thì tia nào có khả năng ion hóa mạnh nhất",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì quỹ đạo của nó là một đường thẳng",
    "re": "Vận tốc của vật là không đổi"
  },
  {
    "con": "Khi một lực tác dụng lên một vật thì vật sẽ có gia tốc",
    "re": "Gia tốc tỷ lệ thuận với lực và nghịch đảo với khối lượng"
  },
  {
    "con": "Trong một hệ kín, tổng năng lượng được bảo toàn",
    "re": "Năng lượng không thể tự sinh ra hoặc mất đi"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên thì động năng trung bình của các phân tử trong vật cũng tăng",
    "re": "Vật sẽ có xu hướng mở rộng"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác thì nó sẽ bị khúc xạ",
    "re": "Góc khúc xạ phụ thuộc vào chỉ số khúc xạ của hai môi trường"
  },
  {
    "con": "Khi một vật chịu tác dụng của hai lực cân bằng thì vật sẽ không chuyển động",
    "re": "Vật sẽ giữ nguyên trạng thái chuyển động của nó"
  },
  {
    "con": "Trong một mạch điện, nếu điện trở tăng thì cường độ dòng điện giảm",
    "re": "Điện áp không đổi"
  },
  {
    "con": "Khi một sóng âm đi vào một môi trường dày đặc hơn thì tốc độ của sóng sẽ giảm",
    "re": "Tần số của sóng không thay đổi"
  },
  {
    "con": "Khi một vật rơi tự do thì gia tốc của nó là gia tốc trọng trường",
    "re": "Gia tốc này có giá trị khoảng 9.81 m/s² trên bề mặt Trái Đất"
  },
  {
    "con": "Trong các tia phóng xạ thì tia nào có khả năng xuyên thấu mạnh nhất.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật chuyển động với vận tốc không đổi thì lực tác dụng lên vật đó là.",
    "re": "Bằng 0"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên thì năng lượng động học của các phân tử trong vật đó.",
    "re": "Tăng lên"
  },
  {
    "con": "Khi một vật rơi tự do thì gia tốc của nó là.",
    "re": "Gia tốc trọng trường"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác thì hiện tượng xảy ra là.",
    "re": "Khúc xạ ánh sáng"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn thì dây dẫn đó sẽ.",
    "re": "Tỏa nhiệt"
  },
  {
    "con": "Khi một vật chịu tác dụng của lực kéo dài thì vật đó sẽ.",
    "re": "Biến dạng"
  },
  {
    "con": "Khi một sóng âm đi qua không khí thì nó sẽ.",
    "re": "Truyền đi dưới dạng dao động của các phân tử không khí"
  },
  {
    "con": "Khi một vật có khối lượng lớn hơn vật khác thì lực hấp dẫn giữa chúng.",
    "re": "Lớn hơn"
  },
  {
    "con": "Khi một vật quay quanh một trục thì lực hướng tâm tác dụng lên vật đó.",
    "re": "Giữ cho vật chuyển động theo quỹ đạo"
  },
  {
    "con": "Một bếp điện hoạt động ở lưới điện có tần số f = 50Hz. Người ta mắc nối tiếp một cuộn dây thuần cảm với một bếp điện, kết quả là làm cho công suất của bếp giảm đi và còn lại một nửa công suất ban đầu. Tính độ tự cảm của cuộn dây nếu điện trở của bếp là R = 20Ω",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Nếu không có lực cản của không khí, thì vận tốc của vật khi chạm đất sẽ phụ thuộc vào độ cao h.",
    "re": "Vận tốc của vật sẽ tăng theo căn bậc hai của độ cao h."
  },
  {
    "con": "Một lò xo có độ cứng k được nén lại một khoảng x. Nếu lực tác dụng lên lò xo lớn hơn độ cứng k, thì lò xo sẽ bị biến dạng vĩnh viễn.",
    "re": "Lò xo sẽ không trở về trạng thái ban đầu."
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Nếu lực tác dụng lên vật là F, thì gia tốc a của vật sẽ được tính theo định luật Newton thứ hai.",
    "re": "Gia tốc a sẽ bằng F/m."
  },
  {
    "con": "Một sóng âm truyền trong không khí với tốc độ v. Nếu tần số f của sóng âm tăng lên, thì bước sóng λ sẽ giảm.",
    "re": "Bước sóng λ sẽ tỉ lệ nghịch với tần số f."
  },
  {
    "con": "Một điện trở R được mắc vào nguồn điện có hiệu điện thế U. Nếu điện trở R tăng lên, thì dòng điện I chạy qua điện trở sẽ giảm.",
    "re": "Dòng điện I sẽ tỉ lệ nghịch với điện trở R."
  },
  {
    "con": "Một vật có khối lượng m được treo vào một lò xo. Nếu lò xo bị kéo dài một khoảng x, thì lực đàn hồi F của lò xo sẽ tỉ lệ thuận với độ dài x.",
    "re": "Lực đàn hồi F sẽ bằng kx, với k là độ cứng của lò xo."
  },
  {
    "con": "Một chất lỏng có mật độ d được đổ vào một bình chứa. Nếu chiều cao h của chất lỏng tăng lên, thì áp suất P tại đáy bình sẽ tăng.",
    "re": "Áp suất P sẽ tỉ lệ thuận với chiều cao h."
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính r. Nếu vận tốc v của vật tăng lên, thì gia tốc hướng tâm a sẽ tăng.",
    "re": "Gia tốc hướng tâm a sẽ tỉ lệ với bình phương vận tốc v."
  },
  {
    "con": "Một điện tích q đặt trong điện trường E. Nếu điện trường E tăng lên, thì lực F tác dụng lên điện tích q sẽ tăng.",
    "re": "Lực F sẽ bằng qE."
  },
  {
    "con": "Một mạch dao động điện từ LC, gồm cuộn dây có lõi sắt từ, ban đầu tụ điện được tích một lượng điện tích Q nào đó, rồi cho dao động tự do. Dao động của dòng điện trong mạch là dao động tắt dần vì",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h, không chịu tác động của lực cản không khí. Vận tốc của vật sau thời gian t sẽ tăng theo công thức v = gt",
    "re": "vận tốc của vật sẽ tăng theo thời gian"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Động năng của vật được tính bằng công thức Ek = 1/2 mv^2",
    "re": "động năng của vật sẽ tăng khi vận tốc tăng"
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m, nếu lực này không thay đổi, gia tốc a của vật sẽ được tính bằng công thức a = F/m",
    "re": "gia tốc của vật sẽ tỷ lệ thuận với lực tác dụng và tỷ lệ nghịch với khối lượng"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau, góc khúc xạ sẽ thay đổi theo định luật Snell",
    "re": "góc khúc xạ sẽ phụ thuộc vào chỉ số khúc xạ của hai môi trường"
  },
  {
    "con": "Một sóng âm truyền trong không khí với tốc độ v. Nếu tần số f của sóng âm tăng, bước sóng λ sẽ giảm theo công thức λ = v/f",
    "re": "bước sóng sẽ giảm khi tần số tăng"
  },
  {
    "con": "Khi một vật quay quanh một trục với vận tốc góc ω, lực hướng tâm F sẽ được tính bằng công thức F = mω²r",
    "re": "lực hướng tâm sẽ tăng khi vận tốc góc hoặc bán kính tăng"
  },
  {
    "con": "Khi một vật bị kéo dài bởi một lực, độ biến dạng của vật sẽ tỷ lệ thuận với lực tác dụng theo định luật Hooke",
    "re": "độ biến dạng sẽ tỷ lệ thuận với lực tác dụng"
  },
  {
    "con": "Khi một điện tích q di chuyển trong một trường điện E, công thực hiện bởi trường điện sẽ được tính bằng W = qEd",
    "re": "công thực hiện sẽ tỷ lệ thuận với điện tích và khoảng cách di chuyển"
  },
  {
    "con": "Khi một vật có khối lượng m di chuyển với vận tốc v, lực quán tính của vật sẽ được tính bằng công thức F = ma",
    "re": "lực quán tính sẽ tỷ lệ thuận với khối lượng và gia tốc"
  },
  {
    "con": "Vật chịu tác động của lực không cân bằng",
    "re": "Vật sẽ thay đổi vận tốc của nó"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt",
    "re": "Năng lượng tổng luôn được bảo toàn trong một hệ kín"
  },
  {
    "con": "Một vật chuyển động theo quỹ đạo tròn",
    "re": "Vật đó sẽ có gia tốc hướng vào tâm quỹ đạo"
  },
  {
    "con": "Nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nội tại của vật đó cũng sẽ tăng lên"
  },
  {
    "con": "Một sóng âm truyền qua không khí",
    "re": "Sóng âm sẽ di chuyển với tốc độ phụ thuộc vào nhiệt độ không khí"
  },
  {
    "con": "Một vật có khối lượng lớn hơn vật khác",
    "re": "Vật có khối lượng lớn hơn sẽ có trọng lực tác động mạnh hơn"
  },
  {
    "con": "Một điện tích dương và một điện tích âm gần nhau",
    "re": "Chúng sẽ hút nhau"
  },
  {
    "con": "Một vật rơi tự do trong chân không",
    "re": "Vật sẽ rơi với gia tốc không đổi là 9.81 m/s²"
  },
  {
    "con": "Một lò xo bị nén hoặc kéo",
    "re": "Lực phục hồi của lò xo sẽ tỷ lệ thuận với độ biến dạng của nó"
  },
  {
    "con": "Một vật có vận tốc không đổi",
    "re": "Lực tác động lên vật đó bằng 0"
  },
  {
    "con": "Phát biểu nào sau đây đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật M treo vào một lò xo làm lò xo giãn 10 cm. Nếu lực đàn hồi tác dụng lên vật là 1 N, tính độ cứng của lò xo.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chuyển động thẳng đều với vận tốc không đổi, thì gia tốc của vật bằng 0.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một lực F tác dụng lên một vật có khối lượng m, thì gia tốc a của vật được tính bằng công thức a = F/m.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, thì vận tốc của vật khi chạm đất được tính bằng công thức v = √(2gh).",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động năng của vật được tính bằng công thức E_k = 1/2 mv^2.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cùng phương và cùng chiều, thì tổng hợp lực là tổng của hai lực đó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật quay quanh một trục với vận tốc góc ω, thì tần số f của chuyển động quay được tính bằng f = ω/(2π).",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sóng có bước sóng λ và tần số f, thì vận tốc của sóng được tính bằng công thức v = λf.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một trường điện với cường độ điện trường E, thì lực tác dụng lên điện tích được tính bằng công thức F = qE.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng m và được nâng lên cao h trong trường trọng lực, thì công thực hiện để nâng vật được tính bằng W = mgh.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Kết luận nào sau đây không đúng? Đối với mỗi chất điểm dao động cơ điều hòa với tần số f thì",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chịu tác dụng của lực không đổi thì",
    "re": "vật sẽ có gia tốc không đổi"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v thì",
    "re": "động năng của vật là 1/2 mv^2"
  },
  {
    "con": "Khi một vật rơi tự do thì",
    "re": "vật sẽ chịu tác dụng của trọng lực và có gia tốc g"
  },
  {
    "con": "Nếu một sóng âm có tần số f thì",
    "re": "bước sóng của nó sẽ tỉ lệ nghịch với tần số"
  },
  {
    "con": "Khi một vật dao động điều hòa thì",
    "re": "vật sẽ có biên độ và tần số xác định"
  },
  {
    "con": "Nếu một vật chuyển động tròn đều thì",
    "re": "vật sẽ có vận tốc góc không đổi"
  },
  {
    "con": "Khi một lực tác dụng lên một vật thì",
    "re": "vật sẽ có gia tốc tỉ lệ thuận với lực và tỉ lệ nghịch với khối lượng"
  },
  {
    "con": "Nếu một chất điểm có vận tốc ban đầu v0 và chịu lực cản thì",
    "re": "vận tốc của chất điểm sẽ giảm theo thời gian"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác thì",
    "re": "ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Một vật dao động điều hòa quanh điểm y = 0 với tần số 1Hz. vào lúc t = 0, vật được kéo khỏi vị trí cân bằng đến vị trí y = -2m, và thả ra không vận tốc ban đầu. Tìm biểu thức toạ độ của vật theo thời gian.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m rơi tự do từ độ cao h. Nếu không có lực cản của không khí, thì vật sẽ đạt vận tốc tối đa v = √(2gh) khi chạm đất.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một lực F tác dụng lên một vật có khối lượng m. Nếu lực F không đổi và hướng của nó trùng với hướng chuyển động của vật, thì vật sẽ có gia tốc a = F/m.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính R và vận tốc v. Nếu tần số góc ω = v/R, thì vật sẽ có chu kỳ T = 2π/ω.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sóng âm có tần số f và vận tốc truyền trong không khí là v. Nếu v = fλ, thì bước sóng λ = v/f.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chịu tác dụng của hai lực F1 và F2 cùng phương và cùng chiều. Nếu F1 > F2, thì vật sẽ có gia tốc theo chiều của F1.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một điện tích q đặt trong điện trường E. Nếu điện trường E có hướng từ dương sang âm, thì lực tác dụng lên điện tích q sẽ có hướng ngược lại nếu q là điện tích dương.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Nếu vật va chạm hoàn toàn đàn hồi với một vật khác, thì tổng động năng của hệ trước và sau va chạm sẽ được bảo toàn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất rắn có khối lượng riêng ρ và thể tích V. Nếu khối lượng của chất rắn là m = ρV, thì chất rắn sẽ nổi trên mặt nước nếu ρ < ρ_nước.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một mạch điện có điện trở R và hiệu điện thế U. Nếu dòng điện I chạy qua mạch được tính bằng công thức I = U/R, thì mạch sẽ tiêu thụ công suất P = UI.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hai bộ phận chính của kính thiên văn là hai thấu kính hội tụ có đặc điểm là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều có vận tốc không đổi và không chịu tác động của lực bên ngoài:",
    "re": "Vật sẽ tiếp tục chuyển động với vận tốc đó"
  },
  {
    "con": "Khi một lực tác động lên một vật có khối lượng, thì vật sẽ có gia tốc tỉ lệ thuận với lực và nghịch đảo với khối lượng:",
    "re": "Định luật II Newton được áp dụng"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt, chỉ có thể chuyển đổi từ dạng này sang dạng khác:",
    "re": "Định luật bảo toàn năng lượng được thực hiện"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau, thì ánh sáng sẽ bị bẻ cong:",
    "re": "Hiện tượng khúc xạ ánh sáng xảy ra"
  },
  {
    "con": "Khi một vật dao động với tần số tự nhiên của nó, thì nó sẽ dao động với biên độ lớn nhất:",
    "re": "Hiện tượng cộng hưởng xảy ra"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn một vật khác và cả hai vật đều chịu tác động của cùng một lực, thì vật có khối lượng lớn hơn sẽ có gia tốc nhỏ hơn:",
    "re": "Định luật II Newton được áp dụng"
  },
  {
    "con": "Khi một điện tích di chuyển trong một từ trường, thì nó sẽ chịu tác động của một lực từ:",
    "re": "Lực Lorentz được tạo ra"
  },
  {
    "con": "Nếu nhiệt độ của một vật tăng lên, thì năng lượng động học của các phân tử trong vật đó cũng sẽ tăng lên:",
    "re": "Nhiệt độ và năng lượng động học có mối quan hệ trực tiếp"
  },
  {
    "con": "Khi một sóng âm đi qua một môi trường khác, thì tốc độ của sóng âm sẽ thay đổi tùy thuộc vào tính chất của môi trường đó:",
    "re": "Hiện tượng khúc xạ âm xảy ra"
  },
  {
    "con": "Chọn t = 0 là lúc vật qua vị trí cân bằng theo chiều dương. Tại thời điểm t = 0,5s thì lực hồi phục lên vật có giá trị bằng bao nhiêu:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi. Nếu vận tốc của vật là 10 m/s và thời gian chuyển động là 5 giây,",
    "re": "quãng đường vật đi được là 50 mét"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Nếu h = 20 m và g = 9,81 m/s²,",
    "re": "thời gian rơi của vật là khoảng 2,02 giây"
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng m, nếu lực F = 20 N và m = 5 kg,",
    "re": "gia tốc của vật là 4 m/s²"
  },
  {
    "con": "Một lò xo có độ cứng k. Nếu lò xo bị nén một đoạn x và k = 200 N/m,",
    "re": "lực hồi phục của lò xo là 200x N"
  },
  {
    "con": "Một vật có khối lượng m = 10 kg di chuyển với vận tốc v = 15 m/s. Nếu tính động năng của vật,",
    "re": "động năng là 1125 J"
  },
  {
    "con": "Một vật có khối lượng m = 2 kg được treo vào một lò xo. Nếu lò xo có độ cứng k = 100 N/m,",
    "re": "vật sẽ kéo lò xo dãn ra một đoạn 0,2 m"
  },
  {
    "con": "Một sóng âm có tần số f = 440 Hz. Nếu tốc độ âm thanh trong không khí là v = 340 m/s,",
    "re": "bước sóng của sóng âm là khoảng 0,773 m"
  },
  {
    "con": "Một điện tích q = 1 μC đặt trong điện trường E = 1000 N/C. Nếu tính lực tác dụng lên điện tích,",
    "re": "lực tác dụng là 1 N"
  },
  {
    "con": "Một vật có khối lượng m = 3 kg đang chuyển động tròn với bán kính r = 2 m. Nếu tính lực hướng tâm,",
    "re": "lực hướng tâm là 9 N khi vật có vận tốc 3 m/s"
  },
  {
    "con": "Tia sáng đi từ không khí vào chất lỏng trong suốt với góc tới i = 600",
    "re": "góc khúc xạ r = 300. Để xảy ra phản xạ toàn phần khi tia sáng từ chất lỏng ra không khí thì góc tới i có giá trị là"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h",
    "re": "thời gian rơi t được tính bằng công thức t = √(2h/g), với g là gia tốc trọng trường"
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m",
    "re": "vật sẽ có gia tốc a = F/m theo định luật II Newton"
  },
  {
    "con": "Nếu một vật chuyển động tròn đều với bán kính R và vận tốc v",
    "re": "thì gia tốc hướng tâm a_c = v^2/R"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí với tần số f",
    "re": "vận tốc của sóng âm v = fλ, với λ là bước sóng"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một trường điện đều E",
    "re": "thì điện tích sẽ chịu lực F = qE"
  },
  {
    "con": "Khi một vật dao động điều hòa với biên độ A và tần số f",
    "re": "thì phương trình dao động có dạng x(t) = A cos(2πft + φ)"
  },
  {
    "con": "Nếu một chất rắn được nung nóng đến nhiệt độ T",
    "re": "thì thể tích của chất rắn có thể thay đổi theo công thức V = V0(1 + β(T - T0))"
  },
  {
    "con": "Khi một dòng điện I chạy qua một điện trở R",
    "re": "thì công suất P = I^2R theo định luật Joule"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v",
    "re": "thì động năng của vật được tính bằng công thức E_k = 1/2 mv^2"
  },
  {
    "con": "Phát biểu nào sau đây không đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì vận tốc của nó không thay đổi",
    "re": "Vật đó có gia tốc bằng 0"
  },
  {
    "con": "Lực tác dụng lên một vật không đổi thì vật sẽ chuyển động theo hướng của lực",
    "re": "Vật sẽ có gia tốc theo định luật Newton thứ hai"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt",
    "re": "Năng lượng chỉ có thể chuyển đổi từ dạng này sang dạng khác"
  },
  {
    "con": "Nếu một vật rơi tự do thì nó chịu tác động của trọng lực",
    "re": "Vật đó sẽ có gia tốc bằng gia tốc trọng trường"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên, thể tích của nó cũng có thể tăng",
    "re": "Điều này đúng với các chất khí theo định luật Charles"
  },
  {
    "con": "Nếu một sóng âm đi qua không khí thì nó sẽ truyền đi với tốc độ nhất định",
    "re": "Tốc độ của sóng âm phụ thuộc vào nhiệt độ và áp suất của không khí"
  },
  {
    "con": "Một vật có khối lượng lớn hơn thì sẽ có trọng lực lớn hơn",
    "re": "Trọng lực của vật đó tỉ lệ thuận với khối lượng của nó"
  },
  {
    "con": "Nếu một điện tích dương và một điện tích âm lại gần nhau",
    "re": "Chúng sẽ hút nhau theo định luật Coulomb"
  },
  {
    "con": "Khi một vật dao động điều hòa thì nó sẽ có một tần số nhất định",
    "re": "Tần số này không thay đổi theo thời gian nếu không có tác động bên ngoài"
  },
  {
    "con": "Một vật chuyển động thẳng đều",
    "re": "vận tốc của nó không thay đổi theo thời gian"
  },
  {
    "con": "Một lực tác dụng lên một vật",
    "re": "sẽ làm thay đổi trạng thái chuyển động của vật đó"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt",
    "re": "nó chỉ có thể chuyển đổi từ dạng này sang dạng khác"
  },
  {
    "con": "Khi một vật rơi tự do",
    "re": "nó chịu tác động của trọng lực và gia tốc của nó là 9.81 m/s²"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn",
    "re": "thì nó sẽ có trọng lực lớn hơn so với vật có khối lượng nhỏ hơn"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác",
    "re": "nó sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Nếu nhiệt độ của một vật tăng lên",
    "re": "thì năng lượng động học của các phân tử trong vật đó cũng tăng lên"
  },
  {
    "con": "Khi một sóng âm đi qua không khí",
    "re": "nó sẽ truyền năng lượng qua các phân tử không khí"
  },
  {
    "con": "Nếu một vật quay quanh một điểm cố định",
    "re": "thì nó sẽ có một gia tốc hướng tâm"
  },
  {
    "con": "Khi một điện tích di chuyển trong từ trường",
    "re": "nó sẽ chịu tác động của lực Lorentz"
  },
  {
    "con": "Một nguồn O dao động với tần số f=25Hz tạo ra sóng trên mặt nước. Biết khoảng cách giữa 11 gợn lồi liên tiếp là 1m. Vận tốc truyền sóng trên mặt nước bằng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m=2kg và chịu tác dụng của lực F=10N. Gia tốc của vật được tính bằng công thức a=F/m.",
    "re": "Gia tốc của vật là 5 m/s²"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h=20m. Thời gian rơi của vật được tính bằng công thức t=√(2h/g) với g=9.81 m/s².",
    "re": "Thời gian rơi của vật là khoảng 2.02 giây"
  },
  {
    "con": "Một lò xo có độ cứng k=200 N/m bị nén một đoạn x=0.1m. Lực đàn hồi của lò xo được tính bằng công thức F=kx.",
    "re": "Lực đàn hồi của lò xo là 20 N"
  },
  {
    "con": "Một vật có vận tốc v=15 m/s va chạm với một vật khác đứng yên và dính vào nhau. Theo định luật bảo toàn động lượng, vận tốc sau va chạm được tính bằng công thức v'=(m1*v1 + m2*v2)/(m1 + m2).",
    "re": "Vận tốc sau va chạm phụ thuộc vào khối lượng của hai vật"
  },
  {
    "con": "Một sóng âm có tần số f=440Hz và vận tốc truyền sóng v=340m/s. Độ dài sóng λ được tính bằng công thức λ=v/f.",
    "re": "Độ dài sóng là 0.773m"
  },
  {
    "con": "Một vật có khối lượng m=3kg di chuyển với vận tốc v=4m/s. Động năng của vật được tính bằng công thức E_k=1/2*m*v².",
    "re": "Động năng của vật là 24J"
  },
  {
    "con": "Một điện tích q=1μC đặt trong điện trường E=1000N/C. Lực tác dụng lên điện tích được tính bằng công thức F=qE.",
    "re": "Lực tác dụng lên điện tích là 1N"
  },
  {
    "con": "Một vật có khối lượng m=5kg và được kéo lên cao với gia tốc a=2m/s². Lực kéo cần thiết được tính bằng công thức F=m(g+a) với g=9.81m/s².",
    "re": "Lực kéo cần thiết là 59.05N"
  },
  {
    "con": "Một vật có khối lượng m=10kg và được đặt trên mặt phẳng nghiêng với góc α=30°. Lực tác dụng lên vật do trọng lực được tính bằng công thức F=mg*sin(α).",
    "re": "Lực tác dụng lên vật là 49.05N"
  },
  {
    "con": "Cho một vật hình trụ, khối lượng m = 400g, diện tích đáy S = 50 m^2, nổi trong nước, trục hình trụ có phương thẳng đứng. Ấn hình trụ chìm vào nước sao cho vật bị lệch khỏi vị trí cân bằng một đoạn x theo phương thẳng đứng rồi thả ra. Tính chu kỳ dao động điều hòa của khối gỗ.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực F và có khối lượng m, thì gia tốc a của vật sẽ được tính bằng công thức a = F/m.",
    "re": "Gia tốc a tỷ lệ thuận với lực F và tỷ lệ nghịch với khối lượng m."
  },
  {
    "con": "Nếu một vật chuyển động thẳng đều với vận tốc v, thì quãng đường s mà vật đi được trong thời gian t sẽ được tính bằng công thức s = vt.",
    "re": "Quãng đường s tỷ lệ thuận với vận tốc v và thời gian t."
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, thì vận tốc v của vật khi chạm đất sẽ được tính bằng công thức v = √(2gh), với g là gia tốc trọng trường.",
    "re": "Vận tốc v tăng theo căn bậc hai của độ cao h."
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động năng K của vật sẽ được tính bằng công thức K = 1/2 mv^2.",
    "re": "Động năng K tỷ lệ với bình phương vận tốc v."
  },
  {
    "con": "Nếu một lực F tác dụng lên một vật trong một khoảng thời gian t, thì xung lượng J của lực sẽ được tính bằng công thức J = Ft.",
    "re": "Xung lượng J tỷ lệ với lực F và thời gian t."
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v va chạm với một vật khác có khối lượng m' và vận tốc v', thì theo định luật bảo toàn động lượng, tổng động lượng trước va chạm bằng tổng động lượng sau va chạm.",
    "re": "Động lượng được bảo toàn trong va chạm."
  },
  {
    "con": "Nếu một vật dao động điều hòa với chu kỳ T, thì tần số f của dao động sẽ được tính bằng công thức f = 1/T.",
    "re": "Tần số f tỷ lệ nghịch với chu kỳ T."
  },
  {
    "con": "Nếu một sóng có bước sóng λ và tần số f, thì vận tốc v của sóng sẽ được tính bằng công thức v = fλ.",
    "re": "Vận tốc v tỷ lệ với tần số f và bước sóng λ."
  },
  {
    "con": "Nếu một điện tích q nằm trong điện trường E, thì lực tác dụng lên điện tích sẽ được tính bằng công thức F = qE.",
    "re": "Lực F tỷ lệ với điện tích q và cường độ điện trường E."
  },
  {
    "con": "Tại điểm S trên mặt nước yên tĩnh có nguồn dao động điều hoà theo phương thẳng đứng với tần số 50Hz.Khi đó hình thành hệ sóng tròn đồng tâm S trên mặt nước .Tại hai điểm M,N cách nhau 9 cm trên đường thẳng đi qua S luôn dao động cùng pha với nhau. Biết rằng vận tốc thay đổi trong khoảng từ 70cm/s đến 80cm/s. Vận tốc truyền sóng trên mặt nước là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực không đổi trong một khoảng thời gian nhất định, thì vật sẽ có gia tốc không đổi.",
    "re": "Vận tốc của vật sẽ thay đổi theo thời gian."
  },
  {
    "con": "Nếu một vật chuyển động tròn đều với bán kính R và vận tốc v, thì lực hướng tâm tác dụng lên vật là:",
    "re": "F = m*v^2/R."
  },
  {
    "con": "Nếu một sóng âm có tần số f và vận tốc truyền sóng v trong không khí, thì bước sóng λ của sóng âm là:",
    "re": "λ = v/f."
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, thì thời gian rơi t là:",
    "re": "t = √(2h/g), với g là gia tốc trọng trường."
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một trường điện đều với cường độ E, thì lực tác dụng lên điện tích là:",
    "re": "F = q*E."
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v và va chạm hoàn toàn đàn hồi với một vật khác có khối lượng M, thì vận tốc sau va chạm của vật m là:",
    "re": "v' = (m - M)/(m + M) * v."
  },
  {
    "con": "Nếu một sóng điện từ có tần số f, thì năng lượng của một photon là:",
    "re": "E = h*f, với h là hằng số Planck."
  },
  {
    "con": "Nếu một lò xo có độ cứng k bị nén hoặc kéo một khoảng x, thì lực phục hồi F của lò xo là:",
    "re": "F = -k*x."
  },
  {
    "con": "Nếu một vật có khối lượng m nằm trên mặt phẳng nghiêng với góc α, thì lực tác dụng lên vật theo phương vuông góc với mặt phẳng là:",
    "re": "F = m*g*cos(α)."
  },
  {
    "con": "Điện áp đặt vào hai đầu tụ điện là U = 110 V, tần số f1 = 50Hz. Khi đó dòng điện qua tụ là I1 = 0,2A. Để dòng điện qua tụ là I2 = 0,5 A thì cần tăng hay giảm tần số bao nhiêu lần?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m = 2 kg và được tác dụng một lực F = 10 N. Khi đó, gia tốc của vật là a = F/m.",
    "re": "Gia tốc a = 5 m/s²"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h = 20 m. Khi đó, thời gian rơi t là căn bậc hai của (2h/g), với g = 9,81 m/s².",
    "re": "Thời gian rơi t ≈ 2,02 giây"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m và bị nén một đoạn x = 0,1 m. Khi đó, năng lượng đàn hồi của lò xo là E = 1/2 kx².",
    "re": "Năng lượng đàn hồi E = 1 J"
  },
  {
    "con": "Một vật có vận tốc v = 15 m/s và khối lượng m = 3 kg. Khi đó, động năng của vật là K = 1/2 mv².",
    "re": "Động năng K = 337,5 J"
  },
  {
    "con": "Một sóng âm có tần số f = 440 Hz và vận tốc âm thanh trong không khí là v = 340 m/s. Khi đó, bước sóng λ = v/f.",
    "re": "Bước sóng λ ≈ 0,773 m"
  },
  {
    "con": "Một điện trở có giá trị R = 100 Ω và dòng điện chạy qua là I = 0,5 A. Khi đó, điện áp U = RI.",
    "re": "Điện áp U = 50 V"
  },
  {
    "con": "Một vật có khối lượng m = 5 kg và đang chuyển động với vận tốc v = 10 m/s. Khi đó, lực quán tính của vật là F = ma.",
    "re": "Lực quán tính F = 50 N"
  },
  {
    "con": "Một vật có khối lượng m = 1 kg và được ném lên với vận tốc ban đầu v0 = 20 m/s. Khi đó, độ cao cực đại h đạt được là h = v0²/(2g).",
    "re": "Độ cao cực đại h ≈ 20,4 m"
  },
  {
    "con": "Một mạch điện có điện trở R = 50 Ω và điện áp U = 220 V. Khi đó, dòng điện I = U/R.",
    "re": "Dòng điện I = 4,4 A"
  },
  {
    "con": "Đồ thị dưới đây biểu diễn sự phụ thuộc của li độ x vào thời gian t của một điểm trên phương truyền sóng của một sóng hình sin. Đoạn PR trên trục thời gian t biểu thị gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi. Vị trí của vật sẽ thay đổi như thế nào theo thời gian?",
    "re": "Vị trí của vật sẽ thay đổi theo một đường thẳng."
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng m, và vật đó không bị cản trở bởi lực nào khác, vật sẽ có gia tốc a. Gia tốc này được tính như thế nào?",
    "re": "Gia tốc a sẽ bằng lực tác dụng chia cho khối lượng m của vật."
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, thì vận tốc của vật khi chạm đất sẽ phụ thuộc vào điều gì?",
    "re": "Vận tốc của vật sẽ phụ thuộc vào độ cao h và gia tốc trọng trường."
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác, hiện tượng gì xảy ra?",
    "re": "Hiện tượng khúc xạ ánh sáng xảy ra."
  },
  {
    "con": "Nếu một sóng âm có tần số f, thì bước sóng λ của sóng âm đó sẽ được tính như thế nào?",
    "re": "Bước sóng λ sẽ bằng tốc độ âm thanh chia cho tần số f."
  },
  {
    "con": "Khi một vật dao động điều hòa, thì li độ x của vật sẽ thay đổi như thế nào theo thời gian?",
    "re": "Li độ x sẽ thay đổi theo hàm sin hoặc cos theo thời gian."
  },
  {
    "con": "Nếu một vật có động năng K và khối lượng m, thì động năng này được tính như thế nào?",
    "re": "Động năng K sẽ bằng 1/2 nhân với khối lượng m và bình phương vận tốc v của vật."
  },
  {
    "con": "Khi một vật bị kéo dài bởi một lực, thì ứng suất và biến dạng của vật sẽ có mối quan hệ như thế nào?",
    "re": "Ứng suất và biến dạng của vật sẽ tỉ lệ thuận với nhau trong giới hạn đàn hồi."
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một trường điện, thì điện thế V tại vị trí của điện tích sẽ có ảnh hưởng như thế nào?",
    "re": "Điện thế V sẽ xác định công mà lực điện thực hiện khi điện tích q di chuyển."
  },
  {
    "con": "Hai lò xo R1, R2, có cùng độ dài. Một vật nặng M khối lượng m = 200g khi treo vào lò xo R1 thì dao động với chu kỳ T1 = 0,3s, khi treo vào lò xo R2 thì dao động với chu kỳ T2 = 0,4s. Nối hai lò xo với nhau cả hai đầu để được một lò xo cùng độ dài, rồi treo vật nặng M vào thì chu kỳ dao động của vật bằng bao nhiêu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m được thả rơi tự do từ độ cao h. Nếu không có lực cản của không khí, thì vật sẽ rơi với gia tốc g = 9,81 m/s².",
    "re": "Vật sẽ đạt vận tốc tối đa khi chạm đất."
  },
  {
    "con": "Một vật dao động điều hòa với biên độ A. Nếu biên độ tăng lên gấp đôi, thì năng lượng dao động của vật sẽ tăng lên gấp bốn lần.",
    "re": "Năng lượng dao động tỉ lệ với bình phương biên độ."
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Nếu vận tốc tăng gấp đôi, thì động năng của vật sẽ tăng lên gấp bốn lần.",
    "re": "Động năng tỉ lệ với bình phương vận tốc."
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo dài một khoảng x. Nếu lực tác dụng lên lò xo tăng lên gấp đôi, thì độ biến dạng của lò xo cũng sẽ tăng lên gấp đôi.",
    "re": "Lực tác dụng tỉ lệ với độ biến dạng theo định luật Hooke."
  },
  {
    "con": "Một vật có khối lượng m được treo vào một lò xo. Nếu khối lượng m tăng lên gấp đôi, thì chu kỳ dao động của vật sẽ tăng lên khoảng 1,41 lần.",
    "re": "Chu kỳ dao động tỉ lệ với căn bậc hai của khối lượng."
  },
  {
    "con": "Một sóng âm có tần số f. Nếu tần số tăng lên, thì bước sóng của sóng sẽ giảm đi.",
    "re": "Bước sóng tỉ lệ nghịch với tần số."
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính R và vận tốc v. Nếu bán kính tăng lên gấp đôi, thì lực hướng tâm cần thiết sẽ tăng lên gấp đôi.",
    "re": "Lực hướng tâm tỉ lệ với bán kính và bình phương vận tốc."
  },
  {
    "con": "Một vật có khối lượng m và vận tốc v va chạm đàn hồi với một vật khác. Nếu khối lượng của vật thứ hai gấp đôi, thì vận tốc sau va chạm của vật thứ nhất sẽ giảm đi.",
    "re": "Vận tốc sau va chạm phụ thuộc vào khối lượng và vận tốc ban đầu."
  },
  {
    "con": "Một vật dao động với chu kỳ T. Nếu tần số f của dao động tăng lên, thì chu kỳ T sẽ giảm đi.",
    "re": "Chu kỳ và tần số tỉ lệ nghịch với nhau."
  },
  {
    "con": "Chuyển động tròn đều có thể xem như tổng hợp của hai dao động điều hòa: một theo phương x, và một theo phương y. Nếu bán kính quỹ đạo của chuyển động tròn đều bằng 1m, và thành phần theo y của chuyển động được cho bởi y = sin (5t), tìm dạng chuyển động của thành phần theo x.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực không đổi, thì gia tốc của vật đó sẽ là hằng số.",
    "re": "Vật sẽ chuyển động theo phương trình chuyển động thẳng biến đổi đều."
  },
  {
    "con": "Nếu một vật rơi tự do trong môi trường không có sức cản, thì vận tốc của vật sẽ tăng theo thời gian với gia tốc bằng gia tốc trọng trường.",
    "re": "Vận tốc của vật sẽ đạt giá trị tối đa khi chạm đất."
  },
  {
    "con": "Nếu một sóng âm truyền trong không khí, thì tốc độ của sóng âm sẽ phụ thuộc vào nhiệt độ của không khí.",
    "re": "Tốc độ sóng âm sẽ tăng khi nhiệt độ không khí tăng."
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v, thì động năng của vật đó được tính bằng công thức 1/2 mv^2.",
    "re": "Động năng sẽ tăng gấp đôi nếu vận tốc của vật tăng lên gấp đôi."
  },
  {
    "con": "Nếu một vật quay quanh một trục với tốc độ góc không đổi, thì lực hướng tâm tác dụng lên vật đó sẽ tỉ lệ thuận với bình phương vận tốc và tỉ lệ nghịch với bán kính quỹ đạo.",
    "re": "Lực hướng tâm sẽ tăng nếu bán kính quỹ đạo giảm."
  },
  {
    "con": "Nếu một vật va chạm đàn hồi với một vật khác, thì tổng động năng của hệ trước và sau va chạm sẽ được bảo toàn.",
    "re": "Hệ sẽ không mất năng lượng trong quá trình va chạm."
  },
  {
    "con": "Nếu một sóng điện từ truyền trong chân không, thì tốc độ của sóng điện từ sẽ bằng tốc độ ánh sáng.",
    "re": "Tốc độ ánh sáng trong chân không là khoảng 3 x 10^8 m/s."
  },
  {
    "con": "Nếu một vật có khối lượng m và được nâng lên độ cao h trong trường trọng lực, thì công thực hiện để nâng vật đó được tính bằng công thức mgh.",
    "re": "Công thực hiện sẽ tăng nếu độ cao h tăng."
  },
  {
    "con": "Nếu một chất rắn được nung nóng, thì thể tích của chất rắn đó sẽ tăng lên.",
    "re": "Hiện tượng này được gọi là giãn nở nhiệt."
  },
  {
    "con": "Một vật sáng nhỏ đặt vuông góc với trục chính của một thấu kính hội tụ có tiêu cự f = 20cm. Biết khoảng cách từ vật tới thấu kính là 15cm. Độ phóng đại của ảnh là bao nhiêu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng m = 5kg được treo trên một sợi dây, thì lực kéo của dây là bao nhiêu khi vật đứng yên?",
    "re": "Lực kéo của dây là 50N"
  },
  {
    "con": "Nếu một vật chuyển động thẳng đều với vận tốc v = 10m/s trong 5 giây, thì quãng đường mà vật đi được là bao nhiêu?",
    "re": "Quãng đường là 50m"
  },
  {
    "con": "Nếu một quả bóng được ném lên với vận tốc ban đầu v0 = 20m/s, thì chiều cao tối đa mà quả bóng đạt được là bao nhiêu?",
    "re": "Chiều cao tối đa là 20m"
  },
  {
    "con": "Nếu một vật có khối lượng m = 2kg rơi tự do từ độ cao h = 10m, thì vận tốc của vật khi chạm đất là bao nhiêu?",
    "re": "Vận tốc khi chạm đất là 14.14m/s"
  },
  {
    "con": "Nếu một lò xo có độ cứng k = 100N/m bị nén một đoạn x = 0.5m, thì năng lượng đàn hồi của lò xo là bao nhiêu?",
    "re": "Năng lượng đàn hồi là 12.5J"
  },
  {
    "con": "Nếu một điện trở có giá trị R = 10Ω và dòng điện chạy qua là I = 2A, thì điện áp trên điện trở là bao nhiêu?",
    "re": "Điện áp là 20V"
  },
  {
    "con": "Nếu một vật có khối lượng m = 3kg di chuyển với vận tốc v = 4m/s, thì động năng của vật là bao nhiêu?",
    "re": "Động năng là 24J"
  },
  {
    "con": "Nếu một sóng âm có tần số f = 440Hz và tốc độ truyền sóng v = 340m/s, thì bước sóng của sóng âm là bao nhiêu?",
    "re": "Bước sóng là 0.773m"
  },
  {
    "con": "Nếu một vật có khối lượng m = 1kg được đặt trên mặt phẳng nghiêng với góc α = 30 độ, thì lực kéo xuống mặt phẳng là bao nhiêu?",
    "re": "Lực kéo là 4.9N"
  },
  {
    "con": "Đối với một vật chuyển động thẳng đều, vận tốc của nó không thay đổi theo thời gian.",
    "re": "Vận tốc là hằng số"
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng, vật sẽ có gia tốc.",
    "re": "Gia tốc tỷ lệ thuận với lực và tỷ lệ nghịch với khối lượng"
  },
  {
    "con": "Trong một hệ kín, tổng năng lượng luôn được bảo toàn.",
    "re": "Năng lượng không tự sinh ra hoặc mất đi"
  },
  {
    "con": "Khi một vật rơi tự do, nó chịu tác động của trọng lực.",
    "re": "Gia tốc của vật là gia tốc trọng trường"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác, nó sẽ có trọng lực lớn hơn.",
    "re": "Trọng lực tỷ lệ thuận với khối lượng"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác, nó có thể bị khúc xạ.",
    "re": "Góc khúc xạ phụ thuộc vào chỉ số khúc xạ của hai môi trường"
  },
  {
    "con": "Khi một sóng âm đi qua một môi trường khác, tốc độ của nó có thể thay đổi.",
    "re": "Tốc độ sóng âm phụ thuộc vào tính chất của môi trường"
  },
  {
    "con": "Nếu một vật quay quanh một trục, nó sẽ có động năng quay.",
    "re": "Động năng quay tỷ lệ với bình phương vận tốc góc"
  },
  {
    "con": "Khi một điện tích di chuyển trong một từ trường, nó sẽ chịu tác động của lực Lorentz.",
    "re": "Lực Lorentz tỷ lệ với độ lớn của điện tích và vận tốc"
  },
  {
    "con": "Nếu nhiệt độ của một vật tăng lên, năng lượng nội của nó cũng tăng.",
    "re": "Năng lượng nội tỷ lệ thuận với nhiệt độ"
  },
  {
    "con": "Phát biểu nào sau đây về máy phát điện xoay chiều một pha là sai?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một mạch dao động điện từ LC, gồm cuộn dây có lõi sắt từ, ban đầu tụ điện được tích một lượng điện tích nào đó, rồi cho dao động tự do. Dao động của dòng điện trong mạch là dao động tắt dần vì",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h, không chịu tác động của lực cản không khí, thì",
    "re": "vật sẽ đạt vận tốc tối đa khi chạm đất, và vận tốc này phụ thuộc vào độ cao h"
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng m, thì",
    "re": "vật sẽ có gia tốc a tỉ lệ thuận với lực và tỉ lệ nghịch với khối lượng, theo định luật Newton thứ hai"
  },
  {
    "con": "Nếu một vật chuyển động tròn đều với bán kính r và vận tốc v, thì",
    "re": "vật sẽ có gia tốc hướng tâm a = v^2/r"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác với chỉ số khúc xạ khác nhau, thì",
    "re": "ánh sáng sẽ bị bẻ cong theo định luật khúc xạ Snell"
  },
  {
    "con": "Nếu một sóng âm truyền trong không khí, thì",
    "re": "tốc độ của sóng âm sẽ phụ thuộc vào nhiệt độ của không khí"
  },
  {
    "con": "Khi một điện tích q di chuyển trong một trường điện đều E, thì",
    "re": "điện tích sẽ chịu tác dụng của lực điện F = qE"
  },
  {
    "con": "Nếu một vật có khối lượng m được kéo lên cao với lực kéo F, thì",
    "re": "công thực hiện bởi lực kéo sẽ bằng F nhân với độ cao h mà vật được kéo lên"
  },
  {
    "con": "Khi một vật dao động điều hòa với biên độ A và tần số f, thì",
    "re": "vận tốc cực đại của vật sẽ bằng A nhân với 2πf"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và hiệu điện thế U, thì",
    "re": "cường độ dòng điện I trong mạch sẽ được tính bằng định luật Ohm: I = U/R"
  },
  {
    "con": "Kết luận nào sau đây đúng ? Cuộn dây thuần cảm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều",
    "re": "Có gia tốc bằng 0"
  },
  {
    "con": "Lực tác dụng lên một vật có khối lượng",
    "re": "Sẽ làm thay đổi vận tốc của vật đó"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt",
    "re": "Năng lượng tổng luôn được bảo toàn"
  },
  {
    "con": "Một vật rơi tự do trong trường hấp dẫn",
    "re": "Chịu tác động của trọng lực mà không có lực cản"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên",
    "re": "Thể tích của chất khí sẽ tăng nếu áp suất không đổi"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước",
    "re": "Tốc độ ánh sáng sẽ giảm và ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Một mạch điện kín có điện trở",
    "re": "Sẽ có dòng điện chạy qua nếu có hiệu điện thế"
  },
  {
    "con": "Khi một vật dao động điều hòa",
    "re": "Vận tốc của vật thay đổi theo thời gian"
  },
  {
    "con": "Khi một lực tác dụng lên một vật",
    "re": "Sẽ tạo ra một phản lực bằng và ngược chiều"
  },
  {
    "con": "Một ròng rọc có bán kính 10cm, có mômem quán tính đối với trục là 10^{-2} kg.m2. Ban đầu ròng rọc đang đứng yên, tác dụng vào ròng rọc một lực không đổi 2N tiếp tuyến với vành ngoài của nó. Sau khi vật chịu tác dụng của lực được 3 s thì vận tốc góc của nó là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 2 kg và chịu tác dụng của một lực không đổi 10 N, thì gia tốc của vật là",
    "re": "5 m/s²"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao 20 m, thì thời gian để vật chạm đất là",
    "re": "2 s"
  },
  {
    "con": "Nếu một lò xo có độ cứng k = 200 N/m bị nén 0.1 m, thì năng lượng tiềm năng đàn hồi trong lò xo là",
    "re": "1 J"
  },
  {
    "con": "Nếu một vật có vận tốc 15 m/s và va chạm hoàn toàn đàn hồi với một vật khác có khối lượng gấp đôi, thì vận tốc của vật thứ hai sau va chạm là",
    "re": "7.5 m/s"
  },
  {
    "con": "Nếu một điện trở có giá trị 10 ohm và dòng điện chạy qua nó là 2 A, thì điện áp trên điện trở là",
    "re": "20 V"
  },
  {
    "con": "Nếu một sóng âm có tần số 440 Hz và tốc độ truyền sóng là 340 m/s, thì bước sóng của sóng âm là",
    "re": "0.773 m"
  },
  {
    "con": "Nếu một vật có khối lượng 5 kg di chuyển với vận tốc 10 m/s, thì động năng của vật là",
    "re": "250 J"
  },
  {
    "con": "Nếu một vật có mômen quán tính I và quay với vận tốc góc ω, thì động lượng góc của vật là",
    "re": "Iω"
  },
  {
    "con": "Nếu một chất lỏng có mật độ 1000 kg/m³ và chiều cao cột chất lỏng là 5 m, thì áp suất tại đáy cột chất lỏng là",
    "re": "50000 Pa"
  },
  {
    "con": "Trong một thí nghiệm về hiện tượng quang điện, người ta dùng màn chắn tách ra một chùm các êlectron có vận tốc cực đại và hướng nó vào một từ trường đều sao cho vận tốc của các êlectron vuông góc với vectơ cảm ứng từ. Bán kính quỹ đạo của các êlectron tăng khi:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h, nếu không có lực cản của không khí thì:",
    "re": "Vận tốc của vật tăng theo thời gian với gia tốc g"
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng m, nếu lực này tăng lên gấp đôi thì:",
    "re": "Gia tốc của vật cũng tăng lên gấp đôi"
  },
  {
    "con": "Trong một hệ thống kín, nếu nhiệt độ của một chất khí tăng lên thì:",
    "re": "Áp suất của chất khí cũng tăng lên nếu thể tích không đổi"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nếu góc tới lớn hơn góc tới giới hạn thì:",
    "re": "Ánh sáng sẽ bị phản xạ hoàn toàn"
  },
  {
    "con": "Nếu một vật dao động điều hòa với biên độ A và tần số f, thì:",
    "re": "Năng lượng dao động của vật tỉ lệ với bình phương biên độ A"
  },
  {
    "con": "Khi một điện tích q di chuyển trong một từ trường với vận tốc v, nếu góc giữa vectơ vận tốc và vectơ cảm ứng từ là 90 độ thì:",
    "re": "Lực Lorentz tác dụng lên điện tích đạt giá trị cực đại"
  },
  {
    "con": "Nếu một sóng âm truyền trong không khí và nhiệt độ tăng lên, thì:",
    "re": "Tốc độ truyền sóng âm cũng tăng lên"
  },
  {
    "con": "Khi một vật chuyển động tròn đều, nếu bán kính quỹ đạo tăng lên thì:",
    "re": "Gia tốc hướng tâm của vật giảm nếu vận tốc không đổi"
  },
  {
    "con": "Trong một phản ứng hạt nhân, nếu năng lượng của các hạt tăng lên thì:",
    "re": "Khả năng xảy ra phản ứng hạt nhân cũng tăng lên"
  },
  {
    "con": "b Để dòng điện qua tụ là I2 = 0,5 A thì cần tăng hay giảm tần số bao nhiêu lần?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng m và chịu tác dụng của lực F thì vật sẽ có gia tốc a = F/m.",
    "re": "Định luật II Newton"
  },
  {
    "con": "Nếu nhiệt độ của một vật tăng lên thì năng lượng động học trung bình của các phân tử trong vật cũng tăng lên.",
    "re": "Định nghĩa về nhiệt độ"
  },
  {
    "con": "Nếu một sóng âm có tần số f thì bước sóng λ của sóng đó được tính bằng công thức λ = v/f, với v là tốc độ âm thanh.",
    "re": "Mối quan hệ giữa tần số và bước sóng"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h thì thời gian rơi t được tính bằng công thức t = √(2h/g), với g là gia tốc trọng trường.",
    "re": "Thời gian rơi tự do"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một từ trường B với vận tốc v thì lực Lorentz tác động lên điện tích đó được tính bằng công thức F = q(v × B).",
    "re": "Lực Lorentz"
  },
  {
    "con": "Nếu một vật có vận tốc v và va chạm với một vật khác thì động lượng của hệ thống trước và sau va chạm sẽ được bảo toàn nếu không có lực bên ngoài tác động.",
    "re": "Định luật bảo toàn động lượng"
  },
  {
    "con": "Nếu một vật có năng lượng tiềm năng trọng trường U = mgh thì khi vật rơi xuống, năng lượng tiềm năng sẽ chuyển hóa thành năng lượng động năng.",
    "re": "Nguyên lý bảo toàn năng lượng"
  },
  {
    "con": "Nếu một sóng điện từ có tần số f thì năng lượng của photon tương ứng được tính bằng công thức E = hf, với h là hằng số Planck.",
    "re": "Mối quan hệ giữa năng lượng và tần số"
  },
  {
    "con": "Nếu một vật quay quanh một trục với vận tốc góc ω thì lực hướng tâm tác động lên vật được tính bằng công thức F = mω²r, với r là bán kính quỹ đạo.",
    "re": "Lực hướng tâm trong chuyển động tròn"
  },
  {
    "con": "Có thể tạo ra dòng điện xoay chiều biến thiên điều hòa theo thời gian trong một khung dây dẫn bằng cách cho khung dây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chịu tác dụng của lực không đổi trong một khoảng thời gian nhất định:",
    "re": "Vật sẽ có gia tốc không đổi"
  },
  {
    "con": "Năng lượng được bảo toàn trong một hệ kín không có lực bên ngoài tác động:",
    "re": "Tổng năng lượng của hệ sẽ không thay đổi"
  },
  {
    "con": "Khi một vật chuyển động tròn đều:",
    "re": "Vật sẽ có gia tốc hướng vào tâm quỹ đạo"
  },
  {
    "con": "Nếu một sóng âm đi qua một môi trường khác với tốc độ khác:",
    "re": "Tần số của sóng sẽ không thay đổi"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên:",
    "re": "Thể tích của chất khí sẽ tăng nếu áp suất không đổi"
  },
  {
    "con": "Nếu một vật rơi tự do trong chân không:",
    "re": "Vật sẽ có gia tốc bằng gia tốc trọng trường"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau:",
    "re": "Ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Nếu một điện tích dương đặt trong điện trường:",
    "re": "Điện tích sẽ chịu lực tác dụng theo hướng của điện trường"
  },
  {
    "con": "Khi một vật dao động điều hòa:",
    "re": "Vật sẽ có vận tốc và gia tốc biến thiên theo thời gian"
  },
  {
    "con": "Ảnh của một vật thật được tạo bởi một thấu kính phân kỳ không có tính chất nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi thì lực tác dụng lên vật đó bằng bao nhiêu?",
    "re": "Bằng 0"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt trong một hệ kín thì tổng năng lượng của hệ đó luôn như thế nào?",
    "re": "Không đổi"
  },
  {
    "con": "Một vật rơi tự do trong trường hấp dẫn thì gia tốc của nó có giá trị là bao nhiêu?",
    "re": "9.81 m/s²"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau thì hiện tượng gì xảy ra?",
    "re": "Khúc xạ ánh sáng"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v thì động năng của vật đó được tính bằng công thức nào?",
    "re": "1/2 mv²"
  },
  {
    "con": "Khi một sóng âm đi từ không khí vào nước thì điều gì xảy ra với tốc độ của sóng?",
    "re": "Tốc độ sóng tăng lên"
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cân bằng thì vật đó sẽ như thế nào?",
    "re": "Vật đứng yên hoặc chuyển động thẳng đều"
  },
  {
    "con": "Khi một vật quay quanh một trục thì lực hướng tâm tác dụng lên vật đó có đặc điểm gì?",
    "re": "Hướng vào tâm quay"
  },
  {
    "con": "Nếu nhiệt độ của một vật tăng lên thì năng lượng nội tại của vật đó sẽ như thế nào?",
    "re": "Tăng lên"
  },
  {
    "con": "Những hiện tượng nào sau đây chứng tỏ ánh sáng có tính chất sóng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi trong một khoảng thời gian nhất định,",
    "re": "thì quãng đường đi được là tích của vận tốc và thời gian."
  },
  {
    "con": "Khi một lực tác động lên một vật có khối lượng,",
    "re": "thì vật sẽ có gia tốc tỷ lệ thuận với lực và tỷ lệ nghịch với khối lượng của nó."
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h,",
    "re": "thì thời gian rơi sẽ phụ thuộc vào độ cao và gia tốc trọng trường."
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau,",
    "re": "thì ánh sáng sẽ bị khúc xạ."
  },
  {
    "con": "Nếu một dòng điện chạy qua một dây dẫn có điện trở R,",
    "re": "thì điện áp trên dây dẫn sẽ tỷ lệ thuận với cường độ dòng điện."
  },
  {
    "con": "Khi một vật dao động điều hòa,",
    "re": "thì nó sẽ có tần số và biên độ nhất định."
  },
  {
    "con": "Nếu một vật chịu tác động của nhiều lực,",
    "re": "thì tổng hợp của các lực này sẽ quyết định chuyển động của vật."
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên,",
    "re": "thì năng lượng động học của các phân tử trong vật cũng tăng theo."
  },
  {
    "con": "Nếu một sóng âm đi qua một môi trường khác,",
    "re": "thì tốc độ và bước sóng của sóng âm sẽ thay đổi."
  },
  {
    "con": "Một thấu kính hội tụ cho vật thật AB một ảnh ảo A’B’ = 4 AB. Thay thấu kính hội tụ bằng thấu kính phân kỳ tiêu cự có cùng giá trị tuyệt đối. Độ phóng đại dài của ảnh là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi. Nếu lực tác dụng lên vật bằng 0 thì vật sẽ tiếp tục chuyển động với vận tốc đó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Nếu không có lực cản thì vận tốc của vật sẽ tăng theo thời gian với gia tốc g.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một điện trở R nối với nguồn điện có hiệu điện thế U. Nếu tăng hiệu điện thế U thì dòng điện I chạy qua điện trở sẽ tăng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sóng âm truyền trong không khí. Nếu tần số sóng tăng thì bước sóng sẽ giảm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Nếu vật va chạm hoàn toàn đàn hồi với vật khác thì tổng động năng của hệ sẽ được bảo toàn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một thấu kính phân kỳ có tiêu cự f. Nếu vật đặt ở khoảng cách lớn hơn f thì ảnh tạo ra sẽ là ảnh ảo.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất rắn có nhiệt độ T. Nếu nhiệt độ tăng thì năng lượng nội của chất rắn sẽ tăng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một mạch điện có điện trở R và hiệu điện thế U. Nếu giảm điện trở R thì dòng điện I trong mạch sẽ tăng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m và vận tốc v. Nếu vật bị tác dụng một lực F trong thời gian t thì động lượng của vật sẽ thay đổi.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Gương cầu lõm có bán kính là 24cm, điểm A nằm trên trục chính và cách gương 20cm. Độ phóng đại dài của ảnh là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2kg và được tác dụng một lực 10N. Gia tốc của vật là:",
    "re": "5 m/s²"
  },
  {
    "con": "Một quả bóng rơi tự do từ độ cao 20m. Thời gian rơi xuống đất là:",
    "re": "2s"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m và bị nén 0.1m. Năng lượng lưu trữ trong lò xo là:",
    "re": "1 J"
  },
  {
    "con": "Một điện trở có điện trở R = 10Ω và được nối với nguồn điện 5V. Dòng điện chạy qua điện trở là:",
    "re": "0.5 A"
  },
  {
    "con": "Một vật có vận tốc 20 m/s và khối lượng 3kg. Động năng của vật là:",
    "re": "600 J"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz và tốc độ truyền sóng là 340 m/s. Chiều dài sóng là:",
    "re": "0.773 m"
  },
  {
    "con": "Một vật có khối lượng 5kg và được nâng lên cao 2m. Công thực hiện để nâng vật là:",
    "re": "100 J"
  },
  {
    "con": "Một chất lỏng có mật độ 1000 kg/m³ và chiều cao cột chất lỏng là 5m. Áp suất tại đáy cột chất lỏng là:",
    "re": "50000 Pa"
  },
  {
    "con": "Một mạch điện có điện trở 4Ω và dòng điện 2A. Công suất tiêu thụ của mạch điện là:",
    "re": "8 W"
  },
  {
    "con": "Vật kính và thị kính của kính hiển vi có vai trò:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Lực tác dụng lên một vật tĩnh là bằng không:",
    "re": "Vật đó sẽ không chuyển động"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt:",
    "re": "Tổng năng lượng trong một hệ kín là hằng số"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi:",
    "re": "Lực tác dụng lên vật đó là bằng không"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên:",
    "re": "Năng lượng nội tại của vật đó cũng tăng"
  },
  {
    "con": "Áp suất trong một chất lỏng tăng lên khi độ sâu tăng:",
    "re": "Áp suất tại độ sâu đó sẽ lớn hơn áp suất bề mặt"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau:",
    "re": "Ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Một vật có khối lượng lớn hơn sẽ có trọng lực lớn hơn:",
    "re": "Trọng lực tác dụng lên vật đó sẽ lớn hơn"
  },
  {
    "con": "Khi một vật dao động điều hòa:",
    "re": "Vận tốc của vật sẽ thay đổi theo thời gian"
  },
  {
    "con": "Khi một điện tích di chuyển trong một từ trường:",
    "re": "Nó sẽ chịu tác dụng của lực Lorentz"
  },
  {
    "con": "Ba chất điểm có khối lượng 5kg, 4kg và 3kg đặt trong hệ toạ độ xOy. Vật 5kg có toạ độ (0; 0), vật 4kg có toạ độ (3; 0) vật 3kg có toạ độ (0;4). Khối tâm của hệ chất điểm có toạ độ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 10kg và được kéo bởi một lực 20N. Nếu lực tác dụng lên vật là không đổi, thì gia tốc của vật là:",
    "re": "2 m/s²"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20m. Nếu không có lực cản không khí, thì thời gian vật rơi đến mặt đất là:",
    "re": "2s"
  },
  {
    "con": "Một lò xo có độ cứng k = 100 N/m bị nén 0.1m. Nếu tính năng lượng đàn hồi của lò xo, thì năng lượng này là:",
    "re": "0.5 J"
  },
  {
    "con": "Một vật có khối lượng 2kg di chuyển với vận tốc 3m/s. Nếu tính động năng của vật, thì động năng này là:",
    "re": "9 J"
  },
  {
    "con": "Một vật có khối lượng 5kg được đặt trên mặt phẳng nghiêng với góc 30 độ. Nếu tính lực kéo xuống mặt phẳng, thì lực này là:",
    "re": "25 N"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz. Nếu tốc độ âm thanh trong không khí là 340 m/s, thì bước sóng của sóng âm này là:",
    "re": "0.773 m"
  },
  {
    "con": "Một điện tích điểm q = 1μC đặt trong điện trường đều có cường độ 1000 N/C. Nếu tính lực tác dụng lên điện tích, thì lực này là:",
    "re": "1 N"
  },
  {
    "con": "Một vật có khối lượng 1kg và vận tốc 5m/s va chạm hoàn toàn đàn hồi với một vật khác có khối lượng 2kg đứng yên. Nếu tính vận tốc của hai vật sau va chạm, thì vận tốc của vật 1 là:",
    "re": "1 m/s"
  },
  {
    "con": "Một mạch điện có điện trở R = 10Ω và nguồn điện áp U = 20V. Nếu tính dòng điện trong mạch, thì dòng điện này là:",
    "re": "2 A"
  },
  {
    "con": "Vật cần chuyển động với vận tốc bao nhiêu để chiều dài của vật giảm đi một nửa so với chiều dài riêng của nó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Lực tác dụng lên một vật tĩnh bằng 0.",
    "re": "Vật sẽ không chuyển động"
  },
  {
    "con": "Năng lượng được bảo toàn trong một hệ kín.",
    "re": "Tổng năng lượng của hệ sẽ không thay đổi"
  },
  {
    "con": "Một vật rơi tự do trong môi trường không có sức cản.",
    "re": "Vật sẽ tăng tốc với gia tốc 9.81 m/s²"
  },
  {
    "con": "Một vật có khối lượng lớn hơn sẽ chịu lực hấp dẫn lớn hơn.",
    "re": "Vật sẽ có trọng lực lớn hơn"
  },
  {
    "con": "Nếu một vật chuyển động tròn đều.",
    "re": "Vật sẽ có gia tốc hướng tâm không đổi"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên.",
    "re": "Thể tích của vật khí sẽ tăng nếu áp suất không đổi"
  },
  {
    "con": "Một sóng âm truyền qua không khí.",
    "re": "Sóng sẽ di chuyển với tốc độ khoảng 343 m/s ở 20 độ C"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước.",
    "re": "Ánh sáng sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Nếu một vật có vận tốc lớn hơn vận tốc âm thanh.",
    "re": "Vật sẽ tạo ra sóng xung kích"
  },
  {
    "con": "Một tia sáng từ thuỷ tinh có chiết suất 1,41 sang không khí sẽ có tia phản xạ khi góc tới thoả mãn đi",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h sẽ có vận tốc v tại thời điểm t nếu h = 0.5 * g * t^2",
    "re": "Vận tốc v = g * t"
  },
  {
    "con": "Nếu một lực F tác dụng lên một vật có khối lượng m thì vật sẽ có gia tốc a nếu F = m * a",
    "re": "Gia tốc a = F/m"
  },
  {
    "con": "Nếu một vật chuyển động tròn đều với bán kính r và vận tốc v thì lực hướng tâm F sẽ được tính bằng công thức F = m * v^2 / r",
    "re": "Lực hướng tâm F = m * v^2 / r"
  },
  {
    "con": "Nếu một sóng âm có tần số f và tốc độ truyền sóng v thì bước sóng λ sẽ được tính bằng công thức λ = v / f",
    "re": "Bước sóng λ = v / f"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một điện trường E thì lực tác dụng lên điện tích sẽ được tính bằng công thức F = q * E",
    "re": "Lực F = q * E"
  },
  {
    "con": "Nếu một vật có năng lượng động năng K thì K sẽ được tính bằng công thức K = 0.5 * m * v^2",
    "re": "Năng lượng động năng K = 0.5 * m * v^2"
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cân bằng thì tổng hợp lực sẽ bằng 0",
    "re": "Vật sẽ đứng yên hoặc chuyển động đều"
  },
  {
    "con": "Nếu một sóng điện từ có tần số f thì năng lượng của photon sẽ được tính bằng công thức E = h * f",
    "re": "Năng lượng E = h * f"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v thì động lượng p sẽ được tính bằng công thức p = m * v",
    "re": "Động lượng p = m * v"
  },
  {
    "con": "Một vật M dao động điều hòa có phương trình tọa độ theo thời gian là x = 5 cos (10t + 2) m. Tìm vận tốc vào thời điểm t.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chịu tác dụng của lực F = ma. Nếu lực tác dụng lên vật tăng lên gấp đôi thì gia tốc của vật cũng tăng lên gấp đôi.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do trong trường hấp dẫn. Nếu không có lực cản thì vật sẽ rơi với gia tốc không đổi là 9.81 m/s².",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sóng âm có tần số f. Nếu tần số tăng lên thì bước sóng sẽ giảm xuống.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m và vận tốc v. Nếu vận tốc tăng lên gấp đôi thì động năng của vật sẽ tăng lên gấp bốn lần.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật đang chuyển động tròn với bán kính R và vận tốc v. Nếu bán kính tăng lên gấp đôi thì lực hướng tâm sẽ giảm đi một nửa.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một điện tích q đặt trong điện trường E. Nếu điện trường tăng lên thì lực tác dụng lên điện tích cũng tăng lên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật dao động điều hòa có biên độ A. Nếu biên độ tăng lên thì năng lượng dao động của vật cũng tăng lên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m và chiều cao h. Nếu chiều cao tăng lên gấp đôi thì năng lượng tiềm năng của vật cũng tăng lên gấp đôi.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sóng điện từ có tần số f. Nếu tần số giảm xuống thì năng lượng của photon sẽ giảm xuống.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 10 kg được treo vào đầu một lò xo khối lượng không đáng kể, có độ cứng 40 N/m. Tìm tần số góc ω và tần số f của dao động điều hòa của vật.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc 20 m/s. Tìm quãng đường đi được sau 5 giây.",
    "re": "Quãng đường đi được là 100 m"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20 m. Tìm thời gian rơi của vật.",
    "re": "Thời gian rơi là khoảng 2.02 giây"
  },
  {
    "con": "Một điện trở có giá trị 10 ohm được nối với nguồn điện 5V. Tìm cường độ dòng điện chạy qua điện trở.",
    "re": "Cường độ dòng điện là 0.5 A"
  },
  {
    "con": "Một vật có khối lượng 2 kg di chuyển với vận tốc 3 m/s. Tính động năng của vật.",
    "re": "Động năng là 9 J"
  },
  {
    "con": "Một lò xo có độ cứng 50 N/m bị nén 0.1 m. Tính năng lượng đàn hồi của lò xo.",
    "re": "Năng lượng đàn hồi là 0.25 J"
  },
  {
    "con": "Một vật có khối lượng 5 kg được kéo lên cao 10 m. Tính công thực hiện để nâng vật.",
    "re": "Công thực hiện là 490 J"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz và tốc độ truyền sóng là 340 m/s. Tính bước sóng của sóng âm.",
    "re": "Bước sóng là 0.773 m"
  },
  {
    "con": "Một vật có khối lượng 1 kg va chạm hoàn toàn đàn hồi với một vật khác có khối lượng 2 kg đang đứng yên. Tính vận tốc của hai vật sau va chạm.",
    "re": "Vận tốc của vật 1 là 0 m/s và vật 2 là 0.667 m/s"
  },
  {
    "con": "Một điện tích 1 C đặt trong điện trường có cường độ 5 N/C. Tính lực tác dụng lên điện tích.",
    "re": "Lực tác dụng là 5 N"
  },
  {
    "con": "Cho một vật nặng M, khối lượng m = 1 kg treo vào một lò xo thẳng đứng có độ cứng k = 400 N/m. Gọi Ox là trục tọa độ có phương trùng với phương dao động của M, và có chiều hướng lên trên, điểm gốc O trùng với vị trí cân bằng. Khi M dao động tự do với biên độ 5 cm, tính động năng E_d1 và E_d2 của quả cầu khi nó đi ngang qua vị trí x_1 = 3 cm và x_2 = -3 cm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v = 10 m/s.",
    "re": "Quãng đường đi được trong 5 giây là 50 m."
  },
  {
    "con": "Một vật rơi tự do từ độ cao h = 20 m.",
    "re": "Thời gian rơi đến mặt đất là khoảng 2.02 giây."
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén một đoạn x = 0.1 m.",
    "re": "Năng lượng dự trữ trong lò xo là 1 J."
  },
  {
    "con": "Một quả cầu có khối lượng m = 2 kg lăn trên mặt phẳng ngang với vận tốc v = 3 m/s.",
    "re": "Động năng của quả cầu là 9 J."
  },
  {
    "con": "Một vật có khối lượng m = 5 kg được kéo lên cao với gia tốc a = 2 m/s².",
    "re": "Lực kéo cần thiết là 35 N."
  },
  {
    "con": "Một vật có khối lượng m = 3 kg đang chuyển động tròn với bán kính r = 2 m và vận tốc v = 4 m/s.",
    "re": "Lực hướng tâm tác dụng lên vật là 6 N."
  },
  {
    "con": "Một sóng âm có tần số f = 440 Hz và vận tốc truyền trong không khí là v = 340 m/s.",
    "re": "Chiều dài sóng là khoảng 0.773 m."
  },
  {
    "con": "Một điện tích q = 1 μC đặt trong điện trường có cường độ E = 1000 N/C.",
    "re": "Lực tác dụng lên điện tích là 1 N."
  },
  {
    "con": "Một mạch điện có điện trở R = 10 Ω và hiệu điện thế U = 20 V.",
    "re": "Dòng điện chạy qua mạch là 2 A."
  },
  {
    "con": "Một lăng kính có góc chiết quang A = 60^0. Góc lệch cực tiểu là Dmin = 30^0. Góc tới i1 có giá trị",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Thời gian rơi t là t = √(2h/g)",
    "re": "Vận tốc cuối cùng v = g * t"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Động năng của vật là K = 1/2 * m * v^2",
    "re": "Nếu vận tốc tăng gấp đôi, động năng sẽ tăng gấp bốn lần"
  },
  {
    "con": "Một lực F tác dụng lên một vật có khối lượng m. Gia tốc a của vật được tính bằng a = F/m",
    "re": "Nếu lực tăng gấp đôi, gia tốc cũng sẽ tăng gấp đôi"
  },
  {
    "con": "Một sóng có tần số f và bước sóng λ. Tốc độ sóng v được tính bằng v = f * λ",
    "re": "Nếu tần số tăng, bước sóng sẽ giảm nếu tốc độ sóng không đổi"
  },
  {
    "con": "Một vật có khối lượng m và vận tốc v va chạm đàn hồi với một vật khác. Động lượng trước va chạm bằng động lượng sau va chạm",
    "re": "Nếu khối lượng vật thứ hai bằng m, vận tốc sau va chạm sẽ thay đổi"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo một khoảng x. Lực phục hồi F được tính bằng F = -k * x",
    "re": "Nếu độ nén hoặc kéo tăng gấp đôi, lực phục hồi sẽ tăng gấp đôi"
  },
  {
    "con": "Một điện tích q đặt trong điện trường E. Lực tác dụng lên điện tích được tính bằng F = q * E",
    "re": "Nếu điện tích tăng gấp đôi, lực tác dụng cũng sẽ tăng gấp đôi"
  },
  {
    "con": "Một vật quay quanh một trục với bán kính r và vận tốc góc ω. Gia tốc hướng tâm a được tính bằng a = ω^2 * r",
    "re": "Nếu vận tốc góc tăng gấp đôi, gia tốc hướng tâm sẽ tăng gấp bốn lần"
  },
  {
    "con": "Một vật chịu tác dụng của trọng lực. Lực trọng trường F = m * g",
    "re": "Nếu khối lượng tăng gấp đôi, lực trọng trường cũng sẽ tăng gấp đôi"
  },
  {
    "con": "Một thanh đồng chất dài L dựa vào một bức tường nhẵn thẳng đứng. Hệ số ma sát nghỉ giữa thanh và sàn là 0,4. Góc mà thanh hợp với sàn nhỏ nhất để thanh không trượt là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v. Nếu thời gian t trôi qua, thì quãng đường mà vật đi được là:",
    "re": "s = v * t"
  },
  {
    "con": "Một vật chịu tác dụng của lực F trong thời gian t. Nếu vật có khối lượng m, thì gia tốc a của vật là:",
    "re": "a = F/m"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo dài một khoảng x. Nếu năng lượng đàn hồi của lò xo là:",
    "re": "E = (1/2)kx^2"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Nếu không có lực cản của không khí, thì vận tốc của vật khi chạm đất là:",
    "re": "v = √(2gh)"
  },
  {
    "con": "Một điện tích q đặt trong điện trường E. Nếu lực tác dụng lên điện tích là F, thì mối quan hệ giữa F, q và E là:",
    "re": "F = qE"
  },
  {
    "con": "Một sóng có tần số f và bước sóng λ. Nếu vận tốc của sóng là v, thì mối quan hệ giữa v, f và λ là:",
    "re": "v = fλ"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Nếu động năng của vật là:",
    "re": "E_k = (1/2)mv^2"
  },
  {
    "con": "Một vật có khối lượng m nằm trên mặt phẳng nghiêng với góc α. Nếu lực tác dụng lên vật là F, thì thành phần lực song song với mặt phẳng là:",
    "re": "F = mg sin(α)"
  },
  {
    "con": "Một dòng điện I chạy qua một điện trở R. Nếu điện trở này có hiệu điện thế U, thì mối quan hệ giữa U, I và R là:",
    "re": "U = IR"
  },
  {
    "con": "Một vật tham gia vào hai dao động điều hòa có cùng tần số thì",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực không đổi thì",
    "re": "Gia tốc của vật sẽ không đổi"
  },
  {
    "con": "Nếu một vật di chuyển theo quỹ đạo tròn với vận tốc không đổi thì",
    "re": "Lực hướng tâm tác dụng lên vật là không đổi"
  },
  {
    "con": "Nếu nhiệt độ của một vật tăng lên thì",
    "re": "Năng lượng nội tại của vật cũng sẽ tăng"
  },
  {
    "con": "Nếu một sóng âm có tần số cao hơn thì",
    "re": "Âm thanh sẽ có cao độ cao hơn"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn thì",
    "re": "Lực hấp dẫn tác dụng lên vật sẽ lớn hơn"
  },
  {
    "con": "Nếu một điện tích dương được đặt trong điện trường thì",
    "re": "Điện tích sẽ chịu tác dụng của lực điện hướng ra xa"
  },
  {
    "con": "Nếu một vật rơi tự do trong chân không thì",
    "re": "Tất cả các vật sẽ rơi với gia tốc giống nhau"
  },
  {
    "con": "Nếu một sóng ánh sáng đi từ môi trường này sang môi trường khác thì",
    "re": "Tốc độ ánh sáng sẽ thay đổi tùy thuộc vào chỉ số khúc xạ của môi trường"
  },
  {
    "con": "Nếu một vật dao động điều hòa thì",
    "re": "Vận tốc của vật sẽ thay đổi theo thời gian"
  },
  {
    "con": "Trên vành của kính lúp có ghi ký hiệu : x 2,5. Tiêu cự của kính lúp có giá trị là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi",
    "re": "Quỹ đạo của vật là một đường thẳng"
  },
  {
    "con": "Lực tác dụng lên một vật có khối lượng m",
    "re": "Vật sẽ có gia tốc a = F/m, với F là lực tác dụng"
  },
  {
    "con": "Một vật rơi tự do trong môi trường không có sức cản",
    "re": "Vật sẽ có gia tốc bằng gia tốc trọng trường g"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt",
    "re": "Năng lượng tổng luôn được bảo toàn trong một hệ kín"
  },
  {
    "con": "Khi một sóng âm đi từ không khí vào nước",
    "re": "Tốc độ sóng âm sẽ tăng lên"
  },
  {
    "con": "Khi một vật bị nén trong lò xo",
    "re": "Năng lượng tiềm năng đàn hồi được lưu trữ trong lò xo"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau",
    "re": "Ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Một điện tích điểm tạo ra một trường điện",
    "re": "Trường điện này có hướng từ điện tích dương ra xa và vào điện tích âm"
  },
  {
    "con": "Khi một vật quay quanh một trục với vận tốc góc không đổi",
    "re": "Lực hướng tâm tác dụng lên vật là không đổi"
  },
  {
    "con": "Một vật có khối lượng 5kg, chuyển động tròn đều với bán kính quỹ đạo bằng 2m, và chu kỳ bằng 10s. Phương trình nào sau đây mô tả đúng chuyển động của vật?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20m, không có lực cản. Thời gian rơi của vật là bao lâu?",
    "re": "Thời gian rơi là khoảng 2.02 giây"
  },
  {
    "con": "Một lực tác dụng lên một vật có khối lượng 10kg, gây ra gia tốc 2m/s². Lực tác dụng là bao nhiêu?",
    "re": "Lực tác dụng là 20N"
  },
  {
    "con": "Một sóng âm có tần số 440Hz và tốc độ truyền sóng là 340m/s. Bước sóng của sóng âm này là bao nhiêu?",
    "re": "Bước sóng là 0.773m"
  },
  {
    "con": "Một vật có khối lượng 3kg di chuyển với vận tốc 4m/s. Động năng của vật là bao nhiêu?",
    "re": "Động năng là 24J"
  },
  {
    "con": "Một vật có khối lượng 2kg được nâng lên cao 5m. Công thực hiện để nâng vật là bao nhiêu?",
    "re": "Công thực hiện là 98J"
  },
  {
    "con": "Một lò xo có độ cứng 300N/m bị nén lại 0.1m. Năng lượng tiềm năng trong lò xo là bao nhiêu?",
    "re": "Năng lượng tiềm năng là 1.5J"
  },
  {
    "con": "Một vật có khối lượng 1kg rơi từ độ cao 10m. Năng lượng cơ học của vật tại điểm cao nhất là bao nhiêu?",
    "re": "Năng lượng cơ học là 98J"
  },
  {
    "con": "Một mạch điện có điện trở 5Ω và dòng điện 2A. Điện áp trên mạch là bao nhiêu?",
    "re": "Điện áp là 10V"
  },
  {
    "con": "Một vật có khối lượng 4kg và vận tốc 3m/s va chạm hoàn toàn đàn hồi với một vật khác có khối lượng 2kg đứng yên. Vận tốc của vật 4kg sau va chạm là bao nhiêu?",
    "re": "Vận tốc của vật 4kg sau va chạm là 2m/s"
  },
  {
    "con": "Một vật có khối lượng m = 1kg được treo vào đầu một lò xo có độ cứng k = 10 N/m, dao động với độ dài tối đa so với vị trí cân bằng là 2m. Tìm vận tốc cực đại của vật.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v = 5 m/s trong 10 giây.",
    "re": "Quá trình chuyển động sẽ đi được quãng đường 50 mét."
  },
  {
    "con": "Một vật rơi tự do từ độ cao h = 20m, không có lực cản không khí.",
    "re": "Thời gian rơi sẽ là khoảng 2.02 giây."
  },
  {
    "con": "Một lực F = 10 N tác động lên một vật có khối lượng m = 2kg.",
    "re": "Vật sẽ có gia tốc a = 5 m/s²."
  },
  {
    "con": "Một vật có khối lượng m = 3kg di chuyển với vận tốc v = 4 m/s va chạm hoàn toàn đàn hồi với một vật khác có khối lượng m' = 3kg đứng yên.",
    "re": "Sau va chạm, hai vật sẽ chuyển động với vận tốc bằng nhau là 2 m/s."
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén một đoạn x = 0.1m.",
    "re": "Lực nén trong lò xo sẽ là F = 20 N."
  },
  {
    "con": "Một vật có khối lượng m = 5kg được kéo lên cao với lực kéo F = 50 N.",
    "re": "Vật sẽ có gia tốc a = 6.67 m/s² nếu bỏ qua trọng lực."
  },
  {
    "con": "Một sóng âm có tần số f = 440 Hz và vận tốc truyền trong không khí là v = 340 m/s.",
    "re": "Chiều dài sóng sẽ là λ = 0.773 m."
  },
  {
    "con": "Một điện trở R = 10 Ω được nối với nguồn điện có hiệu điện thế U = 20 V.",
    "re": "Dòng điện chạy qua điện trở sẽ là I = 2 A."
  },
  {
    "con": "Một vật có khối lượng m = 1kg nằm trên mặt phẳng nghiêng với góc α = 30 độ.",
    "re": "Lực kéo xuống theo phương song song với mặt phẳng sẽ là F = 4.9 N."
  },
  {
    "con": "Mạch dao động chọn sóng của một máy thu gồm một cuộn dây thuần cảm L bằng 0,5mH và tụ điện có điện dung biến đổi được từ 20pF đến 500pF. Máy thu có thể bắt được tất cả các sóng vô tuyến điện có giải sóng nằm trong khoảng nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m và được thả rơi tự do từ độ cao h. Vật sẽ đạt được vận tốc v bằng bao nhiêu khi chạm đất?",
    "re": "v = √(2gh)"
  },
  {
    "con": "Nếu một lực F tác dụng lên một vật có khối lượng m và gây ra gia tốc a, thì lực F có thể được tính bằng công thức nào?",
    "re": "F = ma"
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính r và vận tốc v, thì gia tốc hướng tâm a có thể được tính bằng công thức nào?",
    "re": "a = v²/r"
  },
  {
    "con": "Nếu một sóng âm có tần số f và vận tốc truyền sóng v, thì bước sóng λ của sóng âm đó được tính bằng công thức nào?",
    "re": "λ = v/f"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác, thì tổng động năng của hệ vật sẽ như thế nào?",
    "re": "Tổng động năng được bảo toàn"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một điện trường E, thì công W thực hiện bởi điện trường được tính bằng công thức nào?",
    "re": "W = qEd"
  },
  {
    "con": "Khi một vật chịu tác dụng của trọng lực và không có lực cản, thì nó sẽ rơi tự do với gia tốc như thế nào?",
    "re": "Gia tốc rơi tự do là g ≈ 9.81 m/s²"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và hiệu điện thế U, thì dòng điện I chạy qua mạch được tính bằng công thức nào?",
    "re": "I = U/R"
  },
  {
    "con": "Khi một sóng ánh sáng đi từ môi trường này sang môi trường khác, thì hiện tượng nào xảy ra?",
    "re": "Hiện tượng khúc xạ ánh sáng"
  },
  {
    "con": "Một sợi dây căng ngang AB dài 2m đầu B cố định, đầu A là một nguồn dao động ngang hình sin có chu kì 1/50s. Người ta đếm được từ A đến B có 5 nút A coi là một nút. Nếu muốn dây AB rung thành 2 nút thì tần số dao động là bao nhiêu:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chịu tác dụng của một lực không đổi trong một khoảng thời gian nhất định, thì vật sẽ có một gia tốc không đổi.",
    "re": "Gia tốc của vật sẽ tỷ lệ thuận với lực tác dụng và tỷ lệ nghịch với khối lượng của nó."
  },
  {
    "con": "Nếu một vật chuyển động thẳng đều, thì quãng đường đi được sẽ tỷ lệ thuận với thời gian.",
    "re": "Vận tốc của vật sẽ không thay đổi trong suốt quá trình chuyển động."
  },
  {
    "con": "Nếu một vật rơi tự do trong môi trường không có lực cản, thì vận tốc của vật sẽ tăng theo thời gian.",
    "re": "Gia tốc của vật sẽ bằng gia tốc trọng trường, khoảng 9.81 m/s²."
  },
  {
    "con": "Nếu một lò xo bị nén hoặc kéo ra, thì lực phục hồi của lò xo sẽ tỷ lệ thuận với độ biến dạng của nó.",
    "re": "Lực phục hồi được mô tả bởi định luật Hooke."
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động năng của vật sẽ được tính bằng công thức 1/2 mv².",
    "re": "Động năng của vật sẽ tăng lên khi vận tốc tăng."
  },
  {
    "con": "Nếu một vật quay quanh một trục với vận tốc góc không đổi, thì lực hướng tâm tác dụng lên vật sẽ tỷ lệ thuận với khối lượng và bình phương vận tốc.",
    "re": "Lực hướng tâm được tính bằng công thức F = mv²/r."
  },
  {
    "con": "Nếu một sóng âm truyền qua không khí, thì tốc độ của sóng âm sẽ phụ thuộc vào nhiệt độ của không khí.",
    "re": "Tốc độ sóng âm sẽ tăng khi nhiệt độ không khí tăng."
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một trường điện, thì nó sẽ chịu tác dụng của một lực điện.",
    "re": "Lực điện được tính bằng công thức F = qE, trong đó E là cường độ điện trường."
  },
  {
    "con": "Nếu một vật có khối lượng m và được nâng lên cao h trong trường trọng lực, thì năng lượng thế của vật sẽ được tính bằng công thức mgh.",
    "re": "Năng lượng thế sẽ tăng khi chiều cao h tăng."
  },
  {
    "con": "Một Ôtô khởi hành trên đường nằm ngang với vận tốc 72km/h sau khi chạy nhanh dần đều vượt quãng đường 100m. trần ôtô treo con lắc đơn dài 1m. Cho g = 10m/s2 . Chu kì dao động nhỏ của con lắc đơn là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Nếu h = 20m và g = 10m/s2, thì thời gian rơi của vật là:",
    "re": "2 giây"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0.1m. Nếu năng lượng thế đàn hồi của lò xo là:",
    "re": "1 Joule"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu 20m/s. Nếu g = 10m/s2, thì chiều cao cực đại mà quả bóng đạt được là:",
    "re": "20m"
  },
  {
    "con": "Một vật có khối lượng 5kg chuyển động với vận tốc 10m/s. Nếu lực tác dụng lên vật là 10N, thì gia tốc của vật là:",
    "re": "2 m/s2"
  },
  {
    "con": "Một con lắc đơn dài 2m. Nếu g = 10m/s2, thì chu kỳ dao động của con lắc là:",
    "re": "2.83 giây"
  },
  {
    "con": "Một điện trở có điện trở R = 4Ω và dòng điện chạy qua là 2A. Nếu công suất tiêu thụ của điện trở là:",
    "re": "8W"
  },
  {
    "con": "Một vật có khối lượng 10kg di chuyển với vận tốc 5m/s. Nếu động năng của vật là:",
    "re": "125 Joule"
  },
  {
    "con": "Một sóng âm có tần số 440Hz. Nếu tốc độ âm trong không khí là 340m/s, thì bước sóng của sóng âm là:",
    "re": "0.773m"
  },
  {
    "con": "Một vật có khối lượng 3kg được treo vào một lò xo. Nếu lò xo bị kéo dài 0.2m và độ cứng k = 150 N/m, thì lực kéo của lò xo là:",
    "re": "30N"
  },
  {
    "con": "Một kính hiển vi gồm hai thấu kính hội tụ đồng trục L' và L, tiêu cự 1cm và 3cm dùng làm vật kính và thị kính, đặt cách nhau 22cm. Một quan sát viên có mắt thường, điểm cực cận cách mắt 25cm. Tính độ bội giác khi quan sát viên nhìn ảnh không cần điều tiết.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m và được treo vào một lò xo có độ cứng k, nếu lò xo bị kéo dài một đoạn x thì lực đàn hồi tác dụng lên vật sẽ bằng k*x.",
    "re": "Lực đàn hồi tác dụng lên vật là k*x"
  },
  {
    "con": "Khi một vật chuyển động thẳng đều, nếu vận tốc của vật không thay đổi theo thời gian thì quãng đường đi được sẽ tỉ lệ thuận với thời gian.",
    "re": "Quãng đường đi được tỉ lệ thuận với thời gian"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, thì thời gian rơi của vật sẽ phụ thuộc vào độ cao và gia tốc trọng trường.",
    "re": "Thời gian rơi tỉ lệ với căn bậc hai của độ cao h"
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m, nếu lực này không thay đổi thì gia tốc a của vật sẽ được tính bằng a = F/m.",
    "re": "Gia tốc a của vật là F/m"
  },
  {
    "con": "Nếu một sóng âm có tần số f và vận tốc v, thì bước sóng λ của sóng âm sẽ được tính bằng λ = v/f.",
    "re": "Bước sóng λ là v/f"
  },
  {
    "con": "Khi một vật quay quanh một trục với vận tốc góc ω, nếu bán kính quay là r thì vận tốc tuyến tính v của vật sẽ được tính bằng v = ω*r.",
    "re": "Vận tốc tuyến tính v là ω*r"
  },
  {
    "con": "Nếu một điện tích q đặt trong điện trường E, thì lực điện F tác dụng lên điện tích sẽ được tính bằng F = q*E.",
    "re": "Lực điện F là q*E"
  },
  {
    "con": "Khi một dòng điện I chạy qua một điện trở R, nếu điện trở không thay đổi thì công suất P tiêu thụ sẽ được tính bằng P = I^2*R.",
    "re": "Công suất P là I^2*R"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động năng K của vật sẽ được tính bằng K = 1/2*m*v^2.",
    "re": "Động năng K là 1/2*m*v^2"
  },
  {
    "con": "Treo một vật có khối lượng 1 kg vào một lò xo có độ cứng k = 98 N/m. kéo vật ra khỏi vị trí cân bằng, về phía dưới, đến vị trí x = 5 cm rồi thả ra. Tìm gia tốc cực đại của dao động điều hòa của vật.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h = 20 m. Tính thời gian vật rơi đến mặt đất.",
    "re": "Thời gian rơi là khoảng 2,02 giây"
  },
  {
    "con": "Một vật có khối lượng 2 kg di chuyển với vận tốc 3 m/s. Tính động năng của vật.",
    "re": "Động năng là 9 J"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén lại 10 cm. Tính năng lượng tiềm năng đàn hồi của lò xo.",
    "re": "Năng lượng tiềm năng đàn hồi là 1 J"
  },
  {
    "con": "Một vật có khối lượng 5 kg được kéo lên cao với gia tốc 2 m/s². Tính lực kéo cần thiết.",
    "re": "Lực kéo cần thiết là 35 N"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz di chuyển trong không khí với tốc độ 340 m/s. Tính bước sóng của sóng âm.",
    "re": "Bước sóng là 0,773 m"
  },
  {
    "con": "Một điện tích q = 1 μC đặt trong điện trường đều có cường độ E = 1000 N/C. Tính lực tác dụng lên điện tích.",
    "re": "Lực tác dụng là 1 N"
  },
  {
    "con": "Một vật có khối lượng 10 kg được đặt trên mặt phẳng nghiêng với góc α = 30°. Tính lực ma sát tối đa nếu hệ số ma sát là 0,2.",
    "re": "Lực ma sát tối đa là 4 N"
  },
  {
    "con": "Một mạch điện có điện trở R = 5 Ω và hiệu điện thế U = 10 V. Tính dòng điện chạy qua mạch.",
    "re": "Dòng điện chạy qua mạch là 2 A"
  },
  {
    "con": "Một vật dao động điều hòa với tần số f = 2 Hz. Tính chu kỳ dao động.",
    "re": "Chu kỳ dao động là 0,5 s"
  },
  {
    "con": "Một vật M dao động điều hòa dọc theo trục Ox. Chuyển động của vật được biểu thị bằng phương trình x = 5 cos(2πt + 2)m. Tìm độ dài cực đại của M so với vị trí cân bằng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m rơi tự do từ độ cao h. Nếu không có lực cản của không khí, thì vật sẽ đạt vận tốc tối đa v = √(2gh) khi chạm đất.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v. Nếu thời gian t trôi qua, thì quãng đường đi được S = vt.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo dài một khoảng x. Nếu lực tác dụng F lên lò xo, thì F = kx theo định luật Hooke.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một điện tích q đặt trong điện trường E. Nếu điện trường có hướng từ trái sang phải, thì lực tác dụng lên điện tích F = qE sẽ có hướng từ trái sang phải.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Nếu vật va chạm hoàn toàn đàn hồi với một vật khác, thì tổng động năng của hệ sẽ được bảo toàn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sóng âm có tần số f. Nếu tốc độ âm thanh trong không khí là v, thì bước sóng λ = v/f.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chịu tác dụng của hai lực F1 và F2. Nếu hai lực này cân bằng, thì tổng hợp lực F = F1 + F2 = 0.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m quay quanh một trục với bán kính r. Nếu vật quay với vận tốc góc ω, thì lực hướng tâm F = mω²r.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất rắn có nhiệt độ T. Nếu nhiệt độ tăng lên ΔT, thì năng lượng nhiệt Q hấp thụ được tính bằng Q = mcΔT, với c là nhiệt dung riêng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong một thí nghiệm I-âng đối với ánh sáng trắng, khoảng cách giữa hai khe sáng là 0,5mm, D = 3m. Tại vị trí cách vân trung tâm 1 khoảng 2cm có bao nhiêu cực đại của các màu trùng nhau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật chuyển động thẳng đều, nếu lực tác dụng lên vật bằng 0:",
    "re": "Vật sẽ duy trì vận tốc không đổi"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, không có lực cản của không khí:",
    "re": "Vật sẽ đạt vận tốc tối đa khi chạm đất"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nếu góc tới lớn hơn góc tới giới hạn:",
    "re": "Ánh sáng sẽ bị phản xạ hoàn toàn"
  },
  {
    "con": "Nếu một lò xo bị nén hoặc kéo ra một khoảng x, thì lực phục hồi F sẽ tỉ lệ thuận với độ biến dạng x:",
    "re": "F = -kx, với k là hằng số lò xo"
  },
  {
    "con": "Khi một điện tích q di chuyển trong một trường điện đều, nếu điện trường có độ lớn E:",
    "re": "Điện tích sẽ chịu một lực F = qE"
  },
  {
    "con": "Nếu một sóng âm có tần số f và tốc độ truyền sóng v trong không khí:",
    "re": "Chiều dài sóng λ sẽ được tính bằng công thức λ = v/f"
  },
  {
    "con": "Khi một vật có khối lượng m di chuyển với vận tốc v, nếu nó va chạm hoàn toàn đàn hồi với một vật khác:",
    "re": "Tổng động lượng trước và sau va chạm sẽ được bảo toàn"
  },
  {
    "con": "Nếu một chất rắn được nung nóng và chuyển sang trạng thái lỏng:",
    "re": "Năng lượng cần thiết để thực hiện quá trình này gọi là nhiệt hóa hơi"
  },
  {
    "con": "Khi một điện trở R được nối với một nguồn điện có hiệu điện thế U:",
    "re": "Cường độ dòng điện I chạy qua điện trở sẽ được tính bằng công thức I = U/R"
  },
  {
    "con": "Một gương cầu lõm có bán kính 3m. Một vật AB đặt vuông góc với trục chính tại điểm A trước gương 60cm. Hãy xác định vị trí, tính chất của ảnh?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2kg được treo vào một lò xo có độ cứng 100 N/m. Hãy tính độ biến dạng của lò xo khi vật ở trạng thái cân bằng.",
    "re": "Độ biến dạng của lò xo là 0.2m"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc 10 m/s. Hãy xác định quãng đường vật đi được sau 5 giây.",
    "re": "Quãng đường vật đi được là 50m"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu 20 m/s. Hãy tính chiều cao tối đa mà quả bóng đạt được.",
    "re": "Chiều cao tối đa là 20m"
  },
  {
    "con": "Một điện trở có giá trị 10 ohm được nối với nguồn điện 5V. Hãy tính cường độ dòng điện chạy qua điện trở.",
    "re": "Cường độ dòng điện là 0.5 A"
  },
  {
    "con": "Một vật có khối lượng 5kg rơi tự do từ độ cao 20m. Hãy tính vận tốc của vật khi chạm đất.",
    "re": "Vận tốc khi chạm đất là 20 m/s"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz và vận tốc truyền trong không khí là 340 m/s. Hãy tính bước sóng của sóng âm này.",
    "re": "Bước sóng là 0.772 m"
  },
  {
    "con": "Một vật có khối lượng 3kg di chuyển với vận tốc 4 m/s. Hãy tính động năng của vật.",
    "re": "Động năng của vật là 24 J"
  },
  {
    "con": "Một lò xo có độ cứng 200 N/m bị nén lại 0.1m. Hãy tính năng lượng dự trữ trong lò xo.",
    "re": "Năng lượng dự trữ là 1 J"
  },
  {
    "con": "Một vật có khối lượng 10kg được kéo lên cao với gia tốc 2 m/s². Hãy tính lực kéo cần thiết.",
    "re": "Lực kéo cần thiết là 120 N"
  },
  {
    "con": "Ảnh bằng 1/3 vật. Đặt vật sáng đặt trước gương cách 10 cm, tiêu cự của gương là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi, thì quãng đường đi được tỉ lệ thuận với thời gian.",
    "re": "Quy luật chuyển động thẳng đều"
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng m, thì vật sẽ có gia tốc a tỉ lệ thuận với lực và tỉ lệ nghịch với khối lượng.",
    "re": "Định luật II Newton: F = m * a"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, thì thời gian rơi tỉ lệ với căn bậc hai của độ cao.",
    "re": "Thời gian rơi tự do"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác, thì góc khúc xạ tỉ lệ với tỉ số của chỉ số khúc xạ của hai môi trường.",
    "re": "Định luật Snell"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động năng của vật là 1/2 m*v^2.",
    "re": "Công thức tính động năng"
  },
  {
    "con": "Khi một vật chịu tác dụng của lực đàn hồi, thì lực này tỉ lệ thuận với độ biến dạng của vật.",
    "re": "Định luật Hooke"
  },
  {
    "con": "Nếu một điện tích q đặt trong điện trường E, thì lực tác dụng lên điện tích là F = q * E.",
    "re": "Công thức tính lực trong điện trường"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí, thì tốc độ của sóng âm tỉ lệ với nhiệt độ của không khí.",
    "re": "Tốc độ sóng âm trong không khí"
  },
  {
    "con": "Nếu một vật có khối lượng m và nhiệt độ tăng lên ΔT, thì nhiệt lượng mà vật nhận được là Q = m * c * ΔT, với c là nhiệt dung riêng.",
    "re": "Công thức tính nhiệt lượng"
  },
  {
    "con": "Khi soi gương ta thấy",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Năng lượng được bảo toàn trong một hệ kín",
    "re": "Tổng năng lượng trước và sau tương tác là như nhau"
  },
  {
    "con": "Một vật rơi tự do trong trường hấp dẫn",
    "re": "Chịu tác động của trọng lực mà không có lực cản"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nội tại của vật cũng tăng theo"
  },
  {
    "con": "Một sóng âm truyền trong không khí",
    "re": "Có tần số và biên độ xác định"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác",
    "re": "Sẽ xảy ra hiện tượng khúc xạ"
  },
  {
    "con": "Một điện tích đặt trong điện trường",
    "re": "Sẽ chịu lực tác dụng từ điện trường"
  },
  {
    "con": "Khi một vật dao động điều hòa",
    "re": "Có tần số và biên độ không đổi"
  },
  {
    "con": "Khi một lực tác dụng lên một vật",
    "re": "Vật sẽ thay đổi vận tốc của nó"
  },
  {
    "con": "Định nghĩa nào sau đây về sóng cơ là đúng nhất ? Sóng cơ là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì",
    "re": "vận tốc của nó không thay đổi theo thời gian"
  },
  {
    "con": "Khi một lực tác động lên một vật có khối lượng m thì",
    "re": "vật sẽ có gia tốc tỉ lệ thuận với lực và tỉ lệ nghịch với khối lượng"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt thì",
    "re": "năng lượng tổng luôn được bảo toàn trong một hệ kín"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên thì",
    "re": "năng lượng động học của các phân tử trong vật đó cũng tăng lên"
  },
  {
    "con": "Nếu một sóng âm truyền qua không khí thì",
    "re": "nó sẽ di chuyển với tốc độ khoảng 343 m/s ở nhiệt độ phòng"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước thì",
    "re": "tốc độ ánh sáng giảm và ánh sáng bị khúc xạ"
  },
  {
    "con": "Nếu một điện tích dương đặt trong một điện trường thì",
    "re": "nó sẽ chịu tác động của lực điện theo hướng của điện trường"
  },
  {
    "con": "Khi một vật rơi tự do thì",
    "re": "nó sẽ chịu tác động của trọng lực và gia tốc rơi tự do là 9.81 m/s²"
  },
  {
    "con": "Nếu một vật có động năng thì",
    "re": "nó đang chuyển động và có khả năng thực hiện công"
  },
  {
    "con": "Một gương cầu lồi có R = 12 cm. Vật sáng AB vuông góc với trục chính cho ảnh ảo bằng nửa vật. Vật và ảnh cách gương:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi:",
    "re": "Quỹ đạo của vật là một đường thẳng"
  },
  {
    "con": "Một vật chịu tác dụng của lực không đổi trong một khoảng thời gian:",
    "re": "Vận tốc của vật sẽ thay đổi theo thời gian"
  },
  {
    "con": "Một lò xo tuân theo định luật Hooke:",
    "re": "Lực kéo hoặc nén của lò xo tỉ lệ thuận với độ biến dạng của nó"
  },
  {
    "con": "Một vật rơi tự do trong môi trường không có sức cản:",
    "re": "Vật sẽ tăng tốc với gia tốc bằng gia tốc trọng trường"
  },
  {
    "con": "Một sóng âm truyền trong không khí:",
    "re": "Tốc độ của sóng âm phụ thuộc vào nhiệt độ của không khí"
  },
  {
    "con": "Một điện tích điểm đặt trong điện trường:",
    "re": "Điện tích sẽ chịu tác dụng của lực điện"
  },
  {
    "con": "Một mạch điện có điện trở và nguồn điện nối tiếp:",
    "re": "Cường độ dòng điện trong mạch là không đổi"
  },
  {
    "con": "Một vật có khối lượng m và vận tốc v va chạm hoàn toàn đàn hồi với vật khác:",
    "re": "Tổng động năng và tổng động lượng của hệ vật được bảo toàn"
  },
  {
    "con": "Một ánh sáng đơn sắc đi từ không khí vào nước:",
    "re": "Ánh sáng sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Mắt một người có đặc điểm sau: OCC = 5cm, OCV = 1m. Kết luận nào sau đây là đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi.",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Một vật rơi tự do trong môi trường không có lực cản.",
    "re": "Vật sẽ tăng tốc với gia tốc 9.81 m/s²"
  },
  {
    "con": "Năng lượng được bảo toàn trong một hệ kín.",
    "re": "Tổng năng lượng của hệ không thay đổi theo thời gian"
  },
  {
    "con": "Một lò xo bị nén hoặc kéo ra.",
    "re": "Lực phục hồi tỉ lệ thuận với độ biến dạng của lò xo"
  },
  {
    "con": "Một vật có khối lượng m và vận tốc v.",
    "re": "Động lượng của vật là p = mv"
  },
  {
    "con": "Một sóng âm truyền qua không khí.",
    "re": "Tốc độ của sóng âm phụ thuộc vào nhiệt độ và áp suất của không khí"
  },
  {
    "con": "Một điện tích q đặt trong điện trường E.",
    "re": "Lực tác dụng lên điện tích là F = qE"
  },
  {
    "con": "Một vật quay quanh trục với tốc độ góc không đổi.",
    "re": "Lực ly tâm tác dụng lên vật tỉ lệ với khối lượng và bình phương tốc độ"
  },
  {
    "con": "Một chất rắn được nung nóng.",
    "re": "Thể tích của chất rắn sẽ không thay đổi nhiều, nhưng có thể có sự giãn nở nhiệt"
  },
  {
    "con": "Một người viễn thị có khoảng nhìn rõ ngắn nhất là 40 cm. Tính độ tụ của kính mà người ấy đeo sát mắt để có thể đọc được các dòng chữ cách mắt gần nhất là 25 cm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2 kg và được thả rơi tự do từ độ cao 10 m. Tính vận tốc của vật khi chạm đất.",
    "re": "Vận tốc đạt khoảng 14 m/s"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0.1 m. Tính năng lượng tiềm năng của lò xo.",
    "re": "Năng lượng tiềm năng là 1 J"
  },
  {
    "con": "Một điện trở có điện trở R = 10 Ω và được nối với nguồn điện áp U = 20 V. Tính dòng điện chạy qua điện trở.",
    "re": "Dòng điện chạy qua là 2 A"
  },
  {
    "con": "Một vật có khối lượng 5 kg di chuyển với vận tốc 3 m/s. Tính động năng của vật.",
    "re": "Động năng là 22.5 J"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz và tốc độ truyền sóng là 340 m/s. Tính bước sóng của sóng âm.",
    "re": "Bước sóng là 0.773 m"
  },
  {
    "con": "Một vật có khối lượng 1 kg được kéo lên cao 5 m. Tính công cần thiết để kéo vật lên.",
    "re": "Công cần thiết là 50 J"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu 20 m/s. Tính chiều cao tối đa mà quả bóng đạt được.",
    "re": "Chiều cao tối đa là 20.4 m"
  },
  {
    "con": "Một mạch điện có điện trở R = 5 Ω và nguồn điện áp U = 10 V. Tính công suất tiêu thụ của mạch.",
    "re": "Công suất tiêu thụ là 20 W"
  },
  {
    "con": "Một vật có khối lượng 3 kg chuyển động tròn với bán kính 2 m và vận tốc 4 m/s. Tính gia tốc hướng tâm của vật.",
    "re": "Gia tốc hướng tâm là 8 m/s²"
  },
  {
    "con": "Một con lắc đơn dài 25cm, hòn bi có khối lượng 10g mang điện tích 10^-4C. Cho g = 10m/s2. Treo con lắc giữa hai bản kim loại song song thẳng đứng cách nhau 20cm. Đặt hai bản dưới hiệu điện thế 1 chiều 80V. Chu kì dao động của con lắc với biên độ nhỏ là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2kg rơi tự do từ độ cao 20m. Nếu không có lực cản của không khí, thì vận tốc của vật khi chạm đất là:",
    "re": "Vận tốc là 20m/s"
  },
  {
    "con": "Một lò xo có độ cứng k = 100 N/m bị nén 0.1m. Nếu lò xo được thả ra, thì năng lượng đàn hồi của lò xo là:",
    "re": "Năng lượng đàn hồi là 0.5J"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc 5m/s. Nếu thời gian chuyển động là 10s, thì quãng đường vật đi được là:",
    "re": "Quãng đường là 50m"
  },
  {
    "con": "Một điện tích điểm q = 1μC đặt trong điện trường đều có cường độ E = 2000 N/C. Nếu điện tích này chịu tác dụng của lực điện, thì lực tác dụng lên điện tích là:",
    "re": "Lực là 2N"
  },
  {
    "con": "Một sóng âm có tần số 440Hz. Nếu tốc độ âm thanh trong không khí là 340m/s, thì bước sóng của sóng âm này là:",
    "re": "Bước sóng là 0.773m"
  },
  {
    "con": "Một vật có khối lượng 3kg di chuyển với vận tốc 4m/s. Nếu vật va chạm hoàn toàn đàn hồi với một vật khác có khối lượng 2kg đứng yên, thì vận tốc của vật 3kg sau va chạm là:",
    "re": "Vận tốc là 2m/s"
  },
  {
    "con": "Một điện trở có giá trị R = 10Ω được nối với nguồn điện có hiệu điện thế U = 20V. Nếu dòng điện chạy qua điện trở là I, thì giá trị của dòng điện là:",
    "re": "Dòng điện là 2A"
  },
  {
    "con": "Một vật có khối lượng 5kg được treo vào một sợi dây. Nếu vật đứng yên, thì lực kéo của dây là:",
    "re": "Lực kéo là 50N"
  },
  {
    "con": "Một con lắc đơn có chiều dài 1m. Nếu gia tốc trọng trường g = 9.81m/s², thì chu kỳ dao động của con lắc là:",
    "re": "Chu kỳ dao động là 2s"
  },
  {
    "con": "Mắt của một người có khoảng cách cực cận và cực viễn OCv = 100cm, OCc = 15cm. Trong các phát biểu sau, phát biểu nào là đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi.",
    "re": "Quán tính của vật không thay đổi theo thời gian"
  },
  {
    "con": "Một lực tác dụng lên một vật có khối lượng m.",
    "re": "Vật sẽ có gia tốc a = F/m, với F là lực tác dụng"
  },
  {
    "con": "Năng lượng không thể tự sinh ra hoặc mất đi trong một hệ kín.",
    "re": "Năng lượng tổng trong hệ luôn được bảo toàn"
  },
  {
    "con": "Một vật rơi tự do trong trường hấp dẫn của Trái Đất.",
    "re": "Vật sẽ có gia tốc rơi tự do khoảng 9.81 m/s²"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau.",
    "re": "Ánh sáng sẽ bị bẻ cong tại bề mặt phân cách giữa hai môi trường"
  },
  {
    "con": "Một sóng âm truyền trong không khí.",
    "re": "Sóng âm sẽ lan truyền dưới dạng dao động của các phân tử không khí"
  },
  {
    "con": "Một điện tích điểm đặt trong điện trường.",
    "re": "Điện tích sẽ chịu tác dụng của lực điện F = qE, với q là điện tích và E là cường độ điện trường"
  },
  {
    "con": "Một vật có khối lượng m và vận tốc v va chạm với một vật khác.",
    "re": "Động lượng của hệ sẽ được bảo toàn nếu không có lực bên ngoài tác dụng"
  },
  {
    "con": "Một vật dao động điều hòa với biên độ A và tần số f.",
    "re": "Phương trình dao động của vật có dạng x(t) = A cos(2πft + φ)"
  },
  {
    "con": "Hàm nào sau đây biểu thị đường biểu diễn thế năng trong dao động điều hòa đơn giản?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì quỹ đạo của nó là một đường thẳng.",
    "re": "Quỹ đạo của vật là một đường thẳng"
  },
  {
    "con": "Nếu lực tác dụng lên một vật không đổi và hướng của lực không thay đổi thì vật sẽ có gia tốc không đổi.",
    "re": "Vật sẽ có gia tốc không đổi"
  },
  {
    "con": "Khi một vật rơi tự do thì gia tốc của nó là gia tốc trọng trường.",
    "re": "Gia tốc của vật là gia tốc trọng trường"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn thì lực hấp dẫn tác dụng lên nó sẽ lớn hơn.",
    "re": "Lực hấp dẫn tác dụng lên vật lớn hơn"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí thì nó sẽ di chuyển với tốc độ phụ thuộc vào nhiệt độ của không khí.",
    "re": "Tốc độ sóng âm phụ thuộc vào nhiệt độ"
  },
  {
    "con": "Nếu một vật dao động với tần số cao thì năng lượng của nó sẽ lớn hơn.",
    "re": "Năng lượng của vật sẽ lớn hơn"
  },
  {
    "con": "Khi một điện tích di chuyển trong từ trường thì nó sẽ chịu tác dụng của lực Lorentz.",
    "re": "Điện tích sẽ chịu tác dụng của lực Lorentz"
  },
  {
    "con": "Nếu một vật có động năng lớn thì nó sẽ có vận tốc lớn.",
    "re": "Vật sẽ có vận tốc lớn"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác thì nó sẽ bị khúc xạ.",
    "re": "Ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Một vật rơi tự do trong trường hấp dẫn",
    "re": "Vật sẽ tăng tốc với gia tốc 9.81 m/s²"
  },
  {
    "con": "Năng lượng được bảo toàn trong một hệ kín",
    "re": "Tổng năng lượng của hệ không thay đổi theo thời gian"
  },
  {
    "con": "Một sóng âm truyền trong không khí",
    "re": "Tần số của sóng âm quyết định cao độ của âm thanh"
  },
  {
    "con": "Một vật có khối lượng lớn hơn một vật khác",
    "re": "Vật có khối lượng lớn hơn sẽ có trọng lực tác dụng lớn hơn"
  },
  {
    "con": "Một điện tích dương đặt trong điện trường",
    "re": "Điện tích sẽ chịu lực tác dụng theo hướng của điện trường"
  },
  {
    "con": "Một lò xo bị nén hoặc kéo",
    "re": "Lực phục hồi của lò xo tỷ lệ thuận với độ biến dạng của nó"
  },
  {
    "con": "Một vật chuyển động tròn đều",
    "re": "Vật sẽ có gia tốc hướng tâm không đổi"
  },
  {
    "con": "Một sóng ánh sáng đi từ không khí vào nước",
    "re": "Sóng ánh sáng sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Một phản ứng hóa học xảy ra trong một hệ kín",
    "re": "Tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm"
  },
  {
    "con": "Phát biểu nào sau đây là đúng cho mắt cận thị?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật khối lượng m = 1kg dao động điều hoà theo phương ngang với chu kì 2s. Vật qua vị trí cân bằng với vận tốc 31,3cm/s. Chọn t = 0 là lúc vật qua vị trí cân bằng theo chiều dương. Tại thời điểm t = 0,5s thì lục hồi phục lên vật có giá trị bằng bao nhiêu:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chịu tác dụng của lực F = ma, với m là khối lượng và a là gia tốc. Nếu khối lượng m tăng lên gấp đôi thì gia tốc a sẽ giảm đi một nửa.",
    "re": "Gia tốc a giảm đi một nửa"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Nếu độ cao h tăng lên gấp đôi thì thời gian rơi t sẽ tăng lên theo căn bậc hai của 2.",
    "re": "Thời gian rơi t tăng lên theo căn bậc hai của 2"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Nếu vận tốc v tăng lên gấp đôi thì động năng K của vật sẽ tăng lên gấp bốn lần.",
    "re": "Động năng K tăng lên gấp bốn lần"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo ra một khoảng x. Nếu khoảng x tăng lên gấp đôi thì lực đàn hồi F sẽ tăng lên gấp đôi.",
    "re": "Lực đàn hồi F tăng lên gấp đôi"
  },
  {
    "con": "Một vật có khối lượng m và vận tốc v va chạm đàn hồi với một vật khác. Nếu khối lượng của vật thứ hai gấp đôi thì vận tốc sau va chạm của vật thứ nhất sẽ thay đổi theo một tỷ lệ nhất định.",
    "re": "Vận tốc sau va chạm của vật thứ nhất thay đổi theo một tỷ lệ nhất định"
  },
  {
    "con": "Một sóng có tần số f và bước sóng λ. Nếu tần số f tăng lên gấp đôi thì bước sóng λ sẽ giảm đi một nửa.",
    "re": "Bước sóng λ giảm đi một nửa"
  },
  {
    "con": "Một vật có khối lượng m và vận tốc v va chạm không đàn hồi với một vật khác. Nếu khối lượng của vật thứ hai gấp đôi thì vận tốc sau va chạm sẽ giảm đi.",
    "re": "Vận tốc sau va chạm sẽ giảm đi"
  },
  {
    "con": "Một điện trở R được nối với một nguồn điện có hiệu điện thế U. Nếu điện trở R tăng lên gấp đôi thì dòng điện I sẽ giảm đi một nửa.",
    "re": "Dòng điện I giảm đi một nửa"
  },
  {
    "con": "Một vật có khối lượng m và nhiệt độ T. Nếu khối lượng m tăng lên gấp đôi thì năng lượng nhiệt Q cần để tăng nhiệt độ lên một độ sẽ tăng lên gấp đôi.",
    "re": "Năng lượng nhiệt Q tăng lên gấp đôi"
  },
  {
    "con": "Người ta vận dụng định luật truyền thẳng của ánh sáng vào việc giải thích hiện tượng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chịu tác dụng của lực không đổi trong một khoảng thời gian nhất định",
    "re": "Vật đó sẽ có gia tốc không đổi"
  },
  {
    "con": "Năng lượng được bảo toàn trong một hệ kín",
    "re": "Tổng năng lượng của hệ sẽ không thay đổi theo thời gian"
  },
  {
    "con": "Một vật chuyển động tròn đều",
    "re": "Vật đó sẽ có gia tốc hướng tâm không đổi"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nội tại của vật đó cũng sẽ tăng lên"
  },
  {
    "con": "Một sóng âm truyền qua môi trường",
    "re": "Tốc độ của sóng âm phụ thuộc vào tính chất của môi trường đó"
  },
  {
    "con": "Khi một điện tích di chuyển trong một từ trường",
    "re": "Điện tích đó sẽ chịu tác dụng của lực Lorentz"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau",
    "re": "Ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Một vật có khối lượng lớn hơn sẽ có trọng lực tác động mạnh hơn",
    "re": "Vật đó sẽ có trọng lực lớn hơn so với vật có khối lượng nhỏ hơn"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác",
    "re": "Tổng động năng của hai vật sẽ được bảo toàn"
  },
  {
    "con": "Một lò xo khi chưa treo vật gì vào thì có chiều dài bằng 10 cm; Sau khi treo một vật có khối lượng m = 1 kg, lò xo dài 20 cm. Khối lượng lò xo xem như không đáng kể, g = 9,8 m/s^2. Tìm độ cứng k của lò xo.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h = 20 m; Nếu không có lực cản của không khí, thì thời gian rơi của vật là khoảng 2,02 giây.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một quả cầu có khối lượng m = 0,5 kg được ném thẳng đứng lên với vận tốc ban đầu v0 = 10 m/s; Nếu không có lực cản, thì chiều cao tối đa mà quả cầu đạt được là khoảng 5,1 m.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m = 2 kg được kéo trên mặt phẳng nằm ngang với lực kéo F = 10 N; Nếu hệ số ma sát giữa vật và mặt phẳng là 0,2, thì gia tốc của vật là khoảng 3,33 m/s^2.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một mạch điện có điện trở R = 5 Ω và nguồn điện áp U = 10 V; Nếu áp dụng định luật Ohm, thì dòng điện chạy qua mạch là 2 A.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sóng âm có tần số f = 440 Hz; Nếu tốc độ âm thanh trong không khí là 340 m/s, thì bước sóng của sóng âm này là khoảng 0,77 m.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m = 3 kg di chuyển với vận tốc v = 4 m/s; Nếu tính động năng của vật, thì động năng là 24 J.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén lại một đoạn x = 0,1 m; Nếu tính năng lượng tiềm năng đàn hồi của lò xo, thì năng lượng này là 1 J.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m = 1 kg được đặt trên mặt phẳng nghiêng với góc α = 30 độ; Nếu tính lực kéo xuống của trọng lực theo phương song song với mặt phẳng nghiêng, thì lực này là khoảng 4,9 N.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m = 5 kg được treo vào một dây cáp; Nếu trọng lực tác dụng lên vật là 49 N, thì gia tốc trọng trường g là 9,8 m/s^2.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Vật sáng AB đặt cách thấu kính 30cm qua thấu kính cho ảnh ảo A’B’ cao bằng nửa vật. Hỏi tiêu cự của thấu kính nhận giá trị nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2kg và chịu tác dụng của lực 10N. Hỏi gia tốc của vật là bao nhiêu?",
    "re": "Gia tốc của vật là 5 m/s²"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu 20 m/s. Hỏi chiều cao tối đa mà quả bóng đạt được là bao nhiêu?",
    "re": "Chiều cao tối đa là 20 m"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 45m. Hỏi thời gian vật rơi xuống đất là bao lâu?",
    "re": "Thời gian rơi xuống đất là 3 giây"
  },
  {
    "con": "Một dòng điện có cường độ 2A chạy qua một điện trở 5Ω. Hỏi điện áp trên điện trở là bao nhiêu?",
    "re": "Điện áp trên điện trở là 10V"
  },
  {
    "con": "Một lò xo có độ cứng 200 N/m bị nén 0.1m. Hỏi năng lượng lưu trữ trong lò xo là bao nhiêu?",
    "re": "Năng lượng lưu trữ là 1J"
  },
  {
    "con": "Một vật có khối lượng 1kg di chuyển với vận tốc 10 m/s. Hỏi động năng của vật là bao nhiêu?",
    "re": "Động năng của vật là 50J"
  },
  {
    "con": "Một sóng âm có tần số 440Hz. Hỏi chu kỳ của sóng âm này là bao nhiêu?",
    "re": "Chu kỳ của sóng âm là 0.00227s"
  },
  {
    "con": "Một vật có khối lượng 3kg được kéo lên cao với lực 30N. Hỏi công thực hiện để nâng vật lên 1m là bao nhiêu?",
    "re": "Công thực hiện là 30J"
  },
  {
    "con": "Một thấu kính hội tụ có tiêu cự 10cm. Hỏi vật đặt cách thấu kính 30cm sẽ cho ảnh thật hay ảo?",
    "re": "Ảnh thật"
  },
  {
    "con": "Cho một gương với tiêu cự 1,5(m). Một vật nhỏ AB đặt vuông góc với trục chính của gương cách gương 60(cm). Hãy xác định vị trí, tính chất của ảnh.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2 kg được thả rơi tự do từ độ cao 10 m. Hãy tính vận tốc của vật khi chạm đất.",
    "re": "Vận tốc của vật khi chạm đất là 14 m/s"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0,1 m. Hãy tính năng lượng tiềm năng đàn hồi của lò xo.",
    "re": "Năng lượng tiềm năng đàn hồi là 1 J"
  },
  {
    "con": "Một vật có khối lượng 5 kg chuyển động với vận tốc 10 m/s. Hãy tính động năng của vật.",
    "re": "Động năng của vật là 250 J"
  },
  {
    "con": "Một điện tích điểm q = 1 μC đặt trong điện trường đều có cường độ 1000 N/C. Hãy tính lực tác dụng lên điện tích.",
    "re": "Lực tác dụng lên điện tích là 1 N"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz và tốc độ truyền sóng là 340 m/s. Hãy tính bước sóng của sóng âm.",
    "re": "Bước sóng của sóng âm là 0,773 m"
  },
  {
    "con": "Một vật có khối lượng 3 kg di chuyển trên mặt phẳng nằm ngang với lực kéo 15 N. Hãy tính gia tốc của vật.",
    "re": "Gia tốc của vật là 5 m/s²"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu 20 m/s. Hãy tính chiều cao tối đa mà quả bóng đạt được.",
    "re": "Chiều cao tối đa là 20,4 m"
  },
  {
    "con": "Một mạch điện có điện trở R = 10 Ω và hiệu điện thế U = 20 V. Hãy tính cường độ dòng điện trong mạch.",
    "re": "Cường độ dòng điện trong mạch là 2 A"
  },
  {
    "con": "Một vật có khối lượng 4 kg được treo vào một lò xo có độ cứng k = 100 N/m. Hãy tính độ biến dạng của lò xo.",
    "re": "Độ biến dạng của lò xo là 0,4 m"
  },
  {
    "con": "Vật sáng AB vuông góc với trục chính của một gương cầu sẽ có ảnh A’B’ cùng chiều cao bằng một nửa AB và cách AB 30 cm. Tiêu cự f của gương là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi sẽ có quỹ đạo là một đường thẳng",
    "re": "Quá trình chuyển động của vật là đồng nhất"
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng m, thì vật sẽ có gia tốc a tỉ lệ thuận với lực và tỉ lệ nghịch với khối lượng",
    "re": "Gia tốc của vật được tính theo định luật Newton thứ hai"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, thì thời gian rơi t sẽ được tính bằng công thức t = √(2h/g), với g là gia tốc trọng trường",
    "re": "Vật sẽ chạm đất sau thời gian t"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau, thì góc khúc xạ sẽ thay đổi theo định luật Snell",
    "re": "Ánh sáng sẽ bị bẻ cong tại bề mặt phân cách"
  },
  {
    "con": "Nếu một dòng điện chạy qua một dây dẫn có điện trở R, thì công suất P của dòng điện sẽ được tính bằng công thức P = I²R, với I là cường độ dòng điện",
    "re": "Công suất tiêu thụ của dây dẫn sẽ được xác định"
  },
  {
    "con": "Khi một vật dao động điều hòa với biên độ A và tần số f, thì phương trình dao động sẽ có dạng x(t) = A cos(2πft + φ)",
    "re": "Vị trí của vật tại thời điểm t sẽ được xác định"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động năng của vật sẽ được tính bằng công thức Ek = 1/2 mv²",
    "re": "Động năng của vật sẽ được xác định"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí, thì tốc độ của sóng âm sẽ phụ thuộc vào nhiệt độ của không khí",
    "re": "Tốc độ sóng âm sẽ thay đổi theo điều kiện môi trường"
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cùng phương và cùng chiều, thì tổng hợp lực sẽ là tổng của hai lực đó",
    "re": "Vật sẽ có gia tốc theo hướng của lực tổng hợp"
  },
  {
    "con": "Cần phải đặt vật sáng cách thấu kính hội tụ có tiêu cự f = 5 cm một khoảng cách bằng bao nhiêu để thu được ảnh thật có độ phóng đại gấp 5 lần vật?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m = 10 kg được treo trên một sợi dây, nếu lực kéo tác dụng lên vật là 50 N thì vật sẽ có gia tốc bao nhiêu?",
    "re": "Gia tốc a = 5 m/s²"
  },
  {
    "con": "Khi một vật chuyển động thẳng đều, nếu vận tốc của vật là 20 m/s thì quãng đường đi được sau 5 giây sẽ là bao nhiêu?",
    "re": "Quãng đường là 100 m"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h = 20 m thì thời gian rơi đến mặt đất sẽ là bao nhiêu?",
    "re": "Thời gian rơi t = 2 s"
  },
  {
    "con": "Khi một lò xo bị nén với độ biến dạng x = 0.1 m và độ cứng k = 200 N/m thì lực đàn hồi tác dụng lên lò xo sẽ là bao nhiêu?",
    "re": "Lực đàn hồi F = 20 N"
  },
  {
    "con": "Nếu một điện trở có giá trị R = 10 Ω và dòng điện chạy qua nó là I = 2 A thì điện áp trên điện trở sẽ là bao nhiêu?",
    "re": "Điện áp U = 20 V"
  },
  {
    "con": "Khi một sóng âm có tần số f = 440 Hz truyền trong không khí với tốc độ v = 340 m/s thì bước sóng của sóng âm sẽ là bao nhiêu?",
    "re": "Bước sóng λ = 0.773 m"
  },
  {
    "con": "Nếu một vật có khối lượng m = 5 kg di chuyển với vận tốc v = 10 m/s thì động năng của vật sẽ là bao nhiêu?",
    "re": "Động năng K = 250 J"
  },
  {
    "con": "Khi một vật có khối lượng m = 2 kg được nâng lên cao h = 3 m thì năng lượng thế của vật sẽ là bao nhiêu?",
    "re": "Năng lượng thế E = 60 J"
  },
  {
    "con": "Nếu một thấu kính phân kỳ có tiêu cự f = -10 cm và vật đặt cách thấu kính 30 cm thì ảnh sẽ được tạo ra ở đâu?",
    "re": "Ảnh tạo ra ở 7.5 cm từ thấu kính"
  },
  {
    "con": "Một đĩa mỏng phẳng đồng chất có bán kính 2m có thể quay được xung quanh một trục đi qua tâm và vuông góc với mặt phẳng đĩa. Tác dụng vào đĩa một mômem lực 960Nm không đổi, đĩa chuyển động quay quanh trục với gia tốc góc 3rad/s^2. Khối lượng của đĩa là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h mà không có lực cản. Thời gian rơi t sẽ tỉ lệ thuận với căn bậc hai của độ cao h.",
    "re": "Thời gian rơi t = √(2h/g)"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi. Quãng đường đi được s sẽ tỉ lệ thuận với thời gian t.",
    "re": "s = vt"
  },
  {
    "con": "Một lò xo tuân theo định luật Hooke. Nếu lực kéo F tác dụng vào lò xo thì độ biến dạng x của lò xo sẽ tỉ lệ thuận với lực F.",
    "re": "F = kx"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Nếu lực tác dụng F lên vật là không đổi, thì gia tốc a của vật sẽ tỉ lệ thuận với lực F.",
    "re": "a = F/m"
  },
  {
    "con": "Một điện tích q đặt trong điện trường E. Nếu điện trường E có độ lớn không đổi, thì lực điện F tác dụng lên điện tích q sẽ tỉ lệ thuận với độ lớn của điện tích q.",
    "re": "F = qE"
  },
  {
    "con": "Một sóng âm truyền trong không khí với tốc độ v. Nếu tần số f của sóng âm tăng, thì bước sóng λ sẽ giảm.",
    "re": "λ = v/f"
  },
  {
    "con": "Một vật có khối lượng m và vận tốc v va chạm với một vật khác. Nếu va chạm là hoàn toàn đàn hồi, thì tổng động năng trước và sau va chạm sẽ được bảo toàn.",
    "re": "E_k trước = E_k sau"
  },
  {
    "con": "Một chất lỏng chảy qua một ống dẫn với tiết diện A. Nếu vận tốc v của chất lỏng tăng, thì áp suất P trong ống sẽ giảm.",
    "re": "P = ρgh + 0.5ρv²"
  },
  {
    "con": "Một vật chịu tác dụng của trọng lực và lực cản. Nếu lực cản tăng lên, thì gia tốc a của vật sẽ giảm.",
    "re": "a = (mg - F_c)/m"
  },
  {
    "con": "Một thấu kính hội tụ hai mặt lồi làm bằng thuỷ tinh chiết suất n = 1,6 khi đặt trong không khí thì có tiêu cự f=15cm. Tiêu cự sẽ bằng bao nhiêu nếu thấu kính được đặt trong môi trường trong suốt có chiết suất n’=1,5?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật được đặt cách gương phẳng 20cm thì ảnh của vật sẽ được tạo ra ở khoảng cách 20cm từ gương.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 2kg được treo vào lò xo có độ cứng k = 100 N/m thì độ biến dạng của lò xo sẽ là 0,2m.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một điện trở có giá trị 10Ω được nối với nguồn điện 5V thì cường độ dòng điện chạy qua điện trở sẽ là 0,5A.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chuyển động thẳng đều với vận tốc 10m/s thì sau 5 giây, vật sẽ di chuyển được 50m.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao 20m thì thời gian để vật chạm đất sẽ khoảng 2,02 giây.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sóng âm có tần số 440Hz thì bước sóng của nó trong không khí (với tốc độ âm thanh khoảng 340m/s) sẽ là khoảng 0,77m.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất lỏng có khối lượng riêng 1000kg/m³ được đổ vào một bình có diện tích đáy 0,1m² thì áp suất tại đáy bình sẽ là 10000Pa khi chiều cao chất lỏng là 10m.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có động năng 200J và khối lượng 4kg thì vận tốc của vật sẽ là 10m/s.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một điện tích q = 1μC được đặt trong điện trường có cường độ 1000N/C thì lực tác dụng lên điện tích sẽ là 1N.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biểu thức nào sau đây KHÔNG phải là dạng tổng quát của tọa độ một vật dao động điều hòa đơn giản?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chịu tác dụng của lực không đổi thì nó sẽ có gia tốc không đổi.",
    "re": "Vật sẽ chuyển động theo định luật Newton thứ hai"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn thì lực hấp dẫn tác động lên nó sẽ lớn hơn.",
    "re": "Vật sẽ bị kéo về phía vật có khối lượng lớn hơn"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên thì năng lượng động học của các phân tử trong chất đó sẽ tăng.",
    "re": "Chất sẽ trở nên nóng hơn"
  },
  {
    "con": "Nếu một vật dao động với tần số cao hơn thì chu kỳ dao động của nó sẽ ngắn hơn.",
    "re": "Vật sẽ hoàn thành nhiều chu kỳ trong một khoảng thời gian nhất định"
  },
  {
    "con": "Nếu một sóng âm có tần số cao hơn thì nó sẽ có bước sóng ngắn hơn.",
    "re": "Sóng âm sẽ truyền đi nhanh hơn trong không khí"
  },
  {
    "con": "Nếu một vật chuyển động tròn đều thì nó sẽ có gia tốc hướng tâm.",
    "re": "Vật sẽ luôn thay đổi hướng chuyển động"
  },
  {
    "con": "Nếu một vật va chạm đàn hồi với một vật khác thì tổng động năng của hệ sẽ được bảo toàn.",
    "re": "Hệ sẽ không mất năng lượng trong quá trình va chạm"
  },
  {
    "con": "Nếu một điện tích dương đặt trong điện trường thì nó sẽ chịu lực tác dụng theo hướng của điện trường.",
    "re": "Điện tích sẽ di chuyển theo hướng của lực tác dụng"
  },
  {
    "con": "Nếu một vật được thả rơi tự do thì nó sẽ chịu tác động của trọng lực.",
    "re": "Vật sẽ tăng tốc với gia tốc trọng trường"
  },
  {
    "con": "Mắt một người có đặc điểm sau: OCC = 5cm, OCV = 1m. Kết luận nào sau đây là đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi.",
    "re": "Lực tác động lên vật bằng 0"
  },
  {
    "con": "Một vật rơi tự do trong môi trường không có sức cản.",
    "re": "Vật sẽ tăng tốc với gia tốc 9.81 m/s²"
  },
  {
    "con": "Một vật có khối lượng m và vận tốc v.",
    "re": "Động lượng của vật là p = mv"
  },
  {
    "con": "Một lực F tác dụng lên một vật có khối lượng m.",
    "re": "Vật sẽ có gia tốc a = F/m"
  },
  {
    "con": "Một sóng có tần số f và bước sóng λ.",
    "re": "Tốc độ sóng v = f * λ"
  },
  {
    "con": "Một điện tích q di chuyển trong một trường điện đều.",
    "re": "Điện trường E tác động lên điện tích sẽ tạo ra lực F = qE"
  },
  {
    "con": "Một vật dao động điều hòa với biên độ A và tần số f.",
    "re": "Phương trình dao động là x(t) = A cos(2πft + φ)"
  },
  {
    "con": "Một vật chịu tác động của lực hấp dẫn.",
    "re": "Vật sẽ có trọng lực F = mg"
  },
  {
    "con": "Một hệ thống kín không có lực bên ngoài tác động.",
    "re": "Động lượng tổng của hệ thống sẽ bảo toàn"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì quỹ đạo của nó là một đường thẳng.",
    "re": "Vận tốc của vật là không đổi"
  },
  {
    "con": "Một vật chịu tác dụng của lực không đổi thì gia tốc của nó là không đổi.",
    "re": "Vật sẽ chuyển động theo định luật Newton thứ hai"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt trong một hệ kín.",
    "re": "Năng lượng tổng trong hệ luôn được bảo toàn"
  },
  {
    "con": "Khi một vật rơi tự do thì gia tốc của nó là gia tốc trọng trường.",
    "re": "Gia tốc này có giá trị khoảng 9.81 m/s²"
  },
  {
    "con": "Nếu một sóng âm đi qua một môi trường khác thì tốc độ của sóng sẽ thay đổi.",
    "re": "Tần số của sóng sẽ không thay đổi"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước thì nó sẽ bị khúc xạ.",
    "re": "Góc khúc xạ sẽ nhỏ hơn góc tới"
  },
  {
    "con": "Nếu một điện tích dương và một điện tích âm gần nhau thì chúng sẽ hút nhau.",
    "re": "Lực tương tác giữa chúng là lực Coulomb"
  },
  {
    "con": "Khi một vật dao động điều hòa thì nó sẽ có một tần số xác định.",
    "re": "Vật sẽ dao động quanh vị trí cân bằng"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn thì lực hấp dẫn tác động lên nó sẽ lớn hơn.",
    "re": "Lực hấp dẫn tỷ lệ thuận với khối lượng"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên thì thể tích của chất khí sẽ tăng.",
    "re": "Điều này được mô tả bởi định luật Charles"
  },
  {
    "con": "Hệ thức nào sau đây là hệ thức bất định Heisenberg đối với năng lượng và thời gian?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong cơ học lượng tử, hàm sóng \\mathrm{\\Psi}(\\buildrel\\ r\\over\\ r\\rightarrow,t) là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật thể chuyển động thẳng đều với vận tốc không đổi",
    "re": "Lực tác dụng lên vật thể bằng 0"
  },
  {
    "con": "Khi một vật rơi tự do trong trường hấp dẫn",
    "re": "Vật sẽ chịu tác động của trọng lực và gia tốc rơi tự do là 9.81 m/s²"
  },
  {
    "con": "Trong một hệ thống kín, tổng năng lượng được bảo toàn",
    "re": "Năng lượng không thể tự sinh ra hoặc mất đi"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác với chỉ số khúc xạ khác nhau",
    "re": "Ánh sáng sẽ bị khúc xạ tại bề mặt phân cách"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v",
    "re": "Thì động năng của vật là \\frac{1}{2}mv^2"
  },
  {
    "con": "Khi một lực F tác dụng lên một vật trong thời gian t",
    "re": "Thì xung lượng của vật là F \\cdot t"
  },
  {
    "con": "Trong một vòng tròn, nếu một vật chuyển động với vận tốc không đổi",
    "re": "Thì vật sẽ có gia tốc hướng tâm"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Thì năng lượng nội của vật cũng tăng theo"
  },
  {
    "con": "Nếu một sóng âm truyền qua không khí",
    "re": "Thì tốc độ của sóng âm khoảng 343 m/s ở nhiệt độ phòng"
  },
  {
    "con": "Định luật Newton thứ nhất nói rằng một vật sẽ giữ nguyên trạng thái chuyển động của nó",
    "re": "nếu không có lực tác động lên nó"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực không cân bằng",
    "re": "thì nó sẽ thay đổi vận tốc của mình"
  },
  {
    "con": "Định luật bảo toàn năng lượng phát biểu rằng",
    "re": "năng lượng không thể được tạo ra hoặc tiêu diệt, chỉ có thể chuyển đổi từ dạng này sang dạng khác"
  },
  {
    "con": "Nếu một vật di chuyển theo quỹ đạo tròn",
    "re": "thì nó sẽ chịu tác dụng của lực hướng tâm"
  },
  {
    "con": "Nếu nhiệt độ của một vật tăng lên",
    "re": "thì năng lượng động học của các phân tử trong vật đó cũng tăng lên"
  },
  {
    "con": "Nếu ánh sáng đi từ môi trường này sang môi trường khác",
    "re": "thì nó sẽ bị khúc xạ"
  },
  {
    "con": "Nếu một sóng âm có tần số cao",
    "re": "thì nó sẽ có âm thanh cao hơn"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn",
    "re": "thì nó sẽ có trọng lực tác động lớn hơn"
  },
  {
    "con": "Nếu một điện tích dương và một điện tích âm lại gần nhau",
    "re": "thì chúng sẽ hút nhau"
  },
  {
    "con": "Nếu một vật được ném lên cao",
    "re": "thì nó sẽ đạt đến độ cao cực đại trước khi rơi xuống"
  },
  {
    "con": "Xác định bước sóng Đơbrơi của vi hạt tự do có khối lượng mo= 10^{-30} kg và động năng 200 ev. (1ev= 1,6.10^{-19}J) \\lambda (Ao).",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Áp dụng định luật Newton thứ nhất cho một vật không chịu lực tác dụng,",
    "re": "vật sẽ giữ nguyên trạng thái chuyển động của nó."
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính r và vận tốc v,",
    "re": "lực hướng tâm tác dụng lên vật sẽ được tính bằng công thức F = mv^2/r."
  },
  {
    "con": "Nếu một vật có khối lượng m rơi tự do từ độ cao h,",
    "re": "thời gian rơi sẽ được tính bằng công thức t = √(2h/g), với g là gia tốc trọng trường."
  },
  {
    "con": "Khi một sóng âm truyền qua không khí,",
    "re": "tốc độ của sóng âm sẽ phụ thuộc vào nhiệt độ của không khí."
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một trường điện đều E,",
    "re": "nó sẽ chịu một lực F = qE."
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác,",
    "re": "tốc độ ánh sáng sẽ thay đổi và gây ra hiện tượng khúc xạ."
  },
  {
    "con": "Nếu một vật có động năng K và khối lượng m,",
    "re": "vận tốc của vật sẽ được tính bằng công thức v = √(2K/m)."
  },
  {
    "con": "Khi một lò xo bị nén hoặc kéo,",
    "re": "lực phục hồi sẽ tỉ lệ thuận với độ biến dạng theo định luật Hooke."
  },
  {
    "con": "Nếu một vật có khối lượng m và được nâng lên cao h trong trường trọng lực,",
    "re": "năng lượng thế của vật sẽ được tính bằng công thức U = mgh."
  },
  {
    "con": "Một điện tử không có vận tốc ban đầu, được gia tốc bởi hiệu điện thế chuyển động với bước sóng Đơbrơi \\lambda = 1Ao, Tính hiệu điện thế cần thiết (Vol).",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h, không chịu tác động của lực cản không khí.",
    "re": "Vận tốc của vật tại thời điểm t là v = gt, với g là gia tốc trọng trường."
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v và va chạm hoàn toàn đàn hồi với một vật khác có khối lượng M.",
    "re": "Tổng động năng của hệ trước và sau va chạm là như nhau."
  },
  {
    "con": "Một sóng âm truyền trong không khí với tốc độ v và tần số f.",
    "re": "Bước sóng của sóng âm là \\lambda = \\frac{v}{f}."
  },
  {
    "con": "Một điện trở R được nối với nguồn điện có hiệu điện thế U.",
    "re": "Cường độ dòng điện chạy qua điện trở là I = \\frac{U}{R}."
  },
  {
    "con": "Một vật có khối lượng m được treo vào một lò xo có độ cứng k.",
    "re": "Lực kéo của lò xo là F = -kx, với x là độ biến dạng của lò xo."
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính r và vận tốc góc \\omega.",
    "re": "Gia tốc hướng tâm của vật là a = \\omega^2 r."
  },
  {
    "con": "Một ánh sáng đơn sắc truyền qua một lăng kính với góc tới i.",
    "re": "Góc khúc xạ r được xác định bởi định luật Snell: n_1 \\sin(i) = n_2 \\sin(r)."
  },
  {
    "con": "Một vật có khối lượng m được thả rơi từ độ cao h trong môi trường không có lực cản.",
    "re": "Thời gian rơi của vật được tính bằng công thức t = \\sqrt{\\frac{2h}{g}}."
  },
  {
    "con": "Một điện tích q đặt trong điện trường E.",
    "re": "Lực tác dụng lên điện tích là F = qE."
  },
  {
    "con": "Một electron có động năng ban đầu 10 ev, được gia tốc bởi hiệu điện thế 90 V. Tìm bước sóng của electron sau khi được gia tốc (Ao). Cho e = 1,6.10^{-19}C, m_{e} = 9,1.10^{-31} Kg.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2 kg di chuyển với vận tốc 3 m/s. Tính động lượng của vật.",
    "re": "Động lượng của vật là 6 kg.m/s"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20 m. Tính thời gian vật rơi đến mặt đất.",
    "re": "Thời gian rơi là khoảng 2,02 giây"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0,1 m. Tính năng lượng tiềm năng trong lò xo.",
    "re": "Năng lượng tiềm năng trong lò xo là 1 J"
  },
  {
    "con": "Một quả bóng có khối lượng 0,5 kg va chạm với một bức tường và phản hồi lại với vận tốc 4 m/s. Tính lực tác động nếu thời gian va chạm là 0,1 s.",
    "re": "Lực tác động là 20 N"
  },
  {
    "con": "Một vật có khối lượng 10 kg được kéo lên cao với gia tốc 2 m/s². Tính lực kéo cần thiết.",
    "re": "Lực kéo cần thiết là 120 N"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz và tốc độ truyền sóng là 340 m/s. Tính bước sóng của sóng âm.",
    "re": "Bước sóng là 0,773 m"
  },
  {
    "con": "Một điện trở có giá trị 10 Ω và dòng điện chạy qua là 2 A. Tính công suất tiêu thụ của điện trở.",
    "re": "Công suất tiêu thụ là 40 W"
  },
  {
    "con": "Một vật có khối lượng 5 kg được đặt trên mặt phẳng nghiêng với góc 30 độ. Tính lực kéo xuống mặt phẳng.",
    "re": "Lực kéo xuống mặt phẳng là 25 N"
  },
  {
    "con": "Một vật có khối lượng 1 kg được ném thẳng đứng lên với vận tốc 20 m/s. Tính chiều cao tối đa mà vật đạt được.",
    "re": "Chiều cao tối đa là 20,4 m"
  },
  {
    "con": "Bước sóng Đơbrơi của một proton không tương đối tính \\lambda = 0.113 pm. Tìm tốc độ của nó ? (10^{6} m/s)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2 kg và chịu tác dụng của lực 10 N. Tính gia tốc của vật.",
    "re": "Gia tốc của vật là 5 m/s²"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20 m. Tính thời gian rơi của vật.",
    "re": "Thời gian rơi là khoảng 2.02 giây"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0.1 m. Tính năng lượng tiềm năng trong lò xo.",
    "re": "Năng lượng tiềm năng là 1 J"
  },
  {
    "con": "Một điện tích q = 5 μC đặt trong điện trường E = 2000 N/C. Tính lực tác dụng lên điện tích.",
    "re": "Lực tác dụng là 10 mN"
  },
  {
    "con": "Một vật có vận tốc 15 m/s va chạm hoàn toàn đàn hồi với một vật khác có khối lượng gấp đôi. Tính vận tốc của vật thứ hai sau va chạm.",
    "re": "Vận tốc của vật thứ hai là 15 m/s"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz và tốc độ 340 m/s. Tính bước sóng của sóng âm.",
    "re": "Bước sóng là 0.773 m"
  },
  {
    "con": "Một điện trở có giá trị 100 Ω và dòng điện chạy qua là 0.5 A. Tính điện áp trên điện trở.",
    "re": "Điện áp là 50 V"
  },
  {
    "con": "Một vật có khối lượng 3 kg di chuyển với vận tốc 4 m/s. Tính động năng của vật.",
    "re": "Động năng là 24 J"
  },
  {
    "con": "Một vật có khối lượng 1 kg được nâng lên cao 5 m. Tính công thực hiện để nâng vật.",
    "re": "Công thực hiện là 49 J"
  },
  {
    "con": "Một electron không vận tốc ban đầu gia tốc bởi hiệu điện thế V để có vận tốc v = 10^{8} m/s. Tìm hiệu điện thế V đó ? (Kv)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v trong một khoảng thời gian t thì động lượng của vật đó là p = mv",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật rơi tự do từ độ cao h, thì vận tốc của vật tại thời điểm t được tính bằng công thức v = gt",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một lực F tác dụng lên một vật có khối lượng m và gây ra gia tốc a, thì theo định luật Newton thứ hai, F = ma",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật quay quanh một trục với bán kính r và vận tốc góc ω, thì vận tốc tuyến tính v của vật đó là v = rω",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sóng có tần số f và bước sóng λ, thì vận tốc của sóng đó được tính bằng công thức v = fλ",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật chịu tác dụng của lực đàn hồi, thì độ biến dạng của vật tỉ lệ thuận với lực tác dụng theo định luật Hooke, F = kx",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một trường điện với cường độ điện trường E, thì lực tác dụng lên điện tích đó là F = qE",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính r và vận tốc v, thì gia tốc hướng tâm a_c được tính bằng công thức a_c = v^2/r",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có năng lượng tiềm năng trọng trường mgh, thì khi vật rơi tự do, năng lượng này sẽ chuyển hóa thành năng lượng động năng 1/2 mv^2",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vi hạt tự do có động năng T = 100 ev, khối lượng nghỉ m0= 10^{-30}kg. Xác định bước sóng De Broglie của vi hạt:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m và được thả rơi tự do từ độ cao h, không có lực cản không khí:",
    "re": "Vật sẽ đạt vận tốc tối đa v = √(2gh) khi chạm đất"
  },
  {
    "con": "Một lực F tác dụng lên một vật có khối lượng m và gây ra gia tốc a:",
    "re": "Gia tốc a sẽ được tính bằng công thức a = F/m"
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính r và vận tốc v:",
    "re": "Lực hướng tâm tác dụng lên vật sẽ được tính bằng công thức F = mv²/r"
  },
  {
    "con": "Một sóng âm có tần số f và vận tốc truyền sóng v trong không khí:",
    "re": "Chiều dài sóng λ sẽ được tính bằng công thức λ = v/f"
  },
  {
    "con": "Một điện tích q đặt trong điện trường E:",
    "re": "Lực tác dụng lên điện tích sẽ được tính bằng công thức F = qE"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v và va chạm hoàn toàn đàn hồi với một vật khác có khối lượng m':",
    "re": "Vận tốc sau va chạm sẽ được tính theo công thức bảo toàn động lượng"
  },
  {
    "con": "Một vật có nhiệt độ T và được làm nóng lên một lượng nhiệt Q:",
    "re": "Thay đổi nhiệt độ ΔT sẽ được tính bằng công thức ΔT = Q/(mc)"
  },
  {
    "con": "Một dòng điện I chạy qua một điện trở R:",
    "re": "Điện áp U sẽ được tính bằng công thức U = IR"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h và không có lực cản:",
    "re": "Thời gian rơi t sẽ được tính bằng công thức t = √(2h/g)"
  },
  {
    "con": "Một vi hạt tự do có khối lượng nghỉ m_{0}= 10^{-30}chuyển động với vận tốc v = 10^{6}m/s. Hãy xác định tần số của sóng De Broglie của vi hạt (đơn vị 1/s):",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m và được kéo bởi một lực F. Nếu lực F lớn hơn lực ma sát tối đa thì",
    "re": "vật sẽ bắt đầu chuyển động"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Nếu không có lực cản không khí thì",
    "re": "vật sẽ rơi với gia tốc g = 9.81 m/s²"
  },
  {
    "con": "Một sóng âm có tần số f. Nếu tần số tăng thì",
    "re": "chiều cao âm thanh sẽ tăng lên"
  },
  {
    "con": "Một điện tích q đặt trong điện trường E. Nếu điện tích q dương thì",
    "re": "nó sẽ bị lực điện đẩy theo hướng của điện trường"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Nếu vận tốc tăng gấp đôi thì",
    "re": "động năng của vật sẽ tăng gấp bốn lần"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo ra một khoảng x. Nếu khoảng cách x tăng thì",
    "re": "lực phục hồi của lò xo sẽ tăng theo tỷ lệ với x"
  },
  {
    "con": "Một vật quay quanh một trục với bán kính r. Nếu tốc độ góc tăng thì",
    "re": "tốc độ tuyến tính của vật cũng sẽ tăng"
  },
  {
    "con": "Một dòng điện I chạy qua một dây dẫn có điện trở R. Nếu điện trở R giảm thì",
    "re": "cường độ dòng điện I sẽ tăng lên theo định luật Ohm"
  },
  {
    "con": "Một sóng ánh sáng có bước sóng λ. Nếu bước sóng giảm thì",
    "re": "tần số của sóng ánh sáng sẽ tăng lên"
  },
  {
    "con": "Xác định bước sóng De Brogile của một vi hạt tự do có khối lượng m = 10^{-27}kg và động năng 200eV.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Áp dụng định luật Newton thứ nhất cho một vật không chịu lực tác động.",
    "re": "Vật sẽ giữ nguyên trạng thái chuyển động hoặc đứng yên."
  },
  {
    "con": "Sử dụng công thức F = ma để tính lực tác dụng lên một vật có khối lượng m = 5kg và gia tốc a = 2m/s².",
    "re": "Lực tác dụng là 10N."
  },
  {
    "con": "Xác định năng lượng tiềm năng của một vật có khối lượng m = 2kg ở độ cao h = 10m.",
    "re": "Năng lượng tiềm năng là 196J."
  },
  {
    "con": "Áp dụng định luật bảo toàn năng lượng cho một hệ kín.",
    "re": "Tổng năng lượng của hệ sẽ không thay đổi theo thời gian."
  },
  {
    "con": "Sử dụng công thức P = W/t để tính công suất khi thực hiện công W = 100J trong thời gian t = 5s.",
    "re": "Công suất là 20W."
  },
  {
    "con": "Xác định lực hấp dẫn giữa hai vật có khối lượng m1 = 10kg và m2 = 5kg cách nhau r = 2m.",
    "re": "Lực hấp dẫn là 7.5 x 10^{-9}N."
  },
  {
    "con": "Áp dụng định luật Hooke cho một lò xo có độ cứng k = 300N/m và biến dạng x = 0.1m.",
    "re": "Lực kéo của lò xo là 30N."
  },
  {
    "con": "Tính vận tốc của một vật rơi tự do sau 3 giây.",
    "re": "Vận tốc là 29.4m/s."
  },
  {
    "con": "Sử dụng công thức E = mc² để tính năng lượng tương đương với khối lượng m = 1kg.",
    "re": "Năng lượng là 9 x 10^{16}J."
  },
  {
    "con": "Hãy xác định bước sóng de Broglie của proton được gia tốc (không vận tốc đầu) qua một hiệu điện thế bằng 1 kV. Cho biết: h = 6,625.10^{-34} J.s; mp = 1,6726.10^{-19}kg; e = 1,6.10 ^{-19}C",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động năng của vật đó được tính bằng công thức Ek = 1/2 mv^2",
    "re": "Động năng của vật đó được xác định chính xác"
  },
  {
    "con": "Nếu một lực F tác dụng lên một vật có khối lượng m, thì gia tốc a của vật đó được tính bằng công thức F = ma",
    "re": "Gia tốc của vật đó được xác định chính xác"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, thì thời gian t để vật chạm đất được tính bằng công thức t = √(2h/g), với g là gia tốc trọng trường",
    "re": "Thời gian rơi của vật đó được xác định chính xác"
  },
  {
    "con": "Nếu một sóng có bước sóng λ và tần số f, thì vận tốc của sóng đó được tính bằng công thức v = fλ",
    "re": "Vận tốc của sóng đó được xác định chính xác"
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cùng phương và cùng chiều, thì tổng hợp lực F tổng sẽ bằng tổng hai lực đó",
    "re": "Tổng hợp lực được xác định chính xác"
  },
  {
    "con": "Nếu một vật quay quanh một trục với bán kính r và vận tốc góc ω, thì vận tốc tuyến tính v của vật đó được tính bằng công thức v = rω",
    "re": "Vận tốc tuyến tính của vật đó được xác định chính xác"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một trường điện đều E, thì lực tác dụng lên điện tích đó được tính bằng công thức F = qE",
    "re": "Lực tác dụng lên điện tích được xác định chính xác"
  },
  {
    "con": "Nếu một vật có khối lượng m và được nâng lên cao h trong trường trọng lực, thì công thực hiện để nâng vật đó được tính bằng công thức W = mgh",
    "re": "Công thực hiện được xác định chính xác"
  },
  {
    "con": "Nếu một sóng âm có tần số f và vận tốc v, thì bước sóng λ của sóng âm đó được tính bằng công thức λ = v/f",
    "re": "Bước sóng của sóng âm được xác định chính xác"
  },
  {
    "con": "Tính bước sóng de Broglie của electron có động năng 120eV. Biết m_{e} = 9,1.10^{-31} kg, h = 6,625.10^{-34}Js",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2 kg chuyển động với vận tốc 3 m/s. Tính động lượng của vật.",
    "re": "Động lượng của vật là 6 kg.m/s"
  },
  {
    "con": "Một lực 10 N tác dụng lên một vật có khối lượng 2 kg. Tính gia tốc của vật.",
    "re": "Gia tốc của vật là 5 m/s²"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20 m. Tính thời gian rơi xuống đất.",
    "re": "Thời gian rơi xuống đất là khoảng 2,02 giây"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0,1 m. Tính năng lượng lưu trữ trong lò xo.",
    "re": "Năng lượng lưu trữ trong lò xo là 1 J"
  },
  {
    "con": "Một điện tích q = 5 μC đặt trong điện trường E = 2000 N/C. Tính lực tác dụng lên điện tích.",
    "re": "Lực tác dụng lên điện tích là 10 N"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz. Tính bước sóng của sóng âm trong không khí (v = 340 m/s).",
    "re": "Bước sóng của sóng âm là 0,773 m"
  },
  {
    "con": "Một vật có khối lượng 1 kg di chuyển với vận tốc 10 m/s va chạm hoàn toàn đàn hồi với vật đứng yên có khối lượng 2 kg. Tính vận tốc của hai vật sau va chạm.",
    "re": "Vận tốc của vật 1 là 0 m/s và vật 2 là 5 m/s"
  },
  {
    "con": "Một điện trở có điện trở R = 10 Ω và dòng điện I = 2 A chạy qua. Tính điện áp U.",
    "re": "Điện áp U là 20 V"
  },
  {
    "con": "Một vật có khối lượng 3 kg được kéo lên cao 5 m. Tính công cần thiết để kéo vật lên.",
    "re": "Công cần thiết là 147 J"
  },
  {
    "con": "Hệ thức bất định Heisenberg đối với tọa độ và động lượng theo trục Ox của hạt vi mô có dạng nào dưới đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi:",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Khi một vật rơi tự do trong môi trường không có sức cản:",
    "re": "Vật sẽ tăng tốc với gia tốc bằng gia tốc trọng trường"
  },
  {
    "con": "Nếu một lực tác dụng lên một vật có khối lượng m và gây ra gia tốc a:",
    "re": "Lực đó bằng m nhân với a (F = ma)"
  },
  {
    "con": "Khi một sóng âm đi qua không khí và gặp một bề mặt cứng:",
    "re": "Sóng sẽ phản xạ lại với một góc bằng góc tới"
  },
  {
    "con": "Nếu nhiệt độ của một vật tăng lên:",
    "re": "Năng lượng nội của vật cũng sẽ tăng"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước:",
    "re": "Tốc độ ánh sáng sẽ giảm và ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một trường điện đều:",
    "re": "Điện tích sẽ chịu tác dụng của một lực điện F = qE"
  },
  {
    "con": "Khi một vật dao động điều hòa với biên độ A và tần số f:",
    "re": "Tần số góc ω sẽ bằng 2πf"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v va chạm hoàn toàn đàn hồi với một vật khác:",
    "re": "Tổng động năng của hệ sẽ được bảo toàn"
  },
  {
    "con": "Hệ thức bất định Heisenberg đối với năng lượng và thời gian của hạt vi mô có dạng nào dưới đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi:",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Năng lượng của một photon tỉ lệ thuận với tần số của nó:",
    "re": "E = hf, với h là hằng số Planck"
  },
  {
    "con": "Một vật rơi tự do trong trường hấp dẫn:",
    "re": "Chịu tác động của lực trọng trường và gia tốc là 9.81 m/s²"
  },
  {
    "con": "Khi một sóng âm đi từ không khí vào nước:",
    "re": "Tốc độ sóng âm tăng lên"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v:",
    "re": "Động lượng của vật là p = mv"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác với chỉ số khúc xạ khác nhau:",
    "re": "Ánh sáng sẽ bị bẻ cong"
  },
  {
    "con": "Trong một hệ kín, tổng năng lượng luôn được bảo toàn:",
    "re": "Năng lượng có thể chuyển đổi giữa các dạng nhưng không mất đi"
  },
  {
    "con": "Khi một vật dao động điều hòa:",
    "re": "Lực phục hồi tỉ lệ thuận với độ biến dạng"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một trường điện đều:",
    "re": "Nó sẽ chịu tác động của lực điện F = qE"
  },
  {
    "con": "Dùng hệ thức bất định để xác định độ rộng của mức năng lượng electron trong nguyên tử Hyđro ở trạng thái biến thiên với thời gian sống là 10^{-8}s (10^{-26}J)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Áp dụng định luật Newton thứ nhất cho một vật thể không chịu lực tác động",
    "re": "Vật thể sẽ giữ nguyên trạng thái chuyển động của nó"
  },
  {
    "con": "Sử dụng công thức F = ma để tính lực tác dụng lên một vật có khối lượng 5 kg và gia tốc 2 m/s²",
    "re": "Lực tác dụng là 10 N"
  },
  {
    "con": "Đo chiều dài của một vật bằng thước kẻ có độ chia nhỏ nhất là 1 mm",
    "re": "Kết quả đo phải được ghi với độ chính xác là ±0.5 mm"
  },
  {
    "con": "Sử dụng định luật bảo toàn năng lượng trong một hệ kín",
    "re": "Tổng năng lượng của hệ sẽ không thay đổi theo thời gian"
  },
  {
    "con": "Thực hiện thí nghiệm với một lò xo và đo độ biến dạng của nó",
    "re": "Sẽ có một lực phục hồi tác dụng lên lò xo theo định luật Hooke"
  },
  {
    "con": "Áp dụng định luật Coulomb để tính lực tương tác giữa hai điện tích điểm",
    "re": "Lực tương tác tỉ lệ thuận với tích của hai điện tích và tỉ lệ nghịch với bình phương khoảng cách giữa chúng"
  },
  {
    "con": "Sử dụng công thức P = W/t để tính công suất",
    "re": "Công suất sẽ được tính bằng công thực hiện chia cho thời gian thực hiện công đó"
  },
  {
    "con": "Đo tốc độ của một vật chuyển động thẳng đều",
    "re": "Tốc độ sẽ là quãng đường chia cho thời gian"
  },
  {
    "con": "Sử dụng định luật bảo toàn động lượng trong một va chạm đàn hồi",
    "re": "Tổng động lượng trước va chạm sẽ bằng tổng động lượng sau va chạm"
  },
  {
    "con": "Electron chuyển động trong phạm vi 10 ^{-10} m, nghĩa là độ bất định về vị trí \\mathrm{\\Delta\\ x}=10^{-10}m. Sử dụng hệ thức bất định Heisenberg \\mathrm{\\Delta E\\mathrm{.}\\Delta t\\mathrm{\\ }\\geq\\mathrm{\\ ћ, đánh giá độ bất định về vận tốc của electron. Cho m_{e} = 9,1.10^{ – 31 }kg , ћ = 1,05.10^ {– 34}Js.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m và được tác động bởi lực F, nếu lực này không đổi thì vật sẽ có gia tốc a = \\frac{F}{m}.",
    "re": "Gia tốc của vật là tỉ lệ thuận với lực tác động và tỉ lệ nghịch với khối lượng của nó."
  },
  {
    "con": "Nếu một vật chuyển động tròn với vận tốc không đổi, thì lực hướng tâm tác động lên vật sẽ luôn hướng về tâm của đường tròn.",
    "re": "Lực hướng tâm cần thiết để duy trì chuyển động tròn là F_{h} = \\frac{mv^2}{r}."
  },
  {
    "con": "Nếu một vật rơi tự do trong môi trường không có sức cản, thì gia tốc của nó sẽ luôn bằng gia tốc trọng trường g ≈ 9,81 m/s².",
    "re": "Vật sẽ tăng tốc đều với gia tốc g cho đến khi chạm đất."
  },
  {
    "con": "Nếu một sóng âm truyền trong không khí, thì tốc độ của sóng âm sẽ phụ thuộc vào nhiệt độ của không khí.",
    "re": "Tốc độ sóng âm trong không khí tăng khi nhiệt độ tăng."
  },
  {
    "con": "Nếu một vật có năng lượng tiềm năng hấp dẫn U = mgh, thì khi vật rơi xuống, năng lượng tiềm năng sẽ chuyển hóa thành năng lượng động năng.",
    "re": "Năng lượng động năng của vật sẽ tăng lên khi năng lượng tiềm năng giảm xuống."
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một trường điện E, thì lực tác động lên điện tích đó sẽ được tính bằng công thức F = qE.",
    "re": "Lực tác động lên điện tích sẽ tỉ lệ thuận với độ lớn của điện tích và cường độ trường điện."
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v, thì động năng của vật được tính bằng công thức K = \\frac{1}{2}mv^2.",
    "re": "Động năng của vật sẽ tăng lên khi khối lượng hoặc vận tốc của nó tăng."
  },
  {
    "con": "Nếu một sóng ánh sáng đi từ môi trường này sang môi trường khác với chỉ số khúc xạ khác nhau, thì góc khúc xạ sẽ thay đổi theo định luật Snell.",
    "re": "Góc khúc xạ sẽ tỉ lệ thuận với chỉ số khúc xạ của môi trường."
  },
  {
    "con": "Nếu một vật chịu tác động của nhiều lực, thì tổng hợp lực sẽ được tính bằng tổng vector của các lực đó.",
    "re": "Vật sẽ chuyển động theo hướng của tổng hợp lực."
  },
  {
    "con": "Một electron chuyển động trong hố thế sâu vô hạn 1 chiều có bề rộng a = 10^{-10} m. Tìm tốc độ tối thiểu của nó (10^{6 }m/s). Cho E_{n} = \\frac{n^{2} h^{2}}{8ma^{2}}.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m = 2 kg được thả rơi tự do từ độ cao h = 20 m. Tính vận tốc của vật khi chạm đất. Cho g = 9.81 m/s².",
    "re": "Vận tốc chạm đất là 19.8 m/s"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0.1 m. Tính năng lượng tiềm năng đàn hồi của lò xo.",
    "re": "Năng lượng tiềm năng đàn hồi là 1 J"
  },
  {
    "con": "Một vật có khối lượng m = 5 kg di chuyển với vận tốc v = 10 m/s. Tính động năng của vật.",
    "re": "Động năng là 250 J"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu v_0 = 15 m/s. Tính chiều cao tối đa mà quả bóng đạt được. Cho g = 9.81 m/s².",
    "re": "Chiều cao tối đa là 11.5 m"
  },
  {
    "con": "Một dòng điện I = 3 A chạy qua một điện trở R = 4 Ω. Tính công suất tiêu thụ của điện trở.",
    "re": "Công suất tiêu thụ là 36 W"
  },
  {
    "con": "Một vật có khối lượng m = 10 kg được kéo lên cao với lực F = 100 N. Tính công thực hiện khi kéo vật lên cao h = 5 m.",
    "re": "Công thực hiện là 500 J"
  },
  {
    "con": "Một sóng âm có tần số f = 440 Hz và vận tốc v = 340 m/s. Tính bước sóng λ của sóng âm.",
    "re": "Bước sóng λ là 0.773 m"
  },
  {
    "con": "Một vật có khối lượng m = 1 kg đang chuyển động với vận tốc v = 2 m/s va chạm hoàn toàn đàn hồi với một vật khác có khối lượng m' = 1 kg đang đứng yên. Tính vận tốc của hai vật sau va chạm.",
    "re": "Vận tốc của vật 1 là 0 m/s và vật 2 là 2 m/s"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h = 45 m. Tính thời gian vật rơi đến mặt đất. Cho g = 9.81 m/s².",
    "re": "Thời gian rơi là 3.03 s"
  },
  {
    "con": "Một electron chuyển động trong hố thế sâu vô hạn 1 chiều có bề rộng a = 10^{-10} m. Cho E_{n} = \\frac{n^{2} h^{2}}{8ma^{2}}. Cần cung cấp cho nó năng lượng bằng bao nhiêu ( 10^{-17} J) để nó chuyển từ trạng thái cơ bản 1 sang trạng thái mô tả bởi \\psi_n(x)=\\sqrt{\\frac{2}{a}}sin{(}\\frac{n\\pi\\ x}{a}), với n= 2:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật thể có khối lượng m = 2 kg và chịu tác dụng của lực F = 10 N. Nếu lực này tác dụng trong thời gian t = 5 s thì vật thể sẽ có gia tốc a = \\frac{F}{m} = 5 m/s²:",
    "re": "Gia tốc của vật thể là 5 m/s²"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h = 20 m. Nếu bỏ qua sức cản của không khí, thì thời gian rơi t = \\sqrt{\\frac{2h}{g}} với g = 9.81 m/s²:",
    "re": "Thời gian rơi là khoảng 2.02 giây"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén một đoạn x = 0.1 m. Nếu tính năng lượng tiềm năng đàn hồi U = \\frac{1}{2}kx^2 thì năng lượng tiềm năng là:",
    "re": "Năng lượng tiềm năng là 1 J"
  },
  {
    "con": "Một vật có khối lượng m = 3 kg di chuyển với vận tốc v = 4 m/s. Nếu tính động năng K = \\frac{1}{2}mv^2 thì động năng của vật là:",
    "re": "Động năng là 24 J"
  },
  {
    "con": "Một sóng âm có tần số f = 440 Hz và vận tốc âm thanh trong không khí là v = 340 m/s. Nếu tính bước sóng \\lambda = \\frac{v}{f} thì bước sóng là:",
    "re": "Bước sóng là 0.772 m"
  },
  {
    "con": "Một điện tích q = 1 C đặt trong điện trường E = 1000 N/C. Nếu tính lực tác dụng F = qE thì lực tác dụng là:",
    "re": "Lực tác dụng là 1000 N"
  },
  {
    "con": "Một mạch điện có điện trở R = 5 Ω và hiệu điện thế U = 10 V. Nếu tính dòng điện I = \\frac{U}{R} thì dòng điện trong mạch là:",
    "re": "Dòng điện là 2 A"
  },
  {
    "con": "Một vật có khối lượng m = 1 kg và vận tốc v = 10 m/s va chạm hoàn toàn đàn hồi với một vật khác có khối lượng m' = 2 kg đứng yên. Nếu tính vận tốc sau va chạm v' thì vận tốc của vật thứ hai là:",
    "re": "Vận tốc của vật thứ hai là 6.67 m/s"
  },
  {
    "con": "Một electron chuyển động trong hố thế sâu vô hạn 1 chiều có bề rộng a = 10^{-10} m. Hãy xác định xác suất tìm hạt electron trong khoảng từ \\frac{a}{4} đến \\frac{a}{2} ở trạng thái \\psi_2 hoặc từ \\frac{a}{2} đến a.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật thể có khối lượng m = 2 kg được thả rơi tự do từ độ cao h = 20 m. Hãy tính vận tốc của vật thể khi chạm đất.",
    "re": "Vận tốc là 20 m/s"
  },
  {
    "con": "Một lò xo có độ cứng k = 100 N/m bị nén một đoạn x = 0.1 m. Hãy tính năng lượng tiềm năng của lò xo.",
    "re": "Năng lượng tiềm năng là 0.5 J"
  },
  {
    "con": "Một vật có khối lượng m = 5 kg chuyển động với vận tốc v = 10 m/s. Hãy tính động năng của vật.",
    "re": "Động năng là 250 J"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu v_0 = 15 m/s. Hãy tính chiều cao tối đa mà quả bóng đạt được.",
    "re": "Chiều cao tối đa là 11.47 m"
  },
  {
    "con": "Một dòng điện có cường độ I = 2 A chạy qua một điện trở R = 5 Ω. Hãy tính công suất tiêu thụ của điện trở.",
    "re": "Công suất tiêu thụ là 8 W"
  },
  {
    "con": "Một vật có khối lượng m = 10 kg di chuyển với vận tốc v = 3 m/s. Hãy tính lượng động lượng của vật.",
    "re": "Động lượng là 30 kg·m/s"
  },
  {
    "con": "Một sóng âm có tần số f = 440 Hz và vận tốc v = 340 m/s. Hãy tính bước sóng của sóng âm.",
    "re": "Bước sóng là 0.773 m"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h = 45 m. Hãy tính thời gian vật rơi đến mặt đất.",
    "re": "Thời gian rơi là 3 s"
  },
  {
    "con": "Một vật có khối lượng m = 1 kg được kéo lên cao với lực F = 10 N. Hãy tính công thực hiện khi kéo vật lên cao 2 m.",
    "re": "Công thực hiện là 20 J"
  },
  {
    "con": "Photon có bước sóng l = 0,5mm thì có khối lượng bao nhiêu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì vận tốc của nó không thay đổi.",
    "re": "Vận tốc là hằng số"
  },
  {
    "con": "Nếu lực tác dụng lên một vật không đổi thì gia tốc của vật sẽ tỉ lệ thuận với lực đó.",
    "re": "Gia tốc tăng khi lực tăng"
  },
  {
    "con": "Nếu một vật rơi tự do thì gia tốc của nó là 9,81 m/s².",
    "re": "Gia tốc do trọng lực"
  },
  {
    "con": "Nếu nhiệt độ của một vật tăng lên thì năng lượng nội tại của vật cũng tăng.",
    "re": "Năng lượng nội tại tăng"
  },
  {
    "con": "Nếu một sóng âm có tần số cao thì bước sóng của nó sẽ ngắn.",
    "re": "Bước sóng tỉ lệ nghịch với tần số"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn thì nó sẽ có trọng lực lớn hơn.",
    "re": "Trọng lực tỉ lệ thuận với khối lượng"
  },
  {
    "con": "Nếu một điện tích di chuyển trong từ trường thì nó sẽ chịu tác dụng của lực Lorentz.",
    "re": "Lực Lorentz tác động lên điện tích"
  },
  {
    "con": "Nếu một vật va chạm đàn hồi thì tổng động năng trước và sau va chạm sẽ được bảo toàn.",
    "re": "Động năng được bảo toàn"
  },
  {
    "con": "Nếu ánh sáng đi từ môi trường này sang môi trường khác thì nó sẽ bị khúc xạ.",
    "re": "Hiện tượng khúc xạ ánh sáng"
  },
  {
    "con": "Photon có bước sóng l = 0,4mm thì có khối lượng bao nhiêu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì vận tốc của nó không thay đổi.",
    "re": "Vận tốc là hằng số"
  },
  {
    "con": "Nếu lực tác dụng lên một vật bằng 0 thì vật đó sẽ đứng yên hoặc chuyển động thẳng đều.",
    "re": "Vật không thay đổi trạng thái chuyển động"
  },
  {
    "con": "Nếu một vật có khối lượng m và chịu tác dụng của lực F thì gia tốc a của vật sẽ được tính bằng công thức a = F/m.",
    "re": "Gia tốc tỷ lệ thuận với lực và nghịch đảo với khối lượng"
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên thì năng lượng động học của các phân tử trong chất đó cũng tăng.",
    "re": "Năng lượng động học tăng"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h thì vận tốc của nó tại mặt đất sẽ được tính bằng công thức v = √(2gh).",
    "re": "Vận tốc tại mặt đất phụ thuộc vào độ cao"
  },
  {
    "con": "Nếu một sóng âm có tần số f thì bước sóng λ của nó sẽ được tính bằng công thức λ = v/f, với v là tốc độ âm thanh.",
    "re": "Bước sóng tỷ lệ nghịch với tần số"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một điện trường E thì lực tác dụng lên điện tích đó sẽ được tính bằng công thức F = qE.",
    "re": "Lực tác dụng tỷ lệ thuận với điện tích và cường độ điện trường"
  },
  {
    "con": "Nếu một vật có năng lượng tiềm năng trọng trường thì năng lượng này sẽ được tính bằng công thức U = mgh.",
    "re": "Năng lượng tiềm năng phụ thuộc vào khối lượng, gia tốc trọng trường và độ cao"
  },
  {
    "con": "Nếu một vật quay quanh một trục thì mô men quán tính I của vật sẽ ảnh hưởng đến gia tốc góc α của nó.",
    "re": "Gia tốc góc tỷ lệ nghịch với mô men quán tính"
  },
  {
    "con": "Bước sóng ánh sáng vàng của natri trong không khí là 589nm. Tính tần số của ánh sáng đó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2kg và chịu tác dụng của lực 10N. Tính gia tốc của vật.",
    "re": "Gia tốc của vật là 5 m/s²"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20m. Tính thời gian vật rơi đến mặt đất.",
    "re": "Thời gian rơi là khoảng 2.02 giây"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0.1m. Tính năng lượng tiềm năng trong lò xo.",
    "re": "Năng lượng tiềm năng là 1 J"
  },
  {
    "con": "Một điện tích q = 5μC đặt trong điện trường E = 2000 N/C. Tính lực tác dụng lên điện tích.",
    "re": "Lực tác dụng là 10 mN"
  },
  {
    "con": "Một vật có vận tốc 15 m/s va chạm với một vật khác đứng yên và dừng lại hoàn toàn. Tính động lượng của vật.",
    "re": "Động lượng của vật là 30 kg·m/s"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz. Tính bước sóng của sóng âm trong không khí (v = 340 m/s).",
    "re": "Bước sóng là 0.773 m"
  },
  {
    "con": "Một vật có khối lượng 3kg di chuyển với vận tốc 4 m/s. Tính động năng của vật.",
    "re": "Động năng của vật là 24 J"
  },
  {
    "con": "Một mạch điện có điện trở R = 10Ω và hiệu điện thế U = 20V. Tính dòng điện trong mạch.",
    "re": "Dòng điện là 2 A"
  },
  {
    "con": "Một vật có khối lượng 1kg và được nâng lên cao 5m. Tính công thực hiện để nâng vật.",
    "re": "Công thực hiện là 50 J"
  },
  {
    "con": "Một vi hạt có năng lượng 250keV . Xác định giá trị năng lượng đó theo đơn vị Jun.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2kg và được kéo với lực 10N. Tính gia tốc của vật.",
    "re": "Gia tốc của vật là 5 m/s²"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20m. Tính thời gian vật rơi đến mặt đất.",
    "re": "Thời gian rơi là khoảng 2.02 giây"
  },
  {
    "con": "Một sóng âm có tần số 440Hz. Tính bước sóng của sóng âm trong không khí (với tốc độ âm thanh là 340m/s).",
    "re": "Bước sóng là 0.773m"
  },
  {
    "con": "Một vật có năng lượng tiềm năng 100J ở độ cao 5m. Tính khối lượng của vật.",
    "re": "Khối lượng của vật là 2.04kg"
  },
  {
    "con": "Một lò xo có độ cứng 200N/m bị nén 0.1m. Tính năng lượng đàn hồi của lò xo.",
    "re": "Năng lượng đàn hồi là 1J"
  },
  {
    "con": "Một điện tích 5μC đặt trong điện trường 2000N/C. Tính lực tác dụng lên điện tích.",
    "re": "Lực tác dụng là 0.01N"
  },
  {
    "con": "Một vật có vận tốc 15m/s va chạm với một vật khác đứng yên và dính vào nhau. Tính vận tốc sau va chạm (giả sử khối lượng vật thứ hai là 5kg).",
    "re": "Vận tốc sau va chạm là 3m/s"
  },
  {
    "con": "Một mạch điện có điện trở 10Ω và hiệu điện thế 20V. Tính dòng điện trong mạch.",
    "re": "Dòng điện là 2A"
  },
  {
    "con": "Một vật có khối lượng 3kg chuyển động với vận tốc 4m/s. Tính động năng của vật.",
    "re": "Động năng là 24J"
  },
  {
    "con": "Hạt vi mô có độ bất định về động lượng bằng 2% động lượng của nó. Tính tỉ số giữa bước sóng de Broglie \\lambda và độ bất định về tọa độ \\Delta x của hạt đó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Nếu không có lực cản của không khí, thì vật đó sẽ đạt được vận tốc tối đa v = \\sqrt{2gh} khi chạm đất.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một lực F tác dụng lên một vật có khối lượng m, thì gia tốc a của vật đó được tính bằng công thức a = \\frac{F}{m}.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chuyển động tròn đều với bán kính r và vận tốc v, thì lực hướng tâm F_c tác dụng lên vật đó được tính bằng công thức F_c = \\frac{mv^2}{r}.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sóng âm có tần số f và vận tốc v trong không khí, thì bước sóng \\lambda của sóng âm đó được tính bằng công thức \\lambda = \\frac{v}{f}.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một trường điện E, thì lực tác dụng lên điện tích đó được tính bằng công thức F = qE.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có năng lượng động năng K = \\frac{1}{2}mv^2, thì khi vận tốc v tăng gấp đôi, năng lượng động năng sẽ tăng gấp bốn lần.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng m và được nâng lên độ cao h trong trường trọng lực, thì công thực hiện để nâng vật đó được tính bằng công thức W = mgh.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sóng điện từ có tần số f, thì năng lượng của photon tương ứng được tính bằng công thức E = hf, với h là hằng số Planck.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cân bằng, thì vật đó sẽ không thay đổi trạng thái chuyển động của nó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hạt electron không vận tốc đầu được gia tốc qua hiệu điện thế U nhỏ. Tính U biết rằng sau khi gia tốc, hạt electron chuyển động ứng với bước sóng de Broglie là \\lambda.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật thể rơi tự do từ độ cao h. Tính thời gian rơi t với g là gia tốc trọng trường.",
    "re": "t = \\sqrt{\\frac{2h}{g}}"
  },
  {
    "con": "Một lực F tác dụng lên một vật có khối lượng m. Tính gia tốc a của vật.",
    "re": "a = \\frac{F}{m}"
  },
  {
    "con": "Một sóng âm có tần số f và vận tốc v. Tính bước sóng \\lambda của sóng âm.",
    "re": "\\lambda = \\frac{v}{f}"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Tính động năng K của vật.",
    "re": "K = \\frac{1}{2}mv^2"
  },
  {
    "con": "Một vật chịu tác dụng của lực ma sát f_m. Tính lực tổng hợp F_t nếu lực kéo P tác dụng lên vật.",
    "re": "F_t = P - f_m"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo một khoảng x. Tính lực F tác dụng lên lò xo.",
    "re": "F = -kx"
  },
  {
    "con": "Một điện tích q đặt trong điện trường E. Tính lực điện F tác dụng lên điện tích.",
    "re": "F = qE"
  },
  {
    "con": "Một vật quay quanh một trục với bán kính r và vận tốc góc \\omega. Tính gia tốc hướng tâm a_c.",
    "re": "a_c = r\\omega^2"
  },
  {
    "con": "Một sóng điện từ có tần số f và bước sóng \\lambda. Tính vận tốc c của sóng điện từ.",
    "re": "c = f\\lambda"
  },
  {
    "con": "Một hạt chuyển động được mô tả bởi hàm sóng \\psi ở mỗi vị trí và mỗi thời điểm nhất định \\left|\\psi\\right|^2 tỉ lệ thuận với:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chịu tác dụng của lực không đổi trong một khoảng thời gian nhất định",
    "re": "Vật sẽ có gia tốc không đổi"
  },
  {
    "con": "Năng lượng của một photon tỉ lệ thuận với tần số của nó",
    "re": "Photon có năng lượng cao hơn"
  },
  {
    "con": "Một vật rơi tự do trong trường hấp dẫn",
    "re": "Vật sẽ có gia tốc bằng gia tốc trọng trường"
  },
  {
    "con": "Khi một sóng âm đi qua một môi trường khác",
    "re": "Tốc độ sóng sẽ thay đổi tùy thuộc vào tính chất của môi trường"
  },
  {
    "con": "Một vật có khối lượng lớn hơn sẽ có lực hấp dẫn lớn hơn với một vật khác",
    "re": "Lực hấp dẫn giữa hai vật sẽ tăng lên"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Năng lượng động học của các phân tử trong vật sẽ tăng lên"
  },
  {
    "con": "Một điện tích di chuyển trong một từ trường",
    "re": "Điện tích sẽ chịu tác dụng của lực Lorentz"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước",
    "re": "Ánh sáng sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Một vật dao động điều hòa có biên độ lớn",
    "re": "Năng lượng dao động của vật sẽ cao hơn"
  },
  {
    "con": "Một vi hạt có khối lượng m, động lượng p và động năng E, chuyển động với vận tốc rất nhỏ so với vận tốc ánh sáng thì động lượng p và động năng E có mối quan hệ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chịu tác dụng của lực F trong thời gian t thì vật sẽ có gia tốc a được tính theo công thức:",
    "re": "a = F/m"
  },
  {
    "con": "Khi một vật rơi tự do từ độ cao h thì vận tốc của vật tại thời điểm chạm đất được tính theo công thức:",
    "re": "v = √(2gh)"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v thì động năng E của vật được tính theo công thức:",
    "re": "E = 1/2 mv²"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác thì tổng động lượng của hệ vật trước và sau va chạm sẽ được bảo toàn nếu:",
    "re": "không có lực bên ngoài tác động"
  },
  {
    "con": "Nếu một sóng âm có tần số f và vận tốc truyền sóng v thì bước sóng λ được tính theo công thức:",
    "re": "λ = v/f"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác thì hiện tượng khúc xạ xảy ra nếu:",
    "re": "góc tới không bằng 0"
  },
  {
    "con": "Nếu một vật quay quanh một trục với bán kính r và có vận tốc góc ω thì vận tốc tuyến tính v của vật được tính theo công thức:",
    "re": "v = rω"
  },
  {
    "con": "Khi một vật chịu tác dụng của lực hấp dẫn thì trọng lực F của vật được tính theo công thức:",
    "re": "F = mg"
  },
  {
    "con": "Nếu một chất rắn được nung nóng thì thể tích của chất đó sẽ thay đổi theo quy luật:",
    "re": "thể tích tăng lên khi nhiệt độ tăng"
  },
  {
    "con": "Một vi hạt có khối lượng m, động lượng p và động năng E, chuyển động với vận tốc rất nhỏ so với vận tốc ánh sáng thì có bước sóng De Brogile l được tính bởi biểu thức:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật chịu tác dụng của lực F trong thời gian t, thì sự thay đổi động lượng của vật được tính bằng tích của lực và thời gian tác dụng:",
    "re": "Động lượng của vật sẽ thay đổi theo công thức Δp = F * t"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, thì thời gian rơi t sẽ được tính bằng công thức t = √(2h/g), với g là gia tốc trọng trường:",
    "re": "Vật sẽ chạm đất sau thời gian t"
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính r và vận tốc v, thì gia tốc hướng tâm a sẽ được tính bằng công thức a = v²/r:",
    "re": "Vật sẽ có gia tốc hướng tâm không đổi"
  },
  {
    "con": "Nếu một sóng âm có tần số f và tốc độ v, thì bước sóng λ sẽ được tính bằng công thức λ = v/f:",
    "re": "Bước sóng sẽ tỷ lệ nghịch với tần số"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác, thì tổng động năng của hệ sẽ được bảo toàn:",
    "re": "Động năng trước và sau va chạm sẽ bằng nhau"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một trường điện với cường độ E, thì lực tác dụng lên điện tích sẽ được tính bằng công thức F = qE:",
    "re": "Điện tích sẽ chịu tác dụng của lực F"
  },
  {
    "con": "Khi một vật có khối lượng m di chuyển với vận tốc v, thì động năng E_k của vật sẽ được tính bằng công thức E_k = 1/2 mv²:",
    "re": "Động năng sẽ tăng khi vận tốc tăng"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực ma sát f và lực này lớn hơn lực kéo F, thì vật sẽ không chuyển động:",
    "re": "Vật sẽ ở trạng thái tĩnh"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác với chỉ số khúc xạ n, thì góc khúc xạ θ sẽ được tính bằng định luật Snell:",
    "re": "Góc khúc xạ sẽ phụ thuộc vào chỉ số khúc xạ của hai môi trường"
  },
  {
    "con": "Một electron không có vận tốc ban đầu được gia tốc bởi hiệu điện thế U = 100 v. Tìm bước sóng của electron sau khi được gia tốc.(Chú ý electron ở các bài tập này được coi là hạt không tương đối):",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m và được thả rơi tự do từ độ cao h. Tính vận tốc của vật khi chạm đất:",
    "re": "Vận tốc của vật là v = √(2gh)"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén một khoảng x. Tính năng lượng tiềm năng trong lò xo:",
    "re": "Năng lượng tiềm năng là E = (1/2)kx²"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v. Tính quãng đường đi được sau thời gian t:",
    "re": "Quãng đường là s = vt"
  },
  {
    "con": "Một vật chịu tác dụng của lực F trong thời gian t. Tính gia tốc a của vật:",
    "re": "Gia tốc a = F/m"
  },
  {
    "con": "Một sóng âm có tần số f và vận tốc v. Tính bước sóng λ của sóng:",
    "re": "Bước sóng λ = v/f"
  },
  {
    "con": "Một điện tích q đặt trong điện trường E. Tính lực tác dụng lên điện tích:",
    "re": "Lực tác dụng là F = qE"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Tính động năng của vật:",
    "re": "Động năng là K = (1/2)mv²"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Tính thời gian rơi t:",
    "re": "Thời gian rơi t = √(2h/g)"
  },
  {
    "con": "Một điện trở R được nối với hiệu điện thế U. Tính dòng điện I chạy qua điện trở:",
    "re": "Dòng điện I = U/R"
  },
  {
    "con": "Một vi hạt có khối lượng m, chuyển động trên trục x trong trường thế có dạng hố thế cao vô hạn, bề rộng =A. Khi hạt có năng lượng E = \\frac{2\\pi^2\\hbar^2}{ma^2} thì khả năng tìm thấy hạt lớn nhất tại tọa độ x bằng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m được thả rơi tự do từ độ cao h, nếu không có lực cản thì vật sẽ đạt vận tốc v = \\sqrt{2gh} khi chạm đất.",
    "re": "Vận tốc của vật khi chạm đất là \\sqrt{2gh}"
  },
  {
    "con": "Nếu một lực F tác dụng lên một vật có khối lượng m trong thời gian t, thì gia tốc a của vật sẽ được tính bằng a = \\frac{F}{m}.",
    "re": "Gia tốc của vật là \\frac{F}{m}"
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính R và vận tốc v, nếu không có lực tác dụng thì lực hướng tâm F sẽ được tính bằng F = \\frac{mv^2}{R}.",
    "re": "Lực hướng tâm là \\frac{mv^2}{R}"
  },
  {
    "con": "Nếu một sóng âm có tần số f và vận tốc truyền sóng v, thì bước sóng \\lambda sẽ được tính bằng \\lambda = \\frac{v}{f}.",
    "re": "Bước sóng là \\frac{v}{f}"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác, nếu khối lượng của hai vật là m1 và m2, thì vận tốc sau va chạm sẽ được tính theo công thức bảo toàn động lượng.",
    "re": "Vận tốc sau va chạm được tính theo công thức bảo toàn động lượng"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một trường điện E, thì lực tác dụng lên điện tích sẽ được tính bằng F = qE.",
    "re": "Lực tác dụng lên điện tích là qE"
  },
  {
    "con": "Khi một vật dao động điều hòa với biên độ A và tần số f, thì năng lượng toàn phần của vật sẽ được tính bằng E = \\frac{1}{2}kA^2, với k là độ cứng của lò xo.",
    "re": "Năng lượng toàn phần là \\frac{1}{2}kA^2"
  },
  {
    "con": "Nếu một vật có khối lượng m rơi tự do trong trường hấp dẫn với gia tốc g, thì công của trọng lực thực hiện trên vật khi rơi từ độ cao h sẽ được tính bằng W = mgh.",
    "re": "Công của trọng lực là mgh"
  },
  {
    "con": "Khi một sóng điện từ lan truyền trong chân không, nếu tần số là f, thì năng lượng của một photon sẽ được tính bằng E = hf, với h là hằng số Planck.",
    "re": "Năng lượng của một photon là hf"
  },
  {
    "con": "Tìm phát biểu đúng trong số các phát biểu sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi trong một khoảng thời gian nhất định,",
    "re": "quãng đường đi được sẽ tỉ lệ thuận với thời gian."
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng,",
    "re": "vật sẽ có gia tốc tỉ lệ thuận với lực và tỉ lệ nghịch với khối lượng."
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h,",
    "re": "thời gian rơi sẽ tỉ lệ với căn bậc hai của độ cao."
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác,",
    "re": "tốc độ ánh sáng sẽ thay đổi tùy thuộc vào chỉ số khúc xạ của môi trường."
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cân bằng,",
    "re": "vật sẽ không thay đổi trạng thái chuyển động."
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên,",
    "re": "năng lượng động học của các phân tử trong vật cũng sẽ tăng."
  },
  {
    "con": "Nếu một sóng âm đi qua một môi trường khác với tốc độ khác,",
    "re": "tần số của sóng sẽ không thay đổi nhưng bước sóng sẽ thay đổi."
  },
  {
    "con": "Khi một điện tích di chuyển trong một từ trường,",
    "re": "nó sẽ chịu tác dụng của một lực từ."
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác,",
    "re": "thì lực hấp dẫn giữa chúng sẽ lớn hơn."
  },
  {
    "con": "Electron chuyển động trong giếng thế sâu vô hạn một chiều có bề rộng a = 2.10-10m. Hãy tìm tốc độ tối thiểu của electron:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h, không có lực cản không khí tác động, thì vận tốc của vật khi chạm đất sẽ phụ thuộc vào độ cao h:",
    "re": "Vận tốc lớn hơn khi h lớn hơn"
  },
  {
    "con": "Nếu một lực F tác động lên một vật có khối lượng m, thì gia tốc a của vật sẽ được tính bằng công thức a = F/m:",
    "re": "Gia tốc tỉ lệ thuận với lực và nghịch đảo với khối lượng"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí, nếu nhiệt độ tăng lên, thì tốc độ truyền sóng âm sẽ tăng:",
    "re": "Tốc độ sóng âm tỉ lệ thuận với nhiệt độ"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động năng của vật sẽ được tính bằng công thức KE = 1/2 mv^2:",
    "re": "Động năng tỉ lệ thuận với bình phương vận tốc"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nếu góc tới lớn hơn góc tới giới hạn, thì ánh sáng sẽ bị phản xạ hoàn toàn:",
    "re": "Hiện tượng phản xạ toàn phần xảy ra"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một trường điện đều E, thì lực tác dụng lên điện tích sẽ được tính bằng công thức F = qE:",
    "re": "Lực tỉ lệ thuận với điện tích và cường độ trường điện"
  },
  {
    "con": "Khi một vật quay quanh một trục với vận tốc góc ω, thì gia tốc hướng tâm a_c sẽ được tính bằng công thức a_c = ω^2r:",
    "re": "Gia tốc hướng tâm tỉ lệ thuận với bình phương vận tốc góc"
  },
  {
    "con": "Nếu một sóng điện từ có tần số f, thì bước sóng λ của sóng sẽ được tính bằng công thức λ = c/f, với c là tốc độ ánh sáng:",
    "re": "Bước sóng tỉ lệ nghịch với tần số"
  },
  {
    "con": "Khi một vật chịu tác động của hai lực cân bằng, thì vật sẽ không thay đổi trạng thái chuyển động:",
    "re": "Vật sẽ đứng yên hoặc chuyển động thẳng đều"
  },
  {
    "con": "Tính hiệu điện thế cần thiết để gia tốc electron từ không vận tốc ban đầu đến khi chuyển động như sóng Đờ Brơi với \\lambda = 0,5A^0:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi:",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Khi một vật rơi tự do trong trường hấp dẫn của Trái Đất:",
    "re": "Vật sẽ tăng tốc với gia tốc khoảng 9,81 m/s²"
  },
  {
    "con": "Nếu lực tác dụng lên một vật tăng lên gấp đôi:",
    "re": "Gia tốc của vật cũng sẽ tăng lên gấp đôi nếu khối lượng không thay đổi"
  },
  {
    "con": "Khi một sóng âm đi qua không khí:",
    "re": "Tốc độ sóng âm phụ thuộc vào nhiệt độ và áp suất của không khí"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v va chạm hoàn toàn đàn hồi với một vật khác:",
    "re": "Tổng động năng và tổng động lượng của hệ sẽ được bảo toàn"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác với chỉ số khúc xạ khác nhau:",
    "re": "Ánh sáng sẽ bị bẻ cong theo định luật Snell"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một trường điện đều E:",
    "re": "Điện tích sẽ chịu một lực F = qE"
  },
  {
    "con": "Khi một vật dao động điều hòa với biên độ A và tần số f:",
    "re": "Thời gian dao động sẽ là T = 1/f"
  },
  {
    "con": "Nếu một vật có khối lượng m được nâng lên cao h trong trường hấp dẫn:",
    "re": "Năng lượng tiềm năng của vật sẽ là U = mgh"
  },
  {
    "con": "Electron chuyển động trong hố thế sâu vô hạn một chiều bề rộng a .Tìm biểu thức tính mật độ xác suất tìm electron:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m được thả rơi tự do từ độ cao h:",
    "re": "Vật sẽ đạt vận tốc tối đa v = √(2gh) khi chạm đất"
  },
  {
    "con": "Một lực F tác dụng lên một vật có khối lượng m:",
    "re": "Vật sẽ có gia tốc a = F/m theo định luật Newton thứ hai"
  },
  {
    "con": "Một sóng âm truyền trong không khí với tốc độ v:",
    "re": "Tần số f của sóng sẽ liên hệ với bước sóng λ qua công thức v = fλ"
  },
  {
    "con": "Một vật dao động điều hòa với biên độ A và tần số f:",
    "re": "Phương trình dao động của vật sẽ có dạng x(t) = A cos(2πft + φ)"
  },
  {
    "con": "Một điện tích q đặt trong điện trường E:",
    "re": "Điện tích sẽ chịu lực F = qE"
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính r và vận tốc v:",
    "re": "Vật sẽ có gia tốc hướng tâm a_c = v²/r"
  },
  {
    "con": "Một sóng ánh sáng có bước sóng λ truyền trong chân không:",
    "re": "Tốc độ của sóng ánh sáng sẽ là c = λf"
  },
  {
    "con": "Một vật có khối lượng m và vận tốc v va chạm hoàn toàn đàn hồi với một vật khác:",
    "re": "Tổng động năng của hai vật sẽ được bảo toàn"
  },
  {
    "con": "Một chất rắn có nhiệt độ T được gia nhiệt:",
    "re": "Nhiệt độ của chất sẽ tăng lên theo công thức Q = mcΔT"
  },
  {
    "con": "Một vi hạt chuyển động trong hố thế một chiều sâu vô hạn, bề rộng a thì hàm sóng ở trạng thái có năng lượng En là \\psi_n(x)=\\sqrt{\\frac{2}{a}}sin{(}\\frac{n\\pi\\ x}{a}). Tính xác suất tìm thấy hạt trong phạm vi x = 0 đến x = \\frac{a}{2} trong trạng thái cơ bản.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực không đổi F trong thời gian t, thì gia tốc a của vật được tính bằng công thức a = \\frac{F}{m}, với m là khối lượng của vật.",
    "re": "Gia tốc a được xác định"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, thì vận tốc v của vật khi chạm đất được tính bằng công thức v = \\sqrt{2gh}, với g là gia tốc trọng trường.",
    "re": "Vận tốc v được xác định"
  },
  {
    "con": "Nếu một sóng có tần số f và bước sóng \\lambda, thì vận tốc của sóng v được tính bằng công thức v = f \\cdot \\lambda.",
    "re": "Vận tốc sóng v được xác định"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động năng K của vật được tính bằng công thức K = \\frac{1}{2}mv^2.",
    "re": "Động năng K được xác định"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực ma sát f_s, thì lực ma sát này được tính bằng công thức f_s = \\mu N, với \\mu là hệ số ma sát và N là lực bình thường.",
    "re": "Lực ma sát f_s được xác định"
  },
  {
    "con": "Nếu một vật quay quanh một trục với bán kính r và có vận tốc góc \\omega, thì gia tốc hướng tâm a_c của vật được tính bằng công thức a_c = r\\omega^2.",
    "re": "Gia tốc hướng tâm a_c được xác định"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một trường điện E, thì lực tác dụng lên điện tích được tính bằng công thức F = qE.",
    "re": "Lực F được xác định"
  },
  {
    "con": "Nếu một dòng điện I chạy qua một điện trở R, thì công suất P tiêu thụ trên điện trở được tính bằng công thức P = I^2R.",
    "re": "Công suất P được xác định"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v va chạm với một vật khác, thì động lượng p của hệ được bảo toàn nếu không có lực bên ngoài tác dụng.",
    "re": "Động lượng p được bảo toàn"
  },
  {
    "con": "Vật chịu tác dụng của một lực không đổi trong một khoảng thời gian nhất định",
    "re": "Vật sẽ có gia tốc không đổi"
  },
  {
    "con": "Một vật chuyển động theo quỹ đạo tròn với vận tốc không đổi",
    "re": "Vật sẽ có gia tốc hướng tâm"
  },
  {
    "con": "Năng lượng cơ học của một hệ kín không bị tác động bởi lực bên ngoài",
    "re": "Năng lượng cơ học của hệ sẽ được bảo toàn"
  },
  {
    "con": "Một vật rơi tự do trong môi trường không có sức cản",
    "re": "Vật sẽ có gia tốc bằng gia tốc trọng trường"
  },
  {
    "con": "Khi một sóng âm đi qua một môi trường khác với tốc độ khác",
    "re": "Tần số của sóng sẽ không thay đổi"
  },
  {
    "con": "Một điện tích đặt trong một điện trường",
    "re": "Điện tích sẽ chịu tác dụng của lực điện"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên",
    "re": "Thể tích của chất khí sẽ tăng nếu áp suất không đổi"
  },
  {
    "con": "Một vật có khối lượng m và vận tốc v va chạm với một vật khác",
    "re": "Động lượng của hệ sẽ được bảo toàn nếu va chạm là đàn hồi"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác với chỉ số khúc xạ khác nhau",
    "re": "Ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Khi một vật dao động điều hòa với biên độ A",
    "re": "Vận tốc cực đại của vật sẽ đạt giá trị Aω, với ω là tần số góc"
  },
  {
    "con": "Toán tử \\widehat{x} là toán tử phép biến đổi tọa độ điện tử theo trục x và toán tử \\widehat{p_n} là toán tử hình chiếu động lượng của điện tử đó lên phương x. Phép giao hoán hai toán tử \\widehat{x}.\\widehat{p_n} =\\widehat{p_x}.\\widehat{x} là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hạt vi mô chuyển động trên trục Ox, có độ bất định về động lượng bằng 2% động lượng của nó. Tính tỉ số giữa bước sóng de Broglie \\lambda và độ bất định về tọa độ \\delta x của hạt đó. Cho biết \\mathrm{\\Delta\\ x}.\\mathrm{\\Delta}p_x\\approx\\ h.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m rơi tự do từ độ cao h, không có lực cản,",
    "re": "vận tốc của vật khi chạm đất là \\sqrt{2gh}"
  },
  {
    "con": "Một vật chịu tác dụng của lực F trong thời gian t,",
    "re": "độ biến thiên động lượng của vật là Ft"
  },
  {
    "con": "Một sóng âm truyền trong không khí với tốc độ v,",
    "re": "tần số f của sóng âm liên quan đến bước sóng \\lambda bởi công thức v = f\\lambda"
  },
  {
    "con": "Một điện tích q đặt trong điện trường E,",
    "re": "lực tác dụng lên điện tích là F = qE"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v,",
    "re": "động năng của vật là \\frac{1}{2}mv^2"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo một khoảng x,",
    "re": "năng lượng đàn hồi của lò xo là \\frac{1}{2}kx^2"
  },
  {
    "con": "Một vật quay quanh một trục với bán kính r và vận tốc góc \\omega,",
    "re": "tốc độ tuyến tính của vật là v = r\\omega"
  },
  {
    "con": "Một dòng điện I chạy qua một dây dẫn có điện trở R,",
    "re": "công suất tiêu thụ điện là P = I^2R"
  },
  {
    "con": "Một vật có khối lượng m và vận tốc v va chạm hoàn toàn đàn hồi với một vật khác có khối lượng M và vận tốc V,",
    "re": "các vận tốc sau va chạm được tính theo công thức bảo toàn động lượng và năng lượng"
  },
  {
    "con": "Phát biểu nào sau đây là SAI?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt",
    "re": "Năng lượng tổng luôn được bảo toàn"
  },
  {
    "con": "Một vật rơi tự do trong chân không",
    "re": "Chịu tác động của trọng lực mà không có lực cản"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nội tại của vật cũng tăng lên"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác",
    "re": "Lực hấp dẫn giữa hai vật sẽ lớn hơn"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác",
    "re": "Tốc độ ánh sáng thay đổi tùy thuộc vào chỉ số khúc xạ"
  },
  {
    "con": "Nếu một vật có động năng lớn",
    "re": "Vật đó có thể có vận tốc lớn hoặc khối lượng lớn"
  },
  {
    "con": "Khi một sóng âm đi qua không khí",
    "re": "Nó truyền năng lượng qua không gian mà không di chuyển không khí"
  },
  {
    "con": "Nếu một vật bị nén trong lò xo",
    "re": "Nó sẽ có năng lượng tiềm năng đàn hồi"
  },
  {
    "con": "Quả cầu kim loại A tích điện dương +8C, quả cầu B tích điện âm –2C. Cho chúng chạm nhau rồi tách xa nhau thì điện tích lúc sau của hai quả cầu đó có thể có giá trị nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h, thì vận tốc của vật khi chạm đất sẽ phụ thuộc vào độ cao h và gia tốc trọng trường g.",
    "re": "Vận tốc của vật sẽ tăng theo căn bậc hai của độ cao h."
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động năng của vật đó sẽ được tính bằng công thức 1/2 mv^2.",
    "re": "Động năng của vật sẽ tăng khi vận tốc v tăng."
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m, thì gia tốc a của vật sẽ được tính bằng công thức F = ma.",
    "re": "Gia tốc a sẽ tỷ lệ thuận với lực F và tỷ lệ nghịch với khối lượng m."
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cùng phương và cùng chiều, thì tổng hợp lực sẽ là tổng của hai lực đó.",
    "re": "Vật sẽ có gia tốc lớn hơn nếu lực tác dụng lớn hơn."
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác, nếu chỉ số khúc xạ của môi trường thứ hai lớn hơn môi trường thứ nhất, thì ánh sáng sẽ bị khúc xạ về phía pháp tuyến.",
    "re": "Góc khúc xạ sẽ nhỏ hơn góc tới."
  },
  {
    "con": "Nếu một sóng âm có tần số f, thì bước sóng λ của sóng âm đó sẽ được tính bằng công thức λ = v/f, với v là tốc độ âm thanh.",
    "re": "Bước sóng λ sẽ tăng khi tần số f giảm."
  },
  {
    "con": "Khi một vật dao động điều hòa với biên độ A và tần số f, thì năng lượng dao động của vật sẽ tỷ lệ với bình phương biên độ A.",
    "re": "Năng lượng dao động sẽ tăng khi biên độ A tăng."
  },
  {
    "con": "Nếu một điện trở R được nối với một nguồn điện có hiệu điện thế U, thì cường độ dòng điện I chạy qua điện trở sẽ được tính bằng công thức I = U/R.",
    "re": "Cường độ dòng điện I sẽ tăng khi hiệu điện thế U tăng."
  },
  {
    "con": "Khi một vật được ném lên cao với vận tốc ban đầu v0, thì độ cao cực đại mà vật đạt được sẽ phụ thuộc vào vận tốc ban đầu và gia tốc trọng trường.",
    "re": "Độ cao cực đại sẽ giảm nếu vận tốc ban đầu v0 giảm."
  },
  {
    "con": "Hai vật tích điện +16C và –5C trao đổi điện tích với nhau. Điện tích lúc sau của hai vật đó không thể có giá trị nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2kg và một vật có khối lượng 3kg rơi tự do từ cùng một độ cao. Vật nào sẽ chạm đất trước?",
    "re": "Cả hai vật sẽ chạm đất cùng một lúc"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc 10m/s. Nếu không có lực tác động nào, thì vật đó sẽ tiếp tục chuyển động như thế nào?",
    "re": "Vật sẽ tiếp tục chuyển động với vận tốc 10m/s"
  },
  {
    "con": "Một lò xo bị nén và sau đó được thả ra. Nếu không có lực cản, thì lò xo sẽ làm gì?",
    "re": "Lò xo sẽ trở về trạng thái ban đầu và dao động quanh vị trí cân bằng"
  },
  {
    "con": "Một vật có khối lượng 5kg được treo vào một sợi dây. Nếu trọng lực tác động lên vật là 50N, thì lực căng trong dây sẽ là bao nhiêu?",
    "re": "Lực căng trong dây sẽ là 50N"
  },
  {
    "con": "Một quả bóng được ném lên cao với vận tốc ban đầu 20m/s. Nếu không có lực cản, thì quả bóng sẽ đạt độ cao tối đa khi nào?",
    "re": "Khi vận tốc của quả bóng bằng 0m/s"
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính 2m. Nếu tốc độ góc là 5 rad/s, thì vận tốc tuyến tính của vật là bao nhiêu?",
    "re": "Vận tốc tuyến tính sẽ là 10m/s"
  },
  {
    "con": "Một điện trở có giá trị 10Ω và một nguồn điện áp 20V được kết nối với nhau. Nếu điện trở không thay đổi, thì dòng điện chạy qua điện trở sẽ là bao nhiêu?",
    "re": "Dòng điện sẽ là 2A"
  },
  {
    "con": "Một vật có khối lượng 1kg di chuyển với vận tốc 3m/s. Nếu vật va chạm hoàn toàn đàn hồi với một vật khác có khối lượng 1kg đứng yên, thì sau va chạm, vật thứ hai sẽ có vận tốc là bao nhiêu?",
    "re": "Vật thứ hai sẽ có vận tốc 3m/s"
  },
  {
    "con": "Hai điện tích điểm cùng dấu q_1 và q_2 (q_1 = 4q_2) đặt tại A và B cách nhau một khoảng 3a trong không khí. Đặt điện tích điểm Q trên đoạn AB, cách B một khoảng A. Lực tổng hợp do q_1 và q_2 tác dụng lên Q có đặc điểm gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v không đổi. Nếu lực tác dụng lên vật bằng 0 thì vật sẽ tiếp tục chuyển động với vận tốc v.",
    "re": "Vật sẽ không thay đổi vận tốc"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Nếu không có lực cản của không khí thì vật sẽ đạt vận tốc tối đa khi chạm đất.",
    "re": "Vận tốc tối đa sẽ phụ thuộc vào độ cao h"
  },
  {
    "con": "Một lò xo được nén hoặc kéo ra. Nếu lực tác dụng lên lò xo vượt quá giới hạn đàn hồi thì lò xo sẽ không trở về trạng thái ban đầu.",
    "re": "Lò xo sẽ bị biến dạng vĩnh viễn"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Nếu vật va chạm hoàn toàn đàn hồi với một vật khác có khối lượng M thì tổng động năng của hệ sẽ được bảo toàn.",
    "re": "Động năng trước và sau va chạm sẽ bằng nhau"
  },
  {
    "con": "Một điện tích điểm Q đặt trong điện trường đều. Nếu điện trường có cường độ E thì lực tác dụng lên điện tích Q sẽ bằng Q nhân với E.",
    "re": "Lực tác dụng lên điện tích sẽ là F = Q * E"
  },
  {
    "con": "Một sóng âm truyền trong không khí. Nếu tần số sóng tăng thì bước sóng sẽ giảm theo quy luật v = f * λ.",
    "re": "Vận tốc sóng âm trong không khí không thay đổi"
  },
  {
    "con": "Một vật có khối lượng m nằm trên mặt phẳng nghiêng với góc α. Nếu góc α tăng thì lực ma sát tĩnh tối đa sẽ thay đổi.",
    "re": "Lực ma sát tĩnh tối đa sẽ tăng lên"
  },
  {
    "con": "Một dòng điện chạy qua một dây dẫn có điện trở R. Nếu điện áp U tăng thì dòng điện I sẽ tăng theo định luật Ohm.",
    "re": "Dòng điện I sẽ tỉ lệ thuận với điện áp U"
  },
  {
    "con": "Một vật có khối lượng m được treo bằng một sợi dây. Nếu vật bị kéo lên một khoảng h thì công thực hiện để nâng vật sẽ bằng mgh.",
    "re": "Công thực hiện sẽ phụ thuộc vào khối lượng m và độ cao h"
  },
  {
    "con": "Hai điện tích điểm trái dấu q_1 và q_2 (q_1 = –4q_2), đặt tại A và B cách nhau một khoảng 4a trong không khí. Đặt điện tích điểm Q trên đoạn AB, cách B một khoảng A. Lực tổng hợp do q_1 và q_2 tác dụng lên Q có đặc điểm gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m được thả rơi tự do từ độ cao h. Vận tốc của vật khi chạm đất sẽ phụ thuộc vào độ cao h.",
    "re": "Vận tốc của vật sẽ tăng theo căn bậc hai của độ cao h."
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v. Thời gian t mà vật di chuyển một quãng đường s sẽ được tính bằng công thức s = vt.",
    "re": "Thời gian t sẽ tỷ lệ thuận với quãng đường s."
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m, nếu lực này không thay đổi, thì gia tốc a của vật sẽ được tính bằng công thức F = ma.",
    "re": "Gia tốc a sẽ tỷ lệ thuận với lực F và tỷ lệ nghịch với khối lượng m."
  },
  {
    "con": "Khi một vật quay quanh một trục với vận tốc góc ω, thì động năng quay của vật sẽ được tính bằng công thức E_k = 1/2 I ω², với I là mô men quán tính.",
    "re": "Động năng quay sẽ tăng khi vận tốc góc ω tăng."
  },
  {
    "con": "Trong một hệ thống kín, nếu không có lực bên ngoài tác dụng, thì tổng động lượng của hệ thống sẽ được bảo toàn.",
    "re": "Tổng động lượng sẽ không thay đổi theo thời gian."
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác, nếu chỉ số khúc xạ của môi trường thứ hai lớn hơn môi trường thứ nhất, thì ánh sáng sẽ bị khúc xạ về phía pháp tuyến.",
    "re": "Góc khúc xạ sẽ nhỏ hơn góc tới."
  },
  {
    "con": "Khi một sóng âm truyền qua không khí, nếu tần số f của sóng tăng, thì bước sóng λ sẽ giảm.",
    "re": "Tốc độ sóng âm trong không khí sẽ không thay đổi."
  },
  {
    "con": "Khi một điện tích q di chuyển trong một trường điện đều E, thì công thực hiện bởi lực điện sẽ được tính bằng công thức W = qEd.",
    "re": "Công W sẽ tỷ lệ thuận với điện tích q và khoảng cách d."
  },
  {
    "con": "Khi một vật chịu tác dụng của lực đàn hồi F_h, thì lực này sẽ tỷ lệ thuận với độ biến dạng x của vật theo định luật Hooke.",
    "re": "F_h = -kx, với k là hệ số đàn hồi."
  },
  {
    "con": "Lực tương tác giữa 2 điện tích điểm sẽ thay đổi thế nào nếu ta cho độ lớn của mỗi điện tích điểm đó tăng gấp đôi, đồng thời khoảng cách giữa chúng cũng tăng gấp đôi?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chịu tác dụng của một lực không đổi trong một khoảng thời gian nhất định, thì vận tốc của vật đó sẽ thay đổi theo tỷ lệ với thời gian tác dụng của lực.",
    "re": "Vận tốc của vật sẽ tăng lên"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, thì thời gian rơi của vật sẽ phụ thuộc vào độ cao h và gia tốc trọng trường g.",
    "re": "Thời gian rơi sẽ tăng khi độ cao h tăng"
  },
  {
    "con": "Nếu nhiệt độ của một khí lý tưởng tăng lên, thì thể tích của khí đó sẽ tăng nếu áp suất được giữ cố định.",
    "re": "Thể tích khí sẽ tăng theo định luật Charles"
  },
  {
    "con": "Nếu một sóng âm đi từ không khí vào nước, thì tốc độ của sóng âm sẽ tăng lên.",
    "re": "Tốc độ sóng âm trong nước lớn hơn trong không khí"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động năng của vật đó sẽ tăng lên khi vận tốc v tăng.",
    "re": "Động năng sẽ tăng theo bình phương vận tốc"
  },
  {
    "con": "Nếu một điện trở R được nối với một nguồn điện có hiệu điện thế U, thì dòng điện chạy qua điện trở sẽ tỉ lệ thuận với hiệu điện thế.",
    "re": "Dòng điện sẽ tăng khi hiệu điện thế U tăng"
  },
  {
    "con": "Nếu một vật có khối lượng m được nâng lên cao h trong trường trọng lực, thì năng lượng thế năng của vật đó sẽ tăng lên.",
    "re": "Năng lượng thế năng sẽ tăng theo khối lượng và độ cao"
  },
  {
    "con": "Nếu một vật quay quanh một trục với vận tốc góc không đổi, thì gia tốc hướng tâm của vật đó sẽ tỉ lệ thuận với bình phương vận tốc và tỉ lệ nghịch với bán kính quỹ đạo.",
    "re": "Gia tốc hướng tâm sẽ tăng khi vận tốc tăng hoặc bán kính giảm"
  },
  {
    "con": "Nếu một sóng điện từ di chuyển trong chân không, thì tốc độ của sóng sẽ không thay đổi.",
    "re": "Tốc độ sóng điện từ trong chân không là hằng số"
  },
  {
    "con": "Điện tích Q = - 5.10^{ – 8} C đặt trong không khí. Độ lớn của vectơ cường độ điện trường do điện tích Q gây ra tại điểm M cách nó 30cm có giá trị nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m = 2 kg rơi tự do từ độ cao h = 20 m. Vận tốc của vật khi chạm đất là bao nhiêu?",
    "re": "Vận tốc đạt khoảng 19.8 m/s"
  },
  {
    "con": "Một lò xo có độ cứng k = 100 N/m bị nén lại 0.1 m. Năng lượng tích trữ trong lò xo là bao nhiêu?",
    "re": "Năng lượng tích trữ là 0.5 J"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v = 10 m/s trong 5 giây. Quãng đường mà vật đi được là bao nhiêu?",
    "re": "Quãng đường là 50 m"
  },
  {
    "con": "Một điện trở có giá trị R = 10 Ω được nối với nguồn điện có hiệu điện thế U = 20 V. Cường độ dòng điện chạy qua điện trở là bao nhiêu?",
    "re": "Cường độ dòng điện là 2 A"
  },
  {
    "con": "Một sóng âm có tần số f = 440 Hz. Tốc độ truyền âm trong không khí là 340 m/s. Bước sóng của sóng âm này là bao nhiêu?",
    "re": "Bước sóng là 0.773 m"
  },
  {
    "con": "Một vật có khối lượng m = 5 kg được kéo lên cao với gia tốc a = 2 m/s². Lực kéo cần thiết là bao nhiêu?",
    "re": "Lực kéo cần thiết là 35 N"
  },
  {
    "con": "Một vật có khối lượng m = 3 kg đang chuyển động với vận tốc v = 4 m/s. Động năng của vật là bao nhiêu?",
    "re": "Động năng là 24 J"
  },
  {
    "con": "Một điện tích điểm Q = 1.6.10^{-19} C đặt trong điện trường đều có cường độ E = 1000 N/C. Lực tác dụng lên điện tích là bao nhiêu?",
    "re": "Lực tác dụng là 1.6.10^{-16} N"
  },
  {
    "con": "Một vật có khối lượng m = 10 kg được đặt trên mặt phẳng nghiêng với góc α = 30°. Lực kéo xuống mặt phẳng là bao nhiêu?",
    "re": "Lực kéo xuống mặt phẳng là 49 N"
  },
  {
    "con": "Hai quả cầu nhỏ giống hệt nhau, tích điện cùng dấu, đặt tại A và B. Mỗi quả cầu gây ra tại trung điểm M của AB một điện trường có cường độ là E_1 = 300V/m và E_2 = 200V/m. Nếu cho 2 quả cầu tiếp xúc nhau rồi đưa về vị trí cũ thì cường độ điện trường tại M là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h, nếu không có lực cản của không khí thì thời gian rơi t sẽ được tính bằng công thức t = √(2h/g), với g là gia tốc trọng trường.",
    "re": "Thời gian rơi t là đúng"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động năng của vật đó được tính bằng công thức Ek = 1/2 mv^2.",
    "re": "Động năng Ek là đúng"
  },
  {
    "con": "Nếu một lực F tác dụng lên một vật có khối lượng m và gây ra gia tốc a, thì theo định luật II Newton, F = ma.",
    "re": "Định luật II Newton là đúng"
  },
  {
    "con": "Nếu một vật quay quanh một trục với vận tốc góc ω, thì tần số f của vật đó được tính bằng công thức f = ω/(2π).",
    "re": "Tần số f là đúng"
  },
  {
    "con": "Nếu một sóng có bước sóng λ và tần số f, thì vận tốc của sóng v được tính bằng công thức v = fλ.",
    "re": "Vận tốc sóng v là đúng"
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cùng phương và cùng chiều, thì tổng hợp lực sẽ là tổng của hai lực đó.",
    "re": "Tổng hợp lực là đúng"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển theo đường thẳng với vận tốc không đổi, thì lực tác dụng lên vật đó là bằng 0.",
    "re": "Lực tác dụng là đúng"
  },
  {
    "con": "Nếu một vật được ném lên với vận tốc ban đầu v0, thì độ cao cực đại h mà vật đạt được được tính bằng công thức h = v0^2/(2g).",
    "re": "Độ cao cực đại h là đúng"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một điện trường E, thì lực tác dụng lên điện tích đó được tính bằng công thức F = qE.",
    "re": "Lực tác dụng F là đúng"
  },
  {
    "con": "Có 2 điện tích điểm q_1, q_2 bằng nhau nhưng trái dấu, đặt trên đường thẳng xy như hình 1.1. Đặt thêm điện tích điểm Q < 0 trên đường thẳng xy",
    "re": "lực tác dụng lên Q: Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h trong môi trường không có sức cản của không khí",
    "re": "thời gian rơi t được tính bằng công thức t = √(2h/g), với g là gia tốc trọng trường"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v",
    "re": "quãng đường đi được trong thời gian t là S = vt"
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m, và vật không bị cản trở",
    "re": "vật sẽ có gia tốc a = F/m theo định luật II Newton"
  },
  {
    "con": "Một sóng âm có tần số f và vận tốc truyền sóng v trong không khí",
    "re": "bước sóng λ được tính bằng công thức λ = v/f"
  },
  {
    "con": "Khi một điện tích q di chuyển trong một trường điện đều với cường độ E",
    "re": "điện tích sẽ chịu lực F = qE"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v và va chạm hoàn toàn đàn hồi với một vật khác",
    "re": "tổng động năng của hai vật trước và sau va chạm sẽ được bảo toàn"
  },
  {
    "con": "Khi một vật quay quanh một trục với bán kính r và có vận tốc góc ω",
    "re": "tốc độ tuyến tính v của vật được tính bằng công thức v = rω"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo dài một khoảng x",
    "re": "lực phục hồi F của lò xo được tính bằng công thức F = -kx theo định luật Hooke"
  },
  {
    "con": "Khi một vật chịu tác dụng của nhiều lực đồng quy",
    "re": "có thể sử dụng quy tắc tổng hợp lực để xác định lực tổng hợp tác dụng lên vật"
  },
  {
    "con": "Có 2 điện tích điểm q_1, q_2 bằng nhau, cùng dấu, đặt trên đường thẳng xy như hình 1.2. Đặt thêm điện tích điểm Q < 0 trên đường thẳng xy",
    "re": "lực tác dụng lên Q là hướng về phía giữa q_1 và q_2"
  },
  {
    "con": "Một vật có khối lượng m được thả rơi tự do từ độ cao h",
    "re": "vận tốc của vật khi chạm đất sẽ được tính bằng công thức v = √(2gh)"
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính r và vận tốc góc ω",
    "re": "gia tốc hướng tâm của vật sẽ được tính bằng a = ω²r"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo một khoảng x",
    "re": "lực phục hồi của lò xo sẽ được tính bằng F = -kx"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v va chạm hoàn toàn đàn hồi với một vật khác có khối lượng M",
    "re": "cả hai vật sẽ có vận tốc mới được tính theo định luật bảo toàn động lượng"
  },
  {
    "con": "Một sóng âm có tần số f và tốc độ truyền sóng v",
    "re": "bước sóng λ sẽ được tính bằng λ = v/f"
  },
  {
    "con": "Một điện tích điểm q đặt trong điện trường E",
    "re": "lực tác dụng lên điện tích sẽ được tính bằng F = qE"
  },
  {
    "con": "Một vật có khối lượng m được treo vào một lò xo và dao động điều hòa",
    "re": "tần số dao động sẽ được tính bằng f = (1/2π)√(k/m)"
  },
  {
    "con": "Một nguồn sáng phát ra ánh sáng với công suất P và khoảng cách từ nguồn đến điểm quan sát là r",
    "re": "cường độ ánh sáng tại điểm quan sát sẽ được tính bằng I = P/(4πr²)"
  },
  {
    "con": "Một điện trở R được nối với một nguồn điện có hiệu điện thế U",
    "re": "cường độ dòng điện chạy qua điện trở sẽ được tính bằng I = U/R"
  },
  {
    "con": "Có 2 điện tích điểm q_1, q_2 bằng nhau, cùng dấu, đặt trên đường thẳng xy như hình 1.3. Đặt thêm điện tích điểm Q > 0 trên đường thẳng xy",
    "re": "lực tác dụng lên Q là lực đẩy"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h trong môi trường không có sức cản của không khí",
    "re": "vật sẽ đạt vận tốc tối đa khi chạm đất"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v trên mặt phẳng nằm ngang không ma sát",
    "re": "động lượng của vật là p = mv"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo ra một khoảng x",
    "re": "lực phục hồi của lò xo là F = -kx"
  },
  {
    "con": "Một vật chịu tác dụng của lực F không đổi trong khoảng thời gian t",
    "re": "vận tốc của vật sẽ thay đổi theo công thức v = v_0 + (F/m)t"
  },
  {
    "con": "Một sóng âm truyền trong không khí với tốc độ v",
    "re": "tần số f và bước sóng λ có mối quan hệ f = v/λ"
  },
  {
    "con": "Một điện tích điểm Q đặt trong điện trường E",
    "re": "lực tác dụng lên điện tích là F = QE"
  },
  {
    "con": "Một vật có khối lượng m di chuyển theo quỹ đạo tròn với bán kính r và vận tốc v",
    "re": "lực hướng tâm tác dụng lên vật là F = mv^2/r"
  },
  {
    "con": "Một nguồn sáng phát ra ánh sáng với tần số f",
    "re": "năng lượng của photon là E = hf, với h là hằng số Planck"
  },
  {
    "con": "Một vật có nhiệt độ T trong môi trường có nhiệt độ thấp hơn",
    "re": "vật sẽ truyền nhiệt cho môi trường cho đến khi đạt trạng thái cân bằng nhiệt"
  },
  {
    "con": "Hai quả cầu kim loại giống nhau, có thể chuyển động tự do trên mặt phẳng ngang. Ban đầu chúng đứng cách nhau một khoảng A. Tích điện 2.10– 6 C cho quả cầu thứ nhất và –4.10^{– 6}C cho quả cầu thứ hai",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h, không chịu tác động của lực cản không khí",
    "re": "Vật sẽ đạt vận tốc tối đa khi chạm đất"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v trên mặt phẳng ngang và va chạm với một vật khác có khối lượng M đứng yên",
    "re": "Tổng động lượng của hệ trước và sau va chạm sẽ được bảo toàn nếu va chạm là đàn hồi"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo dài một khoảng x",
    "re": "Lực phục hồi của lò xo sẽ bằng kx và hướng về vị trí cân bằng"
  },
  {
    "con": "Một vật có khối lượng m được treo vào một sợi dây và chịu tác động của trọng lực",
    "re": "Tension trong dây sẽ bằng mg khi vật ở trạng thái cân bằng"
  },
  {
    "con": "Một sóng âm truyền trong không khí với tần số f",
    "re": "Vận tốc của sóng âm sẽ bằng f nhân với bước sóng λ"
  },
  {
    "con": "Một điện tích điểm q đặt trong một trường điện đều",
    "re": "Điện trường E sẽ tác động lên điện tích với lực F = qE"
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính r và vận tốc góc ω",
    "re": "Gia tốc hướng tâm a sẽ bằng ω²r"
  },
  {
    "con": "Một vật có khối lượng m di chuyển trên mặt phẳng nghiêng với góc α",
    "re": "Lực tác dụng lên vật sẽ bao gồm trọng lực và lực ma sát"
  },
  {
    "con": "Một nguồn sáng phát ra ánh sáng đồng nhất trong không gian",
    "re": "Cường độ ánh sáng sẽ giảm theo khoảng cách theo quy luật nghịch đảo bình phương"
  },
  {
    "con": "Phát biểu nào sau đây là SAI?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt",
    "re": "Năng lượng tổng luôn được bảo toàn"
  },
  {
    "con": "Một vật rơi tự do trong chân không",
    "re": "Chịu tác động của trọng lực mà không có lực cản"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nội tại của vật cũng tăng lên"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn thì",
    "re": "Lực hấp dẫn tác dụng lên vật đó cũng lớn hơn"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác",
    "re": "Tốc độ ánh sáng thay đổi tùy thuộc vào chỉ số khúc xạ của môi trường"
  },
  {
    "con": "Khi một sóng âm đi qua một môi trường khác",
    "re": "Tần số của sóng âm không thay đổi"
  },
  {
    "con": "Nếu một vật có động năng lớn",
    "re": "Vật đó có vận tốc lớn hoặc khối lượng lớn"
  },
  {
    "con": "Khi một vật dao động điều hòa",
    "re": "Vật đó có biên độ và tần số xác định"
  },
  {
    "con": "Một điện tích điểm q < 0 được đặt trên trục của một vành khuyên tâm O mang điện tích dương (hình 1.4), sau đó được thả tự do. Kết luận nào sau đây là đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chịu tác dụng của một lực không đổi, thì vật sẽ có gia tốc không đổi.",
    "re": "Gia tốc của vật tỉ lệ thuận với lực tác dụng và nghịch đảo với khối lượng của vật."
  },
  {
    "con": "Nếu một vật chuyển động thẳng đều, thì quãng đường đi được tỉ lệ thuận với thời gian.",
    "re": "Vận tốc của vật là hằng số trong suốt quá trình chuyển động."
  },
  {
    "con": "Nếu một vật rơi tự do trong môi trường không có lực cản, thì gia tốc của vật là hằng số.",
    "re": "Gia tốc do trọng lực tác dụng lên vật là khoảng 9.81 m/s² gần bề mặt Trái Đất."
  },
  {
    "con": "Nếu một sóng âm truyền qua không khí, thì tốc độ của sóng âm phụ thuộc vào nhiệt độ của không khí.",
    "re": "Tốc độ sóng âm tăng khi nhiệt độ không khí tăng."
  },
  {
    "con": "Nếu một điện tích dương được đặt trong một điện trường, thì điện tích sẽ chịu lực tác dụng theo hướng của điện trường.",
    "re": "Lực tác dụng lên điện tích dương là hướng ra xa từ nguồn điện trường."
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v, thì động năng của vật được tính bằng công thức 1/2 mv².",
    "re": "Động năng là đại lượng đo lường năng lượng mà vật có do chuyển động."
  },
  {
    "con": "Nếu một vật va chạm đàn hồi với một vật khác, thì tổng động năng của hệ trước và sau va chạm là không đổi.",
    "re": "Va chạm đàn hồi bảo toàn cả động lượng và động năng."
  },
  {
    "con": "Nếu một vật quay quanh một trục với vận tốc góc không đổi, thì lực hướng tâm tác dụng lên vật là hằng số.",
    "re": "Lực hướng tâm tỉ lệ thuận với khối lượng và bình phương vận tốc góc của vật."
  },
  {
    "con": "Nếu một sóng ánh sáng đi từ môi trường này sang môi trường khác, thì hiện tượng khúc xạ xảy ra.",
    "re": "Góc khúc xạ tỉ lệ thuận với chỉ số khúc xạ của hai môi trường."
  },
  {
    "con": "Phát biểu nào sau đây là đúng khi nói về cường độ điện trường tại điểm M do điện tích điểm Q gây ra?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì vận tốc của nó không thay đổi theo thời gian.",
    "re": "Vận tốc là hằng số"
  },
  {
    "con": "Một vật chịu tác dụng của lực không đổi thì nó sẽ có gia tốc không đổi.",
    "re": "Gia tốc là hằng số"
  },
  {
    "con": "Khi một vật rơi tự do thì gia tốc của nó bằng gia tốc trọng trường.",
    "re": "Gia tốc là 9.81 m/s² gần bề mặt Trái Đất"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v thì động năng của nó được tính bằng công thức 1/2 mv².",
    "re": "Động năng là một đại lượng dương"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí thì nó di chuyển với tốc độ khoảng 343 m/s ở nhiệt độ 20°C.",
    "re": "Tốc độ sóng âm phụ thuộc vào nhiệt độ và áp suất"
  },
  {
    "con": "Nếu một điện tích di chuyển trong một điện trường thì nó sẽ chịu tác dụng của lực điện.",
    "re": "Lực điện có hướng cùng chiều với điện trường nếu điện tích dương"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác thì nó sẽ bị khúc xạ.",
    "re": "Góc khúc xạ phụ thuộc vào chỉ số khúc xạ của hai môi trường"
  },
  {
    "con": "Nếu một vật có khối lượng m và được nâng lên cao h thì năng lượng thế của nó được tính bằng công thức mgh.",
    "re": "Năng lượng thế là năng lượng tiềm tàng do trọng lực"
  },
  {
    "con": "Khi một vật quay quanh một trục thì nó có động lượng góc.",
    "re": "Động lượng góc phụ thuộc vào khối lượng, vận tốc và khoảng cách từ trục quay"
  },
  {
    "con": "Hai điện tích điểm q_1 và q_2 cùng độ lớn và trái dấu. Cường độ điện trường do hai điện tích đó gây ra sẽ triệt tiêu (E = 0) tại điểm M nào dưới đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chuyển động thẳng đều, thì quãng đường đi được sẽ tỉ lệ thuận với thời gian.",
    "re": "Vận tốc của vật là hằng số"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực không đổi, thì gia tốc của vật sẽ là hằng số.",
    "re": "Vật sẽ chuyển động theo phương thẳng với gia tốc không đổi"
  },
  {
    "con": "Nếu một vật rơi tự do trong môi trường không có sức cản, thì gia tốc của vật sẽ bằng gia tốc trọng trường.",
    "re": "Vật sẽ rơi với gia tốc khoảng 9.81 m/s²"
  },
  {
    "con": "Nếu một sóng âm truyền trong không khí, thì tốc độ của sóng âm sẽ phụ thuộc vào nhiệt độ của không khí.",
    "re": "Tốc độ sóng âm sẽ tăng khi nhiệt độ tăng"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v, thì động năng của vật sẽ được tính bằng công thức 1/2 mv².",
    "re": "Động năng của vật sẽ tăng khi vận tốc tăng"
  },
  {
    "con": "Nếu một vật bị kéo lên cao bởi một lực F, thì công thực hiện bởi lực này sẽ bằng F nhân với độ cao h.",
    "re": "Công thực hiện sẽ tăng khi độ cao tăng"
  },
  {
    "con": "Nếu một lò xo bị nén hoặc kéo ra, thì lực phục hồi của lò xo sẽ tỉ lệ thuận với độ biến dạng của nó.",
    "re": "Lực phục hồi sẽ tuân theo định luật Hooke"
  },
  {
    "con": "Nếu một vật quay quanh một trục với vận tốc góc không đổi, thì lực hướng tâm tác dụng lên vật sẽ tỉ lệ thuận với bình phương vận tốc và tỉ lệ nghịch với bán kính quỹ đạo.",
    "re": "Lực hướng tâm sẽ tăng khi vận tốc tăng hoặc bán kính giảm"
  },
  {
    "con": "Nếu một điện trở R được nối với một nguồn điện có hiệu điện thế U, thì cường độ dòng điện I chạy qua điện trở sẽ được tính bằng công thức I = U/R.",
    "re": "Cường độ dòng điện sẽ tăng khi hiệu điện thế tăng hoặc điện trở giảm"
  },
  {
    "con": "Trong hệ SI, đơn vị đo cường độ điện trường E là:",
    "re": "V/m"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực không đổi, thì nó sẽ:",
    "re": "có gia tốc không đổi"
  },
  {
    "con": "Nếu một vật rơi tự do trong chân không, thì nó sẽ:",
    "re": "có gia tốc bằng gia tốc trọng trường"
  },
  {
    "con": "Nếu một sóng âm di chuyển trong không khí, thì nó sẽ:",
    "re": "có tốc độ khoảng 343 m/s ở nhiệt độ 20°C"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v, thì động năng của nó sẽ được tính bằng công thức:",
    "re": "0.5 * m * v^2"
  },
  {
    "con": "Nếu một vật được ném lên cao, thì nó sẽ:",
    "re": "đạt đến độ cao cực đại trước khi rơi xuống"
  },
  {
    "con": "Nếu một lực F tác dụng lên một vật có khối lượng m, thì gia tốc a của vật sẽ được tính bằng công thức:",
    "re": "a = F/m"
  },
  {
    "con": "Nếu một vật quay quanh một trục với tốc độ góc ω, thì vận tốc tuyến tính v của nó sẽ được tính bằng công thức:",
    "re": "v = r * ω"
  },
  {
    "con": "Nếu một sóng ánh sáng đi từ môi trường này sang môi trường khác, thì hiện tượng xảy ra là:",
    "re": "khúc xạ ánh sáng"
  },
  {
    "con": "Nếu một vật có khối lượng m và nằm trong trường hấp dẫn, thì lực hấp dẫn tác dụng lên nó sẽ được tính bằng công thức:",
    "re": "F = m * g"
  },
  {
    "con": "Tấm kim loại (P) phẳng rất rộng, tích điện đều. So sánh cường độ điện trường do (P) gây ra tại các điểm A, B, C",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do trong chân không, không chịu tác động của lực cản không khí",
    "re": "Vật sẽ rơi với gia tốc không đổi bằng gia tốc trọng trường"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Khi một sóng âm đi từ không khí vào nước",
    "re": "Tốc độ sóng âm sẽ tăng lên"
  },
  {
    "con": "Một lò xo bị nén hoặc kéo ra khỏi vị trí cân bằng",
    "re": "Lực đàn hồi tác dụng lên lò xo sẽ tỷ lệ thuận với độ biến dạng của nó"
  },
  {
    "con": "Một vật có khối lượng m và vận tốc v va chạm hoàn toàn đàn hồi với một vật khác",
    "re": "Tổng động năng của hệ vật sẽ được bảo toàn"
  },
  {
    "con": "Một điện tích điểm đặt trong điện trường đều",
    "re": "Sẽ chịu lực điện có phương cùng hướng với điện trường"
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính r và vận tốc góc ω",
    "re": "Có gia tốc hướng tâm có độ lớn a = ω²r"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường có chiết suất n1 sang môi trường có chiết suất n2",
    "re": "Góc khúc xạ sẽ được xác định bởi định luật Snell"
  },
  {
    "con": "Một mạch điện có điện trở R và hiệu điện thế U",
    "re": "Cường độ dòng điện chạy qua mạch sẽ được tính bằng định luật Ohm: I = U/R"
  },
  {
    "con": "Hai điện tích điểm Q_1 = 8mC, Q_2 = - 6mC đặt tại hai điểm A, B cách nhau 10cm trong không khí. Tính độ lớn của vectơ cường độ điện trường do hai điện tích này gây ra tại điểm M, biết M_A = 8cm, M_B = 6cm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m = 2kg rơi tự do từ độ cao h = 20m. Tính vận tốc của vật khi chạm đất.",
    "re": "Vận tốc của vật khi chạm đất là 20m/s"
  },
  {
    "con": "Một lò xo có độ cứng k = 300 N/m bị nén lại 0.1m. Tính năng lượng tiềm năng đàn hồi của lò xo.",
    "re": "Năng lượng tiềm năng đàn hồi của lò xo là 1.5J"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v = 10m/s trong 5 giây. Tính quãng đường mà vật đã đi được.",
    "re": "Quãng đường mà vật đã đi được là 50m"
  },
  {
    "con": "Một quả bóng có khối lượng 0.5kg va chạm với một bức tường và phản hồi lại với vận tốc 8m/s. Tính động lượng của quả bóng trước và sau va chạm.",
    "re": "Động lượng của quả bóng trước va chạm là 4kg.m/s và sau va chạm là -4kg.m/s"
  },
  {
    "con": "Một mạch điện có điện trở R = 10Ω và nguồn điện áp U = 20V. Tính cường độ dòng điện trong mạch.",
    "re": "Cường độ dòng điện trong mạch là 2A"
  },
  {
    "con": "Một vật có khối lượng 3kg được kéo lên cao với gia tốc a = 2m/s². Tính lực kéo cần thiết.",
    "re": "Lực kéo cần thiết là 15N"
  },
  {
    "con": "Một sóng âm có tần số f = 440Hz và vận tốc truyền trong không khí v = 340m/s. Tính bước sóng của sóng âm.",
    "re": "Bước sóng của sóng âm là 0.773m"
  },
  {
    "con": "Một vật có khối lượng 1kg di chuyển với vận tốc 5m/s va chạm với một vật khác có khối lượng 2kg đứng yên. Tính vận tốc của hai vật sau va chạm nếu va chạm hoàn toàn đàn hồi.",
    "re": "Vận tốc của hai vật sau va chạm là 3.33m/s và 1.67m/s"
  },
  {
    "con": "Một vật có khối lượng 4kg treo lơ lửng trên một lò xo có độ cứng k = 200 N/m. Tính độ biến dạng của lò xo.",
    "re": "Độ biến dạng của lò xo là 0.2m"
  },
  {
    "con": "Một sợi dây thẳng dài vô hạn, đặt trong không khí, tích điện đều với mật độ điện tích dài l = - 6.10^– 9 C/m. Cường độ điện trường do sợi dây này gây ra tại điểm M cách dây một đoạn h = 20cm là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m được treo bằng một sợi dây và chịu tác dụng của trọng lực. Nếu vật ở trạng thái cân bằng thì lực kéo của dây bằng:",
    "re": "Trọng lực tác dụng lên vật"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v. Nếu thời gian t trôi qua thì quãng đường s mà vật đi được là:",
    "re": "s = v * t"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo một đoạn x. Nếu lực F tác dụng lên lò xo thì lực này được tính bằng:",
    "re": "F = k * x"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Nếu thời gian rơi là t thì vận tốc cuối cùng v của vật khi chạm đất là:",
    "re": "v = g * t (với g là gia tốc trọng trường)"
  },
  {
    "con": "Một điện tích điểm q đặt trong điện trường E. Nếu điện tích này di chuyển một đoạn đường d trong điện trường thì công W thực hiện là:",
    "re": "W = q * E * d"
  },
  {
    "con": "Một sóng âm có tần số f và vận tốc truyền sóng v. Nếu chiều dài sóng λ được tính bằng công thức thì:",
    "re": "λ = v / f"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Nếu vật va chạm hoàn toàn đàn hồi với một vật khác thì động năng của hệ sau va chạm được bảo toàn, tức là:",
    "re": "Động năng trước va chạm = Động năng sau va chạm"
  },
  {
    "con": "Một chất rắn có khối lượng riêng ρ và thể tích V. Nếu khối lượng m của chất rắn được tính bằng công thức thì:",
    "re": "m = ρ * V"
  },
  {
    "con": "Một mạch điện có điện trở R và hiệu điện thế U. Nếu dòng điện I chạy qua mạch được tính bằng công thức thì:",
    "re": "I = U / R"
  },
  {
    "con": "Mặt phẳng (P) rộng vô hạn, tích điện đều với mật độ điện mặt s = 17,7.10 ^– 10 C/m^2. Cường độ điện trường do mặt phẳng này gây ra tại điểm M trong không khí, cách (P) một khoảng a = 10cm có giá trị nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m = 2kg và được thả rơi tự do từ độ cao h = 20m. Vận tốc của vật khi chạm đất là bao nhiêu?",
    "re": "Vận tốc đạt khoảng 19,8 m/s"
  },
  {
    "con": "Một lò xo có độ cứng k = 300 N/m bị nén lại một đoạn x = 0,1m. Lực đàn hồi của lò xo là bao nhiêu?",
    "re": "Lực đàn hồi là 30 N"
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính r = 5m và vận tốc v = 10m/s. Gia tốc hướng tâm của vật là bao nhiêu?",
    "re": "Gia tốc hướng tâm là 20 m/s²"
  },
  {
    "con": "Một điện tích điểm q = 1μC đặt trong điện trường đều có cường độ E = 1000 N/C. Lực tác dụng lên điện tích này là bao nhiêu?",
    "re": "Lực tác dụng là 1 N"
  },
  {
    "con": "Một sóng âm có tần số f = 440 Hz và vận tốc truyền trong không khí v = 340 m/s. Độ dài sóng của âm này là bao nhiêu?",
    "re": "Độ dài sóng là 0,772 m"
  },
  {
    "con": "Một vật có khối lượng m = 5kg đang chuyển động với vận tốc v = 3m/s. Động năng của vật là bao nhiêu?",
    "re": "Động năng là 22,5 J"
  },
  {
    "con": "Một điện trở có giá trị R = 10Ω và được nối với nguồn điện có hiệu điện thế U = 20V. Cường độ dòng điện chạy qua điện trở là bao nhiêu?",
    "re": "Cường độ dòng điện là 2 A"
  },
  {
    "con": "Một vật có khối lượng m = 10kg được kéo lên cao với gia tốc a = 2m/s². Lực kéo cần thiết để nâng vật là bao nhiêu?",
    "re": "Lực kéo cần thiết là 120 N"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h = 45m. Thời gian để vật chạm đất là bao lâu?",
    "re": "Thời gian là khoảng 3 s"
  },
  {
    "con": "Đặt 2 điện tích điểm q và 4q tại A và B cách nhau 30cm. Hỏi phải đặt một điện tích thử tại điểm M trên đoạn AB, cách A bao nhiêu để nó đứng yên?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m được thả rơi tự do từ độ cao h. Hỏi thời gian rơi của vật đến mặt đất là bao nhiêu?",
    "re": "Thời gian rơi t = √(2h/g)"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v. Hỏi quãng đường đi được sau thời gian t là bao nhiêu?",
    "re": "Quãng đường s = vt"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo dài một đoạn x. Hỏi lực đàn hồi F của lò xo là bao nhiêu?",
    "re": "Lực đàn hồi F = -kx"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v va chạm hoàn toàn đàn hồi với một vật khác có khối lượng M đứng yên. Hỏi vận tốc của vật m sau va chạm là bao nhiêu?",
    "re": "Vận tốc sau va chạm v' = (m - M)/(m + M) * v"
  },
  {
    "con": "Một điện tích q đặt trong điện trường E. Hỏi lực tác dụng lên điện tích này là bao nhiêu?",
    "re": "Lực F = qE"
  },
  {
    "con": "Một vật có khối lượng m được treo vào một lò xo. Hỏi độ biến dạng của lò xo khi vật ở trạng thái cân bằng là bao nhiêu?",
    "re": "Độ biến dạng x = mg/k"
  },
  {
    "con": "Một sóng âm có tần số f và vận tốc v. Hỏi bước sóng λ của sóng âm này là bao nhiêu?",
    "re": "Bước sóng λ = v/f"
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính R và vận tốc góc ω. Hỏi gia tốc hướng tâm a của vật là bao nhiêu?",
    "re": "Gia tốc hướng tâm a = ω²R"
  },
  {
    "con": "Một vật có khối lượng m được ném lên với vận tốc ban đầu v0. Hỏi độ cao cực đại h mà vật đạt được là bao nhiêu?",
    "re": "Độ cao cực đại h = v0²/(2g)"
  },
  {
    "con": "Hai điện tích điểm q_1 = 3mC và q_2 = 12mC đặt cách nhau một khoảng 30cm trong không khí thì tương tác nhau một lực bao nhiêu niutơn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2kg được thả rơi tự do từ độ cao 10m thì vận tốc của nó khi chạm đất là bao nhiêu m/s?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chuyển động thẳng đều với vận tốc 5m/s thì quãng đường đi được sau 10 giây là bao nhiêu mét?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0.1m thì năng lượng đàn hồi của lò xo là bao nhiêu joule?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 3kg di chuyển với vận tốc 4m/s thì động năng của nó là bao nhiêu joule?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một quả cầu rơi tự do từ độ cao 20m thì thời gian để nó chạm đất là bao lâu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dòng điện có cường độ 2A chạy qua một điện trở 5Ω thì điện áp trên điện trở là bao nhiêu volt?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 1kg được kéo lên cao 5m thì công thực hiện là bao nhiêu joule?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sóng âm có tần số 440Hz thì bước sóng của nó trong không khí là bao nhiêu mét?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 0.5kg quay tròn với bán kính 2m và vận tốc 3m/s thì lực hướng tâm tác dụng lên vật là bao nhiêu newton?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hai quả cầu kim loại nhỏ, giống hệt nhau, tích điện q_1 = 2mC; q_2 = –4mC, đặt cách nhau một khoảng r trong không khí thì hút nhau một lực F_1 = 16N. Nếu cho chúng chạm nhau rồi đưa về vị trí cũ thì chúng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, thì vận tốc của vật khi chạm đất sẽ là v = √(2gh), với g là gia tốc trọng trường.",
    "re": "Vận tốc của vật khi chạm đất sẽ tăng theo độ cao h."
  },
  {
    "con": "Nếu một lực F tác dụng lên một vật có khối lượng m, thì gia tốc a của vật sẽ được tính bằng công thức a = F/m.",
    "re": "Gia tốc của vật tỷ lệ thuận với lực tác dụng và tỷ lệ nghịch với khối lượng."
  },
  {
    "con": "Nếu một vật chuyển động tròn đều với bán kính r và vận tốc v, thì lực hướng tâm F_c tác dụng lên vật sẽ được tính bằng công thức F_c = mv²/r.",
    "re": "Lực hướng tâm tỷ lệ với bình phương vận tốc và tỷ lệ nghịch với bán kính."
  },
  {
    "con": "Nếu một sóng âm có tần số f và vận tốc truyền trong không khí là v, thì bước sóng λ sẽ được tính bằng công thức λ = v/f.",
    "re": "Bước sóng tỷ lệ nghịch với tần số."
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v và va chạm hoàn toàn đàn hồi với một vật khác, thì tổng động năng của hệ trước và sau va chạm sẽ được bảo toàn.",
    "re": "Động năng của hệ sẽ không thay đổi trong va chạm đàn hồi."
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một trường điện E, thì lực điện F tác dụng lên điện tích sẽ được tính bằng công thức F = qE.",
    "re": "Lực điện tỷ lệ với độ lớn của điện tích và cường độ trường điện."
  },
  {
    "con": "Nếu một vật có khối lượng m được nâng lên cao h trong trường trọng lực, thì công thực hiện để nâng vật sẽ được tính bằng W = mgh.",
    "re": "Công thực hiện tỷ lệ với khối lượng, gia tốc trọng trường và độ cao."
  },
  {
    "con": "Nếu một vật dao động điều hòa với tần số f, thì chu kỳ T của dao động sẽ được tính bằng công thức T = 1/f.",
    "re": "Chu kỳ tỷ lệ nghịch với tần số."
  },
  {
    "con": "Nếu một ánh sáng đơn sắc có bước sóng λ đi qua một lăng kính, thì ánh sáng sẽ bị khúc xạ và phân tách thành nhiều màu sắc khác nhau.",
    "re": "Hiện tượng khúc xạ ánh sáng tạo ra quang phổ."
  },
  {
    "con": "Trong chân không 2 điện tích điểm cách nhau 10cm thì hút nhau một lực 10^{– 6} N. Nếu đem chúng đến vị trí mới cách nhau 2cm thì lực tương tác giữa chúng sẽ là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chuyển động thẳng đều với vận tốc 20 m/s thì sau 5 giây, vật sẽ di chuyển được 100 mét.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao 20m thì thời gian để vật chạm đất là khoảng 2 giây.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một lò xo có độ cứng k = 200 N/m bị nén 0.1m thì năng lượng tiềm năng đàn hồi trong lò xo là 1 J.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một điện trở có giá trị 10 ohm và dòng điện chạy qua nó là 2 A thì điện áp trên điện trở là 20 V.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 5 kg và được kéo với lực 10 N thì gia tốc của vật là 2 m/s².",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sóng âm có tần số 440 Hz thì bước sóng của nó trong không khí (với tốc độ âm thanh khoảng 340 m/s) là khoảng 0.773 m.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 1 kg và được nâng lên cao 10 m thì công thực hiện để nâng vật là 98 J.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất lỏng có mật độ 1000 kg/m³ thì áp suất tại độ sâu 10 m là khoảng 100 kPa.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có vận tốc 30 m/s và va chạm với một vật khác đứng yên thì động lượng của hệ sau va chạm sẽ phụ thuộc vào khối lượng của vật đứng yên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Đặt 2 điện tích điểm q và –4q tại A và B cách nhau 12cm trong không khí. Hỏi phải đặt một điện tích thử Q tại vị trí nào trên đường thẳng AB để nó đứng yên?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi. Hỏi quãng đường đi được trong thời gian t sẽ là gì?",
    "re": "Quãng đường đi được là S = vt"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Hỏi vận tốc của vật khi chạm đất sẽ là gì?",
    "re": "Vận tốc khi chạm đất là v = √(2gh)"
  },
  {
    "con": "Một lò xo bị nén hoặc kéo ra một khoảng x. Hỏi lực phục hồi của lò xo sẽ được tính như thế nào?",
    "re": "Lực phục hồi F = -kx, với k là độ cứng của lò xo"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Hỏi động năng của vật sẽ được tính như thế nào?",
    "re": "Động năng K = 1/2 mv²"
  },
  {
    "con": "Một vật chịu tác dụng của lực F trong thời gian t. Hỏi gia tốc a của vật sẽ được tính như thế nào?",
    "re": "Gia tốc a = F/m, với m là khối lượng của vật"
  },
  {
    "con": "Một sóng có tần số f và bước sóng λ. Hỏi vận tốc của sóng sẽ được tính như thế nào?",
    "re": "Vận tốc của sóng v = fλ"
  },
  {
    "con": "Một điện trở R được nối với một nguồn điện có hiệu điện thế U. Hỏi cường độ dòng điện I sẽ được tính như thế nào?",
    "re": "Cường độ dòng điện I = U/R theo định luật Ohm"
  },
  {
    "con": "Một vật có khối lượng m di chuyển theo quỹ đạo tròn với bán kính r và vận tốc v. Hỏi lực hướng tâm F sẽ được tính như thế nào?",
    "re": "Lực hướng tâm F = mv²/r"
  },
  {
    "con": "Một vật dao động điều hòa với biên độ A và tần số f. Hỏi phương trình dao động sẽ có dạng gì?",
    "re": "Phương trình dao động x(t) = A cos(2πft + φ)"
  },
  {
    "con": "Trên 2 đỉnh của tam giác ABC ( AB = 4 cm, AC = 3 cm, BC = 5 cm) người ta đặt 2 điện tích q_B = 5.10 ^{– 8} C và q_C = -10.10^{ – 8}C. Hỏi vectơ cường độ điện trường tại A sẽ hợp với cạnh AC một góc bằng bao nhiêu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chuyển động thẳng đều với vận tốc không đổi, thì quãng đường đi được sẽ tỉ lệ thuận với thời gian.",
    "re": "Quy luật chuyển động thẳng đều"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực không đổi, thì gia tốc của vật sẽ tỉ lệ thuận với lực tác dụng và tỉ lệ nghịch với khối lượng của vật.",
    "re": "Định luật II Newton"
  },
  {
    "con": "Nếu một vật rơi tự do trong môi trường không có sức cản, thì vận tốc của vật sẽ tăng theo thời gian với gia tốc bằng gia tốc trọng trường.",
    "re": "Quy luật rơi tự do"
  },
  {
    "con": "Nếu một sóng âm truyền trong không khí, thì tốc độ của sóng âm sẽ phụ thuộc vào nhiệt độ của không khí.",
    "re": "Tốc độ sóng âm trong không khí"
  },
  {
    "con": "Nếu một điện tích q đặt trong một điện trường E, thì lực tác dụng lên điện tích đó sẽ bằng tích của điện tích và cường độ điện trường.",
    "re": "Lực tác dụng lên điện tích trong điện trường"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v, thì động năng của vật sẽ bằng 1/2 m v^2.",
    "re": "Công thức tính động năng"
  },
  {
    "con": "Nếu một vật dao động điều hòa, thì phương trình mô tả chuyển động của nó có dạng x(t) = A cos(ωt + φ), với A là biên độ, ω là tần số góc và φ là pha ban đầu.",
    "re": "Phương trình dao động điều hòa"
  },
  {
    "con": "Nếu một vật bị nén hoặc kéo dãn trong một khoảng cách nhỏ, thì lực phục hồi sẽ tỉ lệ thuận với độ biến dạng của vật.",
    "re": "Định luật Hooke"
  },
  {
    "con": "Nếu một vật chuyển động tròn đều, thì gia tốc hướng tâm của vật sẽ tỉ lệ thuận với bình phương vận tốc và tỉ lệ nghịch với bán kính của vòng tròn.",
    "re": "Công thức gia tốc hướng tâm"
  },
  {
    "con": "Một điện tích điểm dương q, khối lượng m, lúc đầu đứng yên. Sau đó được thả nhẹ vào điện trường đều có vectơ cường độ điện trường \\overrightarrow{E} hướng dọc theo chiều dương của trục Ox (bỏ qua trọng lực và sức cản). Chuyển động của q có tính chất nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m được thả rơi tự do từ độ cao h. Nếu không có sức cản của không khí, thì vật sẽ đạt được vận tốc tối đa v sau thời gian t.",
    "re": "v = g * t, với g là gia tốc trọng trường"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v. Nếu không có lực tác dụng lên vật, thì vật sẽ tiếp tục chuyển động với vận tốc v không đổi.",
    "re": "Định luật I Newton"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo ra một khoảng x. Nếu lực tác dụng lên lò xo tuân theo định luật Hooke, thì lực F sẽ được tính bằng công thức nào?",
    "re": "F = -k * x"
  },
  {
    "con": "Một vật có khối lượng m di chuyển trên mặt phẳng nghiêng với góc α. Nếu không có ma sát, thì lực tác dụng lên vật sẽ bao gồm thành phần nào?",
    "re": "Lực trọng lực và thành phần lực song song với mặt phẳng nghiêng"
  },
  {
    "con": "Một sóng âm truyền trong không khí với tốc độ v. Nếu tần số f của sóng âm tăng lên, thì bước sóng λ sẽ thay đổi như thế nào?",
    "re": "λ = v / f, do đó λ sẽ giảm"
  },
  {
    "con": "Một điện trở R được nối với nguồn điện có hiệu điện thế U. Nếu cường độ dòng điện I chạy qua điện trở được đo, thì mối quan hệ giữa U, I và R là gì?",
    "re": "U = R * I, theo định luật Ohm"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v va chạm hoàn toàn đàn hồi với một vật khác có khối lượng M. Nếu vật m dừng lại sau va chạm, thì vật M sẽ có vận tốc nào?",
    "re": "Vận tốc của M sẽ bằng vận tốc ban đầu của m"
  },
  {
    "con": "Một điện tích điểm q di chuyển trong một điện trường đều. Nếu điện trường có cường độ E, thì lực tác dụng lên điện tích q sẽ được tính như thế nào?",
    "re": "F = q * E"
  },
  {
    "con": "Một vật có khối lượng m quay quanh một trục với bán kính r. Nếu lực hướng tâm F tác dụng lên vật là không đổi, thì mối quan hệ giữa F, m, v và r là gì?",
    "re": "F = m * v^2 / r"
  },
  {
    "con": "Một điện trường có vectơ cường độ điện \\overrightarrow{E} được biểu diễn bởi công thức: \\overrightarrow{E}= E_x. \\overrightarrow{i} + E_y. \\overrightarrow{j} + E_z. \\overrightarrow{k} trong đó E_x, E_y, E_z là các hằng số và \\overrightarrow{i},\\overrightarrow{j},\\overrightarrow{k} là các vectơ đơn vị của hệ tọa độ Descartes. Điện trường này là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chịu tác dụng của lực không đổi và có khối lượng m, nếu lực F tác dụng lên vật được tính bằng công thức F = m.a, trong đó a là gia tốc, thì gia tốc của vật sẽ:",
    "re": "Tỉ lệ thuận với lực tác dụng và tỉ lệ nghịch với khối lượng"
  },
  {
    "con": "Nếu một vật chuyển động thẳng đều với vận tốc v, thì quãng đường s mà vật đi được trong thời gian t sẽ:",
    "re": "Bằng s = v.t"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, thì vận tốc của vật khi chạm đất sẽ được tính bằng công thức v = \\sqrt{2gh}, trong đó g là gia tốc trọng trường, thì vận tốc này:",
    "re": "Tăng theo căn bậc hai của độ cao h"
  },
  {
    "con": "Nếu một sóng âm có tần số f và vận tốc v, thì bước sóng \\lambda của sóng âm sẽ được tính bằng công thức \\lambda = \\frac{v}{f}, thì bước sóng này:",
    "re": "Tỉ lệ nghịch với tần số f"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v, thì động năng K của vật được tính bằng công thức K = \\frac{1}{2}mv^2, thì động năng này:",
    "re": "Tăng theo bình phương vận tốc v"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực đàn hồi F = -kx, trong đó k là hằng số đàn hồi và x là độ biến dạng, thì lực đàn hồi này:",
    "re": "Luôn hướng về vị trí cân bằng và tỉ lệ thuận với độ biến dạng x"
  },
  {
    "con": "Nếu một vật quay quanh một trục với vận tốc góc \\omega, thì gia tốc hướng tâm a_t của vật sẽ được tính bằng công thức a_t = r\\omega^2, trong đó r là bán kính quỹ đạo, thì gia tốc này:",
    "re": "Tăng theo bình phương vận tốc góc \\omega"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một điện trường E, thì lực tác dụng lên điện tích này được tính bằng công thức F = qE, thì lực này:",
    "re": "Tỉ lệ thuận với độ lớn của điện tích q và cường độ điện trường E"
  },
  {
    "con": "Nếu một vật có khối lượng m và được nâng lên độ cao h trong trường trọng lực, thì công W thực hiện để nâng vật sẽ được tính bằng công thức W = mgh, thì công này:",
    "re": "Tăng theo khối lượng m và độ cao h"
  },
  {
    "con": "Hai điện tích điểm Q1, Q2 lần lượt gây ra tại M các vectơ cường độ điện trường \\overrightarrow{E_1}\\ và \\overrightarrow{E_2}. Phát biểu nào sau đây là đúng, khi nói về vectơ cường độ điện trường tổng hợp tại M?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chịu tác dụng của lực F và có khối lượng m. Nếu lực F không đổi thì gia tốc của vật sẽ là a = F/m.",
    "re": "Gia tốc của vật sẽ tỉ lệ thuận với lực và nghịch đảo với khối lượng"
  },
  {
    "con": "Khi một vật chuyển động thẳng đều, nếu vận tốc của nó không thay đổi thì quãng đường đi được sẽ tỉ lệ thuận với thời gian.",
    "re": "Quãng đường đi được sẽ là s = vt"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, thì thời gian rơi tỉ lệ với căn bậc hai của độ cao.",
    "re": "Thời gian rơi t sẽ là t = √(2h/g)"
  },
  {
    "con": "Khi một vật quay quanh một trục, nếu lực tác dụng lên vật không thay đổi thì mô men lực sẽ tỉ lệ với khoảng cách từ trục quay đến điểm tác dụng lực.",
    "re": "Mô men lực sẽ là M = F * d"
  },
  {
    "con": "Nếu một sóng âm truyền trong không khí, thì tốc độ của sóng âm sẽ phụ thuộc vào nhiệt độ của không khí.",
    "re": "Tốc độ sóng âm sẽ tăng khi nhiệt độ không khí tăng"
  },
  {
    "con": "Khi một điện tích di chuyển trong một điện trường, nếu điện trường mạnh hơn thì lực tác dụng lên điện tích sẽ lớn hơn.",
    "re": "Lực tác dụng sẽ là F = qE"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v va chạm với một vật khác, thì động lượng của hệ sẽ được bảo toàn nếu không có lực bên ngoài tác dụng.",
    "re": "Động lượng trước va chạm sẽ bằng động lượng sau va chạm"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác, nếu chỉ số khúc xạ của môi trường thứ hai lớn hơn thì ánh sáng sẽ bị khúc xạ về phía pháp tuyến.",
    "re": "Ánh sáng sẽ bị khúc xạ về phía pháp tuyến"
  },
  {
    "con": "Nếu một vật dao động điều hòa với tần số f, thì chu kỳ T của dao động sẽ là T = 1/f.",
    "re": "Chu kỳ T sẽ tỉ lệ nghịch với tần số f"
  },
  {
    "con": "Gọi \\overrightarrow{e_1} là vectơ đơn vị hướng từ điện tích điểm Q đến điểm M; r là khoảng cách từ Q đến M; \\varepsilon_0 là hằng số điện, ; \\varepsilon là hệ số điện môi của môi trường và q là điện tích thử. Biểu thức nào sau đây xác định vectơ cường độ điện trường do điện tích Q gây ra tại M?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chịu tác dụng của một lực không đổi trong một khoảng thời gian nhất định,",
    "re": "thì vật sẽ có một gia tốc không đổi theo định luật Newton thứ hai."
  },
  {
    "con": "Nếu một vật chuyển động tròn đều với bán kính R và vận tốc v,",
    "re": "thì lực hướng tâm tác dụng lên vật được tính bằng công thức F = \\frac{mv^2}{R}."
  },
  {
    "con": "Nếu một sóng âm có tần số f và vận tốc truyền trong không khí là v,",
    "re": "thì bước sóng của sóng âm đó được tính bằng công thức \\lambda = \\frac{v}{f}."
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h,",
    "re": "thì thời gian rơi của vật được tính bằng công thức t = \\sqrt{\\frac{2h}{g}}, với g là gia tốc trọng trường."
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một điện trường E,",
    "re": "thì công thực hiện bởi điện trường được tính bằng W = qEd, với d là khoảng cách di chuyển."
  },
  {
    "con": "Nếu một vật có khối lượng m được kéo lên cao với một lực F,",
    "re": "thì công thực hiện để nâng vật lên được tính bằng W = Fh, với h là chiều cao nâng."
  },
  {
    "con": "Nếu một sóng ánh sáng có tần số f và bước sóng \\lambda,",
    "re": "thì vận tốc ánh sáng được tính bằng công thức v = f\\lambda."
  },
  {
    "con": "Nếu một vật có động năng K và khối lượng m,",
    "re": "thì vận tốc của vật được tính bằng công thức v = \\sqrt{\\frac{2K}{m}}."
  },
  {
    "con": "Nếu một hệ thống cơ học không có lực bên ngoài tác dụng,",
    "re": "thì tổng năng lượng cơ học của hệ thống được bảo toàn."
  },
  {
    "con": "Mặt phẳng (P) rộng vô hạn, tích điện đều với mật độ điện mặt \\sigma. Cường độ điện trường do mặt phẳng này gây ra tại điểm M trong không khí, cách (P) một khoảng a được tính bởi biểu thức nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h, không chịu tác động của lực cản không khí. Vận tốc của vật khi chạm đất được tính bằng công thức nào?",
    "re": "Vận tốc bằng \\sqrt{2gh}"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Động năng của vật được tính bằng công thức nào?",
    "re": "Động năng bằng \\frac{1}{2}mv^2"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo một khoảng x. Lực phục hồi của lò xo được tính bằng công thức nào?",
    "re": "Lực phục hồi bằng -kx"
  },
  {
    "con": "Một vật có khối lượng m nằm trên mặt phẳng nghiêng với góc nghiêng \\theta. Lực tác dụng lên vật theo phương vuông góc với mặt phẳng nghiêng được tính bằng công thức nào?",
    "re": "Lực bằng mg \\cos(\\theta)"
  },
  {
    "con": "Một sóng âm có tần số f và vận tốc truyền sóng v. Độ dài sóng được tính bằng công thức nào?",
    "re": "Độ dài sóng bằng \\frac{v}{f}"
  },
  {
    "con": "Một điện tích q đặt trong một điện trường E. Lực tác dụng lên điện tích được tính bằng công thức nào?",
    "re": "Lực bằng qE"
  },
  {
    "con": "Một vật có khối lượng m di chuyển theo quỹ đạo tròn với bán kính r và vận tốc v. Lực hướng tâm tác dụng lên vật được tính bằng công thức nào?",
    "re": "Lực hướng tâm bằng \\frac{mv^2}{r}"
  },
  {
    "con": "Một chất lỏng có mật độ \\rho chảy qua một ống dẫn với tiết diện A và vận tốc v. Lưu lượng của chất lỏng được tính bằng công thức nào?",
    "re": "Lưu lượng bằng A \\cdot v"
  },
  {
    "con": "Một vật chịu tác dụng của hai lực F1 và F2. Nếu tổng hợp lực này bằng 0, thì vật sẽ có trạng thái nào?",
    "re": "Vật sẽ đứng yên hoặc chuyển động thẳng đều"
  },
  {
    "con": "Một vòng dây tròn, bán kính R tích điện đều với điện tích tổng cộng là Q, đặt trong không khí. Cường độ điện trường tại điểm M trên trục vòng dây, cách tâm vòng dây một đoạn R, được tính theo biểu thức nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, thì vận tốc của vật khi chạm đất được tính bằng công thức nào?",
    "re": "Vận tốc v = √(2gh)"
  },
  {
    "con": "Nếu một lực F tác dụng lên một vật có khối lượng m, thì gia tốc a của vật được tính theo công thức nào?",
    "re": "Gia tốc a = F/m"
  },
  {
    "con": "Nếu một sóng âm có tần số f và tốc độ truyền sóng v, thì bước sóng λ của sóng âm được tính theo công thức nào?",
    "re": "Bước sóng λ = v/f"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động năng K của vật được tính theo công thức nào?",
    "re": "Động năng K = 1/2 mv²"
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực F1 và F2 cùng phương, thì tổng hợp lực F tổng được tính như thế nào?",
    "re": "F tổng = F1 + F2"
  },
  {
    "con": "Nếu một vật quay quanh một trục với bán kính R và có vận tốc góc ω, thì gia tốc hướng tâm a_h của vật được tính theo công thức nào?",
    "re": "Gia tốc hướng tâm a_h = ω²R"
  },
  {
    "con": "Nếu một chất rắn có khối lượng m và thể tích V, thì mật độ ρ của chất rắn được tính theo công thức nào?",
    "re": "Mật độ ρ = m/V"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một điện trường E, thì công W thực hiện bởi điện trường được tính theo công thức nào?",
    "re": "Công W = qEd"
  },
  {
    "con": "Nếu một vật có khối lượng m rơi tự do trong không khí, thì lực cản không khí tác dụng lên vật được tính theo công thức nào?",
    "re": "Lực cản F_c = kv² (với k là hằng số)"
  },
  {
    "con": "Một vòng dây tròn, bán kính R tích điện đều với điện tích tổng cộng là Q, đặt trong không khí. Cường độ điện trường tại tâm vòng dây được tính theo biểu thức nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h, không chịu tác động của lực cản không khí. Vận tốc của vật sau thời gian t được tính theo công thức nào?",
    "re": "Vận tốc v = g * t, với g là gia tốc trọng trường"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Động năng của vật được tính theo công thức nào?",
    "re": "Động năng K = 1/2 * m * v^2"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo một khoảng x. Lực phục hồi của lò xo được tính theo công thức nào?",
    "re": "F = -k * x"
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính R và vận tốc v. Gia tốc hướng tâm của vật được tính theo công thức nào?",
    "re": "Gia tốc hướng tâm a = v^2 / R"
  },
  {
    "con": "Một sóng âm có tần số f và vận tốc truyền sóng v. Độ dài sóng λ được tính theo công thức nào?",
    "re": "Độ dài sóng λ = v / f"
  },
  {
    "con": "Một điện trở R được nối với nguồn điện có hiệu điện thế U. Cường độ dòng điện I qua điện trở được tính theo công thức nào?",
    "re": "Cường độ dòng điện I = U / R"
  },
  {
    "con": "Một vật có khối lượng m được thả rơi từ độ cao h. Thế năng của vật tại độ cao h được tính theo công thức nào?",
    "re": "Thế năng P = m * g * h"
  },
  {
    "con": "Một chất rắn có khối lượng m và thể tích V. Khối lượng riêng ρ của chất được tính theo công thức nào?",
    "re": "Khối lượng riêng ρ = m / V"
  },
  {
    "con": "Một vật dao động điều hòa với biên độ A và tần số f. Phương trình dao động của vật được biểu diễn như thế nào?",
    "re": "x(t) = A * cos(2πft + φ), với φ là pha ban đầu"
  },
  {
    "con": "Trong chân không tại, 6 đỉnh của lục giác đều cạnh a, người ta đặt 6 điện tích điểm cùng độ lớn q, gồm 3 điện tích âm và 3 điện tích dương đặt xen kẽ. Cường độ điện trường tại tâm O của lục giác đó bằng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi, thì quãng đường đi được tỉ lệ thuận với thời gian.",
    "re": "Quãng đường đi được là một hàm số bậc nhất của thời gian"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực không đổi, thì gia tốc của vật đó là không đổi.",
    "re": "Gia tốc của vật sẽ luôn hướng về phía lực tác dụng"
  },
  {
    "con": "Khi một vật rơi tự do trong chân không, thì gia tốc của nó bằng gia tốc trọng trường.",
    "re": "Gia tốc trọng trường có giá trị khoảng 9.81 m/s²"
  },
  {
    "con": "Nếu một sóng âm truyền trong không khí, thì tốc độ của sóng âm phụ thuộc vào nhiệt độ của không khí.",
    "re": "Tốc độ sóng âm tăng khi nhiệt độ không khí tăng"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác, thì hiện tượng khúc xạ xảy ra.",
    "re": "Góc khúc xạ phụ thuộc vào chỉ số khúc xạ của hai môi trường"
  },
  {
    "con": "Nếu một điện tích điểm đặt trong điện trường, thì nó sẽ chịu lực điện.",
    "re": "Lực điện tác dụng lên điện tích có phương và chiều theo hướng của điện trường"
  },
  {
    "con": "Khi một vật dao động điều hòa, thì biên độ dao động là khoảng cách lớn nhất từ vị trí cân bằng.",
    "re": "Biên độ không thay đổi theo thời gian trong dao động điều hòa lý tưởng"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v, thì động năng của vật đó được tính bằng công thức 1/2 mv².",
    "re": "Động năng là một đại lượng dương"
  },
  {
    "con": "Khi một lực tác dụng lên một vật làm vật đó di chuyển một quãng đường, thì công của lực được tính bằng tích của lực và quãng đường đi được theo phương của lực.",
    "re": "Công có thể âm, dương hoặc bằng không tùy thuộc vào hướng của lực và chuyển động"
  },
  {
    "con": "Một sợi dây thẳng dài vô hạn, đặt trong không khí, tích điện đều với mật độ điện tích dài \\lambda. Cường độ điện trường do sợi dây này gây ra tại điểm M cách dây một đoạn h được tính bởi biểu thức nào sau đây? (k = 9.10^9 Nm^2/C^2)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h trong không khí, không chịu tác động của lực cản, thì thời gian rơi của vật được tính bằng công thức nào?",
    "re": "Thời gian rơi t = \\sqrt{\\frac{2h}{g}}"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v trong không gian, thì động năng của vật được tính bằng công thức nào?",
    "re": "Động năng K = \\frac{1}{2}mv^2"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo dài một đoạn x, thì năng lượng đàn hồi của lò xo được tính bằng công thức nào?",
    "re": "Năng lượng đàn hồi E = \\frac{1}{2}kx^2"
  },
  {
    "con": "Một vật có khối lượng m di chuyển theo một đường tròn với bán kính r và vận tốc v, thì lực hướng tâm tác dụng lên vật được tính bằng công thức nào?",
    "re": "Lực hướng tâm F = \\frac{mv^2}{r}"
  },
  {
    "con": "Một sóng âm có tần số f và vận tốc truyền sóng v, thì bước sóng \\lambda của sóng âm được tính bằng công thức nào?",
    "re": "Bước sóng \\lambda = \\frac{v}{f}"
  },
  {
    "con": "Một điện trở R nối với một nguồn điện có hiệu điện thế U, thì cường độ dòng điện I chạy qua điện trở được tính bằng công thức nào?",
    "re": "Cường độ dòng điện I = \\frac{U}{R}"
  },
  {
    "con": "Một vật có khối lượng m và vận tốc v va chạm với một vật khác có khối lượng M đứng yên, thì theo định luật bảo toàn động lượng, tổng động lượng trước va chạm bằng tổng động lượng sau va chạm.",
    "re": "m*v = (m + M)v'"
  },
  {
    "con": "Một vật chịu tác dụng của một lực F trong thời gian t, thì công A thực hiện bởi lực F được tính bằng công thức nào?",
    "re": "Công A = F * d, với d là quãng đường vật di chuyển theo hướng của lực"
  },
  {
    "con": "Cho ba điện tích điểm q_1 = q_2 = q_3 = q = 6\\mu C đặt tại ba đỉnh của tam giác đều ABC, cạnh a = 10cm (trong chân không). Tính lực tác dụng lên điện tích q_1.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng m = 2kg và chịu tác dụng của lực F = 10N, thì gia tốc của vật sẽ được tính bằng a = F/m.",
    "re": "Gia tốc a = 5 m/s²"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h = 20m, thì thời gian rơi t sẽ được tính bằng công thức t = √(2h/g) với g = 9.81 m/s².",
    "re": "Thời gian rơi t ≈ 2.02 giây"
  },
  {
    "con": "Nếu một sóng âm có tần số f = 440Hz và vận tốc âm thanh trong không khí là v = 340m/s, thì bước sóng λ sẽ được tính bằng λ = v/f.",
    "re": "Bước sóng λ ≈ 0.773m"
  },
  {
    "con": "Nếu một vật có động năng K = 50J và khối lượng m = 2kg, thì vận tốc v của vật sẽ được tính bằng công thức K = 1/2 mv².",
    "re": "Vận tốc v ≈ 7.07 m/s"
  },
  {
    "con": "Nếu một điện trở có giá trị R = 10Ω và dòng điện chạy qua nó là I = 2A, thì điện áp U sẽ được tính bằng U = R × I.",
    "re": "Điện áp U = 20V"
  },
  {
    "con": "Nếu một vật có khối lượng m = 5kg và được kéo lên cao với lực F = 50N, thì công thực hiện W sẽ được tính bằng W = F × h, với h là chiều cao.",
    "re": "Công W = 50h J"
  },
  {
    "con": "Nếu một vật có nhiệt độ ban đầu T1 = 20°C và được làm nóng lên đến T2 = 100°C, thì sự thay đổi nhiệt độ ΔT sẽ được tính bằng ΔT = T2 - T1.",
    "re": "Sự thay đổi nhiệt độ ΔT = 80°C"
  },
  {
    "con": "Nếu một vật có khối lượng m = 3kg và được đặt trong một trường hấp dẫn với gia tốc g = 9.81 m/s², thì trọng lực F sẽ được tính bằng F = m × g.",
    "re": "Trọng lực F = 29.43N"
  },
  {
    "con": "Nếu một lò xo có độ cứng k = 200N/m và bị nén một khoảng x = 0.1m, thì năng lượng đàn hồi E sẽ được tính bằng E = 1/2 kx².",
    "re": "Năng lượng đàn hồi E = 1J"
  },
  {
    "con": "Hai điện tích điểm Q_1 = 8mC, Q_2 = - 6mC đặt tại hai điểm A, B cách nhau 10cm trong không khí. Tính độ lớn của vectơ cường độ điện trường do hai điện tích này gây ra tại điểm M, biết MA = 20cm, MB = 10cm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m = 2kg rơi tự do từ độ cao h = 20m. Tính vận tốc của vật khi chạm đất.",
    "re": "Vận tốc của vật khi chạm đất là 20m/s"
  },
  {
    "con": "Một lò xo có độ cứng k = 100N/m bị nén lại 0.1m. Tính năng lượng đàn hồi của lò xo.",
    "re": "Năng lượng đàn hồi của lò xo là 0.5J"
  },
  {
    "con": "Một vật có khối lượng 5kg chuyển động với vận tốc 10m/s. Tính động năng của vật.",
    "re": "Động năng của vật là 250J"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu 15m/s. Tính chiều cao tối đa mà quả bóng đạt được.",
    "re": "Chiều cao tối đa là 11.5m"
  },
  {
    "con": "Một dòng điện có cường độ I = 2A chạy qua một điện trở R = 5Ω. Tính công suất tiêu thụ của điện trở.",
    "re": "Công suất tiêu thụ là 8W"
  },
  {
    "con": "Một vật có khối lượng 3kg di chuyển trên mặt phẳng nằm ngang với lực kéo F = 12N. Tính gia tốc của vật.",
    "re": "Gia tốc của vật là 4m/s²"
  },
  {
    "con": "Một sóng âm có tần số f = 440Hz và vận tốc v = 340m/s. Tính bước sóng của sóng âm.",
    "re": "Bước sóng là 0.773m"
  },
  {
    "con": "Một vật có khối lượng 10kg được treo vào một dây cáp. Tính lực căng trong dây cáp khi vật đứng yên.",
    "re": "Lực căng trong dây cáp là 98N"
  },
  {
    "con": "Một chất lỏng có mật độ ρ = 1000kg/m³ được đổ vào một bình có chiều cao h = 2m. Tính áp suất tại đáy bình.",
    "re": "Áp suất tại đáy bình là 19620Pa"
  },
  {
    "con": "Hai điện tích điểm Q1 = 8mC, Q2 = - 6mC đặt tại hai điểm A, B cách nhau 10cm trong không khí. Tính độ lớn của vectơ cường độ điện trường do hai điện tích này gây ra tại điểm M, biết MA = 10cm, MB = 20cm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m = 2kg rơi tự do từ độ cao h = 20m. Tính vận tốc của vật khi chạm đất.",
    "re": "Vận tốc đạt được là 20m/s"
  },
  {
    "con": "Một lò xo có độ cứng k = 300N/m bị nén lại 0.1m. Tính năng lượng đàn hồi của lò xo.",
    "re": "Năng lượng đàn hồi là 1.5J"
  },
  {
    "con": "Một vật có khối lượng 5kg di chuyển với vận tốc 10m/s. Tính động năng của vật.",
    "re": "Động năng là 250J"
  },
  {
    "con": "Một điện trở có giá trị R = 10Ω được nối với nguồn điện có hiệu điện thế U = 20V. Tính cường độ dòng điện chạy qua điện trở.",
    "re": "Cường độ dòng điện là 2A"
  },
  {
    "con": "Một sóng âm có tần số f = 440Hz và vận tốc truyền trong không khí là v = 340m/s. Tính bước sóng của sóng âm này.",
    "re": "Bước sóng là 0.773m"
  },
  {
    "con": "Một vật có khối lượng 3kg được kéo lên cao với gia tốc a = 2m/s². Tính lực kéo cần thiết.",
    "re": "Lực kéo cần thiết là 15N"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h = 45m. Tính thời gian vật rơi đến mặt đất.",
    "re": "Thời gian rơi là 3s"
  },
  {
    "con": "Một mạch điện gồm một điện trở R = 5Ω và một tụ điện C = 10μF. Tính thời gian hằng số của mạch.",
    "re": "Thời gian hằng số là 0.05s"
  },
  {
    "con": "Một vật có khối lượng 4kg được đặt trên mặt phẳng nghiêng với góc α = 30°. Tính lực kéo xuống mặt phẳng.",
    "re": "Lực kéo xuống mặt phẳng là 20N"
  },
  {
    "con": "Hai điện tích điểm Q_1 = 8mC, Q_2 = - 6mC đặt tại hai điểm A, B cách nhau 10cm trong không khí. Tính độ lớn của vectơ cường độ điện trường do hai điện tích này gây ra tại điểm M, biết MA = 5cm, MB = 5cm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m = 2kg rơi tự do từ độ cao h = 20m. Tính vận tốc của vật khi chạm đất.",
    "re": "Vận tốc của vật khi chạm đất là 20m/s"
  },
  {
    "con": "Một lò xo có độ cứng k = 300N/m bị nén lại 0.1m. Tính năng lượng tiềm năng đàn hồi của lò xo.",
    "re": "Năng lượng tiềm năng đàn hồi của lò xo là 1.5J"
  },
  {
    "con": "Một vật có khối lượng 5kg chuyển động với vận tốc 10m/s. Tính động năng của vật.",
    "re": "Động năng của vật là 250J"
  },
  {
    "con": "Một dòng điện có cường độ I = 2A chạy qua một điện trở R = 5Ω. Tính công suất tiêu thụ của điện trở.",
    "re": "Công suất tiêu thụ của điện trở là 8W"
  },
  {
    "con": "Một sóng âm có tần số f = 440Hz và vận tốc truyền sóng v = 340m/s. Tính bước sóng của sóng âm.",
    "re": "Bước sóng của sóng âm là 0.773m"
  },
  {
    "con": "Một vật có khối lượng 3kg được kéo lên cao với gia tốc a = 2m/s². Tính lực kéo cần thiết.",
    "re": "Lực kéo cần thiết là 15N"
  },
  {
    "con": "Một chất lỏng có mật độ ρ = 1000kg/m³ được đổ vào một bình có chiều cao h = 2m. Tính áp suất tại đáy bình.",
    "re": "Áp suất tại đáy bình là 19620Pa"
  },
  {
    "con": "Một vật có khối lượng 4kg được đặt trên mặt phẳng nghiêng với góc α = 30°. Tính lực kéo xuống của trọng lực.",
    "re": "Lực kéo xuống của trọng lực là 19.6N"
  },
  {
    "con": "Một điện tích điểm Q = 5μC đặt trong điện trường đều có cường độ E = 2000N/C. Tính lực tác dụng lên điện tích.",
    "re": "Lực tác dụng lên điện tích là 10N"
  },
  {
    "con": "Phát biểu nào sau đây là SAI?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt",
    "re": "Năng lượng tổng luôn được bảo toàn"
  },
  {
    "con": "Một vật rơi tự do trong chân không",
    "re": "Chịu tác động của trọng lực mà không có lực cản"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Năng lượng động học của các phân tử trong vật tăng lên"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác",
    "re": "Lực hấp dẫn giữa chúng sẽ lớn hơn"
  },
  {
    "con": "Khi một sóng âm đi từ không khí vào nước",
    "re": "Tốc độ sóng sẽ thay đổi do sự khác biệt về mật độ"
  },
  {
    "con": "Nếu một điện tích dương di chuyển trong một trường điện",
    "re": "Nó sẽ chịu tác động của lực điện theo hướng của trường"
  },
  {
    "con": "Khi một vật quay quanh một trục",
    "re": "Nó sẽ có gia tốc hướng tâm hướng về trục quay"
  },
  {
    "con": "Nếu một vật va chạm đàn hồi với một vật khác",
    "re": "Tổng động năng trước và sau va chạm sẽ được bảo toàn"
  },
  {
    "con": "Trong hệ SI, đơn vị đo thông lượng điện trường \\Phi_E là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chuyển động thẳng đều, thì quỹ đạo của nó là một đường thẳng và vận tốc là hằng số.",
    "re": "Vật không thay đổi vận tốc theo thời gian."
  },
  {
    "con": "Nếu lực tác dụng lên một vật không đổi, thì gia tốc của vật sẽ tỉ lệ thuận với lực và nghịch đảo với khối lượng.",
    "re": "Định luật II Newton được áp dụng."
  },
  {
    "con": "Nếu một vật rơi tự do trong chân không, thì gia tốc của nó là 9.81 m/s².",
    "re": "Vật chịu tác động của trọng lực mà không bị cản trở."
  },
  {
    "con": "Nếu nhiệt độ của một vật tăng lên, thì năng lượng động học của các phân tử trong vật cũng tăng.",
    "re": "Vật sẽ có nhiệt độ cao hơn."
  },
  {
    "con": "Nếu ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau, thì nó sẽ bị khúc xạ.",
    "re": "Góc khúc xạ sẽ khác với góc tới."
  },
  {
    "con": "Nếu một sóng âm có tần số cao, thì âm thanh sẽ có cao độ cao.",
    "re": "Nghe sẽ cảm nhận được âm thanh trong trẻo hơn."
  },
  {
    "con": "Nếu một điện tích dương và một điện tích âm lại gần nhau, thì chúng sẽ hút nhau.",
    "re": "Lực tương tác giữa chúng là lực điện."
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn, thì lực hấp dẫn mà nó tạo ra với vật khác sẽ lớn hơn.",
    "re": "Lực hấp dẫn tỉ lệ thuận với khối lượng của các vật."
  },
  {
    "con": "Nếu một vật quay quanh một trục, thì nó sẽ có động năng quay.",
    "re": "Động năng này tỉ lệ với bình phương vận tốc góc."
  },
  {
    "con": "Trong hệ SI, đơn vị đo thông lượng điện cảm \\Phi_D là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì vận tốc của nó là:",
    "re": "Không thay đổi theo thời gian"
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng m thì vật đó sẽ có gia tốc a:",
    "re": "Tỉ lệ thuận với lực và tỉ lệ nghịch với khối lượng"
  },
  {
    "con": "Trong một hệ kín, tổng năng lượng được bảo toàn thì:",
    "re": "Năng lượng không thể tự sinh ra hoặc mất đi"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h thì vận tốc của nó tại mặt đất là:",
    "re": "Vận tốc tối đa phụ thuộc vào độ cao h và gia tốc trọng trường"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác thì:",
    "re": "Tốc độ ánh sáng thay đổi tùy thuộc vào chỉ số khúc xạ của môi trường"
  },
  {
    "con": "Nếu một sóng âm có tần số f thì bước sóng của nó \\lambda trong không khí là:",
    "re": "Tỉ lệ nghịch với tần số f"
  },
  {
    "con": "Khi một điện tích q di chuyển trong một từ trường B với vận tốc v thì:",
    "re": "Sẽ chịu tác động của lực Lorentz"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v thì động năng của nó là:",
    "re": "Tỉ lệ với bình phương vận tốc"
  },
  {
    "con": "Trong một mạch điện, nếu điện trở R tăng thì cường độ dòng điện I sẽ:",
    "re": "Giảm nếu điện áp U không đổi"
  },
  {
    "con": "Hai điện tích Q_1 = 8mC và Q_2 = -5mC đặt trong không khí và nằm ngoài mặt kín (S). Thông lượng điện trường \\Phi_E do hai điện tích trên gởi qua mặt (S) có giá trị nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m và được thả rơi tự do từ độ cao h. Vận tốc của vật khi chạm đất sẽ phụ thuộc vào độ cao h.",
    "re": "Vận tốc của vật sẽ tăng theo độ cao h"
  },
  {
    "con": "Nếu một vật chuyển động thẳng đều với vận tốc v, thì quãng đường đi được trong thời gian t sẽ được tính bằng công thức nào?",
    "re": "Quãng đường s = v * t"
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m, thì gia tốc a của vật sẽ được tính như thế nào?",
    "re": "Gia tốc a = F/m"
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cùng phương và cùng chiều, thì lực tổng hợp sẽ được tính như thế nào?",
    "re": "Lực tổng hợp F = F_1 + F_2"
  },
  {
    "con": "Khi một vật quay quanh một trục với vận tốc góc không đổi, thì gia tốc hướng tâm a_h sẽ được tính bằng công thức nào?",
    "re": "Gia tốc hướng tâm a_h = v^2/r"
  },
  {
    "con": "Nếu một sóng âm có tần số f và vận tốc truyền sóng v, thì bước sóng \\lambda sẽ được tính như thế nào?",
    "re": "Bước sóng \\lambda = v/f"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác, thì tổng động năng của hệ sẽ được bảo toàn.",
    "re": "Động năng trước va chạm bằng động năng sau va chạm"
  },
  {
    "con": "Nếu một điện trở R được nối với một nguồn điện có hiệu điện thế U, thì cường độ dòng điện I sẽ được tính như thế nào?",
    "re": "Cường độ dòng điện I = U/R"
  },
  {
    "con": "Khi một vật được nâng lên cao h trong trường trọng lực, thì công thực hiện để nâng vật sẽ phụ thuộc vào khối lượng m và độ cao h.",
    "re": "Công W = m * g * h"
  },
  {
    "con": "Hai điện tích Q_1 = 8mC và Q_2 = -5mC đặt trong không khí và nằm trong mặt kín (S). Thông lượng điện trường do hai điện tích trên gởi qua mặt (S) có giá trị nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m = 2kg rơi tự do từ độ cao h = 20m. Vận tốc của vật khi chạm đất là bao nhiêu?",
    "re": "Vận tốc của vật là khoảng 20m/s"
  },
  {
    "con": "Một lò xo có độ cứng k = 100 N/m bị nén một đoạn x = 0.5m. Lực đàn hồi của lò xo là bao nhiêu?",
    "re": "Lực đàn hồi của lò xo là 50N"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v = 10m/s. Thời gian t = 5s, quãng đường đi được là bao nhiêu?",
    "re": "Quãng đường đi được là 50m"
  },
  {
    "con": "Một điện trở R = 10Ω được nối với nguồn điện có hiệu điện thế U = 20V. Cường độ dòng điện chạy qua điện trở là bao nhiêu?",
    "re": "Cường độ dòng điện là 2A"
  },
  {
    "con": "Một sóng âm có tần số f = 440Hz và tốc độ truyền sóng v = 340m/s. Độ dài sóng λ là bao nhiêu?",
    "re": "Độ dài sóng λ là 0.772m"
  },
  {
    "con": "Một vật có khối lượng m = 5kg được treo vào một dây thừng. Lực căng trong dây thừng khi vật đứng yên là bao nhiêu?",
    "re": "Lực căng trong dây thừng là 50N"
  },
  {
    "con": "Một vật có khối lượng m = 3kg di chuyển với vận tốc v = 4m/s. Động năng của vật là bao nhiêu?",
    "re": "Động năng của vật là 24J"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu v_0 = 15m/s. Thời gian tối đa mà quả bóng đạt được độ cao cực đại là bao nhiêu?",
    "re": "Thời gian tối đa là 1.5s"
  },
  {
    "con": "Một mạch điện có điện trở R = 5Ω và nguồn điện có hiệu điện thế U = 10V. Công suất tiêu thụ của mạch là bao nhiêu?",
    "re": "Công suất tiêu thụ là 20W"
  },
  {
    "con": "Hai điện tích Q_1 = 8mC và Q_2 = -5mC đặt trong không khí và nằm trong mặt kín (S). Thông lượng điện cảm do hai điện tích trên gởi qua mặt (S) có giá trị nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m và được thả rơi tự do từ độ cao h. Vận tốc của vật khi chạm đất sẽ phụ thuộc vào độ cao h.",
    "re": "Vận tốc của vật sẽ tăng theo độ cao h"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v. Thời gian t mà vật di chuyển sẽ tỷ lệ thuận với quãng đường s.",
    "re": "Quãng đường s = v * t"
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m, nếu lực F không thay đổi thì gia tốc a của vật sẽ tỷ lệ thuận với lực F.",
    "re": "Gia tốc a = F/m"
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cùng phương và cùng chiều, thì tổng hợp lực tác dụng lên vật sẽ là tổng hai lực đó.",
    "re": "Lực tổng hợp F = F_1 + F_2"
  },
  {
    "con": "Khi một vật quay quanh một trục với vận tốc góc ω, thì gia tốc hướng tâm a_c sẽ tỷ lệ thuận với bình phương vận tốc v.",
    "re": "Gia tốc hướng tâm a_c = v^2/r"
  },
  {
    "con": "Nếu một sóng âm có tần số f và vận tốc truyền sóng v, thì bước sóng λ sẽ được tính bằng công thức λ = v/f.",
    "re": "Bước sóng λ = v/f"
  },
  {
    "con": "Khi một điện tích q di chuyển trong một trường điện đều, thì công của lực điện sẽ phụ thuộc vào độ lớn của điện tích và hiệu điện thế giữa hai điểm.",
    "re": "Công W = q * ΔV"
  },
  {
    "con": "Nếu một vật có khối lượng m được kéo lên cao h với lực F, thì công thực hiện bởi lực F sẽ phụ thuộc vào khối lượng m và độ cao h.",
    "re": "Công W = m * g * h"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác, thì tổng động năng của hệ sẽ được bảo toàn.",
    "re": "Động năng trước va chạm = Động năng sau va chạm"
  },
  {
    "con": "Đường sức của điện trường là đường",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Vật chịu tác dụng của lực không đổi",
    "re": "Chuyển động của vật là chuyển động thẳng đều"
  },
  {
    "con": "Năng lượng không thể tự sinh ra hoặc mất đi",
    "re": "Năng lượng tổng trong một hệ kín là hằng số"
  },
  {
    "con": "Lực tác dụng lên một vật có khối lượng",
    "re": "Vật sẽ có gia tốc tỉ lệ thuận với lực và nghịch đảo với khối lượng"
  },
  {
    "con": "Tần số của sóng âm tăng",
    "re": "Chiều cao của âm thanh sẽ tăng"
  },
  {
    "con": "Nhiệt độ của một vật tăng",
    "re": "Năng lượng động học của các phân tử trong vật cũng tăng"
  },
  {
    "con": "Một vật rơi tự do trong chân không",
    "re": "Vật sẽ có gia tốc không đổi bằng gia tốc trọng trường"
  },
  {
    "con": "Ánh sáng đi từ môi trường này sang môi trường khác",
    "re": "Ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Một vật dao động điều hòa",
    "re": "Vật có chu kỳ và tần số xác định"
  },
  {
    "con": "Lực hấp dẫn giữa hai vật",
    "re": "Tỉ lệ thuận với tích khối lượng của chúng và nghịch đảo với bình phương khoảng cách giữa chúng"
  },
  {
    "con": "điện thông gởi qua mặt kín (S) mà bằng 0",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "vật chịu tác dụng của lực không cân bằng",
    "re": "vật sẽ chuyển động với gia tốc"
  },
  {
    "con": "năng lượng được bảo toàn trong một hệ kín",
    "re": "tổng năng lượng của hệ sẽ không thay đổi"
  },
  {
    "con": "vật rơi tự do trong môi trường không có sức cản",
    "re": "vật sẽ có gia tốc không đổi bằng 9.81 m/s²"
  },
  {
    "con": "lực tác dụng lên một vật có khối lượng m",
    "re": "sẽ tạo ra gia tốc a theo định luật Newton thứ hai (F = ma)"
  },
  {
    "con": "nhiệt độ của một vật tăng lên",
    "re": "năng lượng nội tại của vật cũng sẽ tăng"
  },
  {
    "con": "sóng âm truyền qua môi trường",
    "re": "tốc độ sóng âm phụ thuộc vào tính chất của môi trường"
  },
  {
    "con": "một vật dao động điều hòa",
    "re": "có tần số và biên độ không đổi"
  },
  {
    "con": "một điện tích đặt trong điện trường",
    "re": "sẽ chịu tác dụng của lực điện"
  },
  {
    "con": "một vật có khối lượng m di chuyển với vận tốc v",
    "re": "có động năng bằng 1/2 mv²"
  },
  {
    "con": "Một mặt cầu (S) bao kín một điện tích q. Nếu giá trị của q tăng lên 3 lần thì điện thông gởi qua (S):",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Nếu h tăng lên gấp đôi thì thời gian rơi sẽ tăng lên:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Nếu m tăng lên gấp đôi thì động năng của vật sẽ:",
    "re": "Tăng lên gấp đôi nếu v không thay đổi"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén một khoảng x. Nếu x tăng lên gấp đôi thì lực đàn hồi sẽ:",
    "re": "Tăng lên gấp đôi"
  },
  {
    "con": "Một dòng điện I chạy qua một điện trở R. Nếu R giảm đi một nửa thì cường độ dòng điện I sẽ:",
    "re": "Tăng lên gấp đôi theo định luật Ohm"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Nếu v tăng lên gấp đôi thì động lượng của vật sẽ:",
    "re": "Tăng lên gấp đôi"
  },
  {
    "con": "Một sóng âm có tần số f. Nếu f tăng lên thì bước sóng λ sẽ:",
    "re": "Giảm xuống theo công thức λ = v/f"
  },
  {
    "con": "Một vật chịu tác dụng của lực F. Nếu F tăng lên gấp ba lần thì gia tốc a của vật sẽ:",
    "re": "Tăng lên gấp ba lần nếu khối lượng m không thay đổi"
  },
  {
    "con": "Một điện tích q di chuyển trong một từ trường B. Nếu B tăng lên thì lực Lorentz F tác dụng lên điện tích sẽ:",
    "re": "Tăng lên nếu vận tốc v không thay đổi"
  },
  {
    "con": "Một vật có nhiệt độ T. Nếu T tăng lên thì năng lượng nội tại của vật sẽ:",
    "re": "Tăng lên theo định luật nhiệt động lực học"
  },
  {
    "con": "Trong trường tĩnh điện, phát biểu nào sau đây là SAI?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì vận tốc của nó không thay đổi theo thời gian.",
    "re": "Vận tốc là hằng số"
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng, thì vật sẽ có gia tốc.",
    "re": "Gia tốc tỷ lệ thuận với lực và nghịch đảo với khối lượng"
  },
  {
    "con": "Khi một vật rơi tự do, thì lực tác dụng duy nhất lên vật là trọng lực.",
    "re": "Vật sẽ rơi với gia tốc bằng gia tốc trọng trường"
  },
  {
    "con": "Trong một hệ kín, tổng động lượng được bảo toàn nếu không có lực bên ngoài tác dụng.",
    "re": "Động lượng trước và sau va chạm là như nhau"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt trong một hệ kín.",
    "re": "Năng lượng được bảo toàn"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác, thì tốc độ ánh sáng thay đổi.",
    "re": "Góc khúc xạ phụ thuộc vào chỉ số khúc xạ của hai môi trường"
  },
  {
    "con": "Khi một sóng âm đi qua không khí, thì tốc độ của sóng âm phụ thuộc vào nhiệt độ của không khí.",
    "re": "Tốc độ sóng âm tăng khi nhiệt độ tăng"
  },
  {
    "con": "Khi một vật dao động điều hòa, thì nó có một tần số xác định.",
    "re": "Tần số là đặc trưng cho chu kỳ dao động"
  },
  {
    "con": "Trong một mạch điện, nếu điện trở tăng thì dòng điện sẽ giảm.",
    "re": "Dòng điện tỷ lệ nghịch với điện trở theo định luật Ohm"
  },
  {
    "con": "Điện tích điểm Q < 0. Kết luận nào sau đây là đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Vật chuyển động thẳng đều với vận tốc không đổi.",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Năng lượng không được tạo ra hay tiêu diệt.",
    "re": "Năng lượng tổng luôn được bảo toàn"
  },
  {
    "con": "Một vật rơi tự do trong trường hấp dẫn.",
    "re": "Vật chỉ chịu tác dụng của trọng lực"
  },
  {
    "con": "Ánh sáng đi từ môi trường này sang môi trường khác với chỉ số khúc xạ khác nhau.",
    "re": "Ánh sáng sẽ bị bẻ cong"
  },
  {
    "con": "Một vật có khối lượng m và vận tốc v.",
    "re": "Động lượng của vật là p = mv"
  },
  {
    "con": "Nhiệt độ của một vật tăng lên.",
    "re": "Năng lượng nội của vật cũng tăng lên"
  },
  {
    "con": "Một lò xo bị nén hoặc kéo ra.",
    "re": "Lực đàn hồi tỉ lệ thuận với độ biến dạng của lò xo"
  },
  {
    "con": "Một điện tích dương đặt trong điện trường.",
    "re": "Điện tích sẽ chịu lực tác dụng theo hướng của điện trường"
  },
  {
    "con": "Một sóng âm truyền trong không khí.",
    "re": "Sóng âm là sóng cơ học và cần môi trường để truyền"
  }
]