[
  {
    "con": "Xâu định dạng nào sau đây dùng để in ra một số thực có độ chính xác đơn:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được gán giá trị:",
    "re": "Sẽ có giá trị mặc định tùy thuộc vào kiểu dữ liệu"
  },
  {
    "con": "Một hàm được định nghĩa nhưng không được gọi:",
    "re": "Sẽ không thực thi và không có tác dụng"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng:",
    "re": "Có thể truy cập từng phần tử của mảng một cách dễ dàng"
  },
  {
    "con": "Khi sử dụng toán tử == để so sánh hai biến:",
    "re": "Chỉ kiểm tra giá trị, không kiểm tra kiểu dữ liệu"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if-else:",
    "re": "Chương trình sẽ thực hiện một trong hai nhánh dựa trên điều kiện"
  },
  {
    "con": "Khi một hàm trả về giá trị:",
    "re": "Giá trị đó có thể được sử dụng trong các phép toán khác"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa const:",
    "re": "Biến đó không thể được gán lại giá trị sau khi đã được khởi tạo"
  },
  {
    "con": "Khi sử dụng mảng trong lập trình:",
    "re": "Có thể lưu trữ nhiều giá trị cùng một kiểu dữ liệu trong một biến"
  },
  {
    "con": "Kiểu dữ liệu int( kiểu số nguyên) có thể xử lí số nguyên nằm trong khoảng nào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo mà không được khởi tạo giá trị:",
    "re": "Sẽ có giá trị mặc định tùy thuộc vào kiểu dữ liệu"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng:",
    "re": "Có thể truy cập từng phần tử của mảng theo chỉ số"
  },
  {
    "con": "Hàm được định nghĩa nhưng không được gọi:",
    "re": "Sẽ không thực thi mã bên trong hàm đó"
  },
  {
    "con": "Sử dụng câu lệnh điều kiện if để kiểm tra một điều kiện:",
    "re": "Chương trình sẽ thực hiện khối mã bên trong if nếu điều kiện đúng"
  },
  {
    "con": "Khi một biến được khai báo là hằng số (const):",
    "re": "Giá trị của biến đó không thể thay đổi trong suốt chương trình"
  },
  {
    "con": "Sử dụng mảng để lưu trữ nhiều giá trị cùng loại:",
    "re": "Có thể truy cập và thao tác với các giá trị thông qua chỉ số của mảng"
  },
  {
    "con": "Khi một hàm trả về giá trị:",
    "re": "Có thể sử dụng giá trị đó trong các phép toán hoặc gán cho biến khác"
  },
  {
    "con": "Sử dụng câu lệnh switch để kiểm tra nhiều điều kiện:",
    "re": "Có thể xử lý nhiều trường hợp khác nhau một cách hiệu quả"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Chương trình sẽ không biên dịch thành công và không thể chạy"
  },
  {
    "con": "Cho a=3, b=2 và c là 3 biến nguyên. Biểu thức nào sau viết sai cú pháp trong ngôn ngữ lập trình C :",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu biến x được khai báo là kiểu số nguyên và gán giá trị 5. Khi thực hiện phép toán x + 2 thì giá trị của x sẽ là:",
    "re": "7"
  },
  {
    "con": "Nếu một hàm không có giá trị trả về được khai báo với từ khóa 'void', thì hàm đó:",
    "re": "không trả về giá trị nào"
  },
  {
    "con": "Nếu một biến được khai báo nhưng không được khởi tạo, thì giá trị của biến đó:",
    "re": "sẽ không xác định"
  },
  {
    "con": "Nếu sử dụng vòng lặp for với điều kiện dừng là sai, thì vòng lặp đó:",
    "re": "sẽ không bao giờ thực thi"
  },
  {
    "con": "Nếu một mảng được khai báo với kích thước là 10, thì chỉ số lớn nhất mà bạn có thể truy cập là:",
    "re": "9"
  },
  {
    "con": "Nếu một chuỗi được khai báo trong ngôn ngữ lập trình Python, thì chuỗi đó có thể được truy cập bằng cách sử dụng:",
    "re": "chỉ số bắt đầu từ 0"
  },
  {
    "con": "Nếu một biến toàn cục được khai báo trong một hàm, thì biến đó:",
    "re": "có thể được truy cập từ bất kỳ đâu trong chương trình"
  },
  {
    "con": "Nếu một điều kiện trong câu lệnh if là đúng, thì khối lệnh bên trong câu lệnh if:",
    "re": "sẽ được thực thi"
  },
  {
    "con": "Nếu một chương trình không có hàm main(), thì chương trình đó:",
    "re": "sẽ không thể biên dịch hoặc chạy"
  },
  {
    "con": "Giả sử a và b là 2 số thực. Biểu thức nào dưới đây là không được phép :",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi bạn viết mã, nếu bạn không sử dụng đúng cú pháp của ngôn ngữ lập trình thì",
    "re": "chương trình sẽ không biên dịch hoặc chạy được"
  },
  {
    "con": "Nếu bạn không kiểm tra lỗi trong mã của mình thì",
    "re": "các lỗi có thể gây ra sự cố trong quá trình thực thi"
  },
  {
    "con": "Khi bạn sử dụng biến, nếu bạn không khởi tạo biến trước khi sử dụng thì",
    "re": "biến đó sẽ chứa giá trị không xác định"
  },
  {
    "con": "Nếu bạn không sử dụng cấu trúc điều kiện trong chương trình thì",
    "re": "chương trình sẽ không thể thực hiện các quyết định dựa trên điều kiện"
  },
  {
    "con": "Khi bạn làm việc với vòng lặp, nếu bạn không có điều kiện dừng thì",
    "re": "vòng lặp sẽ chạy vô hạn và có thể làm treo chương trình"
  },
  {
    "con": "Nếu bạn không sử dụng các hàm để tổ chức mã của mình thì",
    "re": "mã sẽ trở nên khó đọc và bảo trì"
  },
  {
    "con": "Khi bạn sử dụng thư viện bên ngoài, nếu bạn không kiểm tra tài liệu thì",
    "re": "bạn có thể sử dụng sai cách và gặp lỗi"
  },
  {
    "con": "Nếu bạn không thực hiện kiểm thử cho mã của mình thì",
    "re": "bạn có thể bỏ lỡ các lỗi nghiêm trọng"
  },
  {
    "con": "Khi bạn làm việc với dữ liệu, nếu bạn không xử lý dữ liệu đầu vào đúng cách thì",
    "re": "chương trình có thể gặp lỗi hoặc bảo mật bị đe dọa"
  },
  {
    "con": "Cho a=3, b=2. Biến c=(a<<=b) sẽ có giá trị nào dưới đây :",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một biến được khai báo nhưng không được khởi tạo giá trị, thì giá trị của biến đó sẽ là gì?",
    "re": "Giá trị mặc định của biến đó (nếu là kiểu số thì là 0, kiểu boolean là false, kiểu đối tượng là null)"
  },
  {
    "con": "Nếu một hàm không trả về giá trị gì, thì giá trị trả về của hàm đó sẽ là gì?",
    "re": "Giá trị undefined (trong JavaScript) hoặc None (trong Python)"
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp for để lặp qua một mảng, thì bạn có thể truy cập từng phần tử của mảng bằng cách nào?",
    "re": "Sử dụng chỉ số (index) của phần tử trong mảng"
  },
  {
    "con": "Nếu bạn sử dụng toán tử == để so sánh hai giá trị khác kiểu dữ liệu, thì điều gì sẽ xảy ra?",
    "re": "Hai giá trị sẽ được chuyển đổi kiểu dữ liệu để so sánh"
  },
  {
    "con": "Nếu bạn khai báo một biến toàn cục trong một hàm, thì biến đó có thể được truy cập ở đâu?",
    "re": "Biến đó có thể được truy cập từ bất kỳ đâu trong chương trình"
  },
  {
    "con": "Nếu bạn sử dụng toán tử ++ trên một biến số nguyên, thì giá trị của biến đó sẽ thay đổi như thế nào?",
    "re": "Giá trị của biến đó sẽ tăng thêm 1"
  },
  {
    "con": "Nếu bạn gọi một hàm mà không truyền tham số, thì các tham số trong hàm đó sẽ có giá trị gì?",
    "re": "Các tham số sẽ có giá trị undefined (trong JavaScript) hoặc None (trong Python)"
  },
  {
    "con": "Nếu bạn sử dụng cấu trúc điều kiện if-else, thì điều gì sẽ xảy ra nếu điều kiện trong if là false?",
    "re": "Khối lệnh trong else sẽ được thực thi"
  },
  {
    "con": "Nếu bạn sử dụng mảng để lưu trữ dữ liệu, thì bạn có thể thêm phần tử mới vào mảng bằng cách nào?",
    "re": "Sử dụng phương thức push() hoặc chỉ định chỉ số mới cho phần tử"
  },
  {
    "con": "Trong các hàm sau, hàm nào là hàm không định dạng để in một chuỗi kí tự ra màn hình:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi bạn sử dụng biến mà chưa khai báo,",
    "re": "Chương trình sẽ báo lỗi biên dịch."
  },
  {
    "con": "Nếu bạn không sử dụng dấu chấm phẩy ở cuối câu lệnh trong ngôn ngữ lập trình C,",
    "re": "Chương trình sẽ không biên dịch thành công."
  },
  {
    "con": "Khi bạn gọi một hàm mà không truyền đủ tham số cần thiết,",
    "re": "Chương trình sẽ báo lỗi khi chạy."
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp mà không có điều kiện dừng,",
    "re": "Chương trình sẽ chạy mãi mãi."
  },
  {
    "con": "Khi bạn sử dụng toán tử so sánh để kiểm tra hai giá trị,",
    "re": "Kết quả sẽ là true hoặc false."
  },
  {
    "con": "Nếu bạn không xử lý ngoại lệ trong chương trình,",
    "re": "Chương trình có thể bị dừng đột ngột khi gặp lỗi."
  },
  {
    "con": "Khi bạn khai báo một mảng mà không chỉ định kích thước,",
    "re": "Chương trình sẽ không biết kích thước của mảng."
  },
  {
    "con": "Nếu bạn sử dụng biến toàn cục trong một hàm,",
    "re": "Hàm có thể truy cập và thay đổi giá trị của biến đó."
  },
  {
    "con": "Khi bạn sử dụng cấu trúc điều kiện if-else,",
    "re": "Chương trình sẽ thực hiện một trong hai nhánh dựa trên điều kiện."
  },
  {
    "con": "Sử dụng cách truyền nào trong hàm sẽ không làm thay đổi giá trị của biến trong chương trình chính:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo bên trong một hàm sẽ không thể truy cập từ bên ngoài hàm đó:",
    "re": "Đúng"
  },
  {
    "con": "Sử dụng vòng lặp để lặp qua các phần tử trong một mảng sẽ giúp tiết kiệm thời gian viết mã:",
    "re": "Đúng"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện, nếu điều kiện là đúng thì khối lệnh bên trong sẽ được thực thi:",
    "re": "Đúng"
  },
  {
    "con": "Khi một hàm trả về giá trị, giá trị đó có thể được sử dụng trong các phép toán khác:",
    "re": "Đúng"
  },
  {
    "con": "Sử dụng các comment trong mã nguồn sẽ giúp người khác dễ hiểu hơn về logic của chương trình:",
    "re": "Đúng"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa 'const', giá trị của nó không thể thay đổi:",
    "re": "Đúng"
  },
  {
    "con": "Sử dụng các thư viện bên ngoài có thể giúp giảm thiểu thời gian phát triển và tăng tính hiệu quả của chương trình:",
    "re": "Đúng"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp, nó sẽ không thể biên dịch thành công:",
    "re": "Đúng"
  },
  {
    "con": "Việc tổ chức mã nguồn theo các hàm và lớp sẽ giúp cải thiện khả năng bảo trì và mở rộng của chương trình:",
    "re": "Đúng"
  },
  {
    "con": "Cho biết giá trị của biểu thức 5>1 :",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được gán giá trị:",
    "re": "Giá trị của biến đó sẽ là undefined (trong JavaScript) hoặc null (trong Java)"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng:",
    "re": "Có thể truy cập từng phần tử của mảng theo chỉ số"
  },
  {
    "con": "Gọi một hàm mà không truyền tham số:",
    "re": "Hàm sẽ sử dụng giá trị mặc định cho các tham số nếu có"
  },
  {
    "con": "Sử dụng toán tử == để so sánh hai giá trị:",
    "re": "Có thể dẫn đến kết quả không chính xác do so sánh kiểu dữ liệu khác nhau"
  },
  {
    "con": "Khi một hàm trả về giá trị:",
    "re": "Giá trị đó có thể được lưu trữ trong một biến để sử dụng sau này"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện if-else:",
    "re": "Cho phép thực hiện các đoạn mã khác nhau dựa trên điều kiện đúng hoặc sai"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa const:",
    "re": "Biến đó không thể được gán lại giá trị mới"
  },
  {
    "con": "Sử dụng mảng để lưu trữ danh sách các giá trị:",
    "re": "Có thể dễ dàng truy cập và thao tác với các giá trị trong danh sách đó"
  },
  {
    "con": "Khi sử dụng hàm callback:",
    "re": "Hàm đó sẽ được gọi sau khi một tác vụ khác hoàn thành"
  },
  {
    "con": "Biến được khai báo nhưng chưa được gán giá trị:",
    "re": "Giá trị của biến sẽ là undefined trong nhiều ngôn ngữ lập trình."
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng:",
    "re": "Mỗi phần tử trong mảng sẽ được truy cập theo chỉ số của nó."
  },
  {
    "con": "Khi sử dụng toán tử == trong so sánh:",
    "re": "Hai giá trị có thể được chuyển đổi kiểu dữ liệu để so sánh."
  },
  {
    "con": "Khi một hàm không trả về giá trị:",
    "re": "Giá trị trả về sẽ là undefined trong nhiều ngôn ngữ lập trình."
  },
  {
    "con": "Khi sử dụng toán tử && trong biểu thức điều kiện:",
    "re": "Biểu thức sẽ trả về true chỉ khi tất cả các điều kiện đều đúng."
  },
  {
    "con": "Khi một biến được khai báo với từ khóa const:",
    "re": "Biến đó không thể được gán lại giá trị mới."
  },
  {
    "con": "Khi sử dụng hàm console.log() để in ra giá trị:",
    "re": "Giá trị sẽ được hiển thị trên bảng điều khiển của trình duyệt hoặc môi trường phát triển."
  },
  {
    "con": "Khi một mảng được khởi tạo với các giá trị:",
    "re": "Mảng sẽ chứa các phần tử theo thứ tự mà chúng được khai báo."
  },
  {
    "con": "Khi sử dụng toán tử || trong biểu thức điều kiện:",
    "re": "Biểu thức sẽ trả về true nếu ít nhất một trong các điều kiện đúng."
  },
  {
    "con": "Khi một biến được khai báo bên trong một hàm:",
    "re": "Biến đó chỉ có thể được truy cập trong phạm vi của hàm đó."
  },
  {
    "con": "Cho biết giá trị của biểu thức 2+4>2&&4<2 :",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến con trỏ có thể chứa :",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được khởi tạo :",
    "re": "Có thể chứa giá trị không xác định"
  },
  {
    "con": "Cú pháp của một lệnh điều kiện là :",
    "re": "Cần có dấu ngoặc đơn cho điều kiện"
  },
  {
    "con": "Một hàm không trả về giá trị :",
    "re": "Được định nghĩa với kiểu trả về là void"
  },
  {
    "con": "Sử dụng vòng lặp for :",
    "re": "Có thể lặp qua một dãy số xác định"
  },
  {
    "con": "Khi một biến được khai báo trong hàm :",
    "re": "Nó có phạm vi chỉ trong hàm đó"
  },
  {
    "con": "Khi sử dụng mảng :",
    "re": "Cần chỉ định kích thước hoặc khởi tạo giá trị cho các phần tử"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp :",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Khi sử dụng toán tử so sánh :",
    "re": "Kết quả sẽ là true hoặc false"
  },
  {
    "con": "Khi gọi một hàm :",
    "re": "Các tham số phải tương ứng với kiểu dữ liệu đã định nghĩa"
  },
  {
    "con": "Dữ liệu kí tự bao gồm :",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo mà không được gán giá trị:",
    "re": "Biến đó sẽ có giá trị mặc định là null hoặc undefined"
  },
  {
    "con": "Sử dụng vòng lặp để lặp qua một mảng:",
    "re": "Có thể truy cập từng phần tử của mảng một cách tuần tự"
  },
  {
    "con": "Hàm được định nghĩa nhưng không được gọi:",
    "re": "Hàm đó sẽ không thực thi và không có tác dụng"
  },
  {
    "con": "Sử dụng toán tử so sánh ===:",
    "re": "So sánh cả giá trị và kiểu dữ liệu của hai biến"
  },
  {
    "con": "Một chương trình có lỗi cú pháp:",
    "re": "Chương trình sẽ không biên dịch hoặc chạy được"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện if-else:",
    "re": "Cho phép thực hiện các đoạn mã khác nhau dựa trên điều kiện"
  },
  {
    "con": "Khi một biến được khai báo trong hàm:",
    "re": "Biến đó sẽ có phạm vi chỉ trong hàm đó"
  },
  {
    "con": "Sử dụng mảng để lưu trữ dữ liệu:",
    "re": "Có thể lưu trữ nhiều giá trị trong cùng một biến"
  },
  {
    "con": "Khi một hàm trả về giá trị:",
    "re": "Giá trị đó có thể được sử dụng trong các phép toán khác"
  },
  {
    "con": "hàm được gọi trước khi nó định nghĩa",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "biến được khai báo nhưng chưa được gán giá trị",
    "re": "giá trị của biến đó sẽ là undefined"
  },
  {
    "con": "sử dụng vòng lặp để lặp qua một mảng",
    "re": "các phần tử trong mảng sẽ được truy cập tuần tự"
  },
  {
    "con": "sử dụng toán tử so sánh ===",
    "re": "cả giá trị và kiểu dữ liệu của hai biến sẽ được so sánh"
  },
  {
    "con": "khai báo một biến với từ khóa let trong phạm vi khối",
    "re": "biến đó chỉ có thể được truy cập trong phạm vi khối đó"
  },
  {
    "con": "sử dụng hàm để tổ chức mã nguồn",
    "re": "mã nguồn sẽ trở nên dễ đọc và dễ bảo trì hơn"
  },
  {
    "con": "gọi một hàm không có tham số",
    "re": "hàm sẽ được thực thi mà không cần truyền dữ liệu vào"
  },
  {
    "con": "sử dụng cấu trúc điều kiện if-else",
    "re": "chương trình sẽ thực hiện một trong hai nhánh dựa trên điều kiện"
  },
  {
    "con": "khai báo một mảng rỗng",
    "re": "mảng đó có thể được thêm phần tử sau này"
  },
  {
    "con": "sử dụng cú pháp try-catch",
    "re": "các lỗi trong mã sẽ được xử lý mà không làm ngừng chương trình"
  },
  {
    "con": "Kiểu dữ liệu float có thể xử lí dữ liệu trong phạm vi nào :",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo giá trị sẽ có giá trị mặc định là gì :",
    "re": "Giá trị mặc định là null hoặc 0 tùy thuộc vào ngôn ngữ lập trình"
  },
  {
    "con": "Câu lệnh điều kiện if chỉ được thực thi khi điều kiện là gì :",
    "re": "Điều kiện là true"
  },
  {
    "con": "Vòng lặp for thường được sử dụng để làm gì :",
    "re": "Lặp qua một dãy số hoặc một tập hợp các phần tử"
  },
  {
    "con": "Hàm có thể trả về giá trị hay không :",
    "re": "Có thể trả về giá trị hoặc không trả về gì cả"
  },
  {
    "con": "Khi sử dụng mảng, chỉ số bắt đầu thường là gì :",
    "re": "Chỉ số bắt đầu thường là 0"
  },
  {
    "con": "Khi một biến được khai báo là hằng số, giá trị của nó có thể thay đổi hay không :",
    "re": "Không thể thay đổi"
  },
  {
    "con": "Khi sử dụng toán tử == trong so sánh, điều gì xảy ra :",
    "re": "So sánh giá trị của hai biến mà không xét đến kiểu dữ liệu"
  },
  {
    "con": "Khi một hàm không có tham số, nó có thể được gọi như thế nào :",
    "re": "Gọi hàm mà không cần truyền tham số"
  },
  {
    "con": "Khi sử dụng cú pháp try-catch, mục đích chính là gì :",
    "re": "Xử lý ngoại lệ và lỗi trong chương trình"
  },
  {
    "con": "Biến được khai báo mà không được khởi tạo giá trị:",
    "re": "Có thể gây ra lỗi khi sử dụng trong chương trình"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng:",
    "re": "Giúp truy cập từng phần tử của mảng một cách dễ dàng"
  },
  {
    "con": "Hàm không trả về giá trị:",
    "re": "Được gọi là hàm void trong nhiều ngôn ngữ lập trình"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện if-else:",
    "re": "Cho phép thực hiện các đoạn mã khác nhau dựa trên điều kiện"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa const:",
    "re": "Giá trị của biến đó không thể thay đổi sau khi được khởi tạo"
  },
  {
    "con": "Sử dụng mảng để lưu trữ dữ liệu:",
    "re": "Giúp tổ chức và quản lý dữ liệu theo cách có cấu trúc"
  },
  {
    "con": "Khi một hàm được gọi mà không có tham số:",
    "re": "Hàm vẫn có thể thực hiện các tác vụ nhất định mà không cần dữ liệu đầu vào"
  },
  {
    "con": "Sử dụng từ khóa return trong hàm:",
    "re": "Cho phép trả về giá trị từ hàm cho nơi gọi hàm"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Sử dụng comment trong mã nguồn:",
    "re": "Giúp giải thích mã cho người đọc mà không ảnh hưởng đến thực thi chương trình"
  },
  {
    "con": "Lệnh nào trong các lệnh sau cho phép chuyển sang vòng lặp tiếp theo mà không cần phải thực hiện phần còn lại của vòng lặp:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được gán giá trị:",
    "re": "Sẽ có giá trị mặc định là undefined trong JavaScript"
  },
  {
    "con": "Khi sử dụng vòng lặp for, nếu điều kiện dừng không bao giờ được thỏa mãn:",
    "re": "Vòng lặp sẽ chạy vô hạn"
  },
  {
    "con": "Khi một hàm không trả về giá trị nào:",
    "re": "Giá trị trả về sẽ là undefined"
  },
  {
    "con": "Nếu một mảng được khởi tạo với các giá trị khác nhau:",
    "re": "Mảng đó có thể chứa các kiểu dữ liệu khác nhau"
  },
  {
    "con": "Khi sử dụng toán tử == trong JavaScript:",
    "re": "Nó sẽ thực hiện so sánh kiểu dữ liệu và giá trị"
  },
  {
    "con": "Nếu một biến được khai báo với từ khóa const:",
    "re": "Biến đó không thể được gán lại giá trị mới"
  },
  {
    "con": "Khi một hàm được gọi mà không có tham số:",
    "re": "Các tham số trong hàm sẽ có giá trị mặc định là undefined"
  },
  {
    "con": "Nếu một đối tượng trong JavaScript không có thuộc tính được yêu cầu:",
    "re": "Giá trị trả về sẽ là undefined"
  },
  {
    "con": "Khi sử dụng lệnh break trong một vòng lặp:",
    "re": "Vòng lặp sẽ dừng lại ngay lập tức"
  },
  {
    "con": "Giả sử có câu lệnh ch=’A’. Vậy ch sẽ chứa bao nhiêu byte :",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một biến được khai báo nhưng không được khởi tạo giá trị, thì giá trị của biến đó sẽ là gì :",
    "re": "Giá trị không xác định (hoặc null trong một số ngôn ngữ)"
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp for để lặp qua một mảng, thì bạn có thể truy cập từng phần tử của mảng đó như thế nào :",
    "re": "Bằng cách sử dụng chỉ số của phần tử trong vòng lặp"
  },
  {
    "con": "Nếu bạn gọi một hàm mà không truyền tham số cần thiết, thì điều gì sẽ xảy ra :",
    "re": "Có thể xảy ra lỗi hoặc hàm sẽ sử dụng giá trị mặc định nếu được định nghĩa"
  },
  {
    "con": "Nếu bạn sử dụng toán tử == để so sánh hai giá trị, thì điều gì sẽ xảy ra nếu hai giá trị đó có kiểu dữ liệu khác nhau :",
    "re": "Chúng sẽ được chuyển đổi kiểu dữ liệu trước khi so sánh"
  },
  {
    "con": "Nếu bạn muốn kiểm tra xem một biến có phải là một mảng hay không, thì bạn nên sử dụng hàm nào :",
    "re": "Hàm Array.isArray() trong JavaScript hoặc instanceof trong Java"
  },
  {
    "con": "Nếu bạn sử dụng câu lệnh điều kiện if mà không có khối else, thì điều gì sẽ xảy ra nếu điều kiện không được thỏa mãn :",
    "re": "Chương trình sẽ tiếp tục thực hiện các câu lệnh phía dưới if"
  },
  {
    "con": "Nếu bạn muốn tạo một hàm có thể nhận một số lượng tham số không xác định, thì bạn nên sử dụng cú pháp nào :",
    "re": "Sử dụng toán tử spread (...) trong JavaScript hoặc tham số biến trong Python"
  },
  {
    "con": "Nếu bạn muốn lưu trữ một tập hợp các giá trị không trùng lặp, thì bạn nên sử dụng cấu trúc dữ liệu nào :",
    "re": "Sử dụng Set trong JavaScript hoặc Set trong Python"
  },
  {
    "con": "Nếu bạn muốn xử lý ngoại lệ trong chương trình của mình, thì bạn nên sử dụng cấu trúc nào :",
    "re": "Sử dụng khối try-catch"
  },
  {
    "con": "Giả sử có câu lệnh ch[]= \"A\". ch chứa bao nhiêu bytes :",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một biến được khai báo nhưng không được khởi tạo giá trị, thì giá trị của biến đó sẽ là giá trị mặc định của kiểu dữ liệu.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hàm không trả về giá trị, thì kiểu trả về của hàm đó phải được khai báo là void.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu sử dụng vòng lặp for để lặp qua một mảng, thì chỉ số bắt đầu thường là 0.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chương trình có lỗi cú pháp, thì chương trình sẽ không biên dịch thành công.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một biến được khai báo là hằng số (const), thì giá trị của biến đó không thể thay đổi trong suốt chương trình.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chương trình sử dụng thư viện, thì cần phải bao gồm thư viện đó bằng cách sử dụng câu lệnh import hoặc include.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mảng có n phần tử, thì chỉ số của phần tử cuối cùng sẽ là n-1.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một biến kiểu số nguyên được chia cho 0, thì sẽ xảy ra lỗi chia cho 0.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chương trình sử dụng cấu trúc điều kiện if-else, thì chỉ một trong hai nhánh sẽ được thực thi.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Dạng tổng quát của hàm printf() là: printf(“dãy mã quy cách”, dãy mã biểu thức); Trong đó, dãy mã quy cách sẽ là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến trong lập trình được khai báo với kiểu dữ liệu cụ thể như int, float, char;",
    "re": "Biến đó sẽ chỉ chứa giá trị tương ứng với kiểu dữ liệu đã khai báo."
  },
  {
    "con": "Khi sử dụng vòng lặp for, cú pháp là: for (khởi tạo; điều kiện; cập nhật) { khối lệnh }",
    "re": "Vòng lặp sẽ thực hiện khối lệnh cho đến khi điều kiện không còn đúng."
  },
  {
    "con": "Khi một hàm được gọi mà không có giá trị trả về, nó sẽ được định nghĩa với kiểu trả về là void;",
    "re": "Hàm đó sẽ không trả về giá trị nào cho nơi gọi."
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if, cú pháp là: if (điều kiện) { khối lệnh }",
    "re": "Khối lệnh sẽ chỉ được thực thi nếu điều kiện là đúng."
  },
  {
    "con": "Khi một mảng được khai báo với kích thước n, nó sẽ có n phần tử;",
    "re": "Các phần tử trong mảng sẽ được truy cập thông qua chỉ số từ 0 đến n-1."
  },
  {
    "con": "Khi sử dụng toán tử logic && trong điều kiện, cả hai điều kiện phải đúng;",
    "re": "Kết quả của điều kiện sẽ là đúng chỉ khi cả hai điều kiện đều đúng."
  },
  {
    "con": "Khi một chuỗi được khai báo trong ngôn ngữ lập trình, nó thường được đặt trong dấu nháy kép;",
    "re": "Chuỗi đó sẽ được coi là một kiểu dữ liệu đặc biệt để xử lý văn bản."
  },
  {
    "con": "Khi sử dụng hàm nhập liệu như scanf(), cú pháp là: scanf(“định dạng”, &biến);",
    "re": "Hàm sẽ đọc dữ liệu từ bàn phím và lưu vào biến tương ứng."
  },
  {
    "con": "Khi một chương trình được biên dịch thành công, nó sẽ tạo ra một tệp thực thi;",
    "re": "Tệp này có thể được chạy để thực hiện các lệnh đã được lập trình."
  },
  {
    "con": "Trong các hàm sau, hàm nào là hàm không định dạng để nhập một kí tự từ bàn phím",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một biến được khai báo nhưng không được khởi tạo giá trị",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Khi sử dụng vòng lặp for để lặp qua một mảng",
    "re": "Mỗi phần tử trong mảng sẽ được truy cập theo chỉ số của nó"
  },
  {
    "con": "Khi một hàm trả về giá trị và không có từ khóa return",
    "re": "Hàm đó sẽ trả về giá trị undefined (trong JavaScript) hoặc không có giá trị (trong nhiều ngôn ngữ khác)"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa const",
    "re": "Biến đó không thể được gán lại giá trị mới"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if-else",
    "re": "Chương trình sẽ thực hiện khối lệnh tương ứng với điều kiện đúng"
  },
  {
    "con": "Khi một hàm được gọi mà không có tham số nhưng lại có tham số được định nghĩa",
    "re": "Các tham số đó sẽ nhận giá trị mặc định nếu có"
  },
  {
    "con": "Khi một mảng được khởi tạo mà không có phần tử nào",
    "re": "Độ dài của mảng đó sẽ là 0"
  },
  {
    "con": "Khi một chuỗi được nối với một số",
    "re": "Kết quả sẽ là một chuỗi mới, trong đó số được chuyển đổi thành chuỗi"
  },
  {
    "con": "Khi sử dụng từ khóa break trong một vòng lặp",
    "re": "Vòng lặp đó sẽ dừng lại ngay lập tức"
  },
  {
    "con": "Trong các hàm sau, hàm nào để nhập một kí tự từ bàn phím ngay sau khi gõ, không chờ nhấn Enter và không hiện ra màn hình:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một biến được khai báo nhưng không được gán giá trị,",
    "re": "giá trị của biến đó sẽ là null hoặc undefined tùy thuộc vào ngôn ngữ lập trình."
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp for để lặp qua một mảng,",
    "re": "bạn cần đảm bảo rằng chỉ số không vượt quá độ dài của mảng."
  },
  {
    "con": "Khi bạn gọi một hàm mà không truyền đủ tham số,",
    "re": "các tham số không được truyền sẽ nhận giá trị mặc định (nếu có) hoặc undefined."
  },
  {
    "con": "Nếu bạn sử dụng toán tử == để so sánh hai giá trị khác kiểu dữ liệu,",
    "re": "ngôn ngữ lập trình sẽ thực hiện chuyển đổi kiểu dữ liệu trước khi so sánh."
  },
  {
    "con": "Khi bạn sử dụng từ khóa return trong một hàm,",
    "re": "hàm sẽ kết thúc và trả về giá trị cho nơi gọi hàm."
  },
  {
    "con": "Nếu bạn không xử lý ngoại lệ trong một đoạn mã có thể gây lỗi,",
    "re": "chương trình sẽ dừng lại và thông báo lỗi cho người dùng."
  },
  {
    "con": "Khi bạn sử dụng mảng trong lập trình,",
    "re": "bạn có thể truy cập các phần tử của mảng thông qua chỉ số bắt đầu từ 0."
  },
  {
    "con": "Nếu bạn khai báo một hàm bên trong một hàm khác,",
    "re": "hàm bên trong sẽ chỉ có thể được gọi từ hàm bên ngoài."
  },
  {
    "con": "Khi bạn sử dụng cấu trúc điều kiện if-else,",
    "re": "chỉ một trong các nhánh sẽ được thực thi dựa trên điều kiện đã cho."
  },
  {
    "con": "Hàm nào đọc kí tự từ bàn phím ngay sau khi gõ, không chờ nhấn Enter. Các kí tự có hiện ra màn hình:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo mà không được gán giá trị ban đầu:",
    "re": "Giá trị của biến đó sẽ là undefined"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng:",
    "re": "Có thể truy cập từng phần tử của mảng theo chỉ số"
  },
  {
    "con": "Hàm có tham số không được truyền vào khi gọi:",
    "re": "Giá trị của tham số đó sẽ là undefined"
  },
  {
    "con": "Sử dụng toán tử == để so sánh hai giá trị khác kiểu dữ liệu:",
    "re": "Kết quả có thể không chính xác do việc chuyển đổi kiểu dữ liệu"
  },
  {
    "con": "Sử dụng câu lệnh điều kiện if mà không có khối else:",
    "re": "Chương trình sẽ chỉ thực hiện khối lệnh if nếu điều kiện đúng"
  },
  {
    "con": "Khi một hàm không có return:",
    "re": "Hàm đó sẽ trả về giá trị undefined"
  },
  {
    "con": "Sử dụng mảng để lưu trữ nhiều giá trị cùng loại:",
    "re": "Có thể dễ dàng truy cập và thao tác với các giá trị đó"
  },
  {
    "con": "Khi sử dụng toán tử ++ trên một biến:",
    "re": "Giá trị của biến đó sẽ tăng thêm 1"
  },
  {
    "con": "Khi một chuỗi được nối với một số:",
    "re": "Kết quả sẽ là một chuỗi, không phải là tổng số"
  },
  {
    "con": "Lệnh nào trong các lệnh sau cho phép đã chuyển tới một nơi nào đó đã được gán nhãn",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được gán giá trị",
    "re": "Biến đó sẽ có giá trị mặc định là null hoặc undefined"
  },
  {
    "con": "Một hàm được định nghĩa nhưng không được gọi",
    "re": "Hàm đó sẽ không thực thi và không có tác dụng gì"
  },
  {
    "con": "Sử dụng vòng lặp để lặp qua một mảng",
    "re": "Bạn có thể truy cập từng phần tử của mảng một cách tuần tự"
  },
  {
    "con": "Một điều kiện trong câu lệnh if là đúng",
    "re": "Câu lệnh trong khối if sẽ được thực thi"
  },
  {
    "con": "Sử dụng toán tử == để so sánh hai giá trị",
    "re": "Kết quả có thể không chính xác nếu hai giá trị có kiểu dữ liệu khác nhau"
  },
  {
    "con": "Một chương trình không có lỗi cú pháp",
    "re": "Chương trình đó có thể được biên dịch hoặc chạy mà không gặp vấn đề"
  },
  {
    "con": "Sử dụng mảng để lưu trữ nhiều giá trị cùng loại",
    "re": "Bạn có thể dễ dàng truy cập và quản lý các giá trị đó"
  },
  {
    "con": "Một biến toàn cục được khai báo trong một hàm",
    "re": "Biến đó sẽ không thể truy cập được bên ngoài hàm"
  },
  {
    "con": "Sử dụng hàm để tái sử dụng mã nguồn",
    "re": "Bạn có thể giảm thiểu sự lặp lại và tăng tính tổ chức cho chương trình"
  },
  {
    "con": "Lệnh nào trong các lệnh sau cho phép dừng câu lệnh điều khiển:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được gán giá trị:",
    "re": "Sẽ có giá trị mặc định là null hoặc undefined"
  },
  {
    "con": "Một hàm được định nghĩa nhưng không được gọi:",
    "re": "Sẽ không thực thi và không trả về giá trị nào"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng:",
    "re": "Có thể truy cập từng phần tử của mảng theo chỉ số"
  },
  {
    "con": "Khi sử dụng toán tử == để so sánh hai giá trị khác kiểu dữ liệu:",
    "re": "JavaScript sẽ thực hiện chuyển đổi kiểu dữ liệu trước khi so sánh"
  },
  {
    "con": "Khi một hàm trả về giá trị, nhưng không có lệnh return:",
    "re": "Hàm đó sẽ trả về giá trị undefined"
  },
  {
    "con": "Khi một biến được khai báo bằng từ khóa const:",
    "re": "Biến đó không thể được gán lại giá trị mới"
  },
  {
    "con": "Khi sử dụng lệnh break trong một vòng lặp:",
    "re": "Vòng lặp sẽ dừng lại ngay lập tức"
  },
  {
    "con": "Khi một mảng được truyền vào một hàm:",
    "re": "Hàm có thể thay đổi nội dung của mảng đó nếu không sử dụng phương thức sao chép"
  },
  {
    "con": "Khi sử dụng toán tử === để so sánh hai giá trị:",
    "re": "So sánh cả giá trị và kiểu dữ liệu mà không thực hiện chuyển đổi"
  },
  {
    "con": "Trong ngôn ngữ C, khai báo “int array[3][5]” có nghĩa là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một biến được khai báo nhưng không được khởi tạo,",
    "re": "giá trị của biến đó sẽ không xác định."
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp for mà không có điều kiện dừng,",
    "re": "chương trình sẽ rơi vào trạng thái lặp vô hạn."
  },
  {
    "con": "Nếu bạn gọi một hàm mà không truyền đủ tham số,",
    "re": "chương trình sẽ báo lỗi biên dịch."
  },
  {
    "con": "Nếu bạn sử dụng toán tử == để so sánh hai chuỗi trong Python,",
    "re": "nó sẽ so sánh giá trị của chuỗi chứ không phải địa chỉ bộ nhớ."
  },
  {
    "con": "Nếu bạn không sử dụng dấu chấm phẩy ở cuối câu lệnh trong ngôn ngữ C,",
    "re": "chương trình sẽ báo lỗi biên dịch."
  },
  {
    "con": "Nếu bạn khai báo một biến toàn cục trong một hàm,",
    "re": "biến đó sẽ không thể truy cập bên ngoài hàm."
  },
  {
    "con": "Nếu bạn sử dụng mảng mà không kiểm tra kích thước,",
    "re": "bạn có thể gặp lỗi tràn bộ nhớ."
  },
  {
    "con": "Nếu bạn sử dụng từ khóa 'return' trong một hàm không trả giá trị,",
    "re": "chương trình sẽ báo lỗi biên dịch."
  },
  {
    "con": "Nếu bạn không xử lý ngoại lệ trong một chương trình Python,",
    "re": "chương trình sẽ dừng lại khi gặp lỗi."
  },
  {
    "con": "Độ ưu tiên đối với các toán tử logic là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được khởi tạo giá trị:",
    "re": "Sẽ có giá trị mặc định tùy thuộc vào kiểu dữ liệu"
  },
  {
    "con": "Sử dụng vòng lặp để lặp qua một danh sách:",
    "re": "Có thể giúp tiết kiệm thời gian và giảm thiểu lỗi"
  },
  {
    "con": "Một hàm không trả về giá trị:",
    "re": "Sẽ có kiểu trả về là void trong nhiều ngôn ngữ lập trình"
  },
  {
    "con": "Sử dụng câu lệnh điều kiện để kiểm tra một điều kiện:",
    "re": "Sẽ cho phép thực hiện các hành động khác nhau dựa trên kết quả kiểm tra"
  },
  {
    "con": "Khi sử dụng mảng, chỉ số bắt đầu từ 0:",
    "re": "Sẽ dẫn đến việc truy cập phần tử đầu tiên là mảng[0]"
  },
  {
    "con": "Khi một biến được khai báo trong một hàm:",
    "re": "Nó sẽ có phạm vi chỉ trong hàm đó"
  },
  {
    "con": "Sử dụng các hàm để tổ chức mã nguồn:",
    "re": "Sẽ giúp mã dễ đọc và bảo trì hơn"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Nó sẽ không biên dịch thành công"
  },
  {
    "con": "Sử dụng các kiểu dữ liệu phù hợp:",
    "re": "Sẽ giúp tối ưu hóa hiệu suất và sử dụng bộ nhớ"
  },
  {
    "con": "Giả sử trong ngôn ngữ C sử dụng khai báo “double a[12]”, phần tử a[7] là phần tử thứ bao nhiêu trong mảng a:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một biến được khai báo nhưng không được khởi tạo giá trị, thì giá trị của biến đó sẽ là giá trị ngẫu nhiên:",
    "re": "Điều này có thể dẫn đến lỗi trong chương trình"
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp for mà không có điều kiện dừng, thì vòng lặp sẽ chạy vô hạn:",
    "re": "Chương trình sẽ bị treo hoặc không phản hồi"
  },
  {
    "con": "Nếu bạn gọi một hàm mà không truyền đủ tham số cần thiết, thì chương trình sẽ báo lỗi biên dịch:",
    "re": "Điều này cho thấy rằng việc truyền tham số là bắt buộc"
  },
  {
    "con": "Nếu bạn sử dụng toán tử chia cho 0 trong một phép toán, thì chương trình sẽ gặp lỗi:",
    "re": "Điều này dẫn đến lỗi runtime"
  },
  {
    "con": "Nếu bạn sử dụng mảng mà không kiểm tra kích thước của nó, thì bạn có thể truy cập vào vùng nhớ không hợp lệ:",
    "re": "Điều này có thể gây ra lỗi truy cập bộ nhớ"
  },
  {
    "con": "Nếu bạn không sử dụng dấu chấm phẩy ở cuối câu lệnh trong ngôn ngữ C, thì chương trình sẽ báo lỗi biên dịch:",
    "re": "Điều này cho thấy cú pháp là rất quan trọng"
  },
  {
    "con": "Nếu bạn sử dụng biến toàn cục trong một hàm, thì hàm đó có thể thay đổi giá trị của biến toàn cục đó:",
    "re": "Điều này có thể gây ra sự không nhất quán trong chương trình"
  },
  {
    "con": "Nếu bạn không kiểm tra điều kiện trước khi thực hiện phép toán trên biến, thì bạn có thể gặp lỗi logic:",
    "re": "Điều này có thể dẫn đến kết quả không mong muốn"
  },
  {
    "con": "Nếu bạn không sử dụng comment trong mã nguồn, thì mã sẽ khó hiểu hơn cho người khác đọc:",
    "re": "Điều này có thể làm giảm khả năng bảo trì mã"
  },
  {
    "con": "Phát biểu nào sau đây không phải là lợi ích của việc dùng hàm:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chương trình có cấu trúc rõ ràng và dễ hiểu:",
    "re": "Sẽ dễ bảo trì và mở rộng hơn"
  },
  {
    "con": "Khi sử dụng biến mà chưa được khởi tạo:",
    "re": "Sẽ gây ra lỗi khi chạy chương trình"
  },
  {
    "con": "Nếu bạn không sử dụng các chú thích trong mã nguồn:",
    "re": "Mã sẽ khó hiểu hơn cho người khác và cả chính bạn sau này"
  },
  {
    "con": "Khi bạn sử dụng vòng lặp mà không có điều kiện dừng:",
    "re": "Chương trình sẽ chạy mãi mãi và có thể gây treo máy"
  },
  {
    "con": "Nếu bạn không kiểm tra đầu vào của người dùng:",
    "re": "Chương trình có thể gặp lỗi hoặc hành vi không mong muốn"
  },
  {
    "con": "Khi bạn sử dụng cấu trúc điều kiện mà không có trường hợp mặc định:",
    "re": "Chương trình có thể không xử lý được tất cả các tình huống"
  },
  {
    "con": "Nếu bạn không tổ chức mã nguồn thành các hàm hoặc lớp:",
    "re": "Chương trình sẽ trở nên khó quản lý và khó đọc"
  },
  {
    "con": "Khi bạn sử dụng thư viện bên ngoài mà không tìm hiểu kỹ:",
    "re": "Có thể dẫn đến lỗi không mong muốn trong chương trình"
  },
  {
    "con": "Nếu bạn không thường xuyên kiểm tra và sửa lỗi trong mã:",
    "re": "Chương trình sẽ tích tụ nhiều lỗi và khó khăn trong việc khắc phục"
  },
  {
    "con": "Kết quả in ra màn hình của biểu thức sau là gì: -3+4%5/2",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng chưa được gán giá trị",
    "re": "Giá trị của biến đó là undefined"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng",
    "re": "Có thể truy cập từng phần tử của mảng một cách tuần tự"
  },
  {
    "con": "Khi sử dụng hàm không có giá trị trả về",
    "re": "Giá trị trả về sẽ là undefined"
  },
  {
    "con": "Khi sử dụng toán tử == để so sánh hai giá trị khác kiểu dữ liệu",
    "re": "JavaScript sẽ thực hiện chuyển đổi kiểu dữ liệu trước khi so sánh"
  },
  {
    "con": "Khi một hàm được gọi mà không có tham số",
    "re": "Các tham số trong hàm sẽ có giá trị là undefined"
  },
  {
    "con": "Khi sử dụng toán tử + với một chuỗi và một số",
    "re": "Số sẽ được chuyển đổi thành chuỗi và hai chuỗi sẽ được nối lại"
  },
  {
    "con": "Khi một mảng được khai báo nhưng không có phần tử nào",
    "re": "Độ dài của mảng đó sẽ là 0"
  },
  {
    "con": "Khi sử dụng câu lệnh điều kiện if mà điều kiện là false",
    "re": "Câu lệnh trong khối if sẽ không được thực thi"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa const",
    "re": "Biến đó không thể được gán lại giá trị mới"
  },
  {
    "con": "Có các khai báo sau: int x=15; int *p; Muốn p là con trỏ trỏ tới x phải thực hiện lệnh nào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng chưa được gán giá trị:",
    "re": "Giá trị của biến đó sẽ không xác định và có thể gây ra lỗi khi sử dụng"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng:",
    "re": "Cần chỉ định chỉ số bắt đầu, điều kiện dừng và bước nhảy"
  },
  {
    "con": "Khi sử dụng hàm, nếu không có từ khóa return:",
    "re": "Hàm sẽ không trả về giá trị nào"
  },
  {
    "con": "Khi sử dụng toán tử == để so sánh hai biến:",
    "re": "Kết quả sẽ là true nếu hai biến có giá trị bằng nhau và false nếu không"
  },
  {
    "con": "Khi khai báo một hàm, nếu không chỉ định kiểu trả về:",
    "re": "Hàm sẽ mặc định có kiểu trả về là void"
  },
  {
    "con": "Khi sử dụng mảng, nếu chỉ số vượt quá kích thước của mảng:",
    "re": "Sẽ xảy ra lỗi truy cập bộ nhớ hoặc kết quả không xác định"
  },
  {
    "con": "Khi sử dụng con trỏ, nếu con trỏ không được khởi tạo:",
    "re": "Sẽ dẫn đến lỗi truy cập bộ nhớ khi cố gắng sử dụng con trỏ đó"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if-else:",
    "re": "Chỉ một trong hai nhánh sẽ được thực thi dựa trên điều kiện"
  },
  {
    "con": "Khi sử dụng thư viện trong lập trình, nếu không bao gồm tệp tiêu đề tương ứng:",
    "re": "Sẽ không thể sử dụng các hàm hoặc biến được định nghĩa trong thư viện đó"
  },
  {
    "con": "Biến được khai báo nhưng không được gán giá trị:",
    "re": "Giá trị của biến đó sẽ là undefined hoặc null"
  },
  {
    "con": "Một hàm được định nghĩa nhưng không được gọi:",
    "re": "Hàm đó sẽ không thực thi và không có tác dụng"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng:",
    "re": "Có thể truy cập từng phần tử của mảng theo chỉ số"
  },
  {
    "con": "Khi sử dụng toán tử == để so sánh hai giá trị:",
    "re": "Giá trị sẽ được chuyển đổi kiểu nếu cần thiết"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa const:",
    "re": "Biến đó không thể được gán lại giá trị mới"
  },
  {
    "con": "Khi một hàm trả về giá trị:",
    "re": "Giá trị đó có thể được sử dụng trong các phép toán khác"
  },
  {
    "con": "Khi một mảng được khởi tạo với các phần tử:",
    "re": "Mảng đó có thể được truy cập bằng chỉ số từ 0 đến n-1"
  },
  {
    "con": "Khi một đối tượng được tạo ra trong JavaScript:",
    "re": "Có thể truy cập các thuộc tính của đối tượng đó bằng dấu chấm hoặc dấu ngoặc vuông"
  },
  {
    "con": "Khi một biến được khai báo bên trong một hàm:",
    "re": "Biến đó chỉ có thể được truy cập trong phạm vi của hàm đó"
  },
  {
    "con": "Khi sử dụng toán tử === để so sánh hai giá trị:",
    "re": "Giá trị và kiểu dữ liệu của chúng phải giống nhau"
  },
  {
    "con": "Kí hiệu nào là con trỏ của phần tử thứ 3 của màng a có 4 kí tự:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Phép cộng 1 con trỏ với một số nguyên sẽ là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến chưa được khởi tạo sẽ có giá trị:",
    "re": "Giá trị không xác định"
  },
  {
    "con": "Nếu một hàm không trả về giá trị, thì kiểu trả về của nó sẽ là:",
    "re": "void"
  },
  {
    "con": "Khi sử dụng vòng lặp for, nếu điều kiện dừng không bao giờ đạt được, thì:",
    "re": "Vòng lặp sẽ chạy vô hạn"
  },
  {
    "con": "Khi một mảng được khai báo, thì kích thước của nó:",
    "re": "Không thể thay đổi"
  },
  {
    "con": "Nếu một biến được khai báo là hằng số, thì:",
    "re": "Giá trị của nó không thể thay đổi trong suốt chương trình"
  },
  {
    "con": "Khi sử dụng câu lệnh điều kiện if, nếu điều kiện là sai, thì:",
    "re": "Câu lệnh trong khối if sẽ không được thực thi"
  },
  {
    "con": "Nếu một đối tượng được tạo từ lớp, thì nó sẽ có:",
    "re": "Các thuộc tính và phương thức của lớp đó"
  },
  {
    "con": "Khi gọi một hàm, nếu không truyền đủ tham số, thì:",
    "re": "Có thể xảy ra lỗi hoặc sử dụng giá trị mặc định"
  },
  {
    "con": "Nếu một biến toàn cục được khai báo, thì nó có thể được truy cập:",
    "re": "Từ bất kỳ hàm nào trong chương trình"
  },
  {
    "con": "Phép trừ 2 con trỏ có cùng kiểu sẽ là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được khởi tạo sẽ có giá trị:",
    "re": "Giá trị không xác định"
  },
  {
    "con": "Nếu một hàm không trả về giá trị, thì kiểu trả về của hàm đó phải là:",
    "re": "void"
  },
  {
    "con": "Khi sử dụng vòng lặp for, nếu điều kiện dừng không bao giờ đạt được, thì:",
    "re": "Vòng lặp sẽ chạy vô hạn"
  },
  {
    "con": "Nếu một mảng được khai báo với kích thước n, thì chỉ số hợp lệ của mảng sẽ là:",
    "re": "Từ 0 đến n-1"
  },
  {
    "con": "Khi một biến toàn cục và một biến cục bộ có cùng tên, thì:",
    "re": "Biến cục bộ sẽ được ưu tiên sử dụng"
  },
  {
    "con": "Nếu một chương trình không có lệnh return trong hàm main, thì:",
    "re": "Chương trình vẫn có thể chạy nhưng có thể không trả về giá trị đúng"
  },
  {
    "con": "Khi sử dụng toán tử == để so sánh hai chuỗi, thì:",
    "re": "Kết quả sẽ là false nếu hai chuỗi khác nhau"
  },
  {
    "con": "Nếu một biến kiểu số nguyên được chia cho 0, thì:",
    "re": "Chương trình sẽ gây ra lỗi"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if-else, nếu điều kiện if là true, thì:",
    "re": "Khối lệnh else sẽ không được thực thi"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo giá trị:",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Sử dụng vòng lặp để lặp qua một mảng:",
    "re": "Có thể truy cập từng phần tử của mảng một cách tuần tự"
  },
  {
    "con": "Hàm được định nghĩa nhưng không được gọi:",
    "re": "Hàm đó sẽ không được thực thi"
  },
  {
    "con": "Sử dụng toán tử so sánh để kiểm tra hai giá trị:",
    "re": "Kết quả sẽ là true hoặc false"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện if-else:",
    "re": "Chương trình sẽ thực hiện một trong hai nhánh dựa trên điều kiện"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa const:",
    "re": "Giá trị của biến đó không thể thay đổi sau khi được khởi tạo"
  },
  {
    "con": "Sử dụng hàm để tổ chức mã nguồn:",
    "re": "Giúp mã nguồn trở nên dễ đọc và bảo trì hơn"
  },
  {
    "con": "Khi một mảng được khởi tạo với kích thước cố định:",
    "re": "Kích thước của mảng không thể thay đổi trong suốt quá trình thực thi"
  },
  {
    "con": "Sử dụng con trỏ để truy cập vào địa chỉ của biến:",
    "re": "Có thể thao tác trực tiếp với bộ nhớ"
  },
  {
    "con": "Phép toán 1 ngôi nào dùng để xác định địa chỉ của đối tượng mà con trỏ chỉ tới:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sự hiệu chỉnh các kiểu dữ liệu số học khi tính toán là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo và khởi tạo trước khi sử dụng là:",
    "re": "Chương trình sẽ chạy mà không gặp lỗi"
  },
  {
    "con": "Sử dụng vòng lặp để lặp lại một đoạn mã là:",
    "re": "Giúp tiết kiệm thời gian và công sức lập trình"
  },
  {
    "con": "Cú pháp của ngôn ngữ lập trình phải được tuân thủ là:",
    "re": "Chương trình sẽ biên dịch thành công"
  },
  {
    "con": "Sử dụng hàm để tổ chức mã nguồn là:",
    "re": "Giúp mã nguồn dễ đọc và bảo trì hơn"
  },
  {
    "con": "Kiểu dữ liệu không tương thích khi thực hiện phép toán là:",
    "re": "Sẽ gây ra lỗi trong chương trình"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện để kiểm tra các điều kiện là:",
    "re": "Cho phép chương trình thực hiện các nhánh khác nhau"
  },
  {
    "con": "Sử dụng comment để giải thích mã nguồn là:",
    "re": "Giúp người khác (và cả bản thân) hiểu mã dễ hơn"
  },
  {
    "con": "Quản lý bộ nhớ trong lập trình là:",
    "re": "Giúp tránh rò rỉ bộ nhớ và cải thiện hiệu suất"
  },
  {
    "con": "Sử dụng thư viện và framework có sẵn là:",
    "re": "Giúp tăng tốc độ phát triển và giảm thiểu lỗi"
  },
  {
    "con": "Khi khai báo mảng, ta khởi tạo luôn giá trị của mảng như sau: int x[3]={4,2,6}; Nghĩa là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi sử dụng vòng lặp for, nếu điều kiện dừng là i < n thì vòng lặp sẽ chạy từ 0 đến n-1.",
    "re": "Vòng lặp sẽ thực hiện n lần"
  },
  {
    "con": "Khi sử dụng hàm, nếu hàm có kiểu trả về là void thì hàm không trả về giá trị nào.",
    "re": "Hàm chỉ thực hiện các thao tác mà không trả về kết quả"
  },
  {
    "con": "Khi sử dụng toán tử so sánh, nếu a == b thì điều kiện sẽ trả về true khi a và b có giá trị bằng nhau.",
    "re": "Điều kiện sẽ được đánh giá là đúng"
  },
  {
    "con": "Khi khai báo biến, nếu biến không được khởi tạo giá trị, giá trị của biến đó sẽ là không xác định.",
    "re": "Biến có thể chứa giá trị ngẫu nhiên"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if, nếu điều kiện là false thì khối lệnh trong if sẽ không được thực thi.",
    "re": "Chương trình sẽ chuyển sang khối lệnh khác nếu có"
  },
  {
    "con": "Khi sử dụng mảng, nếu truy cập vào chỉ số ngoài phạm vi của mảng sẽ dẫn đến lỗi runtime.",
    "re": "Chương trình có thể bị dừng lại hoặc gây ra hành vi không mong muốn"
  },
  {
    "con": "Khi sử dụng hàm đệ quy, nếu không có điều kiện dừng, hàm sẽ gọi chính nó mãi mãi.",
    "re": "Điều này sẽ dẫn đến lỗi tràn ngăn xếp"
  },
  {
    "con": "Khi sử dụng kiểu dữ liệu chuỗi, nếu không có ký tự kết thúc, chuỗi sẽ không được xác định đúng.",
    "re": "Điều này có thể gây ra lỗi khi xử lý chuỗi"
  },
  {
    "con": "Khi sử dụng toán tử gán, nếu a = b thì giá trị của a sẽ được cập nhật thành giá trị của b.",
    "re": "Giá trị của a và b sẽ trở thành giống nhau"
  },
  {
    "con": "Khi biến con trỏ không chứa bất kì một địa chỉ nào thì giá trị của nó sẽ là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một biến được khai báo nhưng chưa được khởi tạo thì giá trị của nó sẽ là:",
    "re": "Giá trị không xác định"
  },
  {
    "con": "Khi sử dụng vòng lặp for để lặp qua một mảng thì điều kiện dừng của vòng lặp phải:",
    "re": "Đảm bảo không vượt quá chỉ số của mảng"
  },
  {
    "con": "Khi một hàm được gọi mà không có tham số thì:",
    "re": "Hàm sẽ sử dụng giá trị mặc định nếu có"
  },
  {
    "con": "Khi một biến được khai báo là hằng số (const) thì:",
    "re": "Giá trị của biến đó không thể thay đổi trong suốt chương trình"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp thì:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if-else thì:",
    "re": "Chỉ một trong hai nhánh sẽ được thực thi"
  },
  {
    "con": "Khi một mảng được khởi tạo với kích thước cố định thì:",
    "re": "Kích thước của mảng không thể thay đổi trong suốt thời gian chạy"
  },
  {
    "con": "Khi một biến được khai báo trong một hàm thì:",
    "re": "Biến đó chỉ có thể được truy cập trong phạm vi của hàm đó"
  },
  {
    "con": "Khi sử dụng toán tử == để so sánh hai giá trị thì:",
    "re": "Chỉ kiểm tra giá trị mà không kiểm tra kiểu dữ liệu"
  },
  {
    "con": "Các kí hiệu đặc trưng cho sự tác động lên dữ liệu gọi là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo mà không được gán giá trị thì:",
    "re": "Biến đó sẽ có giá trị mặc định tùy thuộc vào kiểu dữ liệu"
  },
  {
    "con": "Cú pháp của một lệnh điều kiện đúng thì:",
    "re": "Chương trình sẽ thực hiện các lệnh bên trong khối điều kiện"
  },
  {
    "con": "Một hàm được định nghĩa nhưng không được gọi thì:",
    "re": "Hàm đó sẽ không được thực thi trong chương trình"
  },
  {
    "con": "Khi sử dụng vòng lặp, nếu điều kiện dừng không bao giờ đạt được thì:",
    "re": "Chương trình sẽ rơi vào trạng thái lặp vô hạn"
  },
  {
    "con": "Khi một lỗi cú pháp xảy ra trong mã nguồn thì:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Khi sử dụng mảng, nếu chỉ số truy cập vượt quá kích thước mảng thì:",
    "re": "Chương trình sẽ gây ra lỗi truy cập ngoài giới hạn"
  },
  {
    "con": "Khi một biến toàn cục được khai báo trong một hàm thì:",
    "re": "Biến đó có thể được truy cập từ bất kỳ đâu trong chương trình"
  },
  {
    "con": "Nếu một ngôn ngữ lập trình hỗ trợ lập trình hướng đối tượng thì:",
    "re": "Người lập trình có thể tạo ra các lớp và đối tượng"
  },
  {
    "con": "Khi một chương trình được biên dịch thành công thì:",
    "re": "Chương trình có thể chạy mà không gặp lỗi biên dịch"
  },
  {
    "con": "Các biến được khai báo và khởi tạo trước khi sử dụng.",
    "re": "Chương trình sẽ không chạy hoặc gây ra lỗi."
  },
  {
    "con": "Cú pháp của ngôn ngữ lập trình được tuân thủ.",
    "re": "Chương trình sẽ biên dịch hoặc chạy thành công."
  },
  {
    "con": "Sử dụng cấu trúc điều kiện để kiểm tra các điều kiện khác nhau.",
    "re": "Chương trình sẽ thực hiện các nhánh khác nhau dựa trên điều kiện."
  },
  {
    "con": "Các hàm được định nghĩa và gọi đúng cách.",
    "re": "Chương trình sẽ thực hiện các tác vụ theo cách mong muốn."
  },
  {
    "con": "Sử dụng vòng lặp để lặp lại các tác vụ.",
    "re": "Chương trình sẽ tiết kiệm thời gian và mã nguồn."
  },
  {
    "con": "Các kiểu dữ liệu được sử dụng đúng với mục đích.",
    "re": "Chương trình sẽ hoạt động chính xác và hiệu quả."
  },
  {
    "con": "Các lỗi cú pháp được sửa chữa trước khi chạy chương trình.",
    "re": "Chương trình sẽ không gặp lỗi khi biên dịch."
  },
  {
    "con": "Sử dụng các thư viện và API phù hợp.",
    "re": "Chương trình sẽ mở rộng chức năng và tiết kiệm thời gian phát triển."
  },
  {
    "con": "Các biến được đặt tên rõ ràng và có ý nghĩa.",
    "re": "Mã nguồn sẽ dễ đọc và bảo trì hơn."
  },
  {
    "con": "Thực hiện kiểm thử cho các phần của chương trình.",
    "re": "Chương trình sẽ giảm thiểu lỗi và cải thiện chất lượng."
  },
  {
    "con": "Cái gì quyết định kích thước của vùng nhớ được cấp phát cho các biến:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chương trình được viết bằng ngôn ngữ lập trình nào:",
    "re": "Chương trình đó sẽ được biên dịch hoặc thông dịch để máy tính hiểu"
  },
  {
    "con": "Các biến được khai báo mà không được khởi tạo giá trị:",
    "re": "Chúng có thể chứa giá trị không xác định"
  },
  {
    "con": "Một hàm được định nghĩa nhưng không được gọi:",
    "re": "Hàm đó sẽ không được thực thi trong chương trình"
  },
  {
    "con": "Cú pháp của ngôn ngữ lập trình không được tuân thủ:",
    "re": "Chương trình sẽ gặp lỗi biên dịch hoặc lỗi thực thi"
  },
  {
    "con": "Một vòng lặp không có điều kiện dừng:",
    "re": "Vòng lặp đó sẽ chạy vô hạn và có thể làm treo chương trình"
  },
  {
    "con": "Một mảng được truy cập bằng chỉ số ngoài phạm vi:",
    "re": "Chương trình có thể gặp lỗi hoặc trả về giá trị không xác định"
  },
  {
    "con": "Một biến được khai báo với từ khóa 'const':",
    "re": "Biến đó không thể được gán giá trị mới sau khi đã được khởi tạo"
  },
  {
    "con": "Một chương trình có nhiều hàm với cùng tên nhưng khác tham số:",
    "re": "Đây là hiện tượng quá tải hàm (function overloading) và được phép trong nhiều ngôn ngữ lập trình"
  },
  {
    "con": "Một chương trình không có bất kỳ lệnh nào:",
    "re": "Chương trình đó sẽ không thực hiện bất kỳ hành động nào và có thể kết thúc ngay lập tức"
  },
  {
    "con": "Lệnh nào trong các lệnh sau cho phép nhảy ra khỏi vòng lặp đến vị trí bất kì mong muốn:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được gán giá trị:",
    "re": "Sẽ gây ra lỗi khi sử dụng"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng:",
    "re": "Sẽ giúp truy cập từng phần tử trong mảng một cách dễ dàng"
  },
  {
    "con": "Khi sử dụng hàm mà không truyền đủ tham số:",
    "re": "Sẽ gây ra lỗi hoặc sử dụng giá trị mặc định nếu có"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa const:",
    "re": "Giá trị của biến đó không thể thay đổi sau khi được gán"
  },
  {
    "con": "Khi sử dụng toán tử == để so sánh hai giá trị:",
    "re": "Sẽ thực hiện so sánh giá trị mà không quan tâm đến kiểu dữ liệu"
  },
  {
    "con": "Khi một hàm không có từ khóa return:",
    "re": "Sẽ trả về giá trị undefined trong JavaScript"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if-else:",
    "re": "Sẽ cho phép thực hiện các đoạn mã khác nhau dựa trên điều kiện"
  },
  {
    "con": "Khi một mảng được khai báo mà không có phần tử nào:",
    "re": "Sẽ có độ dài bằng 0"
  },
  {
    "con": "Khi sử dụng vòng lặp while mà điều kiện luôn đúng:",
    "re": "Sẽ tạo ra vòng lặp vô hạn"
  },
  {
    "con": "Trong các hàm sau, hàm nào không định dạng để in một kí tự ra màn hình:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một biến được khai báo nhưng không được gán giá trị:",
    "re": "Giá trị của biến đó sẽ là undefined trong JavaScript"
  },
  {
    "con": "Nếu một vòng lặp không có điều kiện dừng:",
    "re": "Vòng lặp đó sẽ chạy vô hạn"
  },
  {
    "con": "Khi sử dụng toán tử == trong so sánh:",
    "re": "Hai giá trị có thể được chuyển đổi kiểu dữ liệu để so sánh"
  },
  {
    "con": "Nếu một hàm không trả về giá trị:",
    "re": "Giá trị trả về của hàm đó sẽ là undefined"
  },
  {
    "con": "Khi một mảng được khởi tạo mà không có phần tử nào:",
    "re": "Mảng đó sẽ có độ dài bằng 0"
  },
  {
    "con": "Nếu một biến được khai báo với từ khóa const:",
    "re": "Biến đó sẽ không thể được gán lại giá trị mới"
  },
  {
    "con": "Khi một đối tượng được tạo ra trong JavaScript:",
    "re": "Nó có thể chứa các thuộc tính và phương thức"
  },
  {
    "con": "Nếu một chuỗi được nối với một số:",
    "re": "Kết quả sẽ là một chuỗi, không phải là số"
  },
  {
    "con": "Khi sử dụng từ khóa return trong một hàm:",
    "re": "Hàm sẽ kết thúc và trả về giá trị cho nơi gọi hàm"
  },
  {
    "con": "Lệnh fflush(stdin) dùng để làm gì:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo:",
    "re": "Có thể chứa giá trị ngẫu nhiên"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng:",
    "re": "Giúp truy cập từng phần tử của mảng một cách dễ dàng"
  },
  {
    "con": "Hàm main trong chương trình C/C++:",
    "re": "Là điểm bắt đầu thực thi chương trình"
  },
  {
    "con": "Cú pháp của một câu lệnh điều kiện if:",
    "re": "Cho phép thực hiện các lệnh khác nhau dựa trên điều kiện"
  },
  {
    "con": "Sử dụng toán tử == trong điều kiện:",
    "re": "So sánh hai giá trị để kiểm tra sự bằng nhau"
  },
  {
    "con": "Khi một hàm không trả về giá trị:",
    "re": "Nó được khai báo với kiểu trả về là void"
  },
  {
    "con": "Sử dụng mảng để lưu trữ dữ liệu:",
    "re": "Giúp tổ chức và quản lý dữ liệu theo cách có cấu trúc"
  },
  {
    "con": "Khi sử dụng vòng lặp while:",
    "re": "Chương trình sẽ tiếp tục lặp cho đến khi điều kiện không còn đúng"
  },
  {
    "con": "Khi một biến được khai báo là hằng số (const):",
    "re": "Giá trị của biến đó không thể thay đổi trong suốt chương trình"
  },
  {
    "con": "Hằng có thể được định nghĩa theo cách nào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo mà không được gán giá trị:",
    "re": "Biến đó sẽ có giá trị mặc định là null hoặc undefined"
  },
  {
    "con": "Cú pháp của một vòng lặp for là đúng:",
    "re": "Vòng lặp sẽ lặp lại một số lần nhất định dựa trên điều kiện đã cho"
  },
  {
    "con": "Một hàm được định nghĩa mà không có từ khóa return:",
    "re": "Hàm đó sẽ trả về giá trị undefined"
  },
  {
    "con": "Khi sử dụng toán tử so sánh ==:",
    "re": "Hai giá trị sẽ được so sánh sau khi thực hiện chuyển đổi kiểu nếu cần thiết"
  },
  {
    "con": "Một mảng được khởi tạo với các giá trị:",
    "re": "Mảng đó sẽ chứa các phần tử theo thứ tự đã được chỉ định"
  },
  {
    "con": "Khi một lỗi xảy ra trong chương trình:",
    "re": "Chương trình sẽ dừng lại và thông báo lỗi nếu không được xử lý"
  },
  {
    "con": "Một đối tượng trong lập trình hướng đối tượng được tạo ra:",
    "re": "Đối tượng đó sẽ có các thuộc tính và phương thức riêng"
  },
  {
    "con": "Khi sử dụng từ khóa let để khai báo biến:",
    "re": "Biến đó sẽ có phạm vi khối (block scope)"
  },
  {
    "con": "Khi một hàm được gọi mà không có tham số:",
    "re": "Hàm đó vẫn có thể thực thi mà không gặp lỗi"
  },
  {
    "con": "Hàm gotoxy(int x, int y) là hàm:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo với từ khóa 'int':",
    "re": "Chứa giá trị số nguyên"
  },
  {
    "con": "Câu lệnh điều kiện 'if' có điều kiện đúng:",
    "re": "Câu lệnh trong khối 'if' sẽ được thực thi"
  },
  {
    "con": "Vòng lặp 'for' được sử dụng đúng cách:",
    "re": "Cho phép lặp qua một dãy số hoặc mảng"
  },
  {
    "con": "Hàm có kiểu trả về 'void':",
    "re": "Không trả về giá trị nào"
  },
  {
    "con": "Mảng được khai báo với kích thước cố định:",
    "re": "Không thể thay đổi kích thước sau khi khai báo"
  },
  {
    "con": "Thư viện chuẩn được sử dụng trong chương trình:",
    "re": "Cung cấp các hàm và công cụ hữu ích"
  },
  {
    "con": "Câu lệnh 'switch' được sử dụng:",
    "re": "Để kiểm tra nhiều giá trị khác nhau của một biến"
  },
  {
    "con": "Hàm đệ quy gọi chính nó:",
    "re": "Cần có điều kiện dừng để tránh vòng lặp vô hạn"
  },
  {
    "con": "Kiểu dữ liệu 'float' được sử dụng:",
    "re": "Để lưu trữ giá trị số thực"
  },
  {
    "con": "Phép toán % có ý nghĩa gì:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo mà không gán giá trị:",
    "re": "Có thể chứa giá trị null hoặc không xác định"
  },
  {
    "con": "Cú pháp của một hàm trong ngôn ngữ lập trình:",
    "re": "Phải bao gồm tên hàm, danh sách tham số và thân hàm"
  },
  {
    "con": "Cấu trúc điều kiện if-else được sử dụng để:",
    "re": "Thực hiện các đoạn mã khác nhau dựa trên điều kiện đúng hoặc sai"
  },
  {
    "con": "Vòng lặp for thường được sử dụng để:",
    "re": "Lặp qua một dãy số hoặc một tập hợp các phần tử"
  },
  {
    "con": "Mảng là gì trong lập trình:",
    "re": "Là một cấu trúc dữ liệu lưu trữ nhiều giá trị cùng loại"
  },
  {
    "con": "Kiểu dữ liệu boolean có hai giá trị:",
    "re": "true và false"
  },
  {
    "con": "Thư viện trong lập trình được sử dụng để:",
    "re": "Cung cấp các hàm và phương thức đã được định nghĩa sẵn"
  },
  {
    "con": "Nguyên tắc DRY (Don't Repeat Yourself) trong lập trình:",
    "re": "Khuyến khích việc tái sử dụng mã thay vì lặp lại"
  },
  {
    "con": "Comment trong mã nguồn được sử dụng để:",
    "re": "Giải thích hoặc ghi chú cho các đoạn mã mà không ảnh hưởng đến thực thi"
  },
  {
    "con": "Hàm clrscr() là hàm gì:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được sử dụng:",
    "re": "Sẽ gây ra cảnh báo trong quá trình biên dịch"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng:",
    "re": "Giúp truy cập từng phần tử của mảng một cách dễ dàng"
  },
  {
    "con": "Hàm có thể trả về giá trị:",
    "re": "Cho phép sử dụng kết quả của hàm trong các phép toán khác"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện if-else:",
    "re": "Cho phép thực hiện các hành động khác nhau dựa trên điều kiện"
  },
  {
    "con": "Khi một biến được khai báo là hằng số:",
    "re": "Giá trị của biến đó không thể thay đổi trong suốt chương trình"
  },
  {
    "con": "Sử dụng comment trong mã nguồn:",
    "re": "Giúp giải thích mã và làm cho nó dễ hiểu hơn cho người khác"
  },
  {
    "con": "Khi một hàm không có tham số:",
    "re": "Hàm đó có thể được gọi mà không cần truyền bất kỳ giá trị nào"
  },
  {
    "con": "Sử dụng mảng để lưu trữ dữ liệu:",
    "re": "Giúp tổ chức và quản lý dữ liệu một cách hiệu quả"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo:",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Sử dụng vòng lặp for với điều kiện dừng sai:",
    "re": "Vòng lặp sẽ chạy vô hạn"
  },
  {
    "con": "Hàm main() không trả về giá trị:",
    "re": "Chương trình sẽ báo lỗi biên dịch trong C/C++"
  },
  {
    "con": "Sử dụng toán tử == để so sánh hai chuỗi:",
    "re": "Kết quả có thể không chính xác trong nhiều ngôn ngữ lập trình"
  },
  {
    "con": "Khi gọi hàm mà không truyền đủ tham số:",
    "re": "Chương trình sẽ báo lỗi biên dịch hoặc chạy"
  },
  {
    "con": "Sử dụng mảng mà không kiểm tra chỉ số:",
    "re": "Có thể gây ra lỗi tràn bộ nhớ"
  },
  {
    "con": "Sử dụng biến toàn cục trong hàm:",
    "re": "Có thể làm giảm tính khả thi của mã nguồn"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if mà không có khối else:",
    "re": "Chương trình vẫn sẽ chạy bình thường nhưng có thể bỏ qua một số trường hợp"
  },
  {
    "con": "Khi sử dụng thư viện mà không bao gồm tệp tiêu đề tương ứng:",
    "re": "Chương trình sẽ báo lỗi biên dịch"
  },
  {
    "con": "Khi không giải phóng bộ nhớ đã cấp phát động:",
    "re": "Có thể dẫn đến rò rỉ bộ nhớ"
  },
  {
    "con": "Toán tử “++n” được hiểu:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo:",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Cú pháp của một hàm trong ngôn ngữ lập trình:",
    "re": "Hàm phải có tên và có thể nhận tham số"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng:",
    "re": "Có thể truy cập từng phần tử của mảng một cách tuần tự"
  },
  {
    "con": "Câu lệnh điều kiện if-else được sử dụng:",
    "re": "Để thực hiện các hành động khác nhau dựa trên điều kiện"
  },
  {
    "con": "Khi một hàm trả về giá trị:",
    "re": "Giá trị đó có thể được sử dụng trong các phép toán khác"
  },
  {
    "con": "Khi sử dụng toán tử ==:",
    "re": "So sánh giá trị của hai biến mà không so sánh kiểu dữ liệu"
  },
  {
    "con": "Khi một biến được khai báo là hằng số:",
    "re": "Giá trị của biến đó không thể thay đổi trong suốt chương trình"
  },
  {
    "con": "Khi sử dụng mảng trong lập trình:",
    "re": "Có thể lưu trữ nhiều giá trị cùng loại trong một biến"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Toán tử “n--“ được hiểu:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo và khởi tạo:",
    "re": "Có thể sử dụng trong chương trình"
  },
  {
    "con": "Cú pháp của một hàm được định nghĩa đúng:",
    "re": "Hàm có thể được gọi và thực thi"
  },
  {
    "con": "Cấu trúc điều kiện if-else được sử dụng:",
    "re": "Chương trình có thể thực hiện các nhánh khác nhau"
  },
  {
    "con": "Vòng lặp for được sử dụng đúng cách:",
    "re": "Chương trình có thể lặp qua một tập hợp các giá trị"
  },
  {
    "con": "Mảng được khai báo và khởi tạo:",
    "re": "Có thể lưu trữ nhiều giá trị cùng loại"
  },
  {
    "con": "Thư viện được nhập khẩu đúng cách:",
    "re": "Có thể sử dụng các chức năng từ thư viện đó"
  },
  {
    "con": "Cú pháp của một câu lệnh in ra màn hình đúng:",
    "re": "Chương trình có thể hiển thị thông tin cho người dùng"
  },
  {
    "con": "Kiểu dữ liệu được sử dụng đúng cách:",
    "re": "Chương trình có thể xử lý dữ liệu một cách chính xác"
  },
  {
    "con": "Các lỗi cú pháp được sửa chữa:",
    "re": "Chương trình có thể biên dịch và chạy mà không gặp lỗi"
  },
  {
    "con": "Kết quả hiển thị ra màn hình của chương trình sau là gì:\n #include <stdio.h>\n void main()\n {int a,b;\n a=100;\n b=56;\n printf(“%d”,(a<b) ? a:b);}",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một biến được khai báo nhưng chưa được khởi tạo, giá trị của biến đó sẽ là gì?",
    "re": "Giá trị không xác định"
  },
  {
    "con": "Nếu một vòng lặp while không có điều kiện dừng, thì chương trình sẽ xảy ra điều gì?",
    "re": "Chương trình sẽ bị treo (lặp vô hạn)"
  },
  {
    "con": "Nếu bạn sử dụng toán tử ++ trước một biến, thì giá trị của biến đó sẽ được thay đổi như thế nào?",
    "re": "Giá trị của biến sẽ tăng lên 1 trước khi được sử dụng"
  },
  {
    "con": "Nếu bạn không sử dụng từ khóa return trong hàm main, thì chương trình sẽ có kết quả ra sao?",
    "re": "Chương trình có thể không trả về giá trị đúng cho hệ điều hành"
  },
  {
    "con": "Nếu bạn cố gắng truy cập vào một phần tử không tồn tại trong mảng, thì điều gì sẽ xảy ra?",
    "re": "Chương trình có thể gây ra lỗi truy cập bộ nhớ"
  },
  {
    "con": "Nếu bạn sử dụng toán tử == để so sánh hai chuỗi, thì kết quả sẽ như thế nào?",
    "re": "Kết quả sẽ không chính xác vì toán tử == không so sánh nội dung chuỗi"
  },
  {
    "con": "Nếu bạn không khai báo kiểu dữ liệu cho một biến trong ngôn ngữ lập trình tĩnh, thì điều gì sẽ xảy ra?",
    "re": "Chương trình sẽ gây ra lỗi biên dịch"
  },
  {
    "con": "Nếu bạn sử dụng hàm printf mà không cung cấp đủ tham số, thì điều gì sẽ xảy ra?",
    "re": "Chương trình có thể in ra giá trị không xác định hoặc gây ra lỗi"
  },
  {
    "con": "Nếu bạn sử dụng từ khóa break trong một vòng lặp, thì vòng lặp sẽ dừng lại như thế nào?",
    "re": "Vòng lặp sẽ dừng lại ngay lập tức và tiếp tục với câu lệnh tiếp theo sau vòng lặp"
  },
  {
    "con": "Kết quả của chương trình sau:\n#include \"stdio.h\"\nvoid main()\n{int i;\ni=10;\nprintf(\"%o\",i);}",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Sử dụng vòng lặp for với điều kiện dừng đúng",
    "re": "Chương trình sẽ lặp lại đúng số lần mong muốn"
  },
  {
    "con": "Sử dụng hàm printf với định dạng không đúng",
    "re": "Chương trình có thể gây ra lỗi biên dịch hoặc in ra kết quả không mong muốn"
  },
  {
    "con": "Khi sử dụng mảng mà không kiểm tra chỉ số",
    "re": "Có thể gây ra lỗi tràn bộ nhớ (memory overflow)"
  },
  {
    "con": "Khi gọi hàm mà không truyền đủ tham số",
    "re": "Chương trình có thể gây ra lỗi biên dịch hoặc hành vi không xác định"
  },
  {
    "con": "Sử dụng toán tử so sánh trong điều kiện if",
    "re": "Chương trình sẽ thực hiện khối lệnh tương ứng với điều kiện đúng"
  },
  {
    "con": "Khi sử dụng kiểu dữ liệu không tương thích trong phép toán",
    "re": "Chương trình có thể gây ra lỗi biên dịch hoặc lỗi thực thi"
  },
  {
    "con": "Khi sử dụng biến toàn cục trong hàm mà không khai báo",
    "re": "Chương trình sẽ sử dụng giá trị của biến toàn cục đó"
  },
  {
    "con": "Khi không sử dụng dấu chấm phẩy ở cuối câu lệnh",
    "re": "Chương trình sẽ gây ra lỗi biên dịch"
  },
  {
    "con": "Kết quả in ra màn hình của chương trình sau:\n #include <stdio.h>\n void main()\n {int ch=’A’;\n printf(“%d”,ch);}",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo với từ khóa 'int' thì nó chỉ có thể chứa giá trị số nguyên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hàm không trả về giá trị thì nó phải được khai báo với kiểu trả về là 'void'.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp 'for' mà không có điều kiện dừng thì chương trình sẽ chạy vô hạn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn không khởi tạo biến trước khi sử dụng, thì giá trị của biến đó sẽ không xác định.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn sử dụng toán tử '==' để so sánh hai giá trị, thì nó sẽ trả về true nếu hai giá trị đó bằng nhau.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn muốn nhập dữ liệu từ bàn phím, bạn cần sử dụng hàm 'scanf'.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn khai báo một mảng với kích thước n, thì bạn chỉ có thể truy cập các chỉ số từ 0 đến n-1.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn sử dụng từ khóa 'return' trong một hàm, thì hàm đó sẽ kết thúc và trả về giá trị cho nơi gọi hàm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn không sử dụng dấu chấm phẩy ở cuối câu lệnh trong C, thì chương trình sẽ báo lỗi biên dịch.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Kết quả của chương trình sau:\n #include <stdio.h>\n void main()\n {int i=98;\n printf(“%c”,i);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Sử dụng vòng lặp for với điều kiện dừng đúng",
    "re": "Vòng lặp sẽ thực hiện đúng số lần mong muốn"
  },
  {
    "con": "Gọi hàm mà không truyền đủ tham số",
    "re": "Chương trình sẽ báo lỗi biên dịch"
  },
  {
    "con": "Sử dụng toán tử == để so sánh hai giá trị",
    "re": "Kết quả sẽ là true nếu hai giá trị bằng nhau"
  },
  {
    "con": "Khi sử dụng mảng mà chỉ định chỉ số ngoài phạm vi",
    "re": "Chương trình có thể gây ra lỗi truy cập bộ nhớ"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if mà không có khối else",
    "re": "Chương trình sẽ chỉ thực hiện khối lệnh if nếu điều kiện đúng"
  },
  {
    "con": "Khi khai báo một hàm mà không có kiểu trả về",
    "re": "Chương trình sẽ báo lỗi biên dịch nếu không có kiểu trả về mặc định"
  },
  {
    "con": "Sử dụng từ khóa return trong một hàm",
    "re": "Hàm sẽ kết thúc và trả về giá trị cho nơi gọi hàm"
  },
  {
    "con": "Khi sử dụng thư viện không được bao gồm trong chương trình",
    "re": "Chương trình sẽ báo lỗi biên dịch do thiếu thư viện"
  },
  {
    "con": "Kết quả in ra màn hình của chương trình sau:\n #include <stdio.h>\n void main()\n {int i=5, j=6;\n i= i- --j;\n printf(“%d”,i);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng chưa được gán giá trị",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Sử dụng vòng lặp for với điều kiện dừng đúng",
    "re": "Chương trình sẽ thực hiện đúng số lần lặp mong muốn"
  },
  {
    "con": "Khi gọi hàm mà không truyền đủ tham số",
    "re": "Chương trình sẽ báo lỗi biên dịch"
  },
  {
    "con": "Sử dụng toán tử == để so sánh hai biến",
    "re": "Kết quả sẽ là true nếu hai biến có giá trị bằng nhau"
  },
  {
    "con": "Khi sử dụng mảng mà chỉ số vượt quá kích thước của mảng",
    "re": "Chương trình có thể gây ra lỗi truy cập bộ nhớ"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if mà điều kiện là false",
    "re": "Các câu lệnh trong khối if sẽ không được thực thi"
  },
  {
    "con": "Khi sử dụng hàm trả về giá trị mà không có từ khóa return",
    "re": "Chương trình có thể không hoạt động như mong đợi"
  },
  {
    "con": "Khi sử dụng biến toàn cục trong một hàm",
    "re": "Hàm có thể truy cập và thay đổi giá trị của biến toàn cục đó"
  },
  {
    "con": "Khi sử dụng kiểu dữ liệu không tương thích trong phép toán",
    "re": "Chương trình sẽ báo lỗi biên dịch hoặc thực thi không chính xác"
  },
  {
    "con": "Kết quả in ra màn hình của chương trình sau là gì:\n #include <stdio.h>\n void main()\n {int i;\n for (i=2; i<=4; i+=2)\n printf(“%3d”,i);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu biến số nguyên được khai báo nhưng không được khởi tạo, thì giá trị của biến đó sẽ là giá trị ngẫu nhiên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hàm không trả về giá trị, thì kiểu trả về của hàm đó phải được khai báo là 'void'.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp 'for' mà không có điều kiện dừng, thì chương trình sẽ chạy mãi mãi.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn muốn nhập dữ liệu từ bàn phím trong C, thì bạn cần sử dụng hàm 'scanf'.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn sử dụng toán tử '==' để so sánh hai giá trị, thì bạn đang kiểm tra xem chúng có bằng nhau hay không.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn khai báo một mảng, thì kích thước của mảng phải được xác định tại thời điểm khai báo.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn muốn sử dụng một thư viện trong C, thì bạn cần phải bao gồm nó bằng cách sử dụng chỉ thị '#include'.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn không xử lý ngoại lệ trong chương trình, thì chương trình có thể bị dừng đột ngột khi gặp lỗi.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn muốn sử dụng biến toàn cục trong một hàm, thì bạn cần khai báo biến đó bên ngoài tất cả các hàm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Kết quả in ra màn hình của chương trình sau là gì:\n #include <stdio.h>\n void main()\n {int i;\n for (i=2; ; i++)\n printf(“%3d”,i);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo trước khi sử dụng.",
    "re": "Có thể gây ra lỗi hoặc kết quả không xác định"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng.",
    "re": "Giúp truy cập từng phần tử của mảng một cách dễ dàng"
  },
  {
    "con": "Khi sử dụng hàm printf trong C, nếu không có định dạng đúng cho kiểu dữ liệu.",
    "re": "Có thể dẫn đến lỗi biên dịch hoặc kết quả không chính xác"
  },
  {
    "con": "Khi một hàm không trả về giá trị nhưng được khai báo có kiểu trả về khác void.",
    "re": "Có thể gây ra hành vi không xác định trong chương trình"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện if-else để kiểm tra một điều kiện.",
    "re": "Cho phép thực hiện các hành động khác nhau dựa trên kết quả của điều kiện"
  },
  {
    "con": "Khi một biến toàn cục được khai báo và sử dụng trong một hàm.",
    "re": "Có thể truy cập và thay đổi giá trị của biến đó từ bất kỳ hàm nào"
  },
  {
    "con": "Khi sử dụng mảng, nếu chỉ định chỉ số lớn hơn kích thước của mảng.",
    "re": "Có thể dẫn đến lỗi truy cập bộ nhớ hoặc hành vi không xác định"
  },
  {
    "con": "Khi sử dụng toán tử == để so sánh hai giá trị.",
    "re": "Kiểm tra xem hai giá trị có bằng nhau hay không"
  },
  {
    "con": "Khi một chương trình không có hàm main.",
    "re": "Sẽ không thể biên dịch và chạy chương trình"
  },
  {
    "con": "Tìm lỗi sai trong chương trình sau( in ra kết quả là tổng của 453 và 343):\n #include <stdio.h>\n void main()\n {int sum;\n sum= 453+343\n printf(“\\Ket qua la: “ sum) ;} ;",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi sử dụng biến trong chương trình, nếu biến chưa được khởi tạo thì giá trị của biến đó sẽ không xác định.",
    "re": "Có thể gây ra lỗi hoặc kết quả không mong muốn."
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp mà không có điều kiện dừng, thì chương trình sẽ chạy mãi mãi.",
    "re": "Gây ra tình trạng treo chương trình."
  },
  {
    "con": "Nếu bạn không sử dụng dấu chấm phẩy ở cuối câu lệnh trong ngôn ngữ C, thì trình biên dịch sẽ báo lỗi cú pháp.",
    "re": "Chương trình không thể biên dịch thành công."
  },
  {
    "con": "Nếu bạn sử dụng hàm chưa được định nghĩa trước khi gọi, thì chương trình sẽ báo lỗi biên dịch.",
    "re": "Chương trình không thể chạy."
  },
  {
    "con": "Nếu bạn không kiểm tra điều kiện đầu vào của người dùng, thì chương trình có thể gặp lỗi khi nhận dữ liệu không hợp lệ.",
    "re": "Có thể dẫn đến lỗi runtime."
  },
  {
    "con": "Nếu bạn sử dụng kiểu dữ liệu không phù hợp cho biến, thì có thể xảy ra lỗi khi thực hiện các phép toán.",
    "re": "Kết quả không chính xác hoặc lỗi biên dịch."
  },
  {
    "con": "Nếu bạn không sử dụng comment để giải thích mã nguồn, thì mã sẽ khó hiểu hơn cho người khác hoặc cho chính bạn sau này.",
    "re": "Giảm khả năng bảo trì và phát triển mã nguồn."
  },
  {
    "con": "Nếu bạn không sử dụng cấu trúc điều kiện đúng cách, thì chương trình có thể không thực hiện đúng logic mà bạn mong muốn.",
    "re": "Kết quả không chính xác."
  },
  {
    "con": "Nếu bạn không kiểm tra các trường hợp biên trong thuật toán, thì chương trình có thể không hoạt động đúng trong các tình huống đặc biệt.",
    "re": "Có thể dẫn đến lỗi hoặc kết quả không mong muốn."
  },
  {
    "con": "Kết quả của chương trình sau là gì:\n #include <stdio.h>\n void main()\n {int i,j;\n for (i=1; i<4; i++)j=i;\n printf(“%3d”, j);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn sử dụng biến chưa được khởi tạo trong chương trình,",
    "re": "thì kết quả có thể không xác định và gây ra lỗi."
  },
  {
    "con": "Nếu bạn không sử dụng dấu chấm phẩy ở cuối câu lệnh trong C,",
    "re": "thì trình biên dịch sẽ báo lỗi cú pháp."
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp while mà điều kiện luôn đúng,",
    "re": "thì chương trình sẽ rơi vào vòng lặp vô hạn."
  },
  {
    "con": "Nếu bạn khai báo một mảng mà không chỉ định kích thước,",
    "re": "thì trình biên dịch sẽ báo lỗi."
  },
  {
    "con": "Nếu bạn không kiểm tra điều kiện đầu vào của người dùng,",
    "re": "thì chương trình có thể gặp lỗi khi nhận dữ liệu không hợp lệ."
  },
  {
    "con": "Nếu bạn sử dụng hàm không được định nghĩa trước khi gọi,",
    "re": "thì trình biên dịch sẽ báo lỗi không tìm thấy hàm."
  },
  {
    "con": "Nếu bạn sử dụng kiểu dữ liệu không phù hợp trong phép toán,",
    "re": "thì có thể xảy ra lỗi kiểu dữ liệu."
  },
  {
    "con": "Nếu bạn không giải phóng bộ nhớ đã cấp phát động,",
    "re": "thì có thể gây ra rò rỉ bộ nhớ."
  },
  {
    "con": "Nếu bạn sử dụng các thư viện không cần thiết trong chương trình,",
    "re": "thì chương trình có thể trở nên nặng nề và khó bảo trì."
  },
  {
    "con": "Kết quả của chương trình sau là gì:\n #include <stdio.h>\n void main()\n {int a=40,b=4;\n while(a!=b)if (a>b) a=a-b;\n else b=b-a;\n printf(“%d”,a);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo thì giá trị của biến đó sẽ không xác định.",
    "re": "Giá trị của biến có thể là bất kỳ giá trị nào"
  },
  {
    "con": "Nếu một hàm không trả về giá trị thì kiểu trả về của hàm đó phải được khai báo là void.",
    "re": "Hàm sẽ không trả về giá trị nào"
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp for mà không có điều kiện dừng, thì chương trình sẽ chạy mãi mãi.",
    "re": "Chương trình sẽ bị treo hoặc không bao giờ kết thúc"
  },
  {
    "con": "Nếu bạn sử dụng toán tử == để so sánh hai biến, thì bạn đang kiểm tra xem chúng có bằng nhau hay không.",
    "re": "Kết quả sẽ là true hoặc false"
  },
  {
    "con": "Nếu bạn không sử dụng dấu chấm phẩy ở cuối câu lệnh trong C, thì sẽ xảy ra lỗi biên dịch.",
    "re": "Lỗi biên dịch sẽ xuất hiện"
  },
  {
    "con": "Nếu bạn gọi một hàm trước khi nó được định nghĩa, thì sẽ xảy ra lỗi biên dịch.",
    "re": "Lỗi biên dịch sẽ xuất hiện"
  },
  {
    "con": "Nếu bạn sử dụng mảng mà không khai báo kích thước, thì sẽ xảy ra lỗi biên dịch.",
    "re": "Lỗi biên dịch sẽ xuất hiện"
  },
  {
    "con": "Nếu bạn sử dụng toán tử ++ trước biến, thì biến sẽ được tăng giá trị trước khi sử dụng.",
    "re": "Giá trị của biến sẽ tăng lên 1 trước khi được sử dụng"
  },
  {
    "con": "Nếu bạn không kiểm tra điều kiện trước khi truy cập vào phần tử của mảng, thì có thể xảy ra lỗi truy cập bộ nhớ.",
    "re": "Lỗi truy cập bộ nhớ có thể xảy ra"
  },
  {
    "con": "Kết quả của chương trình sau là gì:\n #include <stdio.h>\n void hoanvi(int *px, int *py)\n {int z;z=*px;*px=*py ;*py=z ;};\n void main()\n {int a=15, b=21 ;\n hoanvi(a,b);\n printf (“%d %d”,a,b);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo giá trị sẽ có giá trị không xác định.",
    "re": "Giá trị của biến đó có thể gây ra lỗi hoặc hành vi không mong muốn."
  },
  {
    "con": "Nếu một hàm không trả về giá trị, thì kiểu trả về của hàm đó phải được khai báo là void.",
    "re": "Chương trình sẽ biên dịch thành công mà không có lỗi."
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp for mà không có điều kiện dừng, thì vòng lặp đó sẽ chạy vô hạn.",
    "re": "Chương trình sẽ bị treo hoặc không thể hoàn thành."
  },
  {
    "con": "Nếu bạn sử dụng toán tử == để so sánh hai biến, thì bạn đang kiểm tra xem chúng có bằng nhau hay không.",
    "re": "Kết quả sẽ là true hoặc false."
  },
  {
    "con": "Nếu bạn không sử dụng dấu chấm phẩy ở cuối câu lệnh trong ngôn ngữ C, thì trình biên dịch sẽ báo lỗi cú pháp.",
    "re": "Chương trình sẽ không biên dịch thành công."
  },
  {
    "con": "Nếu bạn gọi một hàm trước khi nó được khai báo, thì bạn cần phải có một khai báo hàm trước đó.",
    "re": "Chương trình sẽ báo lỗi không tìm thấy hàm."
  },
  {
    "con": "Nếu bạn sử dụng mảng mà không kiểm tra chỉ số, thì bạn có thể truy cập vào vùng nhớ không hợp lệ.",
    "re": "Chương trình có thể gây ra lỗi truy cập bộ nhớ."
  },
  {
    "con": "Nếu bạn sử dụng biến toàn cục, thì biến đó có thể được truy cập từ bất kỳ hàm nào trong chương trình.",
    "re": "Điều này có thể dẫn đến xung đột tên biến và khó khăn trong việc bảo trì mã."
  },
  {
    "con": "Nếu bạn không xử lý ngoại lệ trong chương trình, thì chương trình có thể dừng lại khi gặp lỗi.",
    "re": "Người dùng sẽ không nhận được thông báo lỗi rõ ràng."
  },
  {
    "con": "Kết quả chương trình sau là gì:\n#include <stdio.h>\nvoid hoanvi(int px, int py)\n{int pz;pz=px; px=py; py=pz;};\nvoid main()\n{int a=15, b=21;\nhoanvi(a,b);\nprintf(“%d %d”,a,b);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo sẽ có giá trị gì?",
    "re": "Giá trị không xác định"
  },
  {
    "con": "Nếu một hàm không trả về giá trị, thì kiểu trả về của hàm đó phải là gì?",
    "re": "void"
  },
  {
    "con": "Khi sử dụng vòng lặp for, nếu điều kiện dừng không bao giờ đúng, thì vòng lặp sẽ làm gì?",
    "re": "Chạy vô hạn"
  },
  {
    "con": "Nếu một mảng được khai báo với kích thước n, thì chỉ số hợp lệ của mảng đó là gì?",
    "re": "Từ 0 đến n-1"
  },
  {
    "con": "Nếu một biến được khai báo là const, thì biến đó có thể được làm gì?",
    "re": "Không thể thay đổi giá trị"
  },
  {
    "con": "Khi sử dụng toán tử == trong điều kiện, nếu hai giá trị khác kiểu dữ liệu, thì điều gì xảy ra?",
    "re": "Có thể xảy ra chuyển đổi kiểu dữ liệu"
  },
  {
    "con": "Nếu một chương trình không có hàm main(), thì chương trình đó sẽ như thế nào?",
    "re": "Không thể biên dịch hoặc chạy"
  },
  {
    "con": "Nếu một hàm được gọi với số lượng tham số không đúng, thì điều gì sẽ xảy ra?",
    "re": "Có thể gây ra lỗi biên dịch hoặc lỗi thời gian chạy"
  },
  {
    "con": "Nếu một chuỗi được khai báo trong C mà không có ký tự kết thúc null, thì điều gì sẽ xảy ra khi in chuỗi đó?",
    "re": "Có thể gây ra lỗi hoặc in ra dữ liệu không mong muốn"
  },
  {
    "con": "Khai báo các biến:\n int m,n; \n float x,y;\n Lệnh nào sai :",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sử dụng toán tử so sánh '==' để kiểm tra sự bằng nhau giữa hai biến:",
    "re": "Kết quả trả về là true hoặc false"
  },
  {
    "con": "Khi sử dụng vòng lặp for:\n for(int i = 0; i < 10; i++) {\n // code\n }\n Vòng lặp sẽ chạy bao nhiêu lần:",
    "re": "10 lần"
  },
  {
    "con": "Khi gọi hàm mà không truyền tham số:\n void myFunction() {\n // code\n }\n Hàm sẽ được gọi như thế nào:",
    "re": "Chỉ cần gọi myFunction();"
  },
  {
    "con": "Khi sử dụng mảng:\n int arr[5];\n arr[0] = 10;\n arr[5] = 20;\n Lệnh nào sai:",
    "re": "arr[5] sẽ gây ra lỗi vì chỉ số mảng bắt đầu từ 0"
  },
  {
    "con": "Khi sử dụng câu lệnh điều kiện if:\n if (x > 0) {\n // code\n }\n Nếu x = -1 thì:",
    "re": "Câu lệnh trong if sẽ không được thực thi"
  },
  {
    "con": "Khi sử dụng kiểu dữ liệu boolean:\n bool isTrue = true;\n Nếu isTrue thì:",
    "re": "Điều kiện sẽ được đánh giá là đúng"
  },
  {
    "con": "Khi sử dụng hàm trả về giá trị:\n int add(int a, int b) {\n return a + b;\n }\n Hàm sẽ trả về gì khi gọi add(2, 3):",
    "re": "5"
  },
  {
    "con": "Khi sử dụng từ khóa return trong hàm:\n return; \n Nếu hàm không có giá trị trả về:",
    "re": "Hàm sẽ kết thúc mà không trả về giá trị nào"
  },
  {
    "con": "Khi sử dụng vòng lặp while:\n while (true) {\n // code\n }\n Vòng lặp này sẽ chạy như thế nào:",
    "re": "Chạy vô hạn trừ khi có lệnh break"
  },
  {
    "con": "Kết quả in ra màn hình của chương trình sau:\n #include <stdio.h >\n void main()\n {char *s;s=\"chao cac ban\";\n strcpy(&s[5],&s[9]);\n printf(\"%s\",s);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo với từ khóa 'int' và gán giá trị 5 thì biến đó có kiểu dữ liệu là số nguyên.",
    "re": "Biến có thể lưu trữ giá trị số nguyên"
  },
  {
    "con": "Nếu một hàm được định nghĩa với kiểu trả về là 'void' thì hàm đó không trả về giá trị nào.",
    "re": "Hàm có thể thực hiện các tác vụ mà không cần trả về giá trị"
  },
  {
    "con": "Nếu một vòng lặp 'for' được viết đúng cú pháp thì nó sẽ lặp lại một số lần nhất định.",
    "re": "Vòng lặp sẽ thực hiện các câu lệnh bên trong nó"
  },
  {
    "con": "Nếu một mảng được khai báo với kích thước 10 thì nó có thể chứa tối đa 10 phần tử.",
    "re": "Mảng có thể lưu trữ 10 giá trị"
  },
  {
    "con": "Nếu một biến được khai báo nhưng không được khởi tạo thì giá trị của biến đó là không xác định.",
    "re": "Biến có thể chứa giá trị rác"
  },
  {
    "con": "Nếu một điều kiện trong câu lệnh 'if' là đúng thì các câu lệnh trong khối 'if' sẽ được thực thi.",
    "re": "Khối lệnh sẽ được thực hiện"
  },
  {
    "con": "Nếu một chuỗi được khai báo trong C bằng cách sử dụng dấu nháy kép thì nó sẽ được lưu trữ dưới dạng mảng ký tự.",
    "re": "Chuỗi có thể được xử lý như một mảng ký tự"
  },
  {
    "con": "Nếu một chương trình có lỗi cú pháp thì nó sẽ không biên dịch thành công.",
    "re": "Chương trình sẽ không chạy được"
  },
  {
    "con": "Nếu một biến toàn cục được khai báo thì nó có thể được truy cập từ bất kỳ hàm nào trong chương trình.",
    "re": "Biến có thể được sử dụng ở nhiều nơi"
  },
  {
    "con": "Kết quả in ra màn hình của chương trình sau:\n #include <stdio.h>\n void main()\n {int a=100, b=6;\n double f;\n f=(double)a/(double)b;\n printf(“%2.2f”,f);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo với từ khóa 'int' và gán giá trị 5 thì kiểu dữ liệu của biến đó là số nguyên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hàm không có giá trị trả về thì nó phải được khai báo với kiểu 'void'.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp 'for' với điều kiện dừng là sai thì vòng lặp sẽ không được thực thi.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn gọi một hàm chưa được định nghĩa trước khi sử dụng thì chương trình sẽ báo lỗi biên dịch.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn sử dụng toán tử '==' để so sánh hai giá trị thì kết quả sẽ là true nếu chúng bằng nhau.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn không khởi tạo biến trước khi sử dụng thì giá trị của biến đó sẽ không xác định.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn sử dụng mảng mà không kiểm tra chỉ số thì có thể xảy ra lỗi truy cập bộ nhớ.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn sử dụng từ khóa 'return' trong một hàm thì hàm sẽ kết thúc và trả về giá trị cho nơi gọi.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn sử dụng câu lệnh 'switch' mà không có 'default' thì sẽ không có hành động nào xảy ra nếu không có trường hợp nào khớp.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Có các khai báo sau:\n char msg[10];\n char value;\n Câu nào sau đây sẽ là đúng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Có một biến số nguyên được khai báo và gán giá trị 5,\n int a = 5;\n Nếu a được tăng thêm 3 thì:",
    "re": "Giá trị của a sẽ là 8"
  },
  {
    "con": "Có một vòng lặp for với điều kiện i < 10,\n for(int i = 0; i < 10; i++) {\n ... }\n Nếu vòng lặp này được thực hiện thì:",
    "re": "Nó sẽ lặp lại 10 lần"
  },
  {
    "con": "Có một hàm được định nghĩa như sau:\n void greet() {\n printf(\"Hello, World!\");\n }\n Nếu hàm này được gọi thì:",
    "re": "Nó sẽ in ra 'Hello, World!'"
  },
  {
    "con": "Có một mảng số nguyên được khai báo như sau:\n int arr[5] = {1, 2, 3, 4, 5};\n Nếu truy cập arr[2] thì:",
    "re": "Giá trị trả về sẽ là 3"
  },
  {
    "con": "Có một biến kiểu boolean được khai báo và gán giá trị true,\n bool flag = true;\n Nếu kiểm tra điều kiện flag == false thì:",
    "re": "Kết quả sẽ là false"
  },
  {
    "con": "Có một hàm trả về giá trị kiểu double,\n double calculateArea(double radius) {\n return 3.14 * radius * radius;\n }\n Nếu gọi hàm này với radius = 2 thì:",
    "re": "Giá trị trả về sẽ là 12.56"
  },
  {
    "con": "Có một cấu trúc dữ liệu kiểu struct được định nghĩa như sau:\n struct Point { int x; int y; };\n Nếu tạo một biến p và gán p.x = 10 thì:",
    "re": "Giá trị của p.x sẽ là 10"
  },
  {
    "con": "Có một chuỗi được khai báo như sau:\n char str[] = \"Hello\";\n Nếu truy cập str[1] thì:",
    "re": "Giá trị trả về sẽ là 'e'"
  },
  {
    "con": "Có một hàm kiểm tra số chẵn được định nghĩa như sau:\n bool isEven(int num) {\n return num % 2 == 0;\n }\n Nếu gọi hàm này với num = 4 thì:",
    "re": "Kết quả sẽ là true"
  },
  {
    "con": "Có các khai báo sau:\n char msg[10];\n char *ptr;\n char value;\n Câu nào sau đây là đúng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng chưa được khởi tạo:",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Sử dụng vòng lặp for với điều kiện dừng đúng:",
    "re": "Vòng lặp sẽ thực hiện đúng số lần mong muốn"
  },
  {
    "con": "Sử dụng hàm printf để in ra một biến kiểu int:",
    "re": "Cú pháp sẽ là printf(\"%d\", variable);"
  },
  {
    "con": "Khi sử dụng mảng, chỉ số bắt đầu từ 0:",
    "re": "Phần tử đầu tiên của mảng sẽ có chỉ số 0"
  },
  {
    "con": "Khi sử dụng toán tử == để so sánh hai giá trị:",
    "re": "Kết quả sẽ là true nếu hai giá trị bằng nhau"
  },
  {
    "con": "Khi một hàm không trả về giá trị:",
    "re": "Kiểu trả về của hàm phải được khai báo là void"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if:",
    "re": "Chương trình sẽ thực hiện khối lệnh bên trong if nếu điều kiện đúng"
  },
  {
    "con": "Khi khai báo một biến toàn cục:",
    "re": "Biến đó có thể được truy cập từ bất kỳ hàm nào trong chương trình"
  },
  {
    "con": "Khi sử dụng toán tử ++ trên một biến:",
    "re": "Giá trị của biến đó sẽ tăng thêm 1"
  },
  {
    "con": "Cho các khai báo sau:\n void *tongquat;\n int *nguyen;\n char *kitu;\n Phép gán nào là không hợp lệ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một biến được khai báo nhưng chưa được khởi tạo:",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Nếu một hàm không trả về giá trị:",
    "re": "Kiểu trả về của hàm đó phải là void"
  },
  {
    "con": "Khi sử dụng vòng lặp for:",
    "re": "Cần có điều kiện dừng để tránh vòng lặp vô hạn"
  },
  {
    "con": "Nếu một mảng được khai báo với kích thước n:",
    "re": "Chỉ số hợp lệ của mảng sẽ từ 0 đến n-1"
  },
  {
    "con": "Khi sử dụng toán tử == để so sánh hai biến:",
    "re": "Cần đảm bảo rằng kiểu dữ liệu của hai biến là tương thích"
  },
  {
    "con": "Nếu một biến được khai báo là const:",
    "re": "Giá trị của biến đó không thể thay đổi sau khi được khởi tạo"
  },
  {
    "con": "Khi sử dụng hàm printf:",
    "re": "Cần phải cung cấp định dạng đúng cho các tham số"
  },
  {
    "con": "Nếu một chương trình không có hàm main:",
    "re": "Chương trình sẽ không thể biên dịch và chạy"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if-else:",
    "re": "Cần đảm bảo rằng các điều kiện được kiểm tra là rõ ràng và không mâu thuẫn"
  },
  {
    "con": "Cho biết kết quả của đoạn chương trình sau:\n int p=4;\n p=10+ ++p;",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một biến được khai báo nhưng chưa được gán giá trị, thì giá trị của biến đó là không xác định.",
    "re": "Giá trị không xác định"
  },
  {
    "con": "Nếu một vòng lặp không có điều kiện dừng, thì chương trình sẽ bị treo hoặc chạy vô hạn.",
    "re": "Chương trình sẽ bị treo"
  },
  {
    "con": "Khi sử dụng toán tử chia trong lập trình, nếu mẫu số là 0, thì sẽ xảy ra lỗi chia cho 0.",
    "re": "Lỗi chia cho 0"
  },
  {
    "con": "Nếu một hàm không trả về giá trị, thì kiểu trả về của hàm đó phải được khai báo là void.",
    "re": "Kiểu trả về là void"
  },
  {
    "con": "Khi sử dụng mảng, nếu chỉ số vượt quá kích thước của mảng, thì sẽ xảy ra lỗi truy cập bộ nhớ.",
    "re": "Lỗi truy cập bộ nhớ"
  },
  {
    "con": "Nếu một biến được khai báo là hằng số, thì giá trị của biến đó không thể thay đổi trong suốt chương trình.",
    "re": "Giá trị không thể thay đổi"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if-else, nếu điều kiện là đúng, thì khối lệnh trong if sẽ được thực thi.",
    "re": "Khối lệnh trong if được thực thi"
  },
  {
    "con": "Nếu một chương trình không có điểm vào chính (main), thì chương trình sẽ không thể chạy.",
    "re": "Chương trình không thể chạy"
  },
  {
    "con": "Khi sử dụng vòng lặp for, nếu điều kiện lặp là sai ngay từ đầu, thì khối lệnh trong vòng lặp sẽ không được thực thi.",
    "re": "Khối lệnh không được thực thi"
  },
  {
    "con": "Có các khai báo sau: \n char tb, mang[15];\n Trong các câu lệnh sau, câu nào đúng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng chưa được gán giá trị:",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Sử dụng vòng lặp for với điều kiện dừng là sai:",
    "re": "Vòng lặp sẽ không bao giờ dừng lại"
  },
  {
    "con": "Một hàm không trả về giá trị nhưng có kiểu trả về là void:",
    "re": "Hàm đó có thể được gọi mà không cần xử lý giá trị trả về"
  },
  {
    "con": "Sử dụng toán tử == để so sánh hai chuỗi:",
    "re": "Kết quả có thể không chính xác vì toán tử này so sánh địa chỉ bộ nhớ"
  },
  {
    "con": "Khi sử dụng mảng, chỉ số bắt đầu từ 0:",
    "re": "Phần tử đầu tiên của mảng sẽ có chỉ số là 0"
  },
  {
    "con": "Khi khai báo một biến toàn cục trong một hàm:",
    "re": "Biến đó sẽ không thể được truy cập bên ngoài hàm"
  },
  {
    "con": "Sử dụng câu lệnh break trong một vòng lặp:",
    "re": "Vòng lặp sẽ kết thúc ngay lập tức"
  },
  {
    "con": "Khi gọi một hàm với tham số không đúng kiểu:",
    "re": "Chương trình có thể gây ra lỗi biên dịch hoặc lỗi thời gian chạy"
  },
  {
    "con": "Sử dụng toán tử ++ trước biến:",
    "re": "Giá trị của biến sẽ được tăng lên trước khi sử dụng trong biểu thức"
  },
  {
    "con": "Chương trình: \n #include <stdio.h> \n void main()\n {char c;\n int n;\n scanf(“%d%c”,&n,&c);\n printf(“%3d%c”,n,c); }; \n Giả sử khi chạy chương trình ta gõ từ bản phím: “29h b”. Kết quả in ra n và c tương ứng sẽ là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một biến được khai báo nhưng chưa được gán giá trị,",
    "re": "giá trị của biến đó sẽ không xác định."
  },
  {
    "con": "Nếu một vòng lặp 'for' có điều kiện dừng là sai ngay từ đầu,",
    "re": "thân vòng lặp sẽ không được thực thi."
  },
  {
    "con": "Khi sử dụng hàm printf để in một chuỗi,",
    "re": "cần phải sử dụng định dạng %s để in ra chuỗi đó."
  },
  {
    "con": "Nếu một hàm không trả về giá trị,",
    "re": "cần phải khai báo kiểu trả về là 'void'."
  },
  {
    "con": "Khi sử dụng toán tử chia trong ngôn ngữ lập trình,",
    "re": "nếu mẫu số là 0, chương trình sẽ gây ra lỗi."
  },
  {
    "con": "Nếu một mảng được khai báo với kích thước n,",
    "re": "các chỉ số hợp lệ của mảng sẽ từ 0 đến n-1."
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện 'if',",
    "re": "nếu điều kiện là đúng, đoạn mã trong khối 'if' sẽ được thực thi."
  },
  {
    "con": "Nếu một biến toàn cục và một biến cục bộ có cùng tên,",
    "re": "biến cục bộ sẽ được ưu tiên sử dụng trong phạm vi của nó."
  },
  {
    "con": "Khi sử dụng vòng lặp 'while',",
    "re": "nếu điều kiện là sai ngay từ đầu, thân vòng lặp sẽ không được thực thi."
  },
  {
    "con": "Kết quả của chương trình sau là gì: #include <stdio.h>\nvoid main() { int x, *p;x=3; x=6; p=&x; *p=9; printf(“%d”,x); printf(“%d”,*p); printf(“%d”,x); };",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo sẽ có giá trị không xác định.",
    "re": "Giá trị của biến có thể gây ra lỗi khi sử dụng"
  },
  {
    "con": "Sử dụng vòng lặp for với điều kiện dừng không chính xác có thể dẫn đến vòng lặp vô hạn.",
    "re": "Chương trình sẽ không bao giờ dừng lại"
  },
  {
    "con": "Nếu một hàm không trả về giá trị nhưng được khai báo với kiểu trả về khác void, thì chương trình có thể gặp lỗi biên dịch.",
    "re": "Lỗi biên dịch sẽ xảy ra"
  },
  {
    "con": "Khi sử dụng mảng, nếu chỉ định chỉ số ngoài phạm vi của mảng, thì chương trình có thể truy cập vào vùng nhớ không hợp lệ.",
    "re": "Có thể gây ra lỗi truy cập bộ nhớ"
  },
  {
    "con": "Nếu bạn không sử dụng dấu chấm phẩy ở cuối câu lệnh trong ngôn ngữ C, thì chương trình sẽ không biên dịch thành công.",
    "re": "Lỗi biên dịch sẽ xảy ra"
  },
  {
    "con": "Khi sử dụng con trỏ, nếu không khởi tạo con trỏ trước khi sử dụng, thì chương trình có thể gặp lỗi truy cập bộ nhớ.",
    "re": "Có thể gây ra lỗi truy cập bộ nhớ"
  },
  {
    "con": "Nếu bạn sử dụng toán tử == để so sánh hai chuỗi trong C, thì kết quả sẽ không chính xác.",
    "re": "So sánh sẽ không hoạt động như mong đợi"
  },
  {
    "con": "Khi gọi hàm, nếu số lượng tham số không khớp với định nghĩa hàm, thì chương trình có thể gặp lỗi biên dịch.",
    "re": "Lỗi biên dịch sẽ xảy ra"
  },
  {
    "con": "Nếu bạn không khai báo kiểu dữ liệu cho biến, thì chương trình sẽ không biên dịch thành công.",
    "re": "Lỗi biên dịch sẽ xảy ra"
  },
  {
    "con": "Kết quả của chương trình sau là gì: \n #include <stdio.h> \n int change(int a) \n {a=10;return a;};\n void main()\n {int a=5;change(i);\n printf(“%d”,i);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một biến được khai báo nhưng chưa được khởi tạo, giá trị của biến đó sẽ là giá trị ngẫu nhiên.",
    "re": "Giá trị của biến không xác định"
  },
  {
    "con": "Nếu một hàm không trả về giá trị, thì kiểu trả về của hàm đó phải được khai báo là void.",
    "re": "Hàm không có giá trị trả về"
  },
  {
    "con": "Khi sử dụng vòng lặp for, nếu điều kiện dừng không bao giờ đạt được, thì vòng lặp sẽ chạy vô hạn.",
    "re": "Chương trình sẽ bị treo"
  },
  {
    "con": "Nếu một mảng được khai báo với kích thước n, thì chỉ số hợp lệ của mảng sẽ từ 0 đến n-1.",
    "re": "Truy cập ngoài chỉ số sẽ gây lỗi"
  },
  {
    "con": "Khi sử dụng toán tử == để so sánh hai biến, nếu hai biến có kiểu dữ liệu khác nhau, thì kết quả so sánh có thể không chính xác.",
    "re": "Có thể xảy ra lỗi so sánh"
  },
  {
    "con": "Nếu một biến toàn cục và một biến cục bộ có cùng tên, thì biến nào sẽ được sử dụng trong hàm là biến cục bộ.",
    "re": "Biến cục bộ sẽ được ưu tiên"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp, thì chương trình sẽ không biên dịch thành công.",
    "re": "Lỗi cú pháp sẽ ngăn chương trình chạy"
  },
  {
    "con": "Nếu một hàm được gọi mà không có đủ tham số, thì chương trình sẽ gặp lỗi khi chạy.",
    "re": "Lỗi tham số không đủ"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if-else, nếu điều kiện if là đúng, thì khối lệnh else sẽ không được thực thi.",
    "re": "Khối lệnh else bị bỏ qua"
  },
  {
    "con": "Kết quả của chương trình sau là gì: \n #include <stdio.h>\n int change(int *a)\n {*a=10;return *a;};\n void main()\n {int i=5;\n change(&i);\n printf(“%d”,i);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo sẽ có giá trị không xác định.",
    "re": "Giá trị của biến có thể gây ra lỗi khi sử dụng"
  },
  {
    "con": "Nếu một hàm không trả về giá trị, thì kiểu trả về của hàm đó phải được khai báo là void.",
    "re": "Hàm sẽ không có giá trị trả về"
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp for mà không có điều kiện dừng, thì chương trình sẽ chạy vô hạn.",
    "re": "Chương trình sẽ không bao giờ kết thúc"
  },
  {
    "con": "Nếu bạn cố gắng truy cập vào phần tử ngoài giới hạn của mảng, thì chương trình có thể gây ra lỗi truy cập bộ nhớ.",
    "re": "Lỗi có thể xảy ra và chương trình có thể bị dừng"
  },
  {
    "con": "Nếu bạn sử dụng toán tử == để so sánh hai chuỗi trong C, thì kết quả sẽ không chính xác.",
    "re": "Cần sử dụng hàm strcmp để so sánh chuỗi"
  },
  {
    "con": "Nếu bạn không sử dụng dấu chấm phẩy ở cuối câu lệnh trong C, thì trình biên dịch sẽ báo lỗi cú pháp.",
    "re": "Lỗi cú pháp sẽ xảy ra"
  },
  {
    "con": "Nếu bạn khai báo một biến toàn cục, thì biến đó có thể được truy cập từ bất kỳ hàm nào trong chương trình.",
    "re": "Biến toàn cục có phạm vi toàn cục"
  },
  {
    "con": "Nếu bạn sử dụng từ khóa return trong một hàm không có kiểu trả về, thì chương trình sẽ không biên dịch thành công.",
    "re": "Lỗi biên dịch sẽ xảy ra"
  },
  {
    "con": "Nếu bạn không kiểm tra điều kiện trước khi sử dụng con trỏ, thì có thể xảy ra lỗi truy cập bộ nhớ.",
    "re": "Chương trình có thể gặp lỗi nghiêm trọng"
  },
  {
    "con": "Kết quả của chương trình sau là gì:\n #include <stdio.h>\n void main()\n {int x, *p;\n x=6; p=&x;\n printf(“%d”,x);\n printf(“%d”,*p);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo sẽ có giá trị không xác định.",
    "re": "Giá trị không xác định"
  },
  {
    "con": "Nếu một hàm không trả về giá trị, thì kiểu trả về của hàm đó phải là void.",
    "re": "Kiểu trả về là void"
  },
  {
    "con": "Khi sử dụng vòng lặp for, nếu điều kiện dừng không bao giờ đạt được, thì vòng lặp sẽ chạy vô hạn.",
    "re": "Vòng lặp chạy vô hạn"
  },
  {
    "con": "Nếu một mảng được khai báo với kích thước n, thì chỉ số hợp lệ của mảng sẽ từ 0 đến n-1.",
    "re": "Chỉ số hợp lệ từ 0 đến n-1"
  },
  {
    "con": "Nếu bạn sử dụng toán tử == để so sánh hai giá trị, thì nó sẽ trả về true nếu hai giá trị đó bằng nhau.",
    "re": "Trả về true nếu bằng nhau"
  },
  {
    "con": "Nếu bạn không sử dụng từ khóa return trong một hàm có kiểu trả về khác void, thì hành vi của chương trình sẽ không xác định.",
    "re": "Hành vi không xác định"
  },
  {
    "con": "Nếu bạn khai báo một biến toàn cục, thì biến đó có thể được truy cập từ bất kỳ hàm nào trong chương trình.",
    "re": "Có thể truy cập từ bất kỳ hàm nào"
  },
  {
    "con": "Nếu bạn sử dụng toán tử ++ trước biến, thì biến đó sẽ được tăng giá trị trước khi được sử dụng.",
    "re": "Tăng giá trị trước khi sử dụng"
  },
  {
    "con": "Nếu bạn không kiểm tra điều kiện trước khi truy cập vào phần tử của mảng, thì có thể xảy ra lỗi tràn bộ nhớ.",
    "re": "Có thể xảy ra lỗi tràn bộ nhớ"
  },
  {
    "con": "Kết quả của chương trình sau là gì:\n #include <stdio.h>\n void main()\n {printf(“%d”,3<2||6);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo thì giá trị của biến đó là gì?",
    "re": "Giá trị không xác định"
  },
  {
    "con": "Nếu một hàm không trả về giá trị thì kiểu trả về của hàm đó nên được khai báo là gì?",
    "re": "void"
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp for mà không có điều kiện dừng thì điều gì sẽ xảy ra?",
    "re": "Chương trình sẽ bị treo (vòng lặp vô hạn)"
  },
  {
    "con": "Nếu bạn cố gắng truy cập vào một phần tử không tồn tại trong mảng thì điều gì sẽ xảy ra?",
    "re": "Có thể gây ra lỗi truy cập bộ nhớ"
  },
  {
    "con": "Nếu bạn sử dụng toán tử == để so sánh hai chuỗi trong C thì điều gì sẽ xảy ra?",
    "re": "So sánh địa chỉ bộ nhớ thay vì nội dung chuỗi"
  },
  {
    "con": "Nếu bạn không sử dụng dấu chấm phẩy ở cuối câu lệnh trong C thì điều gì sẽ xảy ra?",
    "re": "Chương trình sẽ báo lỗi biên dịch"
  },
  {
    "con": "Nếu bạn khai báo một biến toàn cục và một biến cục bộ cùng tên thì biến nào sẽ được sử dụng trong hàm?",
    "re": "Biến cục bộ sẽ được ưu tiên"
  },
  {
    "con": "Nếu bạn sử dụng toán tử ++ trước biến thì điều gì sẽ xảy ra?",
    "re": "Biến sẽ được tăng giá trị trước khi sử dụng"
  },
  {
    "con": "Nếu bạn không kiểm tra điều kiện trước khi sử dụng con trỏ thì điều gì sẽ xảy ra?",
    "re": "Có thể gây ra lỗi truy cập bộ nhớ hoặc lỗi chương trình"
  },
  {
    "con": "Kết quả của chương trình sau là gì:\n #include <stdio.h>\n void main()\n {int i,k;\n for(i=1; ; i++) k=5;\n printf(“%d”,i);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo trước khi sử dụng.",
    "re": "Có thể dẫn đến lỗi không xác định trong chương trình."
  },
  {
    "con": "Sử dụng vòng lặp while mà không có điều kiện dừng.",
    "re": "Chương trình sẽ chạy vô hạn."
  },
  {
    "con": "Khi sử dụng mảng, chỉ số truy cập vượt quá kích thước của mảng.",
    "re": "Có thể gây ra lỗi truy cập bộ nhớ."
  },
  {
    "con": "Khi gọi hàm mà không truyền đủ tham số cần thiết.",
    "re": "Chương trình sẽ báo lỗi biên dịch."
  },
  {
    "con": "Sử dụng toán tử so sánh để kiểm tra giá trị của hai biến.",
    "re": "Kết quả sẽ là true hoặc false."
  },
  {
    "con": "Khi sử dụng câu lệnh điều kiện if mà không có khối lệnh else.",
    "re": "Chương trình vẫn hoạt động bình thường nhưng không xử lý trường hợp ngược lại."
  },
  {
    "con": "Khi sử dụng kiểu dữ liệu không tương thích trong phép toán.",
    "re": "Có thể dẫn đến lỗi biên dịch hoặc lỗi chạy."
  },
  {
    "con": "Khi sử dụng hàm không được định nghĩa trước khi gọi.",
    "re": "Chương trình sẽ báo lỗi biên dịch."
  },
  {
    "con": "Khi sử dụng biến toàn cục và biến cục bộ cùng tên.",
    "re": "Biến cục bộ sẽ được ưu tiên trong phạm vi hàm."
  },
  {
    "con": "Kết quả của chương trình sau là gì:\n #include <stdio.h>\n void main()\n {int i=1, k=0;\n for (; i<5; i++) k++;\n printf(“%d”,k);}",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo sẽ có giá trị không xác định.",
    "re": "Giá trị của biến có thể gây ra lỗi trong chương trình."
  },
  {
    "con": "Nếu một hàm không trả về giá trị, thì kiểu trả về của hàm đó phải được khai báo là void.",
    "re": "Chương trình sẽ biên dịch thành công."
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp while mà điều kiện luôn đúng, thì chương trình sẽ chạy vô hạn.",
    "re": "Chương trình sẽ không bao giờ dừng lại."
  },
  {
    "con": "Nếu bạn không sử dụng dấu chấm phẩy ở cuối câu lệnh trong C, thì chương trình sẽ báo lỗi biên dịch.",
    "re": "Lỗi biên dịch sẽ xảy ra."
  },
  {
    "con": "Nếu bạn gọi một hàm trước khi định nghĩa nó, thì bạn cần phải khai báo trước hàm đó.",
    "re": "Chương trình sẽ biên dịch thành công."
  },
  {
    "con": "Nếu bạn sử dụng mảng mà không kiểm tra chỉ số, thì có thể xảy ra lỗi truy cập bộ nhớ.",
    "re": "Chương trình có thể bị lỗi hoặc gặp sự cố."
  },
  {
    "con": "Nếu bạn sử dụng toán tử == để so sánh hai biến, thì bạn đang kiểm tra giá trị của chúng.",
    "re": "Kết quả sẽ là true hoặc false."
  },
  {
    "con": "Nếu bạn không sử dụng từ khóa return trong hàm có kiểu trả về khác void, thì chương trình có thể không hoạt động như mong đợi.",
    "re": "Kết quả có thể không chính xác."
  },
  {
    "con": "Nếu bạn sử dụng thư viện không được bao gồm trong chương trình, thì sẽ xảy ra lỗi biên dịch.",
    "re": "Chương trình sẽ không biên dịch thành công."
  },
  {
    "con": "Khi nhập vào dòng văn bản: “Chao Cac Ban”. Kết quả của chương trình sau là gì:\n #include <stdio.h>\n #include <conio.h>\n int main()\n {clrscr();\n char str[80];\n fflush(stdin);\n scanf(“%s”,str);\n cprintf(“Dong van ban vua nhap la: %s”,str);\n getch();\n return 0;};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi biến được khai báo với từ khóa 'int', thì biến đó sẽ chỉ có thể lưu trữ giá trị số nguyên.",
    "re": "Biến chỉ có thể lưu trữ giá trị số nguyên"
  },
  {
    "con": "Khi sử dụng vòng lặp 'for', thì vòng lặp sẽ lặp lại một số lần xác định trước.",
    "re": "Vòng lặp sẽ lặp lại một số lần xác định trước"
  },
  {
    "con": "Khi một hàm được định nghĩa với kiểu trả về là 'void', thì hàm đó sẽ không trả về giá trị nào.",
    "re": "Hàm sẽ không trả về giá trị nào"
  },
  {
    "con": "Khi sử dụng toán tử '==' để so sánh hai giá trị, thì kết quả sẽ là 'true' nếu hai giá trị đó bằng nhau.",
    "re": "Kết quả sẽ là 'true' nếu hai giá trị đó bằng nhau"
  },
  {
    "con": "Khi một mảng được khai báo, thì kích thước của mảng phải được xác định ngay tại thời điểm khai báo.",
    "re": "Kích thước của mảng phải được xác định ngay tại thời điểm khai báo"
  },
  {
    "con": "Khi sử dụng câu lệnh 'if', thì chương trình sẽ thực hiện khối lệnh bên trong nếu điều kiện là đúng.",
    "re": "Chương trình sẽ thực hiện khối lệnh bên trong nếu điều kiện là đúng"
  },
  {
    "con": "Khi một biến được khai báo nhưng không được khởi tạo, thì giá trị của biến đó sẽ không xác định.",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Khi sử dụng câu lệnh 'switch', thì chương trình sẽ kiểm tra giá trị của biến và thực hiện khối lệnh tương ứng với giá trị đó.",
    "re": "Chương trình sẽ thực hiện khối lệnh tương ứng với giá trị đó"
  },
  {
    "con": "Khi một chương trình có lỗi cú pháp, thì chương trình sẽ không biên dịch thành công.",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Kết quả của chương trình sau là gì:\n #include <stdio.h>\n #include <conio.h>\n void main(){clrscr();\n int i;\n for (i=1; i<=24; i++);\n printf(“\\n%d”,i);\n getch();return;};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được sử dụng trong chương trình thì chương trình sẽ không có lỗi biên dịch.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hàm không trả về giá trị thì kiểu trả về của hàm đó phải được khai báo là void.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một vòng lặp while không có điều kiện dừng thì vòng lặp đó sẽ chạy vô hạn.",
    "re": "Đúng"
  },
  {
    "con": "Nếu bạn sử dụng toán tử == để so sánh hai biến, thì bạn đang kiểm tra xem chúng có bằng nhau hay không.",
    "re": "Đúng"
  },
  {
    "con": "Nếu bạn không khởi tạo biến trước khi sử dụng, thì giá trị của biến đó sẽ không xác định.",
    "re": "Đúng"
  },
  {
    "con": "Nếu bạn sử dụng mảng, thì chỉ số của mảng bắt đầu từ 0.",
    "re": "Đúng"
  },
  {
    "con": "Nếu bạn gọi một hàm đệ quy mà không có điều kiện dừng, thì chương trình sẽ gây ra lỗi tràn ngăn xếp.",
    "re": "Đúng"
  },
  {
    "con": "Nếu bạn sử dụng dấu chấm phẩy sau câu lệnh điều kiện if, thì khối lệnh bên trong if sẽ không được thực thi.",
    "re": "Đúng"
  },
  {
    "con": "Nếu bạn không sử dụng từ khóa return trong hàm có kiểu trả về khác void, thì chương trình có thể không hoạt động như mong đợi.",
    "re": "Đúng"
  },
  {
    "con": "Kết quả của đoạn chương trình sau là gì:\n char c;\n int n;\n scanf(“%d%c”,&n,&c);\n Nếu gõ vào : ”10 T”.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo trước khi sử dụng.",
    "re": "Có thể gây ra lỗi hoặc kết quả không xác định"
  },
  {
    "con": "Sử dụng vòng lặp for với điều kiện dừng không chính xác.",
    "re": "Có thể dẫn đến vòng lặp vô hạn"
  },
  {
    "con": "Gọi hàm mà không truyền đủ tham số cần thiết.",
    "re": "Có thể gây ra lỗi biên dịch"
  },
  {
    "con": "Sử dụng toán tử chia cho 0 trong một phép toán.",
    "re": "Sẽ gây ra lỗi runtime"
  },
  {
    "con": "Khi sử dụng mảng, chỉ số vượt quá kích thước của mảng.",
    "re": "Có thể dẫn đến lỗi truy cập bộ nhớ"
  },
  {
    "con": "Khi sử dụng kiểu dữ liệu không tương thích trong phép toán.",
    "re": "Có thể gây ra lỗi biên dịch hoặc kết quả không chính xác"
  },
  {
    "con": "Sử dụng câu lệnh điều kiện if mà không có khối lệnh else.",
    "re": "Chương trình vẫn chạy bình thường nhưng không xử lý trường hợp khác"
  },
  {
    "con": "Khi không sử dụng từ khóa return trong hàm không trả giá trị.",
    "re": "Có thể gây ra hành vi không xác định"
  },
  {
    "con": "Khi không kiểm tra giá trị trả về của hàm scanf.",
    "re": "Có thể dẫn đến việc sử dụng dữ liệu không hợp lệ"
  },
  {
    "con": "Kết quả in ra màn hình của chương trình sau:\n #include <stdio.h>\n void main()\n {int i=100;\n printf(“%c”,i);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo trong một chương trình C",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Sử dụng vòng lặp for với điều kiện dừng đúng",
    "re": "Chương trình sẽ thực hiện đúng số lần lặp đã chỉ định"
  },
  {
    "con": "Khi một hàm không trả về giá trị nhưng được gọi trong một biểu thức",
    "re": "Chương trình sẽ gây ra lỗi biên dịch"
  },
  {
    "con": "Sử dụng toán tử == để so sánh hai biến số nguyên",
    "re": "Kết quả sẽ là true nếu hai biến có giá trị bằng nhau"
  },
  {
    "con": "Khi một mảng được khai báo nhưng không được khởi tạo",
    "re": "Các phần tử trong mảng sẽ chứa giá trị không xác định"
  },
  {
    "con": "Sử dụng câu lệnh switch với một giá trị không hợp lệ",
    "re": "Chương trình sẽ không thực hiện bất kỳ case nào và có thể rơi vào default"
  },
  {
    "con": "Khi một biến toàn cục được khai báo và sử dụng trong một hàm",
    "re": "Hàm sẽ có quyền truy cập vào biến toàn cục đó"
  },
  {
    "con": "Khi một chuỗi được truyền vào hàm printf mà không có định dạng đúng",
    "re": "Chương trình có thể gây ra lỗi hoặc in ra kết quả không mong muốn"
  },
  {
    "con": "Khi sử dụng toán tử ++ trước một biến",
    "re": "Giá trị của biến sẽ được tăng lên trước khi được sử dụng trong biểu thức"
  },
  {
    "con": "Kết quả của chương trình sau là gì:\n #include <stdio.h>\n #include <conio.h>\n float x[] =\n {63.2, -45.6, 70.1, 3.6, 14.5 };\n int n=sizeof(x)/sizeof(float);\n void main()\n {clrscr();\n int i,j;\n floar c;\n for (i=0, j=n-1; i<j; i++, j--);\n {c=x[i];x[i]=x[j];x[j]=c;};\n printf(“\\nDay ket qua la: \\n”);\n for (i=0 ; i<n ; i++)\n printf(“%8.2f ”,x[i]);\n getch() ;return;} ;",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Ngôn ngữ lập trình có cú pháp rõ ràng và dễ hiểu thì người học sẽ dễ dàng tiếp cận và nắm bắt kiến thức hơn.",
    "re": "Người học sẽ có khả năng lập trình tốt hơn."
  },
  {
    "con": "Nếu bạn thực hành viết mã thường xuyên thì kỹ năng lập trình của bạn sẽ được cải thiện nhanh chóng.",
    "re": "Bạn sẽ trở nên thành thạo hơn trong lập trình."
  },
  {
    "con": "Nếu bạn hiểu rõ các cấu trúc điều khiển như vòng lặp và điều kiện thì bạn sẽ có khả năng giải quyết vấn đề tốt hơn.",
    "re": "Bạn sẽ có thể viết các chương trình phức tạp hơn."
  },
  {
    "con": "Nếu bạn sử dụng các công cụ gỡ lỗi hiệu quả thì bạn sẽ tìm ra lỗi trong mã của mình nhanh hơn.",
    "re": "Thời gian phát triển và sửa lỗi sẽ giảm."
  },
  {
    "con": "Nếu bạn đọc tài liệu và tham khảo mã nguồn mở thì bạn sẽ học hỏi được nhiều kỹ thuật lập trình mới.",
    "re": "Kiến thức lập trình của bạn sẽ phong phú hơn."
  },
  {
    "con": "Nếu bạn tham gia vào các dự án nhóm thì bạn sẽ cải thiện kỹ năng làm việc nhóm và giao tiếp.",
    "re": "Bạn sẽ trở thành một lập trình viên toàn diện hơn."
  },
  {
    "con": "Nếu bạn viết tài liệu cho mã của mình thì người khác sẽ dễ dàng hiểu và sử dụng mã của bạn.",
    "re": "Mã của bạn sẽ trở nên dễ bảo trì hơn."
  },
  {
    "con": "Nếu bạn học cách sử dụng các thư viện và framework thì bạn sẽ tiết kiệm thời gian phát triển.",
    "re": "Bạn sẽ có thể tập trung vào các tính năng chính của ứng dụng."
  },
  {
    "con": "Nếu bạn thường xuyên tham gia các khóa học trực tuyến và hội thảo thì bạn sẽ cập nhật được các xu hướng mới trong lập trình.",
    "re": "Bạn sẽ không bị lạc hậu trong lĩnh vực công nghệ."
  },
  {
    "con": "Kết quả của chương trình sau là gì:\n #include <stdio.h>\n #include <conio.h>\n #include <ctype.h>\n #define EOL ‘\\n’void main()\n {clrscr();\n char chu[80];\n int tong,dem;\n for (dem=0; dem<tong; dem++);\n tong=dem;\n for (dem=0; dem<tong; ++dem)\n putchar(toupper(chu[dem]));\n getch();\n return;};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu biến số nguyên được khai báo nhưng không được khởi tạo, thì giá trị của biến đó sẽ là không xác định.",
    "re": "Giá trị không xác định"
  },
  {
    "con": "Nếu một hàm không trả về giá trị, thì kiểu trả về của hàm đó phải được khai báo là 'void'.",
    "re": "Kiểu trả về là 'void'"
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp 'for', thì bạn cần đảm bảo rằng điều kiện dừng của vòng lặp sẽ được thực hiện để tránh vòng lặp vô hạn.",
    "re": "Tránh vòng lặp vô hạn"
  },
  {
    "con": "Nếu bạn sử dụng mảng, thì chỉ số của mảng bắt đầu từ 0 trong hầu hết các ngôn ngữ lập trình.",
    "re": "Chỉ số bắt đầu từ 0"
  },
  {
    "con": "Nếu bạn muốn nhập dữ liệu từ bàn phím, thì bạn cần sử dụng hàm nhập tương ứng như 'scanf' trong C.",
    "re": "Sử dụng hàm 'scanf'"
  },
  {
    "con": "Nếu bạn muốn so sánh hai chuỗi trong C, thì bạn cần sử dụng hàm 'strcmp' thay vì toán tử '='.",
    "re": "Sử dụng hàm 'strcmp'"
  },
  {
    "con": "Nếu bạn khai báo một biến toàn cục, thì biến đó có thể được truy cập từ bất kỳ hàm nào trong chương trình.",
    "re": "Có thể truy cập từ bất kỳ hàm nào"
  },
  {
    "con": "Nếu bạn sử dụng toán tử '&&', thì cả hai điều kiện đều phải đúng để kết quả là đúng.",
    "re": "Cả hai điều kiện đều đúng"
  },
  {
    "con": "Nếu bạn muốn xử lý ngoại lệ trong chương trình, thì bạn cần sử dụng cấu trúc 'try-catch' trong các ngôn ngữ hỗ trợ.",
    "re": "Sử dụng cấu trúc 'try-catch'"
  },
  {
    "con": "Kết quả của đoạn chương trình sau là gì:\n char c;\n int n;\n scanf(“%c%d”,&n,&c);\n Nếu gõ vào: “r 45”.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo.",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Sử dụng vòng lặp for với điều kiện dừng không bao giờ đạt được.",
    "re": "Chương trình sẽ chạy vô hạn"
  },
  {
    "con": "Gọi hàm mà không truyền đủ tham số cần thiết.",
    "re": "Chương trình sẽ báo lỗi biên dịch"
  },
  {
    "con": "Sử dụng toán tử chia cho 0 trong một phép toán.",
    "re": "Chương trình sẽ gây ra lỗi runtime"
  },
  {
    "con": "Khi sử dụng mảng mà chỉ số vượt quá kích thước của nó.",
    "re": "Chương trình có thể truy cập vào vùng nhớ không hợp lệ"
  },
  {
    "con": "Khi sử dụng kiểu dữ liệu không tương thích trong phép toán.",
    "re": "Chương trình sẽ báo lỗi biên dịch"
  },
  {
    "con": "Khi không sử dụng dấu chấm phẩy ở cuối câu lệnh trong ngôn ngữ C.",
    "re": "Chương trình sẽ báo lỗi biên dịch"
  },
  {
    "con": "Khi sử dụng biến toàn cục trong một hàm mà không khai báo lại.",
    "re": "Hàm sẽ sử dụng giá trị của biến toàn cục"
  },
  {
    "con": "Khi không kiểm tra điều kiện đầu vào trước khi xử lý.",
    "re": "Chương trình có thể gặp lỗi hoặc cho kết quả không mong muốn"
  },
  {
    "con": "Cho đoạn chương trình sau:\n #include <stdio.h>\n #include <conio.h>\n void main()\n {char c;clrscr();\n do c=getchar();\n while (c!=’*’);\n getch();};\n Yêu cầu của đoạn chương trình trên là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được sử dụng trong chương trình:",
    "re": "Biến đó sẽ không ảnh hưởng đến kết quả của chương trình"
  },
  {
    "con": "Nếu một hàm không trả về giá trị:",
    "re": "Hàm đó cần được khai báo với kiểu trả về là void"
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp for mà không có điều kiện dừng:",
    "re": "Chương trình sẽ chạy vô hạn và có thể gây treo hệ thống"
  },
  {
    "con": "Nếu bạn không khai báo thư viện cần thiết cho các hàm sử dụng trong chương trình:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Nếu bạn sử dụng toán tử gán '=' thay vì toán tử so sánh '==' trong điều kiện:",
    "re": "Kết quả của điều kiện sẽ không đúng như mong đợi"
  },
  {
    "con": "Nếu bạn không sử dụng dấu chấm phẩy ';' ở cuối câu lệnh trong C:",
    "re": "Trình biên dịch sẽ báo lỗi cú pháp"
  },
  {
    "con": "Nếu bạn gọi một hàm trước khi nó được khai báo:",
    "re": "Trình biên dịch sẽ không nhận diện được hàm đó và báo lỗi"
  },
  {
    "con": "Nếu bạn sử dụng mảng mà không kiểm tra giới hạn của nó:",
    "re": "Có thể xảy ra lỗi tràn bộ nhớ (buffer overflow)"
  },
  {
    "con": "Nếu bạn không sử dụng các comment để giải thích mã nguồn:",
    "re": "Mã nguồn sẽ khó hiểu hơn cho người khác và cả chính bạn trong tương lai"
  },
  {
    "con": "Kết quả của chương trình sau là gì:\n #include <stdio.h>\n void main()\n {printf(“%d”,3<7&&8>6);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo thì giá trị của biến đó là không xác định.",
    "re": "Giá trị không xác định"
  },
  {
    "con": "Nếu một hàm không trả về giá trị thì kiểu trả về của hàm đó phải là void.",
    "re": "Kiểu trả về là void"
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp for mà không có điều kiện dừng, thì chương trình sẽ chạy vô hạn.",
    "re": "Chương trình chạy vô hạn"
  },
  {
    "con": "Nếu bạn sử dụng toán tử == để so sánh hai biến khác kiểu dữ liệu, thì kết quả có thể không chính xác.",
    "re": "Kết quả có thể không chính xác"
  },
  {
    "con": "Nếu bạn không sử dụng dấu chấm phẩy ở cuối câu lệnh trong C, thì sẽ xảy ra lỗi biên dịch.",
    "re": "Sẽ xảy ra lỗi biên dịch"
  },
  {
    "con": "Nếu bạn gọi một hàm trước khi định nghĩa nó, thì bạn cần phải khai báo trước hàm đó.",
    "re": "Cần phải khai báo trước hàm"
  },
  {
    "con": "Nếu bạn sử dụng mảng mà không kiểm tra giới hạn, thì có thể xảy ra lỗi tràn bộ nhớ.",
    "re": "Có thể xảy ra lỗi tràn bộ nhớ"
  },
  {
    "con": "Nếu bạn sử dụng biến toàn cục, thì biến đó có thể được truy cập từ bất kỳ hàm nào trong chương trình.",
    "re": "Có thể truy cập từ bất kỳ hàm nào"
  },
  {
    "con": "Nếu bạn không sử dụng từ khóa return trong hàm có kiểu trả về khác void, thì hành vi của chương trình sẽ không xác định.",
    "re": "Hành vi không xác định"
  },
  {
    "con": "Phép toán 1 ngôi nào dùng để xác định giá trị ở địa chỉ con trỏ trỏ tới:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng chưa được gán giá trị:",
    "re": "Sẽ có giá trị không xác định"
  },
  {
    "con": "Sử dụng vòng lặp để lặp qua các phần tử của mảng:",
    "re": "Giúp tiết kiệm thời gian và công sức lập trình"
  },
  {
    "con": "Khi một hàm được gọi mà không có tham số:",
    "re": "Hàm sẽ sử dụng giá trị mặc định nếu có"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa 'const':",
    "re": "Biến đó không thể được gán giá trị mới"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện 'if':",
    "re": "Chương trình sẽ thực hiện khối lệnh bên trong nếu điều kiện đúng"
  },
  {
    "con": "Khi một mảng được khởi tạo mà không có kích thước xác định:",
    "re": "Mảng sẽ có kích thước bằng 0"
  },
  {
    "con": "Khi một lỗi xảy ra trong chương trình:",
    "re": "Chương trình sẽ dừng lại và thông báo lỗi"
  },
  {
    "con": "Khi sử dụng từ khóa 'return' trong hàm:",
    "re": "Hàm sẽ trả về giá trị và dừng thực thi"
  },
  {
    "con": "Khi một biến toàn cục được sử dụng trong một hàm:",
    "re": "Hàm có thể truy cập và thay đổi giá trị của biến đó"
  },
  {
    "con": "Phép trừ 1 con trỏ với một số nguyên sẽ là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được khởi tạo sẽ có giá trị:",
    "re": "Giá trị không xác định"
  },
  {
    "con": "Nếu một hàm không trả về giá trị, thì kiểu trả về của hàm đó sẽ là:",
    "re": "void"
  },
  {
    "con": "Khi sử dụng vòng lặp for, nếu điều kiện dừng không bao giờ đạt được, thì:",
    "re": "Vòng lặp sẽ chạy vô hạn"
  },
  {
    "con": "Nếu một mảng được khai báo với kích thước n, thì chỉ số hợp lệ của mảng đó sẽ là:",
    "re": "Từ 0 đến n-1"
  },
  {
    "con": "Khi sử dụng toán tử == để so sánh hai biến, nếu chúng có kiểu dữ liệu khác nhau, thì:",
    "re": "Chúng sẽ được chuyển đổi kiểu trước khi so sánh"
  },
  {
    "con": "Nếu một biến toàn cục và một biến cục bộ có cùng tên, thì:",
    "re": "Biến cục bộ sẽ được ưu tiên sử dụng trong phạm vi của nó"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp, thì:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Nếu một hàm được gọi mà không có đủ tham số, thì:",
    "re": "Chương trình có thể gặp lỗi hoặc sử dụng giá trị mặc định"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if-else, nếu điều kiện là đúng, thì:",
    "re": "Khối lệnh trong if sẽ được thực thi"
  },
  {
    "con": "Đâu là kết quả của câu lệnh sau: printf(“%2f”,123.5678908);",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng chưa được gán giá trị.",
    "re": "Giá trị của biến đó sẽ không xác định."
  },
  {
    "con": "Sử dụng vòng lặp for với điều kiện dừng không bao giờ đạt được.",
    "re": "Vòng lặp sẽ chạy vô hạn."
  },
  {
    "con": "Sử dụng toán tử == để so sánh hai chuỗi trong ngôn ngữ lập trình C.",
    "re": "Kết quả so sánh sẽ không chính xác."
  },
  {
    "con": "Khi một hàm không trả về giá trị trong ngôn ngữ lập trình C.",
    "re": "Chương trình có thể gặp lỗi biên dịch."
  },
  {
    "con": "Khi sử dụng mảng mà không kiểm tra kích thước của nó.",
    "re": "Có thể xảy ra lỗi tràn bộ nhớ."
  },
  {
    "con": "Khi sử dụng biến toàn cục trong một hàm.",
    "re": "Biến đó có thể được truy cập và thay đổi từ bất kỳ đâu trong chương trình."
  },
  {
    "con": "Khi không sử dụng dấu chấm phẩy ở cuối câu lệnh trong ngôn ngữ C.",
    "re": "Chương trình sẽ gặp lỗi biên dịch."
  },
  {
    "con": "Khi một hàm được gọi mà không có tham số cần thiết.",
    "re": "Chương trình có thể gặp lỗi hoặc hành vi không mong muốn."
  },
  {
    "con": "Khi sử dụng toán tử ++ trên một biến không được khởi tạo.",
    "re": "Kết quả sẽ không xác định và có thể gây ra lỗi."
  },
  {
    "con": "Một biến được khai báo nhưng không được gán giá trị:",
    "re": "Sẽ có giá trị mặc định tùy thuộc vào kiểu dữ liệu của nó"
  },
  {
    "con": "Khi sử dụng vòng lặp for để lặp qua một mảng:",
    "re": "Cần phải xác định chỉ số bắt đầu và kết thúc của mảng"
  },
  {
    "con": "Nếu một hàm không trả về giá trị:",
    "re": "Nó sẽ trả về giá trị None trong Python hoặc undefined trong JavaScript"
  },
  {
    "con": "Khi sử dụng câu lệnh điều kiện if:",
    "re": "Chỉ những khối lệnh trong điều kiện true mới được thực thi"
  },
  {
    "con": "Nếu một chương trình có lỗi cú pháp:",
    "re": "Chương trình sẽ không biên dịch hoặc chạy được"
  },
  {
    "con": "Khi sử dụng kiểu dữ liệu danh sách (list) trong Python:",
    "re": "Có thể thêm, xóa hoặc sửa đổi các phần tử trong danh sách"
  },
  {
    "con": "Nếu một biến được khai báo với từ khóa const trong JavaScript:",
    "re": "Biến đó không thể được gán lại giá trị mới"
  },
  {
    "con": "Khi gọi một hàm với tham số không đúng số lượng:",
    "re": "Có thể xảy ra lỗi hoặc hàm sẽ sử dụng giá trị mặc định nếu được định nghĩa"
  },
  {
    "con": "Nếu một chương trình sử dụng thư viện bên ngoài:",
    "re": "Cần phải cài đặt và nhập thư viện đó vào chương trình"
  },
  {
    "con": "Khi sử dụng cấu trúc dữ liệu từ điển (dictionary) trong Python:",
    "re": "Có thể truy cập giá trị thông qua khóa (key) tương ứng"
  },
  {
    "con": "Khai báo hàm tìm giá trị lớn nhất trong một màng các số long dưới đây, khai báo nào đúng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp for để lặp qua một mảng, thì bạn cần phải xác định chỉ số bắt đầu và kết thúc của vòng lặp.",
    "re": "Điều này giúp tránh lỗi truy cập ngoài giới hạn mảng."
  },
  {
    "con": "Nếu bạn không khởi tạo biến trước khi sử dụng, thì chương trình có thể gặp lỗi khi chạy.",
    "re": "Điều này dẫn đến việc sử dụng giá trị không xác định."
  },
  {
    "con": "Nếu bạn sử dụng cấu trúc điều kiện if-else, thì bạn có thể kiểm tra nhiều điều kiện khác nhau.",
    "re": "Điều này giúp điều hướng luồng chương trình dựa trên các điều kiện cụ thể."
  },
  {
    "con": "Nếu bạn định nghĩa một hàm, thì bạn cần phải chỉ định kiểu dữ liệu trả về (nếu có).",
    "re": "Điều này giúp người dùng hiểu rõ hơn về giá trị mà hàm sẽ trả về."
  },
  {
    "con": "Nếu bạn sử dụng mảng, thì bạn cần phải biết kích thước của nó trước khi truy cập các phần tử.",
    "re": "Điều này giúp tránh lỗi truy cập ngoài giới hạn mảng."
  },
  {
    "con": "Nếu bạn muốn sử dụng một thư viện bên ngoài, thì bạn cần phải cài đặt và nhập thư viện đó vào chương trình.",
    "re": "Điều này cho phép bạn sử dụng các chức năng bổ sung mà thư viện cung cấp."
  },
  {
    "con": "Nếu bạn sử dụng biến toàn cục, thì bạn cần phải cẩn thận với việc thay đổi giá trị của nó trong các hàm.",
    "re": "Điều này có thể dẫn đến các lỗi khó phát hiện trong chương trình."
  },
  {
    "con": "Nếu bạn muốn xử lý ngoại lệ, thì bạn cần sử dụng cấu trúc try-catch.",
    "re": "Điều này giúp chương trình không bị dừng đột ngột khi gặp lỗi."
  },
  {
    "con": "Nếu bạn muốn tối ưu hóa mã nguồn, thì bạn nên sử dụng các thuật toán và cấu trúc dữ liệu phù hợp.",
    "re": "Điều này giúp cải thiện hiệu suất và giảm thời gian thực thi."
  },
  {
    "con": "Khai báo hàm tính tổng các phần tử trong một mảng các số nguyên dưới đây, khai báo nào đúng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn sử dụng biến mà chưa khai báo trước đó:",
    "re": "Chương trình sẽ báo lỗi"
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp for để lặp qua một mảng:",
    "re": "Bạn có thể truy cập từng phần tử của mảng"
  },
  {
    "con": "Nếu bạn không sử dụng dấu chấm phẩy ở cuối câu lệnh trong ngôn ngữ lập trình C:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Nếu bạn khai báo một biến với từ khóa const:",
    "re": "Biến đó sẽ không thể thay đổi giá trị sau khi được gán"
  },
  {
    "con": "Nếu bạn sử dụng hàm để tổ chức mã nguồn:",
    "re": "Mã nguồn sẽ trở nên dễ đọc và bảo trì hơn"
  },
  {
    "con": "Nếu bạn không xử lý ngoại lệ trong chương trình:",
    "re": "Chương trình có thể dừng đột ngột khi gặp lỗi"
  },
  {
    "con": "Nếu bạn sử dụng cấu trúc điều kiện if-else:",
    "re": "Bạn có thể thực hiện các hành động khác nhau dựa trên điều kiện"
  },
  {
    "con": "Nếu bạn không sử dụng đúng kiểu dữ liệu cho biến:",
    "re": "Chương trình có thể gặp lỗi khi thực hiện các phép toán"
  },
  {
    "con": "Nếu bạn sử dụng comment trong mã nguồn:",
    "re": "Bạn có thể giải thích mã cho người khác hoặc cho chính mình sau này"
  },
  {
    "con": "Để khai báo 1 hàm kiểm tra một mảng là tăng hay không ta dùng khai báo nào dưới đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn muốn in ra một chuỗi trong Python, bạn cần sử dụng hàm nào?",
    "re": "Hàm print()"
  },
  {
    "con": "Nếu bạn muốn tạo một vòng lặp lặp qua từng phần tử trong một danh sách, bạn nên sử dụng cấu trúc nào?",
    "re": "Vòng lặp for"
  },
  {
    "con": "Nếu bạn muốn kiểm tra một điều kiện trong chương trình, bạn cần sử dụng cấu trúc nào?",
    "re": "Câu lệnh if"
  },
  {
    "con": "Nếu bạn muốn lưu trữ nhiều giá trị trong một biến, bạn nên sử dụng kiểu dữ liệu nào?",
    "re": "Danh sách (list) hoặc mảng (array)"
  },
  {
    "con": "Nếu bạn muốn định nghĩa một hàm trong JavaScript, bạn cần sử dụng từ khóa nào?",
    "re": "Từ khóa function"
  },
  {
    "con": "Nếu bạn muốn xử lý ngoại lệ trong Python, bạn cần sử dụng cấu trúc nào?",
    "re": "Câu lệnh try-except"
  },
  {
    "con": "Nếu bạn muốn tạo một đối tượng trong lập trình hướng đối tượng, bạn cần sử dụng từ khóa nào?",
    "re": "Từ khóa class"
  },
  {
    "con": "Nếu bạn muốn nhập dữ liệu từ người dùng trong Python, bạn cần sử dụng hàm nào?",
    "re": "Hàm input()"
  },
  {
    "con": "Nếu bạn muốn so sánh hai giá trị trong một điều kiện, bạn cần sử dụng toán tử nào?",
    "re": "Toán tử so sánh (==, !=, >, <, >=, <=)"
  },
  {
    "con": "Đoạn code nào sẽ hoán vị 2 số a và b:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được sử dụng:",
    "re": "Sẽ gây ra cảnh báo trong một số trình biên dịch"
  },
  {
    "con": "Sử dụng vòng lặp để lặp qua một mảng:",
    "re": "Sẽ giúp truy cập từng phần tử trong mảng một cách hiệu quả"
  },
  {
    "con": "Khi một hàm không trả về giá trị:",
    "re": "Nó sẽ trả về giá trị mặc định là null hoặc undefined trong nhiều ngôn ngữ lập trình"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện if-else:",
    "re": "Sẽ cho phép thực hiện các đoạn mã khác nhau dựa trên điều kiện đã cho"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa const:",
    "re": "Giá trị của biến đó không thể thay đổi sau khi đã được gán"
  },
  {
    "con": "Sử dụng hàm để tổ chức mã:",
    "re": "Sẽ giúp mã dễ đọc và bảo trì hơn"
  },
  {
    "con": "Khi một mảng được khởi tạo mà không có phần tử:",
    "re": "Nó sẽ có độ dài bằng 0"
  },
  {
    "con": "Sử dụng toán tử == để so sánh:",
    "re": "Có thể dẫn đến kết quả không chính xác do so sánh kiểu dữ liệu khác nhau"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Nó sẽ không biên dịch thành công và không thể chạy"
  },
  {
    "con": "Các kí hiệu đặc trưng cho sự tác động lên dữ liệu được gọi là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo mà không được gán giá trị sẽ có giá trị mặc định là:",
    "re": "null hoặc undefined (tùy thuộc vào ngôn ngữ lập trình)"
  },
  {
    "con": "Khi một hàm được gọi mà không có tham số, thì:",
    "re": "Hàm vẫn có thể thực thi mà không gặp lỗi"
  },
  {
    "con": "Cấu trúc điều kiện 'if' được sử dụng để:",
    "re": "Kiểm tra một điều kiện và thực hiện mã lệnh tương ứng"
  },
  {
    "con": "Một vòng lặp 'for' thường được sử dụng để:",
    "re": "Lặp qua một tập hợp các giá trị hoặc thực hiện một hành động nhiều lần"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa 'const', thì:",
    "re": "Biến đó không thể được gán giá trị mới sau khi đã được khởi tạo"
  },
  {
    "con": "Trong lập trình hướng đối tượng, một lớp (class) được sử dụng để:",
    "re": "Định nghĩa một kiểu dữ liệu mới với các thuộc tính và phương thức"
  },
  {
    "con": "Khi sử dụng mảng, chỉ số bắt đầu thường là:",
    "re": "0 trong hầu hết các ngôn ngữ lập trình"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp, thì:",
    "re": "Chương trình sẽ không biên dịch hoặc chạy cho đến khi lỗi được sửa"
  },
  {
    "con": "Khi sử dụng toán tử '==' trong so sánh, thì:",
    "re": "Nó so sánh giá trị của hai biến mà không kiểm tra kiểu dữ liệu"
  },
  {
    "con": "Kích thước của biến con trỏ là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo:",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Sử dụng vòng lặp để lặp qua một mảng:",
    "re": "Có thể truy cập từng phần tử của mảng một cách tuần tự"
  },
  {
    "con": "Một hàm không trả về giá trị:",
    "re": "Được gọi là hàm void"
  },
  {
    "con": "Sử dụng toán tử so sánh trong điều kiện:",
    "re": "Kết quả sẽ là true hoặc false"
  },
  {
    "con": "Khi một biến được khai báo là hằng số:",
    "re": "Giá trị của biến đó không thể thay đổi trong suốt chương trình"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện if-else:",
    "re": "Cho phép thực hiện các đoạn mã khác nhau dựa trên điều kiện"
  },
  {
    "con": "Khi một mảng được truyền vào hàm:",
    "re": "Hàm có thể thay đổi nội dung của mảng đó"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua số lần xác định:",
    "re": "Giúp tối ưu hóa mã và giảm thiểu lỗi"
  },
  {
    "con": "Khi sử dụng biến toàn cục:",
    "re": "Biến đó có thể được truy cập từ bất kỳ đâu trong chương trình"
  },
  {
    "con": "Biến được khai báo nhưng chưa được gán giá trị",
    "re": "Giá trị của biến sẽ là undefined"
  },
  {
    "con": "Sử dụng toán tử == để so sánh hai giá trị khác kiểu dữ liệu",
    "re": "Kết quả có thể không chính xác do phép chuyển đổi kiểu dữ liệu"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng",
    "re": "Có thể truy cập từng phần tử của mảng theo chỉ số"
  },
  {
    "con": "Gọi một hàm chưa được định nghĩa",
    "re": "Sẽ gây ra lỗi và chương trình sẽ dừng lại"
  },
  {
    "con": "Sử dụng toán tử && trong một biểu thức điều kiện",
    "re": "Biểu thức sẽ trả về true chỉ khi tất cả các điều kiện đều đúng"
  },
  {
    "con": "Khai báo một hàm với tham số mặc định",
    "re": "Có thể gọi hàm mà không cần truyền tham số, tham số sẽ nhận giá trị mặc định"
  },
  {
    "con": "Sử dụng mảng để lưu trữ nhiều giá trị",
    "re": "Có thể truy cập và thao tác với các giá trị trong mảng bằng chỉ số"
  },
  {
    "con": "Sử dụng câu lệnh điều kiện if-else",
    "re": "Chương trình sẽ thực hiện khối lệnh tương ứng với điều kiện đúng"
  },
  {
    "con": "Sử dụng toán tử ++ để tăng giá trị của biến",
    "re": "Giá trị của biến sẽ tăng thêm 1"
  },
  {
    "con": "Sử dụng câu lệnh return trong một hàm",
    "re": "Hàm sẽ trả về giá trị được chỉ định và dừng thực thi"
  },
  {
    "con": "Cho biết giá trị của biểu thức: 2+4>2&&4<2;",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Giá trị lôgic của biểu thức sau là gì: !(1&&1||1&&0);",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được gán giá trị sẽ có giá trị mặc định là null trong JavaScript.",
    "re": "Giá trị của biến là null"
  },
  {
    "con": "Nếu một hàm không trả về giá trị, thì giá trị trả về của hàm đó sẽ là undefined trong JavaScript.",
    "re": "Giá trị trả về là undefined"
  },
  {
    "con": "Khi sử dụng vòng lặp for, nếu điều kiện dừng không bao giờ được thỏa mãn, thì vòng lặp sẽ chạy vô hạn.",
    "re": "Vòng lặp chạy vô hạn"
  },
  {
    "con": "Nếu một mảng được khai báo nhưng không có phần tử nào, thì độ dài của mảng đó sẽ là 0.",
    "re": "Độ dài của mảng là 0"
  },
  {
    "con": "Khi sử dụng toán tử + với một chuỗi và một số, thì số sẽ được chuyển đổi thành chuỗi trước khi thực hiện phép cộng.",
    "re": "Kết quả là một chuỗi"
  },
  {
    "con": "Nếu một biến được khai báo với từ khóa const, thì biến đó không thể được gán lại giá trị.",
    "re": "Biến không thể gán lại giá trị"
  },
  {
    "con": "Khi một hàm được gọi mà không có đối số, thì các tham số của hàm đó sẽ có giá trị là undefined.",
    "re": "Tham số có giá trị là undefined"
  },
  {
    "con": "Nếu một đối tượng không có thuộc tính mà bạn đang cố gắng truy cập, thì giá trị trả về sẽ là undefined.",
    "re": "Giá trị trả về là undefined"
  },
  {
    "con": "Khi sử dụng toán tử ===, nếu hai giá trị có kiểu dữ liệu khác nhau, thì kết quả sẽ là false.",
    "re": "Kết quả là false"
  },
  {
    "con": "Chọn biểu thức biểu diễn num là số nằm giữa 1 và 9 nhưng không phải là 4:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sử dụng vòng lặp để lặp qua từng phần tử trong mảng:",
    "re": "Có thể truy cập và xử lý từng phần tử một cách hiệu quả"
  },
  {
    "con": "Khi khai báo một biến mà không gán giá trị:",
    "re": "Biến đó sẽ có giá trị undefined trong JavaScript"
  },
  {
    "con": "Sử dụng hàm để tổ chức mã nguồn thành các khối chức năng:",
    "re": "Giúp mã nguồn dễ đọc và bảo trì hơn"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if-else:",
    "re": "Chương trình sẽ thực hiện một trong hai nhánh dựa trên điều kiện đã cho"
  },
  {
    "con": "Khi gọi một hàm mà không truyền tham số:",
    "re": "Hàm sẽ sử dụng giá trị mặc định cho các tham số nếu có"
  },
  {
    "con": "Khi sử dụng toán tử so sánh === trong JavaScript:",
    "re": "So sánh cả giá trị và kiểu dữ liệu của hai biến"
  },
  {
    "con": "Khi tạo một đối tượng trong lập trình hướng đối tượng:",
    "re": "Có thể sử dụng các thuộc tính và phương thức để tương tác với đối tượng đó"
  },
  {
    "con": "Khi sử dụng mảng để lưu trữ danh sách các giá trị:",
    "re": "Có thể truy cập các giá trị bằng chỉ số của chúng"
  },
  {
    "con": "Khi xử lý ngoại lệ bằng try-catch:",
    "re": "Có thể ngăn chặn chương trình bị dừng lại khi xảy ra lỗi"
  },
  {
    "con": "Tại sao hai hàm scanf() và printf() gọi là 2 hàm nhập, xuất có định dạng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được khởi tạo:",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Khi sử dụng vòng lặp for, điều kiện dừng không được xác định:",
    "re": "Vòng lặp sẽ chạy vô hạn"
  },
  {
    "con": "Một hàm không trả về giá trị:",
    "re": "Hàm đó được gọi là hàm void"
  },
  {
    "con": "Khi sử dụng toán tử == để so sánh hai biến khác kiểu dữ liệu:",
    "re": "Kết quả so sánh có thể không chính xác"
  },
  {
    "con": "Khi một mảng được truyền vào hàm:",
    "re": "Hàm nhận địa chỉ của mảng, không phải bản sao"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if mà không có else:",
    "re": "Chương trình sẽ chỉ thực hiện khối lệnh if nếu điều kiện đúng"
  },
  {
    "con": "Khi một chương trình không có hàm main():",
    "re": "Chương trình sẽ không thể biên dịch và chạy"
  },
  {
    "con": "Khi một biến toàn cục và biến cục bộ có cùng tên:",
    "re": "Biến cục bộ sẽ che khuất biến toàn cục trong phạm vi của nó"
  },
  {
    "con": "Khi sử dụng toán tử ++ trước biến:",
    "re": "Biến sẽ được tăng giá trị trước khi sử dụng trong biểu thức"
  },
  {
    "con": "biến được khai báo nhưng không được khởi tạo",
    "re": "giá trị của biến sẽ không xác định"
  },
  {
    "con": "sử dụng vòng lặp for với điều kiện dừng đúng",
    "re": "vòng lặp sẽ thực hiện đúng số lần mong muốn"
  },
  {
    "con": "gọi hàm mà không truyền đủ tham số",
    "re": "hàm sẽ gây ra lỗi hoặc sử dụng giá trị mặc định"
  },
  {
    "con": "sử dụng toán tử == để so sánh hai biến",
    "re": "kết quả sẽ là true nếu hai biến có giá trị bằng nhau"
  },
  {
    "con": "sử dụng mảng mà không kiểm tra chỉ số",
    "re": "có thể gây ra lỗi truy cập ngoài giới hạn mảng"
  },
  {
    "con": "sử dụng cấu trúc điều kiện if với điều kiện đúng",
    "re": "khối lệnh bên trong if sẽ được thực thi"
  },
  {
    "con": "khai báo một hàm mà không có giá trị trả về",
    "re": "hàm sẽ trả về giá trị mặc định là null hoặc undefined"
  },
  {
    "con": "sử dụng biến toàn cục trong hàm",
    "re": "hàm có thể truy cập và thay đổi giá trị của biến toàn cục"
  },
  {
    "con": "sử dụng toán tử ++ trên biến số nguyên",
    "re": "giá trị của biến sẽ tăng thêm 1"
  },
  {
    "con": "sử dụng câu lệnh return trong hàm",
    "re": "hàm sẽ kết thúc và trả về giá trị đã chỉ định"
  },
  {
    "con": "Chọn một phát biểu sai:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo mà không được khởi tạo:",
    "re": "Giá trị của biến sẽ không xác định"
  },
  {
    "con": "Sử dụng vòng lặp để lặp lại một đoạn mã:",
    "re": "Giúp tiết kiệm thời gian và giảm thiểu lỗi"
  },
  {
    "con": "Sử dụng hàm để tổ chức mã:",
    "re": "Giúp mã dễ đọc và bảo trì hơn"
  },
  {
    "con": "Chọn kiểu dữ liệu không phù hợp:",
    "re": "Có thể gây ra lỗi khi thực thi chương trình"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện để kiểm tra điều kiện:",
    "re": "Cho phép chương trình thực hiện các hành động khác nhau"
  },
  {
    "con": "Không xử lý ngoại lệ trong mã:",
    "re": "Có thể dẫn đến việc chương trình dừng đột ngột"
  },
  {
    "con": "Sử dụng comment trong mã:",
    "re": "Giúp người khác hiểu rõ hơn về chức năng của mã"
  },
  {
    "con": "Tối ưu hóa mã không cần thiết:",
    "re": "Có thể làm cho mã trở nên phức tạp và khó hiểu"
  },
  {
    "con": "Thực hiện kiểm tra đầu vào từ người dùng:",
    "re": "Giúp bảo vệ chương trình khỏi các lỗi và tấn công"
  },
  {
    "con": "Các định dạng nào sau đây có thể sử dụng để xuất số nguyên không dấu:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng chưa được gán giá trị:",
    "re": "Có thể gây ra lỗi khi sử dụng"
  },
  {
    "con": "Một hàm được định nghĩa nhưng không được gọi:",
    "re": "Sẽ không thực thi mã bên trong hàm đó"
  },
  {
    "con": "Sử dụng vòng lặp để lặp qua một danh sách:",
    "re": "Có thể truy cập từng phần tử trong danh sách"
  },
  {
    "con": "Khi sử dụng toán tử so sánh trong điều kiện:",
    "re": "Kết quả sẽ là true hoặc false"
  },
  {
    "con": "Một chương trình không có lỗi cú pháp:",
    "re": "Có thể biên dịch và chạy thành công"
  },
  {
    "con": "Sử dụng biến toàn cục trong một hàm:",
    "re": "Có thể truy cập và thay đổi giá trị của biến đó"
  },
  {
    "con": "Khi sử dụng mảng:",
    "re": "Có thể lưu trữ nhiều giá trị cùng loại trong một biến"
  },
  {
    "con": "Khi gọi một hàm với tham số không đúng loại:",
    "re": "Có thể gây ra lỗi hoặc hành vi không mong muốn"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện để kiểm tra giá trị:",
    "re": "Có thể thực hiện các hành động khác nhau dựa trên điều kiện"
  },
  {
    "con": "Định dạng nào dưới đây dùng để hiển thị một số thực:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được gán giá trị:",
    "re": "Sẽ có giá trị mặc định tùy thuộc vào kiểu dữ liệu"
  },
  {
    "con": "Một hàm không trả về giá trị:",
    "re": "Sẽ trả về giá trị None (hoặc tương đương) trong nhiều ngôn ngữ lập trình"
  },
  {
    "con": "Sử dụng vòng lặp để lặp qua một danh sách:",
    "re": "Sẽ giúp tiết kiệm thời gian và công sức khi xử lý dữ liệu"
  },
  {
    "con": "Khi sử dụng toán tử so sánh trong điều kiện:",
    "re": "Kết quả sẽ là true hoặc false"
  },
  {
    "con": "Một chương trình không có lỗi cú pháp:",
    "re": "Có thể biên dịch và chạy mà không gặp vấn đề"
  },
  {
    "con": "Sử dụng comment trong mã nguồn:",
    "re": "Giúp người đọc hiểu rõ hơn về chức năng của đoạn mã"
  },
  {
    "con": "Khi gọi một hàm với tham số không đúng loại:",
    "re": "Sẽ gây ra lỗi trong quá trình thực thi"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện if-else:",
    "re": "Cho phép thực hiện các nhánh khác nhau dựa trên điều kiện"
  },
  {
    "con": "Khi một biến được khai báo trong một hàm:",
    "re": "Chỉ có thể được truy cập trong phạm vi của hàm đó"
  },
  {
    "con": "Biến được khai báo và khởi tạo:",
    "re": "Có thể lưu trữ giá trị và sử dụng trong chương trình"
  },
  {
    "con": "Cú pháp của một ngôn ngữ lập trình được tuân thủ:",
    "re": "Chương trình sẽ biên dịch hoặc chạy mà không gặp lỗi"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện như if-else:",
    "re": "Cho phép chương trình thực hiện các nhánh khác nhau dựa trên điều kiện"
  },
  {
    "con": "Sử dụng vòng lặp như for hoặc while:",
    "re": "Cho phép thực hiện một đoạn mã nhiều lần cho đến khi điều kiện không còn đúng"
  },
  {
    "con": "Hàm được định nghĩa và gọi đúng cách:",
    "re": "Có thể tái sử dụng mã và tổ chức chương trình tốt hơn"
  },
  {
    "con": "Sử dụng kiểu dữ liệu phù hợp:",
    "re": "Giúp chương trình hoạt động hiệu quả và tránh lỗi"
  },
  {
    "con": "Sử dụng các thư viện và API:",
    "re": "Có thể mở rộng chức năng của chương trình mà không cần viết mã từ đầu"
  },
  {
    "con": "Xử lý ngoại lệ được thực hiện:",
    "re": "Chương trình có thể xử lý lỗi mà không bị dừng đột ngột"
  },
  {
    "con": "Tài liệu mã nguồn được viết rõ ràng:",
    "re": "Giúp người khác (hoặc chính bạn sau này) hiểu và duy trì mã dễ dàng hơn"
  },
  {
    "con": "Kiểm tra và gỡ lỗi mã thường xuyên:",
    "re": "Giúp phát hiện và sửa lỗi kịp thời, nâng cao chất lượng chương trình"
  },
  {
    "con": "Một biến phải bắt đầu với:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một hàm cần được định nghĩa trước khi được gọi:",
    "re": "Hàm sẽ không được thực thi nếu chưa được định nghĩa"
  },
  {
    "con": "Một câu lệnh điều kiện phải có điều kiện đúng hoặc sai:",
    "re": "Câu lệnh sẽ không thực hiện đúng nếu điều kiện không được xác định"
  },
  {
    "con": "Một vòng lặp cần có điều kiện dừng:",
    "re": "Vòng lặp sẽ chạy vô hạn nếu không có điều kiện dừng"
  },
  {
    "con": "Một mảng cần được khởi tạo trước khi sử dụng:",
    "re": "Sẽ xảy ra lỗi nếu cố gắng truy cập vào mảng chưa được khởi tạo"
  },
  {
    "con": "Một biến toàn cục có thể được truy cập từ bất kỳ đâu trong chương trình:",
    "re": "Biến sẽ không bị giới hạn trong phạm vi của hàm nếu là biến toàn cục"
  },
  {
    "con": "Một biến cục bộ chỉ có thể được truy cập trong hàm mà nó được định nghĩa:",
    "re": "Biến sẽ không khả dụng bên ngoài hàm nếu là biến cục bộ"
  },
  {
    "con": "Một ngôn ngữ lập trình có cú pháp riêng:",
    "re": "Cú pháp sai sẽ dẫn đến lỗi biên dịch hoặc lỗi thực thi"
  },
  {
    "con": "Một chương trình cần có điểm vào chính (main function):",
    "re": "Chương trình sẽ không chạy nếu không có hàm chính"
  },
  {
    "con": "Một kiểu dữ liệu phải được xác định trước khi sử dụng:",
    "re": "Sẽ xảy ra lỗi nếu kiểu dữ liệu không được xác định"
  },
  {
    "con": "Mảng là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo mà không được gán giá trị:",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Sử dụng vòng lặp để lặp qua các phần tử trong mảng:",
    "re": "Có thể truy cập và xử lý từng phần tử một cách tuần tự"
  },
  {
    "con": "Hàm được định nghĩa với tham số:",
    "re": "Có thể nhận giá trị đầu vào và thực hiện các thao tác dựa trên giá trị đó"
  },
  {
    "con": "Câu lệnh điều kiện (if) được sử dụng:",
    "re": "Cho phép thực hiện các đoạn mã khác nhau dựa trên điều kiện đúng hoặc sai"
  },
  {
    "con": "Sử dụng kiểu dữ liệu số nguyên:",
    "re": "Có thể thực hiện các phép toán số học như cộng, trừ, nhân, chia"
  },
  {
    "con": "Sử dụng kiểu dữ liệu chuỗi:",
    "re": "Có thể thực hiện các thao tác như nối, cắt và tìm kiếm trong chuỗi"
  },
  {
    "con": "Sử dụng cấu trúc dữ liệu danh sách:",
    "re": "Có thể lưu trữ và quản lý một tập hợp các phần tử có thể thay đổi"
  },
  {
    "con": "Sử dụng các thư viện lập trình:",
    "re": "Có thể tận dụng các chức năng đã được phát triển sẵn để tiết kiệm thời gian và công sức"
  },
  {
    "con": "Sử dụng các công cụ gỡ lỗi:",
    "re": "Có thể phát hiện và sửa lỗi trong mã nguồn một cách hiệu quả hơn"
  },
  {
    "con": "Kích thước của mảng là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo:",
    "re": "Giá trị của biến sẽ không xác định"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng:",
    "re": "Có thể truy cập từng phần tử của mảng"
  },
  {
    "con": "Một hàm không trả về giá trị:",
    "re": "Sẽ trả về giá trị mặc định là null hoặc undefined"
  },
  {
    "con": "Sử dụng toán tử so sánh ===:",
    "re": "So sánh cả giá trị và kiểu dữ liệu"
  },
  {
    "con": "Khi một biến được khai báo bằng từ khóa const:",
    "re": "Biến đó không thể được gán lại giá trị"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện if:",
    "re": "Cho phép thực hiện các đoạn mã khác nhau dựa trên điều kiện"
  },
  {
    "con": "Khi một hàm được gọi mà không có tham số:",
    "re": "Các tham số sẽ nhận giá trị mặc định là undefined"
  },
  {
    "con": "Sử dụng mảng để lưu trữ danh sách các giá trị:",
    "re": "Có thể dễ dàng truy cập và thao tác với các giá trị đó"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Chương trình sẽ không thể biên dịch hoặc chạy"
  },
  {
    "con": "Đâu là phát biểu đúng nhất về biến động:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo mà không được gán giá trị:",
    "re": "Biến đó sẽ có giá trị mặc định tùy thuộc vào kiểu dữ liệu"
  },
  {
    "con": "Một hàm được định nghĩa nhưng không được gọi:",
    "re": "Hàm đó sẽ không được thực thi"
  },
  {
    "con": "Một vòng lặp không có điều kiện dừng:",
    "re": "Vòng lặp đó sẽ chạy vô hạn"
  },
  {
    "con": "Một mảng được khai báo với kích thước cố định:",
    "re": "Kích thước của mảng không thể thay đổi trong quá trình thực thi"
  },
  {
    "con": "Một câu lệnh điều kiện không đúng:",
    "re": "Câu lệnh trong khối điều kiện đó sẽ không được thực thi"
  },
  {
    "con": "Một biến toàn cục được khai báo trong một hàm:",
    "re": "Biến đó sẽ không thể truy cập bên ngoài hàm"
  },
  {
    "con": "Một ngôn ngữ lập trình không hỗ trợ lập trình hướng đối tượng:",
    "re": "Ngôn ngữ đó sẽ không có các khái niệm như lớp và đối tượng"
  },
  {
    "con": "Một chương trình không có lỗi cú pháp:",
    "re": "Chương trình đó có thể biên dịch thành công"
  },
  {
    "con": "Một biến được khai báo với từ khóa 'const':",
    "re": "Biến đó không thể được gán giá trị mới sau khi đã được khởi tạo"
  },
  {
    "con": "Biến được khai báo mà không được khởi tạo giá trị:",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Sử dụng vòng lặp mà không có điều kiện dừng:",
    "re": "Chương trình sẽ bị treo hoặc chạy vô hạn"
  },
  {
    "con": "Gọi hàm mà không truyền đủ tham số:",
    "re": "Chương trình sẽ báo lỗi hoặc sử dụng giá trị mặc định"
  },
  {
    "con": "Sử dụng toán tử so sánh để kiểm tra giá trị:",
    "re": "Kết quả sẽ là true hoặc false"
  },
  {
    "con": "Khi sử dụng mảng mà không kiểm tra chỉ số:",
    "re": "Có thể gây ra lỗi truy cập ngoài giới hạn"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện mà không có nhánh else:",
    "re": "Chương trình sẽ không thực hiện hành động nào nếu điều kiện sai"
  },
  {
    "con": "Khi không sử dụng comment trong mã nguồn:",
    "re": "Mã sẽ khó hiểu và bảo trì hơn"
  },
  {
    "con": "Khi sử dụng thư viện mà không import đúng cách:",
    "re": "Chương trình sẽ không nhận diện được các hàm trong thư viện đó"
  },
  {
    "con": "Khi không xử lý ngoại lệ trong chương trình:",
    "re": "Chương trình có thể dừng đột ngột khi gặp lỗi"
  },
  {
    "con": "Khi sử dụng kiểu dữ liệu không tương thích:",
    "re": "Chương trình sẽ báo lỗi biên dịch hoặc lỗi chạy"
  },
  {
    "con": "Khai báo hàm đọc một text file vào một mảng các số nguyên, hãy chọn khai báo đúng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sử dụng vòng lặp để lặp qua từng phần tử trong mảng, hãy đảm bảo rằng bạn không vượt quá chỉ số của mảng:",
    "re": "Chương trình sẽ không gặp lỗi truy cập ngoài phạm vi"
  },
  {
    "con": "Khi sử dụng biến trong một hàm, hãy chắc chắn rằng biến đó đã được khai báo trước khi sử dụng:",
    "re": "Chương trình sẽ không gặp lỗi biến chưa được khai báo"
  },
  {
    "con": "Nếu bạn muốn kiểm tra điều kiện trong một câu lệnh if, hãy đảm bảo rằng điều kiện đó trả về giá trị boolean:",
    "re": "Câu lệnh if sẽ hoạt động chính xác"
  },
  {
    "con": "Khi sử dụng các cấu trúc dữ liệu như danh sách hoặc từ điển, hãy chọn phương pháp phù hợp để thêm hoặc xóa phần tử:",
    "re": "Cấu trúc dữ liệu sẽ được cập nhật chính xác"
  },
  {
    "con": "Nếu bạn muốn xử lý ngoại lệ trong chương trình, hãy sử dụng khối try-catch:",
    "re": "Chương trình sẽ không bị dừng đột ngột khi gặp lỗi"
  },
  {
    "con": "Khi viết mã, nếu bạn sử dụng các hàm, hãy đảm bảo rằng bạn đã truyền đúng số lượng tham số cần thiết:",
    "re": "Hàm sẽ được thực thi mà không gặp lỗi"
  },
  {
    "con": "Nếu bạn muốn tối ưu hóa hiệu suất của chương trình, hãy tránh sử dụng vòng lặp lồng nhau khi không cần thiết:",
    "re": "Chương trình sẽ chạy nhanh hơn"
  },
  {
    "con": "Khi làm việc với chuỗi, nếu bạn muốn nối hai chuỗi lại với nhau, hãy sử dụng toán tử nối chuỗi:",
    "re": "Kết quả sẽ là một chuỗi mới được tạo ra"
  },
  {
    "con": "Nếu bạn muốn tổ chức mã nguồn của mình một cách hợp lý, hãy chia mã thành các hàm và lớp:",
    "re": "Mã sẽ dễ đọc và bảo trì hơn"
  },
  {
    "con": "Giả sử f là con trỏ tệp nhị phân. Để đọc từ f cho biến x kiểu int, ta có thể dùng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn muốn in ra một chuỗi trong Python, bạn có thể sử dụng hàm:",
    "re": "print()"
  },
  {
    "con": "Nếu bạn khai báo một biến mà không gán giá trị cho nó, thì biến đó sẽ có giá trị:",
    "re": "None (hoặc giá trị mặc định tùy thuộc vào ngôn ngữ lập trình)"
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp for để duyệt qua một danh sách, thì bạn có thể truy cập từng phần tử của danh sách bằng:",
    "re": "cú pháp for item in list"
  },
  {
    "con": "Nếu bạn muốn kiểm tra điều kiện trong một câu lệnh if, thì bạn cần sử dụng:",
    "re": "các toán tử so sánh như ==, !=, >, <, >=, và <="
  },
  {
    "con": "Nếu bạn định nghĩa một hàm trong Python, thì bạn cần sử dụng từ khóa:",
    "re": "def"
  },
  {
    "con": "Nếu bạn muốn xử lý ngoại lệ trong Python, bạn có thể sử dụng khối:",
    "re": "try-except"
  },
  {
    "con": "Nếu bạn muốn tạo một mảng trong Java, bạn có thể sử dụng cú pháp:",
    "re": "new Type[size]"
  },
  {
    "con": "Nếu bạn muốn đọc dữ liệu từ bàn phím trong C, bạn có thể sử dụng hàm:",
    "re": "scanf()"
  },
  {
    "con": "Nếu bạn muốn tạo một đối tượng trong Java, bạn cần sử dụng từ khóa:",
    "re": "new"
  },
  {
    "con": "Chọn câu đúng nhất trong các câu sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo và khởi tạo trước khi sử dụng:",
    "re": "Chương trình sẽ không gặp lỗi khi chạy"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện đúng cách:",
    "re": "Chương trình sẽ thực hiện các nhánh khác nhau dựa trên điều kiện"
  },
  {
    "con": "Sử dụng vòng lặp để lặp lại một đoạn mã:",
    "re": "Giúp tiết kiệm thời gian và công sức viết mã"
  },
  {
    "con": "Khi sử dụng hàm, cần phải truyền đúng số lượng tham số:",
    "re": "Hàm sẽ hoạt động chính xác và trả về kết quả mong muốn"
  },
  {
    "con": "Sử dụng kiểu dữ liệu phù hợp cho biến:",
    "re": "Giúp chương trình hoạt động hiệu quả và tránh lỗi"
  },
  {
    "con": "Thực hiện kiểm tra lỗi trong mã nguồn:",
    "re": "Giúp phát hiện và sửa chữa lỗi trước khi chạy chương trình"
  },
  {
    "con": "Sử dụng chú thích trong mã nguồn:",
    "re": "Giúp người khác (hoặc chính bạn sau này) hiểu rõ hơn về mã"
  },
  {
    "con": "Tổ chức mã nguồn thành các hàm và lớp:",
    "re": "Giúp mã dễ đọc, bảo trì và tái sử dụng hơn"
  },
  {
    "con": "Thực hiện kiểm thử đơn vị cho các hàm:",
    "re": "Giúp đảm bảo rằng từng phần của mã hoạt động đúng"
  },
  {
    "con": "Hàm nào dưới đây chỉ dùng để đọc 1 kí tự từ tệp:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được gán giá trị:",
    "re": "Sẽ có giá trị mặc định là null hoặc undefined (tùy thuộc vào ngôn ngữ lập trình)"
  },
  {
    "con": "Một vòng lặp for được sử dụng để lặp qua một mảng:",
    "re": "Sẽ thực hiện các thao tác trên từng phần tử của mảng đó"
  },
  {
    "con": "Hàm có tham số mặc định được gọi mà không truyền tham số:",
    "re": "Sẽ sử dụng giá trị mặc định cho tham số đó"
  },
  {
    "con": "Một hàm được định nghĩa nhưng không được gọi:",
    "re": "Sẽ không thực hiện bất kỳ thao tác nào"
  },
  {
    "con": "Một điều kiện trong câu lệnh if là đúng:",
    "re": "Câu lệnh trong khối if sẽ được thực thi"
  },
  {
    "con": "Một biến toàn cục được khai báo trong một hàm:",
    "re": "Sẽ không thể truy cập từ bên ngoài hàm đó"
  },
  {
    "con": "Một mảng được khởi tạo với các giá trị:",
    "re": "Có thể truy cập từng phần tử thông qua chỉ số của nó"
  },
  {
    "con": "Một đối tượng được tạo ra từ lớp (class):",
    "re": "Sẽ có thể sử dụng các thuộc tính và phương thức của lớp đó"
  },
  {
    "con": "Một chuỗi được nối với một chuỗi khác:",
    "re": "Sẽ tạo ra một chuỗi mới với nội dung kết hợp của cả hai chuỗi"
  },
  {
    "con": "Hàm nào dưới đây chỉ dùng để nhập dữ liệu từ tệp:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được sử dụng:",
    "re": "Sẽ gây ra cảnh báo trong quá trình biên dịch"
  },
  {
    "con": "Sử dụng vòng lặp để lặp qua một danh sách:",
    "re": "Giúp tiết kiệm thời gian và công sức trong việc xử lý dữ liệu"
  },
  {
    "con": "Khi một hàm không trả về giá trị:",
    "re": "Hàm đó sẽ trả về giá trị None trong Python"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện để kiểm tra một điều kiện:",
    "re": "Cho phép chương trình thực hiện các hành động khác nhau dựa trên kết quả của điều kiện"
  },
  {
    "con": "Khi một biến được khai báo là hằng số:",
    "re": "Giá trị của biến đó không thể thay đổi trong suốt quá trình thực thi chương trình"
  },
  {
    "con": "Sử dụng comment trong mã nguồn:",
    "re": "Giúp người đọc hiểu rõ hơn về chức năng của đoạn mã"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Chương trình sẽ không thể biên dịch và chạy"
  },
  {
    "con": "Sử dụng thư viện bên ngoài trong lập trình:",
    "re": "Giúp mở rộng khả năng của chương trình mà không cần phải viết lại mã từ đầu"
  },
  {
    "con": "Khi một biến được khai báo trong một hàm:",
    "re": "Biến đó chỉ có thể được truy cập trong phạm vi của hàm đó"
  },
  {
    "con": "Hàm nào dưới đây chỉ dùng để ghi một kí tự vào tệp:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được gán giá trị:",
    "re": "Sẽ có giá trị mặc định tùy thuộc vào kiểu dữ liệu"
  },
  {
    "con": "Một vòng lặp không có điều kiện dừng:",
    "re": "Sẽ gây ra lỗi tràn bộ nhớ hoặc treo chương trình"
  },
  {
    "con": "Sử dụng toán tử == để so sánh hai giá trị:",
    "re": "Sẽ kiểm tra giá trị mà không kiểm tra kiểu dữ liệu"
  },
  {
    "con": "Một hàm được định nghĩa nhưng không được gọi:",
    "re": "Sẽ không thực thi mã bên trong hàm đó"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện if mà không có else:",
    "re": "Chương trình vẫn sẽ chạy bình thường nhưng không xử lý trường hợp ngược lại"
  },
  {
    "con": "Khi một mảng được khai báo nhưng không được khởi tạo:",
    "re": "Sẽ không có giá trị nào trong mảng đó"
  },
  {
    "con": "Sử dụng từ khóa return trong một hàm:",
    "re": "Sẽ trả về giá trị cho nơi gọi hàm"
  },
  {
    "con": "Khi một biến toàn cục được sử dụng trong một hàm:",
    "re": "Có thể truy cập và thay đổi giá trị của biến đó"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng:",
    "re": "Sẽ cho phép truy cập từng phần tử của mảng theo chỉ số"
  },
  {
    "con": "Hàm nào dưới đây dùng để ghi 1 xâu kí tự vào tệp:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được gán giá trị:",
    "re": "Sẽ gây ra lỗi khi được sử dụng"
  },
  {
    "con": "Nếu một vòng lặp không có điều kiện dừng:",
    "re": "Chương trình sẽ bị treo hoặc chạy vô hạn"
  },
  {
    "con": "Khi sử dụng toán tử so sánh trong điều kiện:",
    "re": "Kết quả sẽ là true hoặc false"
  },
  {
    "con": "Nếu một hàm không trả về giá trị:",
    "re": "Giá trị trả về mặc định sẽ là null hoặc undefined"
  },
  {
    "con": "Khi sử dụng mảng, nếu chỉ định chỉ số ngoài phạm vi:",
    "re": "Sẽ gây ra lỗi hoặc trả về giá trị undefined"
  },
  {
    "con": "Nếu một biến được khai báo với từ khóa const:",
    "re": "Giá trị của biến đó không thể thay đổi"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if-else:",
    "re": "Chỉ một trong hai nhánh sẽ được thực thi"
  },
  {
    "con": "Nếu một hàm được gọi mà không có tham số cần thiết:",
    "re": "Các tham số đó sẽ nhận giá trị mặc định hoặc undefined"
  },
  {
    "con": "Khi sử dụng vòng lặp for, nếu điều kiện không bao giờ đúng:",
    "re": "Vòng lặp sẽ không được thực thi"
  },
  {
    "con": "Hàm nào dưới đây chỉ dùng để đọc 1 khối dữ liệu từ tệp:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được sử dụng:",
    "re": "Sẽ gây ra cảnh báo trong quá trình biên dịch"
  },
  {
    "con": "Sử dụng vòng lặp để lặp qua một danh sách:",
    "re": "Giúp tiết kiệm thời gian và công sức lập trình"
  },
  {
    "con": "Một hàm không trả về giá trị:",
    "re": "Sẽ có kiểu trả về là 'void' trong nhiều ngôn ngữ lập trình"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện để kiểm tra một điều kiện:",
    "re": "Cho phép thực hiện các hành động khác nhau dựa trên kết quả của điều kiện"
  },
  {
    "con": "Khi một biến được khai báo trong một hàm:",
    "re": "Biến đó chỉ có thể được truy cập trong phạm vi của hàm đó"
  },
  {
    "con": "Sử dụng mảng để lưu trữ nhiều giá trị cùng loại:",
    "re": "Giúp tổ chức dữ liệu một cách hiệu quả hơn"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Sử dụng hàm để tái sử dụng mã nguồn:",
    "re": "Giúp giảm thiểu sự lặp lại và tăng tính dễ bảo trì của chương trình"
  },
  {
    "con": "Khi một biến toàn cục được khai báo:",
    "re": "Biến đó có thể được truy cập từ bất kỳ đâu trong chương trình"
  },
  {
    "con": "Hàm nào dưới đây chỉ dùng để ghi một khối dữ liệu vào file:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được sử dụng trong chương trình:",
    "re": "Sẽ gây ra cảnh báo trong quá trình biên dịch"
  },
  {
    "con": "Sử dụng vòng lặp để lặp lại một khối lệnh nhiều lần:",
    "re": "Giúp tiết kiệm thời gian và công sức lập trình"
  },
  {
    "con": "Khi một hàm không trả về giá trị:",
    "re": "Hàm đó sẽ trả về giá trị mặc định là null hoặc undefined"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện để kiểm tra một điều kiện:",
    "re": "Cho phép chương trình thực hiện các hành động khác nhau dựa trên kết quả kiểm tra"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa const:",
    "re": "Biến đó không thể được gán lại giá trị mới"
  },
  {
    "con": "Sử dụng mảng để lưu trữ nhiều giá trị cùng loại:",
    "re": "Giúp tổ chức dữ liệu một cách hiệu quả và dễ dàng truy cập"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Chương trình sẽ không thể biên dịch thành công"
  },
  {
    "con": "Sử dụng hàm để tái sử dụng mã nguồn:",
    "re": "Giúp giảm thiểu sự trùng lặp và cải thiện khả năng bảo trì của chương trình"
  },
  {
    "con": "Khi một biến toàn cục được khai báo:",
    "re": "Biến đó có thể được truy cập từ bất kỳ đâu trong chương trình"
  },
  {
    "con": "Một biến được khai báo nhưng không được khởi tạo",
    "re": "Có thể chứa giá trị không xác định"
  },
  {
    "con": "Một hàm được định nghĩa nhưng không có từ khóa trả về",
    "re": "Mặc định trả về giá trị null hoặc undefined"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng",
    "re": "Có thể truy cập từng phần tử của mảng theo chỉ số"
  },
  {
    "con": "Khi sử dụng toán tử so sánh === trong JavaScript",
    "re": "So sánh cả giá trị và kiểu dữ liệu"
  },
  {
    "con": "Khi một hàm được gọi mà không có đối số",
    "re": "Các tham số của hàm sẽ nhận giá trị undefined"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa let trong một khối lệnh",
    "re": "Biến đó chỉ có thể được truy cập trong khối lệnh đó"
  },
  {
    "con": "Khi sử dụng toán tử + với một chuỗi và một số",
    "re": "Số sẽ được chuyển đổi thành chuỗi và nối lại"
  },
  {
    "con": "Khi một mảng được truyền vào một hàm",
    "re": "Hàm có thể thay đổi nội dung của mảng đó"
  },
  {
    "con": "Khi sử dụng từ khóa return trong một hàm",
    "re": "Hàm sẽ dừng thực thi và trả về giá trị đã chỉ định"
  },
  {
    "con": "Khi một đối tượng được tạo ra từ một lớp (class)",
    "re": "Đối tượng đó sẽ có tất cả các thuộc tính và phương thức của lớp"
  },
  {
    "con": "Cho tệp nhị phân DATA chứa dãy các cấu trúc liền nhau L struct T{…} x;và f là con trỏ tệp đến DATA. Chọn câu đúng nhất trong các câu sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Phát biểu nào sau là đúng khi nói về hàm fgets():",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được khởi tạo:",
    "re": "Có thể chứa giá trị không xác định"
  },
  {
    "con": "Một hàm không trả về giá trị:",
    "re": "Được gọi là hàm void"
  },
  {
    "con": "Khi sử dụng vòng lặp for:",
    "re": "Cần có điều kiện dừng để tránh vòng lặp vô hạn"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Khi sử dụng mảng trong lập trình:",
    "re": "Cần xác định kích thước của mảng trước khi sử dụng"
  },
  {
    "con": "Khi gọi một hàm trong chương trình:",
    "re": "Cần phải truyền đúng số lượng và kiểu tham số"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if:",
    "re": "Cần có điều kiện để xác định nhánh thực thi"
  },
  {
    "con": "Khi một biến được khai báo là hằng số:",
    "re": "Giá trị của biến đó không thể thay đổi trong suốt chương trình"
  },
  {
    "con": "Khi sử dụng thư viện trong lập trình:",
    "re": "Cần phải bao gồm thư viện đó trước khi sử dụng các hàm của nó"
  },
  {
    "con": "Hàm nào dưới đây chỉ dùng để ghi 1 xâu kí tự vào tệp:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được gán giá trị:",
    "re": "Sẽ có giá trị mặc định tùy thuộc vào ngôn ngữ lập trình"
  },
  {
    "con": "Một vòng lặp không có điều kiện dừng:",
    "re": "Sẽ gây ra lỗi tràn bộ nhớ hoặc treo chương trình"
  },
  {
    "con": "Một hàm được gọi mà không có tham số:",
    "re": "Sẽ thực thi mà không cần dữ liệu đầu vào"
  },
  {
    "con": "Một mảng được truy cập bằng chỉ số âm:",
    "re": "Sẽ gây ra lỗi hoặc trả về giá trị không xác định"
  },
  {
    "con": "Một biến toàn cục được sử dụng trong một hàm:",
    "re": "Có thể truy cập và thay đổi giá trị của nó trong hàm đó"
  },
  {
    "con": "Một chuỗi được nối với một số:",
    "re": "Sẽ được chuyển đổi thành chuỗi và nối lại"
  },
  {
    "con": "Một hàm trả về giá trị mà không có từ khóa return:",
    "re": "Sẽ trả về giá trị mặc định của ngôn ngữ lập trình"
  },
  {
    "con": "Một điều kiện trong câu lệnh if là đúng:",
    "re": "Câu lệnh trong khối if sẽ được thực thi"
  },
  {
    "con": "Một đối tượng được tạo từ lớp mà không gọi hàm khởi tạo:",
    "re": "Sẽ không được khởi tạo đúng cách và có thể gây lỗi"
  },
  {
    "con": "Phát biểu đúng nhất về mẫu lệnh( f là con trỏ tệp): while ((ch=fgetc(f))!=EOF) …",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được sử dụng",
    "re": "Có thể gây ra cảnh báo trong quá trình biên dịch"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng",
    "re": "Giúp tối ưu hóa mã nguồn và dễ đọc hơn"
  },
  {
    "con": "Khi sử dụng hàm, nếu không truyền đủ tham số cần thiết",
    "re": "Chương trình sẽ gặp lỗi hoặc hành vi không mong muốn"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if-else",
    "re": "Chương trình sẽ thực hiện một trong hai nhánh tùy thuộc vào điều kiện"
  },
  {
    "con": "Khi khai báo một hàm mà không có kiểu trả về",
    "re": "Hàm đó sẽ mặc định trả về kiểu void trong nhiều ngôn ngữ lập trình"
  },
  {
    "con": "Khi sử dụng con trỏ mà không khởi tạo",
    "re": "Có thể dẫn đến lỗi truy cập bộ nhớ"
  },
  {
    "con": "Khi sử dụng mảng, nếu chỉ định chỉ số ngoài phạm vi",
    "re": "Chương trình có thể gặp lỗi hoặc hành vi không xác định"
  },
  {
    "con": "Khi sử dụng thư viện mà không bao gồm tệp tiêu đề tương ứng",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Khi sử dụng kiểu dữ liệu không phù hợp trong phép toán",
    "re": "Có thể dẫn đến lỗi biên dịch hoặc lỗi thực thi"
  },
  {
    "con": "Phát biểu nào đúng khi nói về câu lệnh fflush(FILE *f):",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được khởi tạo:",
    "re": "Có thể chứa giá trị không xác định"
  },
  {
    "con": "Khi sử dụng vòng lặp for, nếu điều kiện dừng không bao giờ đạt được:",
    "re": "Vòng lặp sẽ chạy vô hạn"
  },
  {
    "con": "Khi gọi một hàm không có giá trị trả về:",
    "re": "Hàm sẽ trả về giá trị mặc định là 'void'"
  },
  {
    "con": "Nếu một mảng được khai báo với kích thước n:",
    "re": "Chỉ số hợp lệ của mảng là từ 0 đến n-1"
  },
  {
    "con": "Khi sử dụng toán tử == để so sánh hai biến:",
    "re": "Kết quả sẽ là true nếu hai biến có giá trị bằng nhau"
  },
  {
    "con": "Nếu một chương trình không có câu lệnh return trong hàm main:",
    "re": "Chương trình vẫn có thể chạy nhưng có thể không trả về giá trị đúng"
  },
  {
    "con": "Khi sử dụng câu lệnh switch, nếu không có case nào khớp:",
    "re": "Câu lệnh default sẽ được thực thi nếu có"
  },
  {
    "con": "Nếu một biến được khai báo là const:",
    "re": "Giá trị của biến đó không thể thay đổi sau khi được khởi tạo"
  },
  {
    "con": "Khi sử dụng thư viện stdio.h, nếu không khai báo đúng:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo:",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Một hàm được định nghĩa nhưng không được gọi:",
    "re": "Hàm đó sẽ không được thực thi"
  },
  {
    "con": "Sử dụng vòng lặp để lặp qua một mảng:",
    "re": "Có thể truy cập từng phần tử của mảng"
  },
  {
    "con": "Sử dụng toán tử so sánh trong điều kiện:",
    "re": "Kết quả sẽ là true hoặc false"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện if-else:",
    "re": "Có thể thực hiện các hành động khác nhau dựa trên điều kiện"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa const:",
    "re": "Giá trị của biến đó không thể thay đổi"
  },
  {
    "con": "Khi sử dụng hàm trả về giá trị:",
    "re": "Giá trị đó có thể được sử dụng trong các phép toán khác"
  },
  {
    "con": "Khi một mảng được khởi tạo với kích thước cố định:",
    "re": "Kích thước của mảng không thể thay đổi sau khi khởi tạo"
  },
  {
    "con": "Khi một đối tượng được tạo từ lớp:",
    "re": "Có thể truy cập các thuộc tính và phương thức của lớp đó"
  },
  {
    "con": "Hàm nào dưới đây chỉ dùng để chuyển con trỏ về vị trí đầu tệp:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Dấu hiệu nào là đúng khi sử dụng hàm fread();",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không sử dụng;",
    "re": "Cảnh báo sẽ xuất hiện trong quá trình biên dịch"
  },
  {
    "con": "Sử dụng vòng lặp for với điều kiện dừng không hợp lệ;",
    "re": "Vòng lặp sẽ chạy vô hạn"
  },
  {
    "con": "Gọi hàm mà không truyền đủ tham số;",
    "re": "Lỗi sẽ xảy ra trong quá trình thực thi"
  },
  {
    "con": "Sử dụng toán tử so sánh để kiểm tra giá trị;",
    "re": "Kết quả sẽ là true hoặc false"
  },
  {
    "con": "Khai báo một mảng mà không chỉ định kích thước;",
    "re": "Mảng sẽ không được khởi tạo đúng cách"
  },
  {
    "con": "Sử dụng biến chưa được khởi tạo;",
    "re": "Giá trị của biến sẽ không xác định"
  },
  {
    "con": "Sử dụng cú pháp không đúng trong câu lệnh điều kiện;",
    "re": "Lỗi cú pháp sẽ xảy ra"
  },
  {
    "con": "Sử dụng hàm trả về giá trị mà không gán cho biến;",
    "re": "Giá trị trả về sẽ bị bỏ qua"
  },
  {
    "con": "Sử dụng thư viện mà không bao gồm nó trong mã nguồn;",
    "re": "Chương trình sẽ không nhận diện được các hàm trong thư viện đó"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo",
    "re": "Giá trị của biến sẽ không xác định"
  },
  {
    "con": "Sử dụng vòng lặp for với điều kiện dừng đúng",
    "re": "Vòng lặp sẽ thực hiện đúng số lần mong muốn"
  },
  {
    "con": "Hàm được định nghĩa nhưng không được gọi",
    "re": "Hàm sẽ không được thực thi"
  },
  {
    "con": "Sử dụng toán tử == để so sánh hai giá trị",
    "re": "Kết quả sẽ là true nếu hai giá trị bằng nhau"
  },
  {
    "con": "Sử dụng mảng để lưu trữ nhiều giá trị cùng loại",
    "re": "Có thể truy cập các giá trị bằng chỉ số"
  },
  {
    "con": "Sử dụng câu lệnh điều kiện if với điều kiện đúng",
    "re": "Khối lệnh bên trong if sẽ được thực thi"
  },
  {
    "con": "Sử dụng hàm return trong một hàm",
    "re": "Giá trị trả về sẽ được sử dụng tại nơi gọi hàm"
  },
  {
    "con": "Khai báo biến toàn cục trong một chương trình",
    "re": "Biến có thể được truy cập từ bất kỳ hàm nào"
  },
  {
    "con": "Sử dụng cú pháp đúng khi định nghĩa một lớp trong OOP",
    "re": "Lớp sẽ được tạo ra và có thể được khởi tạo"
  },
  {
    "con": "Sử dụng thư viện chuẩn của ngôn ngữ lập trình",
    "re": "Có thể sử dụng các hàm và phương thức đã được định nghĩa sẵn"
  },
  {
    "con": "Dấu hiệu nào là đúng khi sử dụng hàm fopen() để mở một file đã tồn tại đọc theo kiểu nhị phân:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo với từ khóa 'var' trong JavaScript:",
    "re": "Có thể được truy cập trong toàn bộ hàm hoặc khối mã nơi nó được khai báo"
  },
  {
    "con": "Khi sử dụng vòng lặp for trong Python, nếu điều kiện dừng không bao giờ đạt được:",
    "re": "Vòng lặp sẽ chạy vô hạn"
  },
  {
    "con": "Khi một hàm trong Python không có từ khóa 'return':",
    "re": "Hàm sẽ trả về giá trị None"
  },
  {
    "con": "Nếu một mảng trong JavaScript được khai báo nhưng không được khởi tạo giá trị:",
    "re": "Các phần tử của mảng sẽ có giá trị undefined"
  },
  {
    "con": "Khi sử dụng toán tử == trong JavaScript để so sánh hai giá trị khác kiểu dữ liệu:",
    "re": "JavaScript sẽ tự động chuyển đổi kiểu dữ liệu trước khi so sánh"
  },
  {
    "con": "Nếu một biến được khai báo với từ khóa 'const' trong JavaScript:",
    "re": "Biến đó không thể được gán lại giá trị mới"
  },
  {
    "con": "Khi một lỗi xảy ra trong chương trình Python và không được xử lý:",
    "re": "Chương trình sẽ dừng lại và thông báo lỗi"
  },
  {
    "con": "Nếu một hàm được gọi mà không có đủ tham số cần thiết:",
    "re": "Python sẽ báo lỗi TypeError"
  },
  {
    "con": "Khi sử dụng hàm print() trong Python với nhiều tham số:",
    "re": "Các tham số sẽ được in ra cách nhau bởi dấu cách"
  },
  {
    "con": "Dấu hiệu nào là đúng khi dùng hàm fopen() để mở file đã tồn tại, thêm theo kiểu văn bản:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu biến được khai báo nhưng không được khởi tạo giá trị:",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Nếu một hàm không trả về giá trị:",
    "re": "Hàm đó sẽ trả về giá trị mặc định là null (hoặc undefined trong JavaScript)"
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp for mà không có điều kiện dừng:",
    "re": "Vòng lặp sẽ chạy vô hạn"
  },
  {
    "con": "Nếu bạn gọi một hàm trước khi nó được định nghĩa trong mã nguồn:",
    "re": "Hàm sẽ không được nhận diện và gây lỗi"
  },
  {
    "con": "Nếu bạn sử dụng toán tử == thay vì === trong JavaScript:",
    "re": "So sánh sẽ không kiểm tra kiểu dữ liệu, có thể dẫn đến kết quả không mong muốn"
  },
  {
    "con": "Nếu bạn không xử lý ngoại lệ trong mã nguồn:",
    "re": "Chương trình có thể bị dừng đột ngột khi gặp lỗi"
  },
  {
    "con": "Nếu bạn sử dụng biến toàn cục trong một hàm:",
    "re": "Biến đó có thể bị thay đổi từ bất kỳ đâu trong chương trình"
  },
  {
    "con": "Nếu bạn không sử dụng dấu chấm phẩy kết thúc câu lệnh trong JavaScript:",
    "re": "Có thể dẫn đến lỗi cú pháp hoặc hành vi không mong muốn"
  },
  {
    "con": "Nếu bạn sử dụng mảng mà không kiểm tra độ dài của nó:",
    "re": "Có thể gây ra lỗi khi truy cập vào chỉ số không tồn tại"
  },
  {
    "con": "Hàm nào trả lại kích thước của một tệp được mở:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được sử dụng:",
    "re": "Sẽ gây ra cảnh báo trong trình biên dịch"
  },
  {
    "con": "Sử dụng vòng lặp để lặp qua một mảng:",
    "re": "Giúp xử lý từng phần tử của mảng một cách hiệu quả"
  },
  {
    "con": "Khi một hàm không trả về giá trị:",
    "re": "Hàm đó sẽ trả về giá trị mặc định là null hoặc undefined"
  },
  {
    "con": "Khi sử dụng toán tử so sánh '===' trong JavaScript:",
    "re": "Sẽ kiểm tra cả giá trị và kiểu dữ liệu"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa 'const':",
    "re": "Biến đó không thể được gán lại giá trị"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Khi sử dụng hàm 'console.log()':",
    "re": "Sẽ in ra giá trị lên bảng điều khiển"
  },
  {
    "con": "Khi một mảng được khởi tạo mà không có phần tử:",
    "re": "Mảng đó sẽ có độ dài bằng 0"
  },
  {
    "con": "Khi sử dụng từ khóa 'return' trong một hàm:",
    "re": "Hàm sẽ kết thúc và trả về giá trị cho nơi gọi hàm"
  },
  {
    "con": "Câu lệnh sau có ý nghĩa gì: FILE *fopen(tep1,”ab”);",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo với từ khóa 'int' thì nó chỉ có thể chứa giá trị số nguyên",
    "re": "Biến đó không thể chứa giá trị kiểu chuỗi"
  },
  {
    "con": "Câu lệnh 'for' có cấu trúc đúng thì nó sẽ lặp lại một đoạn mã nhiều lần",
    "re": "Đoạn mã đó sẽ được thực thi theo số lần đã chỉ định"
  },
  {
    "con": "Hàm được định nghĩa với từ khóa 'void' thì nó không trả về giá trị",
    "re": "Hàm đó chỉ thực hiện các thao tác mà không cung cấp kết quả"
  },
  {
    "con": "Câu lệnh 'if' có điều kiện đúng thì khối lệnh bên trong nó sẽ được thực thi",
    "re": "Khối lệnh đó sẽ được thực hiện"
  },
  {
    "con": "Mảng được khai báo với kích thước cố định thì nó không thể thay đổi kích thước trong quá trình thực thi",
    "re": "Người dùng không thể thêm hoặc xóa phần tử trong mảng đó"
  },
  {
    "con": "Câu lệnh 'switch' có nhiều case thì nó cho phép kiểm tra nhiều giá trị khác nhau",
    "re": "Mỗi case sẽ tương ứng với một giá trị cụ thể"
  },
  {
    "con": "Biến toàn cục được khai báo bên ngoài tất cả các hàm thì nó có thể được truy cập từ bất kỳ hàm nào",
    "re": "Biến đó có phạm vi sử dụng rộng hơn so với biến cục bộ"
  },
  {
    "con": "Câu lệnh 'return' trong hàm có kiểu trả về khác 'void' thì nó phải trả về một giá trị tương ứng",
    "re": "Giá trị trả về phải phù hợp với kiểu dữ liệu của hàm"
  },
  {
    "con": "Câu lệnh 'break' trong vòng lặp thì nó sẽ thoát khỏi vòng lặp đó ngay lập tức",
    "re": "Vòng lặp sẽ không tiếp tục thực hiện các lần lặp còn lại"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo:",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Sử dụng vòng lặp để lặp lại một đoạn mã:",
    "re": "Giúp tiết kiệm thời gian và giảm thiểu lỗi"
  },
  {
    "con": "Hàm được định nghĩa nhưng không được gọi:",
    "re": "Hàm đó sẽ không được thực thi"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện để kiểm tra một điều kiện:",
    "re": "Chương trình sẽ thực hiện các lệnh khác nhau dựa trên kết quả của điều kiện"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa 'const':",
    "re": "Biến đó sẽ không thể thay đổi giá trị sau khi được khởi tạo"
  },
  {
    "con": "Sử dụng mảng để lưu trữ nhiều giá trị cùng loại:",
    "re": "Giúp quản lý và truy cập dữ liệu dễ dàng hơn"
  },
  {
    "con": "Khi một hàm trả về giá trị:",
    "re": "Giá trị đó có thể được sử dụng trong các phép toán khác"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Sử dụng comment trong mã nguồn:",
    "re": "Giúp người đọc hiểu rõ hơn về chức năng của đoạn mã"
  },
  {
    "con": "Khi một biến được khai báo bên trong hàm:",
    "re": "Biến đó chỉ có thể được truy cập trong phạm vi của hàm đó"
  },
  {
    "con": "Trong chế độ văn bản, dấu hiệu kết thúc tệp là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được khởi tạo giá trị:",
    "re": "Sẽ có giá trị mặc định tùy thuộc vào kiểu dữ liệu"
  },
  {
    "con": "Khi sử dụng vòng lặp for, điều kiện dừng phải được xác định:",
    "re": "Vòng lặp sẽ tiếp tục cho đến khi điều kiện dừng không còn đúng"
  },
  {
    "con": "Khi gọi một hàm, các tham số phải được truyền đúng kiểu dữ liệu:",
    "re": "Hàm sẽ thực thi chính xác và trả về kết quả mong muốn"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if-else, điều kiện phải được đánh giá:",
    "re": "Một trong hai nhánh sẽ được thực thi dựa trên kết quả của điều kiện"
  },
  {
    "con": "Khi một mảng được khai báo, kích thước của nó phải được xác định:",
    "re": "Mảng sẽ có số lượng phần tử cố định tương ứng với kích thước đã khai báo"
  },
  {
    "con": "Khi sử dụng các thư viện bên ngoài, chúng phải được nhập khẩu đúng cách:",
    "re": "Các chức năng và lớp trong thư viện sẽ có sẵn để sử dụng trong chương trình"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp, nó sẽ không biên dịch thành công:",
    "re": "Chương trình sẽ không chạy cho đến khi lỗi được sửa chữa"
  },
  {
    "con": "Khi sử dụng kiểu dữ liệu số nguyên, giá trị không được vượt quá giới hạn của kiểu:",
    "re": "Sẽ xảy ra lỗi tràn số nếu giá trị vượt quá giới hạn"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa const, giá trị của nó không thể thay đổi:",
    "re": "Bất kỳ nỗ lực nào để thay đổi giá trị sẽ dẫn đến lỗi"
  },
  {
    "con": "Câu lệnh sau có ý nghĩa gì: FILE *fopen(tep1,”r+”);",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng",
    "re": "Có thể truy cập từng phần tử của mảng một cách tuần tự"
  },
  {
    "con": "Hàm có kiểu trả về void",
    "re": "Không trả về giá trị nào khi kết thúc"
  },
  {
    "con": "Sử dụng toán tử == để so sánh hai giá trị",
    "re": "Kiểm tra xem hai giá trị có bằng nhau hay không"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if",
    "re": "Chương trình sẽ thực hiện khối lệnh bên trong nếu điều kiện là đúng"
  },
  {
    "con": "Khi khai báo một hàm, nếu không có tham số",
    "re": "Hàm đó có thể được gọi mà không cần truyền tham số"
  },
  {
    "con": "Sử dụng mảng để lưu trữ nhiều giá trị cùng loại",
    "re": "Có thể truy cập các giá trị bằng chỉ số của chúng"
  },
  {
    "con": "Khi sử dụng toán tử ++",
    "re": "Giá trị của biến sẽ được tăng thêm 1"
  },
  {
    "con": "Khi sử dụng từ khóa return trong một hàm",
    "re": "Hàm sẽ kết thúc và trả về giá trị cho nơi gọi hàm"
  },
  {
    "con": "Câu lệnh sau có ý nghĩa gì: int open(tep1, O_TRUNC);",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo.",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Câu lệnh điều kiện sử dụng cú pháp if-else.",
    "re": "Chương trình sẽ thực hiện một trong hai nhánh tùy thuộc vào điều kiện"
  },
  {
    "con": "Một hàm được định nghĩa với kiểu trả về void.",
    "re": "Hàm đó sẽ không trả về giá trị nào"
  },
  {
    "con": "Sử dụng vòng lặp for với điều kiện dừng không đúng.",
    "re": "Vòng lặp sẽ không bao giờ dừng lại và có thể gây ra lỗi tràn bộ nhớ"
  },
  {
    "con": "Khi sử dụng mảng, chỉ số bắt đầu từ 0.",
    "re": "Phần tử đầu tiên của mảng sẽ có chỉ số là 0"
  },
  {
    "con": "Khi gọi hàm, số lượng tham số truyền vào không khớp với định nghĩa hàm.",
    "re": "Chương trình sẽ báo lỗi biên dịch"
  },
  {
    "con": "Sử dụng toán tử == để so sánh hai giá trị.",
    "re": "Kết quả sẽ là true nếu hai giá trị bằng nhau"
  },
  {
    "con": "Khi sử dụng cấu trúc switch-case, không có case nào khớp.",
    "re": "Chương trình sẽ thực hiện nhánh default (nếu có)"
  },
  {
    "con": "Khi sử dụng thư viện, cần phải khai báo thư viện đó trước khi sử dụng.",
    "re": "Chương trình sẽ không nhận diện được các hàm trong thư viện đó"
  },
  {
    "con": "Có thể truy cập thành phần của cấu trúc thông qua con trỏ như( với p là con trỏ cấu trúc, a là thành phần cấu trúc):",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sử dụng biến để lưu trữ giá trị và có thể thay đổi giá trị đó trong quá trình thực thi chương trình:",
    "re": "Giá trị của biến có thể được cập nhật"
  },
  {
    "con": "Sử dụng vòng lặp để lặp lại một đoạn mã nhiều lần cho đến khi điều kiện dừng được thỏa mãn:",
    "re": "Giúp tiết kiệm thời gian và công sức lập trình"
  },
  {
    "con": "Khi sử dụng hàm, nếu truyền tham số không đúng kiểu dữ liệu,",
    "re": "Chương trình có thể gặp lỗi hoặc không hoạt động như mong đợi"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện để kiểm tra các điều kiện khác nhau trong chương trình:",
    "re": "Cho phép chương trình thực hiện các hành động khác nhau dựa trên điều kiện"
  },
  {
    "con": "Khi khai báo một mảng, nếu chỉ định kích thước mảng là 0:",
    "re": "Mảng sẽ không thể chứa bất kỳ phần tử nào"
  },
  {
    "con": "Sử dụng các thư viện có sẵn trong ngôn ngữ lập trình để mở rộng chức năng của chương trình:",
    "re": "Giúp tiết kiệm thời gian phát triển và tăng tính hiệu quả"
  },
  {
    "con": "Khi sử dụng con trỏ, nếu không khởi tạo con trỏ trước khi sử dụng:",
    "re": "Chương trình có thể gặp lỗi truy cập bộ nhớ"
  },
  {
    "con": "Khi viết mã, nếu không sử dụng chú thích để giải thích mã:",
    "re": "Mã có thể trở nên khó hiểu cho người khác hoặc cho chính bạn trong tương lai"
  },
  {
    "con": "Sử dụng kiểu dữ liệu phù hợp cho từng biến trong chương trình:",
    "re": "Giúp tối ưu hóa bộ nhớ và tăng hiệu suất chương trình"
  },
  {
    "con": "Biến được khai báo mà không được khởi tạo giá trị ban đầu:",
    "re": "Có thể gây ra lỗi khi sử dụng biến đó"
  },
  {
    "con": "Sử dụng vòng lặp mà không có điều kiện dừng:",
    "re": "Có thể dẫn đến vòng lặp vô hạn"
  },
  {
    "con": "Khi sử dụng hàm, không truyền đủ tham số cần thiết:",
    "re": "Hàm sẽ không hoạt động đúng và có thể gây ra lỗi"
  },
  {
    "con": "Khi sử dụng toán tử so sánh, kiểu dữ liệu không tương thích:",
    "re": "Kết quả so sánh có thể không chính xác"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện mà không có nhánh else:",
    "re": "Có thể bỏ lỡ các trường hợp không được xử lý"
  },
  {
    "con": "Khi sử dụng mảng mà không kiểm tra chỉ số hợp lệ:",
    "re": "Có thể gây ra lỗi truy cập ngoài giới hạn mảng"
  },
  {
    "con": "Khi không sử dụng comment trong mã nguồn:",
    "re": "Mã sẽ khó hiểu và khó bảo trì hơn"
  },
  {
    "con": "Khi không tuân thủ quy tắc đặt tên biến:",
    "re": "Có thể gây nhầm lẫn và khó đọc mã"
  },
  {
    "con": "Khi không sử dụng các thư viện hoặc module có sẵn:",
    "re": "Có thể làm tăng thời gian phát triển và giảm hiệu suất"
  },
  {
    "con": "Khi không kiểm tra lỗi trong quá trình nhập dữ liệu:",
    "re": "Có thể dẫn đến dữ liệu không hợp lệ và lỗi trong chương trình"
  },
  {
    "con": "Biết cách sử dụng biến:",
    "re": "Có thể lưu trữ và truy xuất dữ liệu trong chương trình"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện:",
    "re": "Có thể thực hiện các hành động khác nhau dựa trên điều kiện cụ thể"
  },
  {
    "con": "Áp dụng vòng lặp:",
    "re": "Có thể lặp lại một đoạn mã nhiều lần mà không cần viết lại"
  },
  {
    "con": "Hiểu về kiểu dữ liệu:",
    "re": "Có thể chọn kiểu dữ liệu phù hợp cho từng biến trong chương trình"
  },
  {
    "con": "Sử dụng hàm:",
    "re": "Có thể tổ chức mã nguồn và tái sử dụng các đoạn mã"
  },
  {
    "con": "Biết cách xử lý lỗi:",
    "re": "Có thể phát hiện và xử lý các lỗi trong chương trình một cách hiệu quả"
  },
  {
    "con": "Sử dụng cấu trúc dữ liệu:",
    "re": "Có thể tổ chức và quản lý dữ liệu một cách hiệu quả"
  },
  {
    "con": "Thực hành lập trình hướng đối tượng:",
    "re": "Có thể xây dựng các chương trình phức tạp hơn với các đối tượng và lớp"
  },
  {
    "con": "Tìm hiểu về thuật toán:",
    "re": "Có thể giải quyết vấn đề một cách logic và hiệu quả"
  },
  {
    "con": "Sử dụng công cụ gỡ lỗi:",
    "re": "Có thể xác định và sửa chữa các vấn đề trong mã nguồn"
  },
  {
    "con": "Toán tử nào sau đây sẽ truy xuất 1 thành phần của con trỏ cấu trúc:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo:",
    "re": "Có thể chứa giá trị không xác định"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng:",
    "re": "Có thể truy cập từng phần tử của mảng theo chỉ số"
  },
  {
    "con": "Khi một hàm không trả về giá trị:",
    "re": "Kiểu trả về của hàm phải được khai báo là void"
  },
  {
    "con": "Nếu một biến được khai báo là hằng số:",
    "re": "Giá trị của biến đó không thể thay đổi trong suốt chương trình"
  },
  {
    "con": "Khi sử dụng toán tử so sánh trong điều kiện if:",
    "re": "Kết quả sẽ là true hoặc false"
  },
  {
    "con": "Nếu một mảng được khai báo với kích thước cố định:",
    "re": "Kích thước của mảng không thể thay đổi trong quá trình thực thi"
  },
  {
    "con": "Khi sử dụng con trỏ để truy cập vào một biến:",
    "re": "Có thể thay đổi giá trị của biến thông qua con trỏ"
  },
  {
    "con": "Nếu một chương trình không có hàm main:",
    "re": "Chương trình sẽ không thể biên dịch và chạy"
  },
  {
    "con": "Khi sử dụng thư viện trong lập trình:",
    "re": "Có thể sử dụng các hàm và đối tượng đã được định nghĩa sẵn"
  },
  {
    "con": "Khi bạn sử dụng biến trong một chương trình, hãy đảm bảo rằng biến đó đã được khai báo trước khi sử dụng.",
    "re": "Chương trình sẽ không chạy nếu biến chưa được khai báo."
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp để lặp qua một mảng, hãy chắc chắn rằng điều kiện dừng của vòng lặp là chính xác.",
    "re": "Vòng lặp có thể chạy vô hạn nếu điều kiện dừng không đúng."
  },
  {
    "con": "Khi bạn định nghĩa một hàm, hãy đảm bảo rằng bạn đã chỉ định đúng kiểu dữ liệu trả về.",
    "re": "Chương trình có thể gặp lỗi nếu kiểu dữ liệu trả về không khớp."
  },
  {
    "con": "Nếu bạn muốn xử lý ngoại lệ trong chương trình, hãy sử dụng cấu trúc try-catch.",
    "re": "Chương trình sẽ dừng lại nếu có lỗi xảy ra mà không được xử lý."
  },
  {
    "con": "Khi làm việc với chuỗi, hãy nhớ rằng chuỗi là bất biến trong nhiều ngôn ngữ lập trình.",
    "re": "Bất kỳ thay đổi nào trên chuỗi sẽ tạo ra một chuỗi mới."
  },
  {
    "con": "Nếu bạn muốn sử dụng thư viện bên ngoài, hãy chắc chắn rằng thư viện đó đã được cài đặt và nhập đúng cách.",
    "re": "Chương trình sẽ không tìm thấy các hàm từ thư viện nếu không được nhập đúng."
  },
  {
    "con": "Khi bạn sử dụng cấu trúc điều kiện, hãy đảm bảo rằng tất cả các nhánh đều được xử lý.",
    "re": "Có thể xảy ra lỗi logic nếu không xử lý tất cả các trường hợp."
  },
  {
    "con": "Nếu bạn muốn tối ưu hóa hiệu suất của chương trình, hãy xem xét việc sử dụng thuật toán và cấu trúc dữ liệu phù hợp.",
    "re": "Chương trình có thể chạy chậm nếu thuật toán không hiệu quả."
  },
  {
    "con": "Khi bạn làm việc với dữ liệu người dùng, hãy luôn kiểm tra và xác thực dữ liệu đầu vào.",
    "re": "Chương trình có thể gặp lỗi hoặc bảo mật nếu dữ liệu không được xác thực."
  },
  {
    "con": "Nếu bạn muốn tạo ra mã nguồn dễ bảo trì, hãy tuân thủ các quy tắc đặt tên biến và hàm rõ ràng.",
    "re": "Mã nguồn sẽ khó hiểu và khó bảo trì nếu tên biến không rõ ràng."
  },
  {
    "con": "Hãy khai báo một cấu trúc mô tả sinh viên, thông tin về mỗi sinh viên bao gồm: tên, điểm 3 môn học. Khai báo nào sau đây là đúng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến con trỏ có thể chứa:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng chưa được gán giá trị:",
    "re": "Có thể gây ra lỗi khi sử dụng"
  },
  {
    "con": "Cú pháp của một lệnh điều kiện không đúng:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Một hàm không trả về giá trị:",
    "re": "Sẽ trả về giá trị mặc định là null hoặc undefined"
  },
  {
    "con": "Sử dụng vòng lặp để lặp qua một mảng:",
    "re": "Giúp tiết kiệm thời gian và công sức trong việc xử lý dữ liệu"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa 'const':",
    "re": "Giá trị của biến đó không thể thay đổi"
  },
  {
    "con": "Sử dụng các hàm để tổ chức mã nguồn:",
    "re": "Giúp mã nguồn dễ đọc và bảo trì hơn"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Chương trình sẽ không chạy cho đến khi lỗi được sửa"
  },
  {
    "con": "Sử dụng kiểu dữ liệu phù hợp:",
    "re": "Giúp tối ưu hóa hiệu suất và giảm thiểu lỗi"
  },
  {
    "con": "Khi một biến được khai báo bên trong một hàm:",
    "re": "Biến đó chỉ có thể được truy cập trong phạm vi của hàm đó"
  },
  {
    "con": "Kiểu dữ liệu nào có thể chứa nhiều thành phần dữ liệu có thể có kiểu dữ liệu khác nhau thành một nhóm duy nhất:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng chưa được gán giá trị:",
    "re": "Có thể gây ra lỗi khi sử dụng"
  },
  {
    "con": "Cú pháp của một ngôn ngữ lập trình không được tuân thủ:",
    "re": "Chương trình sẽ không biên dịch hoặc chạy được"
  },
  {
    "con": "Sử dụng vòng lặp để lặp lại một đoạn mã nhiều lần:",
    "re": "Giúp tiết kiệm thời gian và công sức lập trình"
  },
  {
    "con": "Một hàm được định nghĩa nhưng không được gọi:",
    "re": "Sẽ không có tác dụng trong chương trình"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện để kiểm tra một điều kiện:",
    "re": "Cho phép thực hiện các hành động khác nhau dựa trên kết quả kiểm tra"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Chương trình sẽ không thể biên dịch thành công"
  },
  {
    "con": "Sử dụng comment trong mã nguồn:",
    "re": "Giúp người đọc hiểu rõ hơn về chức năng của đoạn mã"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa 'const':",
    "re": "Giá trị của biến đó không thể thay đổi sau khi được gán"
  },
  {
    "con": "Sử dụng thư viện trong lập trình:",
    "re": "Giúp tái sử dụng mã và tiết kiệm thời gian phát triển"
  },
  {
    "con": "Có bao nhiêu cách khai báo biến cấu trúc:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được sử dụng:",
    "re": "Sẽ gây ra cảnh báo trong một số ngôn ngữ lập trình"
  },
  {
    "con": "Sử dụng vòng lặp để lặp qua một mảng:",
    "re": "Sẽ giúp tiết kiệm thời gian và mã nguồn"
  },
  {
    "con": "Khi một hàm không trả về giá trị:",
    "re": "Nó sẽ trả về giá trị mặc định là null hoặc undefined"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện để kiểm tra giá trị:",
    "re": "Sẽ giúp xác định hành động tiếp theo trong chương trình"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa const:",
    "re": "Giá trị của biến đó không thể thay đổi"
  },
  {
    "con": "Sử dụng comment trong mã nguồn:",
    "re": "Sẽ giúp người khác hiểu rõ hơn về logic của chương trình"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Sử dụng hàm để tái sử dụng mã nguồn:",
    "re": "Sẽ giúp giảm thiểu sự lặp lại và tăng tính tổ chức"
  },
  {
    "con": "Khi một biến được khai báo bên trong hàm:",
    "re": "Biến đó chỉ có thể được truy cập trong phạm vi của hàm đó"
  },
  {
    "con": "Chọn đáp án đúng khi sử dụng trường kiểu bit:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sử dụng biến để lưu trữ giá trị:",
    "re": "Giá trị có thể được truy cập và thay đổi trong chương trình"
  },
  {
    "con": "Viết hàm để thực hiện một tác vụ cụ thể:",
    "re": "Giúp mã nguồn trở nên gọn gàng và dễ bảo trì hơn"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện để kiểm tra điều kiện:",
    "re": "Chương trình sẽ thực hiện các hành động khác nhau dựa trên điều kiện"
  },
  {
    "con": "Sử dụng vòng lặp để lặp lại một đoạn mã:",
    "re": "Giúp tiết kiệm thời gian và công sức khi xử lý nhiều dữ liệu"
  },
  {
    "con": "Chọn kiểu dữ liệu phù hợp cho biến:",
    "re": "Giúp tối ưu hóa bộ nhớ và hiệu suất chương trình"
  },
  {
    "con": "Sử dụng chú thích trong mã nguồn:",
    "re": "Giúp người khác (và cả bản thân) hiểu rõ hơn về mã"
  },
  {
    "con": "Kiểm tra lỗi trong mã trước khi chạy:",
    "re": "Giảm thiểu khả năng gặp lỗi khi chương trình thực thi"
  },
  {
    "con": "Sử dụng thư viện và API có sẵn:",
    "re": "Tiết kiệm thời gian phát triển và tận dụng các giải pháp đã được kiểm chứng"
  },
  {
    "con": "Thực hiện kiểm thử đơn vị cho các hàm:",
    "re": "Đảm bảo rằng các hàm hoạt động đúng như mong đợi"
  },
  {
    "con": "Biến được khai báo mà không được khởi tạo giá trị:",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng:",
    "re": "Có thể truy cập từng phần tử của mảng một cách tuần tự"
  },
  {
    "con": "Một hàm không trả về giá trị:",
    "re": "Sẽ trả về giá trị mặc định là null hoặc undefined"
  },
  {
    "con": "Sử dụng câu lệnh điều kiện if để kiểm tra một điều kiện:",
    "re": "Chương trình sẽ thực hiện khối lệnh tương ứng với điều kiện đó nếu đúng"
  },
  {
    "con": "Khi sử dụng toán tử == trong so sánh:",
    "re": "Chỉ so sánh giá trị mà không so sánh kiểu dữ liệu"
  },
  {
    "con": "Khi một hàm được gọi mà không có tham số:",
    "re": "Các tham số trong hàm sẽ nhận giá trị mặc định là undefined"
  },
  {
    "con": "Sử dụng mảng để lưu trữ nhiều giá trị:",
    "re": "Có thể truy cập các giá trị bằng chỉ số của chúng"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa const:",
    "re": "Biến đó không thể được gán lại giá trị mới"
  },
  {
    "con": "Khi sử dụng toán tử === trong so sánh:",
    "re": "Cả giá trị và kiểu dữ liệu của hai đối tượng phải giống nhau"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Chương trình sẽ không thể biên dịch và chạy"
  },
  {
    "con": "Để tạo danh sách liên kết, theo bạn sinh viên nào dưới đây là khai báo đúng cấu trúc tự trỏ sẽ được dùng:\n 1- Sinh viên 1:\n struct SV{char ht[25]; int tuoi; struct Sv *tiep;};\n 2- Sinh viên 2:\n typedef\n struct SV node;\n struct SV{char ht[25]; int tuoi; node *tiep;};\n 3- Sinh viên 3:\n typedef\n struct SV{char ht[25]; int tuoi; struct SV *tiep;} node;",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi sử dụng vòng lặp for, nếu điều kiện dừng không được xác định rõ ràng thì",
    "re": "vòng lặp có thể chạy vô hạn"
  },
  {
    "con": "Nếu bạn khai báo một biến nhưng không khởi tạo giá trị cho nó thì",
    "re": "biến đó sẽ chứa giá trị không xác định"
  },
  {
    "con": "Khi sử dụng hàm trong lập trình, nếu bạn không trả về giá trị từ hàm có kiểu trả về khác void thì",
    "re": "chương trình sẽ gặp lỗi biên dịch"
  },
  {
    "con": "Nếu bạn sử dụng mảng mà không kiểm tra giới hạn chỉ số thì",
    "re": "có thể xảy ra lỗi tràn bộ nhớ"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if-else, nếu không có khối else thì",
    "re": "chương trình sẽ chỉ thực hiện khối if khi điều kiện đúng"
  },
  {
    "con": "Nếu bạn không sử dụng từ khóa return trong hàm, thì",
    "re": "hàm sẽ không trả về giá trị mong muốn"
  },
  {
    "con": "Khi bạn sử dụng con trỏ, nếu không khởi tạo nó trước khi sử dụng thì",
    "re": "có thể dẫn đến lỗi truy cập bộ nhớ"
  },
  {
    "con": "Nếu bạn không giải phóng bộ nhớ đã cấp phát động, thì",
    "re": "chương trình sẽ gây ra rò rỉ bộ nhớ"
  },
  {
    "con": "Khi bạn sử dụng thư viện ngoài mà không bao gồm tệp tiêu đề tương ứng, thì",
    "re": "chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Kết quả của chương trình sau là gì:\n#include <stdio.h>\nvoid main()\n{struct diem;\n{float k;\nfloat a;\nfloat l;};\nstruct diem m;\nm.k = 8;\nm.a = 6.5;\nm.l = 6;\nprintf(“%0.1f%0.1f%0.1f”, m.k, m.a, m.l);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo sẽ có giá trị không xác định.",
    "re": "Giá trị của biến có thể gây ra lỗi khi sử dụng"
  },
  {
    "con": "Nếu một hàm không trả về giá trị, thì kiểu trả về của hàm đó phải là void.",
    "re": "Hàm sẽ không trả về giá trị nào"
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp while mà điều kiện không bao giờ sai, thì vòng lặp sẽ chạy vô hạn.",
    "re": "Chương trình sẽ không bao giờ dừng lại"
  },
  {
    "con": "Nếu bạn sử dụng toán tử == để so sánh hai biến kiểu số thực, thì kết quả có thể không chính xác do sai số số học.",
    "re": "Kết quả so sánh có thể không đúng"
  },
  {
    "con": "Nếu bạn không sử dụng dấu chấm phẩy ở cuối câu lệnh trong C, thì trình biên dịch sẽ báo lỗi cú pháp.",
    "re": "Lỗi cú pháp sẽ xảy ra"
  },
  {
    "con": "Nếu bạn khai báo một mảng với kích thước cố định, thì kích thước của mảng không thể thay đổi trong suốt quá trình thực thi chương trình.",
    "re": "Kích thước mảng là cố định"
  },
  {
    "con": "Nếu bạn gọi một hàm mà không truyền đủ tham số, thì trình biên dịch sẽ báo lỗi.",
    "re": "Lỗi tham số không đủ sẽ xảy ra"
  },
  {
    "con": "Nếu bạn sử dụng từ khóa return trong một hàm, thì hàm sẽ kết thúc ngay lập tức và trả về giá trị (nếu có).",
    "re": "Hàm sẽ dừng lại và trả về giá trị"
  },
  {
    "con": "Nếu bạn sử dụng toán tử ++ trên một biến, thì giá trị của biến đó sẽ tăng thêm 1.",
    "re": "Giá trị biến sẽ tăng lên 1"
  },
  {
    "con": "Chọn kết quả đúng cho chương trình sau:\n#include <stdio.h>\nvoid main()\n{clrscr();\nstruct sv\n{ float d;\nchar ht[10];};\nstruct sv m, *p;\np=&m;\n(*p).d=p->d=10;\nstrcpy(m.ht,”NguyenVanTuan”);\nprintf(“%0.1f”,m.d);\nprintf(“%s”,m.ht);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo với kiểu dữ liệu không hợp lệ",
    "re": "Chương trình sẽ báo lỗi biên dịch"
  },
  {
    "con": "Sử dụng vòng lặp for với điều kiện dừng không bao giờ đạt được",
    "re": "Vòng lặp sẽ chạy vô hạn"
  },
  {
    "con": "Gán giá trị cho một biến chưa được khởi tạo",
    "re": "Giá trị của biến có thể không xác định"
  },
  {
    "con": "Sử dụng hàm printf mà không bao gồm thư viện stdio.h",
    "re": "Chương trình sẽ báo lỗi biên dịch"
  },
  {
    "con": "Sử dụng toán tử ++ trên một biến kiểu số nguyên",
    "re": "Giá trị của biến sẽ tăng thêm 1"
  },
  {
    "con": "Khi gọi hàm mà không truyền đủ tham số",
    "re": "Chương trình sẽ báo lỗi biên dịch"
  },
  {
    "con": "Sử dụng mảng mà không kiểm tra chỉ số truy cập",
    "re": "Có thể gây ra lỗi truy cập bộ nhớ"
  },
  {
    "con": "Sử dụng biến toàn cục trong một hàm mà không khai báo lại",
    "re": "Hàm sẽ sử dụng giá trị của biến toàn cục"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện if mà không có khối lệnh đi kèm",
    "re": "Chương trình sẽ chỉ thực hiện lệnh tiếp theo ngay sau if"
  },
  {
    "con": "Đâu là kết quả của đoạn mã sau:\n struct Employee\n { char Code[], tộce[];\n long Salary;};\n Employee e1= { “E089”, “Hoang so”, 12000}, e2=e1;\n printf(“%ld”,el.Salary+e2 -> Salary);",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một biến được khai báo nhưng chưa được khởi tạo, giá trị của biến đó sẽ là giá trị ngẫu nhiên.",
    "re": "Giá trị của biến có thể không xác định"
  },
  {
    "con": "Nếu một hàm không trả về giá trị, thì kiểu trả về của hàm đó phải được khai báo là void.",
    "re": "Hàm sẽ không trả về giá trị nào"
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp for mà không có điều kiện dừng, thì chương trình sẽ chạy vô hạn.",
    "re": "Chương trình sẽ không bao giờ dừng lại"
  },
  {
    "con": "Nếu bạn cố gắng truy cập vào một phần tử ngoài phạm vi của mảng, thì chương trình có thể gây ra lỗi truy cập bộ nhớ.",
    "re": "Lỗi có thể xảy ra"
  },
  {
    "con": "Nếu bạn sử dụng toán tử == để so sánh hai chuỗi, thì kết quả sẽ không chính xác.",
    "re": "Cần sử dụng hàm strcmp để so sánh chuỗi"
  },
  {
    "con": "Nếu bạn khai báo một biến toàn cục, thì biến đó có thể được truy cập từ bất kỳ hàm nào trong chương trình.",
    "re": "Biến toàn cục có phạm vi toàn cục"
  },
  {
    "con": "Nếu bạn không sử dụng từ khóa return trong một hàm có kiểu trả về khác void, thì hành vi của chương trình sẽ không xác định.",
    "re": "Hành vi không xác định"
  },
  {
    "con": "Nếu bạn sử dụng toán tử ++ trước biến, thì biến sẽ được tăng giá trị trước khi được sử dụng.",
    "re": "Giá trị biến sẽ tăng trước khi sử dụng"
  },
  {
    "con": "Nếu bạn không kiểm tra điều kiện trước khi thực hiện phép chia, thì có thể xảy ra lỗi chia cho 0.",
    "re": "Lỗi chia cho 0 có thể xảy ra"
  },
  {
    "con": "char S[20]=”aaaaaea”;\n char* p=strstr(S,”e”);\n Nếu địa chỉ của S là 1000, thì giá trị của p là bao nhiêu:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu biến x được khai báo là int x = 5; và y = x + 3, thì giá trị của y là:",
    "re": "8"
  },
  {
    "con": "Nếu mảng A được khai báo là int A[5] = {1, 2, 3, 4, 5}; và A[2] được truy cập, thì giá trị của A[2] là:",
    "re": "3"
  },
  {
    "con": "Nếu hàm f được định nghĩa là int f(int a) { return a * 2; } và f(4) được gọi, thì giá trị trả về của f(4) là:",
    "re": "8"
  },
  {
    "con": "Nếu vòng lặp for được viết là for(int i = 0; i < 5; i++) { printf(\"%d \", i); } thì đầu ra của vòng lặp là:",
    "re": "0 1 2 3 4 "
  },
  {
    "con": "Nếu điều kiện if(x > 10) được sử dụng và x = 15, thì khối lệnh bên trong if sẽ được thực thi:",
    "re": "Đúng"
  },
  {
    "con": "Nếu biến chuỗi được khai báo là char str[10] = \"Hello\"; và strlen(str) được gọi, thì giá trị trả về của strlen(str) là:",
    "re": "5"
  },
  {
    "con": "Nếu một hàm không có giá trị trả về được khai báo là void myFunction() và được gọi, thì không có giá trị nào được trả về:",
    "re": "Đúng"
  },
  {
    "con": "Nếu một biến toàn cục được khai báo bên ngoài tất cả các hàm, thì biến đó có thể được truy cập từ bất kỳ hàm nào trong chương trình:",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mảng được khai báo là int arr[3] = {1, 2, 3}; và arr[3] được truy cập, thì sẽ xảy ra lỗi truy cập bộ nhớ:",
    "re": "Đúng"
  },
  {
    "con": "Một số tác vụ sau sẽ được áp dụng để kiểm tra xem một số nguyên là lẻ hay chẵn:\n 1- Begin(bắt đầu).\n 2- Nhập số nguyên n.\n 3- Nếu số đó là 0 thì hiển thị chuỗi: “Đây là số chẵn”.\n 4- Ngược lại hiển thị: “Đây là số lẻ”\n 5- Chia n cho 2;\n 6- End(kết thúc).\n Theo bạn, thứ tự các bước nào sau đây là đúng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bạn sử dụng biến để lưu trữ giá trị trong chương trình.",
    "re": "Biến giúp quản lý và thao tác dữ liệu hiệu quả."
  },
  {
    "con": "Khi bạn sử dụng vòng lặp để lặp lại một đoạn mã nhiều lần.",
    "re": "Vòng lặp giúp tiết kiệm thời gian và công sức lập trình."
  },
  {
    "con": "Nếu bạn định nghĩa một hàm mà không có tham số.",
    "re": "Hàm đó có thể được gọi mà không cần truyền dữ liệu vào."
  },
  {
    "con": "Khi bạn sử dụng cấu trúc điều kiện để kiểm tra một điều kiện.",
    "re": "Chương trình sẽ thực hiện các hành động khác nhau dựa trên kết quả của điều kiện đó."
  },
  {
    "con": "Nếu bạn sử dụng kiểu dữ liệu không chính xác cho một biến.",
    "re": "Chương trình có thể gặp lỗi khi thực thi."
  },
  {
    "con": "Khi bạn sử dụng comment trong mã nguồn.",
    "re": "Comment giúp người khác hiểu rõ hơn về mã của bạn."
  },
  {
    "con": "Nếu bạn không xử lý ngoại lệ trong chương trình.",
    "re": "Chương trình có thể bị dừng đột ngột khi gặp lỗi."
  },
  {
    "con": "Khi bạn sử dụng thư viện trong lập trình.",
    "re": "Thư viện giúp bạn tái sử dụng mã và tiết kiệm thời gian phát triển."
  },
  {
    "con": "Nếu bạn không kiểm tra đầu vào của người dùng.",
    "re": "Chương trình có thể nhận dữ liệu không hợp lệ và gây ra lỗi."
  },
  {
    "con": "Tìm kết quả của chương trình sau:\n main()\n {int n;\n for (n=18; n>0; n/=2)\n printf(“%3d”,n);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Sử dụng vòng lặp for với điều kiện dừng không chính xác",
    "re": "Chương trình có thể chạy vô hạn hoặc không bao giờ chạy"
  },
  {
    "con": "Gọi hàm mà không truyền đủ tham số",
    "re": "Chương trình sẽ báo lỗi biên dịch"
  },
  {
    "con": "Sử dụng toán tử chia cho 0 trong phép toán",
    "re": "Chương trình sẽ gây ra lỗi runtime"
  },
  {
    "con": "Khi sử dụng mảng, chỉ số vượt quá kích thước của mảng",
    "re": "Chương trình có thể truy cập vào vùng nhớ không hợp lệ"
  },
  {
    "con": "Sử dụng kiểu dữ liệu không tương thích trong phép toán",
    "re": "Chương trình sẽ báo lỗi biên dịch"
  },
  {
    "con": "Khi không sử dụng dấu chấm phẩy ở cuối câu lệnh trong C",
    "re": "Chương trình sẽ báo lỗi biên dịch"
  },
  {
    "con": "Khi sử dụng biến toàn cục trong hàm mà không khai báo lại",
    "re": "Hàm sẽ sử dụng giá trị của biến toàn cục"
  },
  {
    "con": "Khi không kiểm tra điều kiện trước khi truy cập vào con trỏ",
    "re": "Chương trình có thể gây ra lỗi truy cập bộ nhớ"
  },
  {
    "con": "Tìm kết quả của chương trình sau:\n #include <stdio.h>\n main()\n {int i, ch;\n for (i=0, ch=’A’; i<5; i++, ch++)\n putchar(ch);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi sử dụng vòng lặp for, nếu điều kiện dừng không bao giờ đạt được thì",
    "re": "vòng lặp sẽ chạy vô hạn"
  },
  {
    "con": "Nếu một biến được khai báo nhưng không được khởi tạo giá trị thì",
    "re": "giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Nếu bạn sử dụng toán tử == để so sánh hai chuỗi trong C thì",
    "re": "kết quả sẽ không chính xác vì toán tử này chỉ so sánh địa chỉ bộ nhớ"
  },
  {
    "con": "Nếu bạn không sử dụng từ khóa return trong hàm main() thì",
    "re": "chương trình có thể không trả về giá trị như mong đợi"
  },
  {
    "con": "Khi sử dụng mảng, nếu bạn truy cập vào chỉ số ngoài phạm vi của mảng thì",
    "re": "chương trình có thể gây ra lỗi hoặc hành vi không xác định"
  },
  {
    "con": "Nếu bạn không khai báo kiểu dữ liệu cho một biến trong C thì",
    "re": "trình biên dịch sẽ báo lỗi"
  },
  {
    "con": "Nếu bạn sử dụng hàm scanf mà không truyền địa chỉ của biến thì",
    "re": "giá trị không được lưu vào biến"
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp while mà không có điều kiện dừng thì",
    "re": "vòng lặp sẽ chạy vô hạn"
  },
  {
    "con": "Nếu bạn không bao gồm thư viện cần thiết cho hàm printf() thì",
    "re": "trình biên dịch sẽ báo lỗi không tìm thấy hàm"
  },
  {
    "con": "Tìm kết quả của chương trình sau:\n #include <stdio.h>\n main()\n {int i,ch;\n for (i=0,ch=’A’; i<4; i++,ch+=2)\n putchar(ch);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua các phần tử của mảng.",
    "re": "Có thể truy cập từng phần tử của mảng một cách tuần tự"
  },
  {
    "con": "Khi khai báo một biến trong ngôn ngữ lập trình, nếu không chỉ định kiểu dữ liệu thì",
    "re": "Biến đó sẽ không được biên dịch và gây lỗi"
  },
  {
    "con": "Nếu sử dụng toán tử == để so sánh hai giá trị khác kiểu dữ liệu thì",
    "re": "Kết quả so sánh có thể không chính xác do chuyển đổi kiểu"
  },
  {
    "con": "Khi sử dụng hàm trong lập trình, nếu không truyền đủ tham số cần thiết thì",
    "re": "Chương trình sẽ gây ra lỗi hoặc không hoạt động như mong đợi"
  },
  {
    "con": "Nếu sử dụng cấu trúc điều kiện if mà không có khối else thì",
    "re": "Chương trình chỉ thực hiện khối lệnh if khi điều kiện đúng"
  },
  {
    "con": "Khi sử dụng mảng, nếu chỉ định chỉ số ngoài phạm vi của mảng thì",
    "re": "Chương trình có thể gây ra lỗi truy cập bộ nhớ"
  },
  {
    "con": "Nếu không sử dụng từ khóa return trong hàm có kiểu trả về khác void thì",
    "re": "Chương trình có thể không hoạt động đúng và gây ra lỗi"
  },
  {
    "con": "Khi sử dụng vòng lặp while, nếu điều kiện luôn đúng thì",
    "re": "Vòng lặp sẽ trở thành vòng lặp vô hạn"
  },
  {
    "con": "Nếu không xử lý ngoại lệ trong chương trình thì",
    "re": "Chương trình có thể dừng lại đột ngột khi gặp lỗi"
  },
  {
    "con": "Có khai báo:\n char *ptr;\n char msg[10];\n char v;\n Câu nào sẽ đúng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sử dụng vòng lặp for với cú pháp đúng:",
    "re": "Vòng lặp sẽ thực thi đúng số lần đã chỉ định"
  },
  {
    "con": "Khi sử dụng hàm printf với định dạng không đúng:",
    "re": "Chương trình sẽ gặp lỗi biên dịch hoặc lỗi chạy"
  },
  {
    "con": "Khi khai báo biến mà không khởi tạo giá trị:",
    "re": "Biến sẽ chứa giá trị không xác định"
  },
  {
    "con": "Khi sử dụng toán tử == để so sánh hai giá trị:",
    "re": "Kết quả sẽ là true nếu hai giá trị bằng nhau, false nếu không"
  },
  {
    "con": "Khi gọi hàm mà không truyền đủ tham số:",
    "re": "Chương trình sẽ gặp lỗi biên dịch"
  },
  {
    "con": "Khi sử dụng mảng mà không kiểm tra chỉ số:",
    "re": "Có thể xảy ra lỗi tràn bộ nhớ (memory overflow)"
  },
  {
    "con": "Khi sử dụng biến toàn cục trong hàm:",
    "re": "Biến sẽ có thể được truy cập và thay đổi trong toàn bộ chương trình"
  },
  {
    "con": "Khi sử dụng kiểu dữ liệu không tương thích trong phép toán:",
    "re": "Chương trình sẽ gặp lỗi biên dịch hoặc lỗi chạy"
  },
  {
    "con": "Khi không sử dụng dấu chấm phẩy ở cuối câu lệnh:",
    "re": "Chương trình sẽ gặp lỗi biên dịch"
  },
  {
    "con": "Hàm nào trong các hàm sau thuộc các hàm nhập xuất không định dạng:\n 1- printf();\n 2- scanf();\n 3- getchar();\n 4- putchar();",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến nào trong các biến sau không thể lưu trữ giá trị số nguyên:\n 1- int a;\n 2- float b;\n 3- double c;\n 4- char d;",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cú pháp nào sau đây là đúng để khai báo một hàm trong ngôn ngữ C:\n 1- void myFunction();\n 2- function myFunction();\n 3- myFunction() void;\n 4- void:myFunction();",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một biến được khai báo là 'const', thì nó không thể:\n 1- Được thay đổi giá trị sau khi khởi tạo.\n 2- Được sử dụng trong các phép toán.\n 3- Được truyền vào hàm.\n 4- Được khai báo lại.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vòng lặp 'for' có cấu trúc như sau: for (int i = 0; i < 10; i++), thì nó sẽ lặp lại:\n 1- 9 lần.\n 2- 10 lần.\n 3- 11 lần.\n 4- Không lặp lại.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một mảng được khai báo là 'int arr[5];', thì nó có thể chứa:\n 1- 4 phần tử.\n 2- 5 phần tử.\n 3- 6 phần tử.\n 4- Không có phần tử nào.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hàm không trả về giá trị, thì kiểu trả về của nó phải là:\n 1- void.\n 2- int.\n 3- float.\n 4- char.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chương trình không có hàm 'main()', thì nó:\n 1- Vẫn có thể chạy bình thường.\n 2- Không thể biên dịch.\n 3- Chỉ chạy một phần.\n 4- Không có ảnh hưởng gì.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một biến được khai báo bên trong một hàm, thì phạm vi của biến đó là:\n 1- Toàn bộ chương trình.\n 2- Chỉ trong hàm đó.\n 3- Trong tất cả các hàm.\n 4- Trong một file.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chương trình sử dụng 'printf' để in ra giá trị, thì nó sẽ:\n 1- In ra giá trị trên màn hình.\n 2- Lưu giá trị vào file.\n 3- Không làm gì cả.\n 4- Gọi hàm khác.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chọn kết quả của đoạn code sau:\n for (int i=1; i<10; i++)\n for(int j=1; j<10; j++)\n if (j%i==0) printf(“Hello\\n”);",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo với từ khóa 'int' thì nó chỉ có thể chứa giá trị số nguyên.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hàm không trả về giá trị thì nó phải được khai báo với kiểu trả về là 'void'.",
    "re": "Đúng"
  },
  {
    "con": "Nếu sử dụng vòng lặp 'for' thì cần có điều kiện dừng để tránh vòng lặp vô hạn.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một biến không được khởi tạo trước khi sử dụng thì giá trị của nó sẽ không xác định.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mảng được khai báo với kích thước n thì nó có thể chứa tối đa n phần tử.",
    "re": "Đúng"
  },
  {
    "con": "Nếu sử dụng toán tử '==' để so sánh hai giá trị thì nó sẽ trả về true nếu hai giá trị đó bằng nhau.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một chương trình không có hàm 'main' thì nó sẽ không thể chạy được.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một biến được khai báo là 'const' thì giá trị của nó không thể thay đổi sau khi được khởi tạo.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một chuỗi được khai báo trong ngôn ngữ lập trình thì nó phải được đặt trong dấu nháy kép.",
    "re": "Đúng"
  },
  {
    "con": "Một số tác vụ sau sẽ được dùng để kiểm tra một số nguyên là lẻ hay chẵn:\n 1- Bắt đầu;\n 2- Nhập số nguyên n;\n 3- Nếu số dư là 0 thì hiển thị chuỗi: “Đây là số chẵn”;\n 4- Ngược lại hiển thị chuỗi: “Đây là số lẻ”;\n 5- Chia n cho 2;\n 6- Kết thúc;\n Thứ tự các bước như thế nào là đúng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được khởi tạo giá trị thì",
    "re": "Giá trị của biến đó sẽ là undefined"
  },
  {
    "con": "Một hàm được định nghĩa nhưng không được gọi thì",
    "re": "Hàm đó sẽ không thực thi"
  },
  {
    "con": "Nếu một vòng lặp không có điều kiện dừng thì",
    "re": "Vòng lặp đó sẽ chạy vô hạn"
  },
  {
    "con": "Khi sử dụng toán tử so sánh '==' thì",
    "re": "Hai giá trị sẽ được so sánh sau khi chuyển đổi kiểu dữ liệu nếu cần"
  },
  {
    "con": "Nếu một mảng được khai báo nhưng không có phần tử nào thì",
    "re": "Độ dài của mảng đó sẽ là 0"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa 'const' thì",
    "re": "Biến đó không thể được gán lại giá trị mới"
  },
  {
    "con": "Nếu một chương trình không có lỗi cú pháp thì",
    "re": "Chương trình có thể được biên dịch và chạy"
  },
  {
    "con": "Khi sử dụng toán tử '===' thì",
    "re": "Hai giá trị sẽ được so sánh mà không chuyển đổi kiểu dữ liệu"
  },
  {
    "con": "Nếu một đối tượng không có thuộc tính nào thì",
    "re": "Khi truy cập thuộc tính đó sẽ trả về undefined"
  },
  {
    "con": "Cho đoạn chương trình sau:\n int n=0;\n for (int i=0; i<10; i+=4) n+=i;\n Giá trị của biến n là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một biến được khai báo nhưng chưa được gán giá trị, thì giá trị của biến đó là:",
    "re": "Không xác định"
  },
  {
    "con": "Nếu một hàm không trả về giá trị nào, thì kiểu trả về của hàm đó phải là:",
    "re": "void"
  },
  {
    "con": "Khi sử dụng vòng lặp for, nếu điều kiện dừng không bao giờ đạt được, thì vòng lặp sẽ:",
    "re": "Chạy vô hạn"
  },
  {
    "con": "Nếu một mảng có kích thước n, thì chỉ số hợp lệ của mảng đó là từ:",
    "re": "0 đến n-1"
  },
  {
    "con": "Khi sử dụng toán tử chia trong lập trình, nếu chia cho 0, thì chương trình sẽ:",
    "re": "Gây ra lỗi"
  },
  {
    "con": "Nếu một biến được khai báo là 'const', thì biến đó:",
    "re": "Không thể thay đổi giá trị sau khi đã gán"
  },
  {
    "con": "Khi gọi một hàm, nếu không truyền đủ tham số cần thiết, thì chương trình sẽ:",
    "re": "Gây ra lỗi biên dịch"
  },
  {
    "con": "Nếu một chuỗi được khai báo trong ngôn ngữ lập trình, thì chuỗi đó có thể được truy cập bằng cách sử dụng:",
    "re": "Chỉ số"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if-else, nếu điều kiện if là đúng, thì khối lệnh nào sẽ được thực thi:",
    "re": "Khối lệnh trong if"
  },
  {
    "con": "Nghiên cứu đoạn code sau:\n FILE* f= fopen(“FL.txt”,”r”);\n int n=7;\n fprintf(f,”%d”,n);\n Hãy chọn câu đúng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một biến được khai báo nhưng chưa được khởi tạo:",
    "re": "Giá trị của biến đó là không xác định"
  },
  {
    "con": "Nếu một hàm không trả về giá trị:",
    "re": "Hàm đó phải được khai báo với kiểu trả về là void"
  },
  {
    "con": "Khi sử dụng vòng lặp for:",
    "re": "Cấu trúc của nó bao gồm khởi tạo, điều kiện và bước lặp"
  },
  {
    "con": "Nếu một mảng được khai báo với kích thước n:",
    "re": "Chỉ số của mảng sẽ từ 0 đến n-1"
  },
  {
    "con": "Khi sử dụng câu lệnh điều kiện if:",
    "re": "Câu lệnh else sẽ được thực thi nếu điều kiện if là sai"
  },
  {
    "con": "Nếu một biến được khai báo là hằng số (const):",
    "re": "Giá trị của biến đó không thể thay đổi trong suốt chương trình"
  },
  {
    "con": "Khi gọi một hàm trong chương trình:",
    "re": "Các tham số truyền vào phải tương ứng với kiểu dữ liệu mà hàm yêu cầu"
  },
  {
    "con": "Nếu một chương trình có lỗi biên dịch:",
    "re": "Chương trình sẽ không thể chạy cho đến khi lỗi được sửa"
  },
  {
    "con": "Khi sử dụng kiểu dữ liệu chuỗi (string):",
    "re": "Chuỗi phải được kết thúc bằng ký tự null ('\\0') trong ngôn ngữ C"
  },
  {
    "con": "Khi bạn khai báo một biến trong chương trình,",
    "re": "biến đó sẽ được sử dụng để lưu trữ giá trị trong suốt vòng đời của nó."
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp for mà không có điều kiện dừng,",
    "re": "chương trình sẽ rơi vào trạng thái lặp vô hạn."
  },
  {
    "con": "Khi bạn gọi một hàm mà không truyền đủ tham số,",
    "re": "chương trình sẽ gặp lỗi biên dịch hoặc lỗi thời gian chạy."
  },
  {
    "con": "Nếu bạn sử dụng toán tử == để so sánh hai giá trị,",
    "re": "kết quả sẽ là true nếu hai giá trị đó bằng nhau."
  },
  {
    "con": "Khi bạn khai báo một mảng,",
    "re": "bạn cần chỉ định kích thước của mảng để có thể lưu trữ các phần tử."
  },
  {
    "con": "Nếu bạn không xử lý ngoại lệ trong chương trình,",
    "re": "chương trình có thể dừng lại khi gặp lỗi."
  },
  {
    "con": "Khi bạn sử dụng cấu trúc điều kiện if-else,",
    "re": "chương trình sẽ thực hiện khối lệnh của điều kiện đúng đầu tiên."
  },
  {
    "con": "Nếu bạn không khởi tạo biến trước khi sử dụng,",
    "re": "giá trị của biến đó sẽ không xác định và có thể gây ra lỗi."
  },
  {
    "con": "Khi bạn sử dụng hàm trả về giá trị,",
    "re": "bạn cần phải lưu giá trị đó vào một biến hoặc sử dụng nó ngay lập tức."
  },
  {
    "con": "Cho khai báo FILE *f1,*f2; int c; và đoạn lệnh:\n f1=fopen(“source”,”rt”); f2=fopen(“TARGET”,”wt”);\n while((c=fgetc(f1))!=EOF) fputc(c,f2);\n Trong trường hợp tổng quát, hãy cho biết các khẳng định sau, khẳng định nào đúng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Giả sử tệp DATA chứa 5 byte: “70, 26, 13, 10, 44”. Cho đoạn lệnh:\n FILE *f;\n char ch;\n f=fopen(“DATA”,”r”);\n while(!feof(f)) { ch=fgetc(f); printf(“%c”,ch);};\n fclose(f);\n Hãy cho biết kết quả của đoạn chương trình trên:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một biến được khai báo nhưng chưa được khởi tạo,",
    "re": "thì giá trị của biến đó sẽ không xác định."
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp for với điều kiện dừng không bao giờ đạt được,",
    "re": "thì vòng lặp sẽ chạy vô hạn."
  },
  {
    "con": "Nếu bạn gọi hàm mà không truyền đủ tham số cần thiết,",
    "re": "thì chương trình sẽ báo lỗi biên dịch."
  },
  {
    "con": "Nếu bạn sử dụng toán tử chia cho 0 trong một phép toán,",
    "re": "thì chương trình sẽ gây ra lỗi runtime."
  },
  {
    "con": "Nếu bạn sử dụng mảng mà không kiểm tra chỉ số,",
    "re": "thì có thể xảy ra lỗi truy cập bộ nhớ."
  },
  {
    "con": "Nếu bạn không giải phóng bộ nhớ đã cấp phát động,",
    "re": "thì sẽ dẫn đến rò rỉ bộ nhớ."
  },
  {
    "con": "Nếu bạn sử dụng kiểu dữ liệu không phù hợp cho một phép toán,",
    "re": "thì có thể xảy ra lỗi biên dịch hoặc kết quả không chính xác."
  },
  {
    "con": "Nếu bạn không sử dụng dấu chấm phẩy ở cuối câu lệnh trong ngôn ngữ C,",
    "re": "thì chương trình sẽ báo lỗi biên dịch."
  },
  {
    "con": "Nếu bạn sử dụng biến toàn cục trong một hàm mà không khai báo,",
    "re": "thì chương trình sẽ không nhận diện được biến đó."
  },
  {
    "con": "f là con trỏ trỏ đến tệp nhị phân DATA chứa không quá 100 bản ghi( kiểu cấu trúc) liền nhau. Cho khai báo:\n struct T {…};\n struct T x[100];\n int i=0, n=0;\n Đoạn chương trình nào sau đây đọc toàn bộ các bảng ghi trong DATA vào x:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo với từ khóa 'int' và gán giá trị 5, thì biến đó có kiểu dữ liệu là số nguyên.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hàm không trả về giá trị, thì kiểu trả về của hàm đó phải được khai báo là 'void'.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một vòng lặp 'for' được sử dụng với điều kiện dừng là sai, thì vòng lặp đó sẽ không được thực thi.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một mảng được khai báo với kích thước 10, thì chỉ có thể lưu trữ tối đa 10 phần tử trong mảng đó.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một biến được khai báo là 'const', thì giá trị của biến đó không thể thay đổi sau khi được gán.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hàm được gọi mà không có đủ tham số, thì chương trình sẽ báo lỗi biên dịch.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một chuỗi được khai báo trong C bằng cách sử dụng dấu nháy kép, thì chuỗi đó sẽ tự động kết thúc bằng ký tự null '\\0'.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một con trỏ trỏ đến một vùng nhớ không hợp lệ, thì việc truy cập vào vùng nhớ đó có thể gây ra lỗi chương trình.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một cấu trúc được khai báo với nhiều trường, thì có thể truy cập từng trường của cấu trúc đó bằng toán tử '.'.",
    "re": "Đúng"
  },
  {
    "con": "Phát biểu nào sau đây là đúng khi nói về chế độ truyền:\n 1- Trong chế độ nhị phân, các byte được xử lí khác với giá trị trên thiết bị ngoại vi và có sự thực hiện chuyển đổi.\n 2- Trong chế độ nhị phân, các kí tự được tổ chức thành từng dòng, được kết thúc bằng kí tự xuống dòng và có sự chuyển đổi.\n 3- Trong chế độ văn bản, các kí tự được tổ chức thành từng dòng, mỗi dòng kết thúc bằng kí tự xuống dòng, có sự chuyển đổi của một số kí tự theo yêu cầu của môi trường.\n 4- Trong chế độ nhị phân, các byte được xử lí đúng như giá trị trên thiết bị ngoại vi và không có sự thực hiện chuyển đổi nào.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chương trình được viết bằng ngôn ngữ lập trình bậc cao sẽ dễ đọc và bảo trì hơn so với chương trình viết bằng ngôn ngữ máy.",
    "re": "Chương trình dễ hiểu hơn"
  },
  {
    "con": "Khi sử dụng biến trong lập trình, nếu biến không được khởi tạo trước khi sử dụng, thì chương trình có thể gặp lỗi khi chạy.",
    "re": "Chương trình có thể gặp lỗi"
  },
  {
    "con": "Nếu một hàm được định nghĩa nhưng không được gọi trong chương trình, thì hàm đó sẽ không được thực thi.",
    "re": "Hàm không được thực thi"
  },
  {
    "con": "Khi sử dụng vòng lặp, nếu điều kiện dừng không bao giờ đạt được, thì vòng lặp sẽ chạy vô hạn.",
    "re": "Vòng lặp sẽ chạy vô hạn"
  },
  {
    "con": "Nếu một ngôn ngữ lập trình hỗ trợ lập trình hướng đối tượng, thì nó cho phép tổ chức mã nguồn theo các đối tượng và lớp.",
    "re": "Tổ chức mã nguồn theo đối tượng và lớp"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện, nếu điều kiện là đúng, thì khối lệnh trong cấu trúc điều kiện sẽ được thực thi.",
    "re": "Khối lệnh sẽ được thực thi"
  },
  {
    "con": "Nếu một biến được khai báo là hằng số, thì giá trị của biến đó không thể thay đổi trong suốt quá trình thực thi chương trình.",
    "re": "Giá trị không thể thay đổi"
  },
  {
    "con": "Khi sử dụng mảng, nếu chỉ số truy cập nằm ngoài giới hạn của mảng, thì chương trình có thể gặp lỗi.",
    "re": "Chương trình có thể gặp lỗi"
  },
  {
    "con": "Nếu một ngôn ngữ lập trình có hỗ trợ thư viện, thì lập trình viên có thể sử dụng lại mã nguồn đã được viết sẵn.",
    "re": "Có thể sử dụng lại mã nguồn"
  },
  {
    "con": "Cho khai báo:\n struct T {int x; float y;} t, *p, a[10];\n Câu lệnh nào không hợp lệ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được khởi tạo:",
    "re": "Giá trị của biến đó có thể không xác định"
  },
  {
    "con": "Sử dụng vòng lặp for với điều kiện dừng không hợp lệ:",
    "re": "Chương trình có thể gây ra lỗi hoặc chạy vô hạn"
  },
  {
    "con": "Khi gọi một hàm mà không truyền đủ tham số:",
    "re": "Chương trình sẽ báo lỗi biên dịch"
  },
  {
    "con": "Khi sử dụng toán tử chia cho 0:",
    "re": "Chương trình sẽ gây ra lỗi runtime"
  },
  {
    "con": "Khi sử dụng biến chưa được khai báo:",
    "re": "Chương trình sẽ báo lỗi biên dịch"
  },
  {
    "con": "Khi sử dụng mảng với chỉ số vượt quá kích thước của nó:",
    "re": "Chương trình có thể gây ra lỗi hoặc truy cập vào vùng nhớ không hợp lệ"
  },
  {
    "con": "Khi sử dụng kiểu dữ liệu không tương thích trong phép toán:",
    "re": "Chương trình sẽ báo lỗi biên dịch"
  },
  {
    "con": "Khi không sử dụng dấu chấm phẩy ở cuối câu lệnh trong ngôn ngữ lập trình C:",
    "re": "Chương trình sẽ báo lỗi biên dịch"
  },
  {
    "con": "Khi không kiểm tra điều kiện trước khi truy cập vào con trỏ:",
    "re": "Chương trình có thể gây ra lỗi truy cập bộ nhớ"
  },
  {
    "con": "Cho các khai báo sau:\n struct ngay{ int ng, th, n;} vaotruong, ratruong;\n typedef struct sinhvien{ char hoten; ngay ngaysinh;};\n Hãy chọn câu đúng nhất:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi bạn sử dụng vòng lặp for để lặp qua một mảng,",
    "re": "bạn cần đảm bảo rằng chỉ số không vượt quá kích thước của mảng."
  },
  {
    "con": "Nếu bạn khai báo một biến nhưng không khởi tạo giá trị cho nó,",
    "re": "giá trị của biến đó sẽ không xác định."
  },
  {
    "con": "Khi bạn sử dụng hàm trong lập trình,",
    "re": "bạn cần đảm bảo rằng các tham số được truyền vào đúng kiểu dữ liệu."
  },
  {
    "con": "Nếu bạn muốn kiểm tra điều kiện trong một câu lệnh if,",
    "re": "bạn cần sử dụng dấu ngoặc đơn để bao quanh biểu thức điều kiện."
  },
  {
    "con": "Khi bạn sử dụng mảng,",
    "re": "bạn cần nhớ rằng chỉ số bắt đầu từ 0 trong hầu hết các ngôn ngữ lập trình."
  },
  {
    "con": "Nếu bạn muốn sử dụng một thư viện bên ngoài trong chương trình của mình,",
    "re": "bạn cần phải bao gồm tệp tiêu đề tương ứng."
  },
  {
    "con": "Khi bạn viết mã, nếu bạn không sử dụng các chú thích,",
    "re": "mã của bạn có thể trở nên khó hiểu cho người khác và cả cho chính bạn sau này."
  },
  {
    "con": "Nếu bạn gặp lỗi biên dịch,",
    "re": "bạn nên đọc kỹ thông báo lỗi để xác định nguyên nhân và sửa chữa."
  },
  {
    "con": "Khi bạn sử dụng biến toàn cục,",
    "re": "bạn cần cẩn thận để tránh xung đột tên với các biến cục bộ."
  },
  {
    "con": "Trong các khởi tạo giá trị cho các cấu trúc sau, hãy chọn câu đúng:\n struct S1{ int ngay, thang, tộc;}; S1=(2, 1, 3);\n struct S2{ char hoten[10]; struct S1 ngaysinh;}; S2={“Ly Ly”, {4, 5, 6}};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi sử dụng vòng lặp for, nếu biến điều kiện không được cập nhật trong thân vòng lặp,",
    "re": "vòng lặp sẽ trở thành vòng lặp vô hạn"
  },
  {
    "con": "Nếu một hàm không có giá trị trả về,",
    "re": "nó phải được khai báo với kiểu trả về là void"
  },
  {
    "con": "Khi sử dụng mảng, nếu chỉ định một chỉ số ngoài phạm vi của mảng,",
    "re": "chương trình có thể gây ra lỗi truy cập bộ nhớ"
  },
  {
    "con": "Nếu bạn muốn sử dụng một thư viện trong chương trình,",
    "re": "bạn cần phải bao gồm nó bằng cách sử dụng chỉ thị #include"
  },
  {
    "con": "Khi so sánh hai chuỗi trong C, nếu sử dụng toán tử ==,",
    "re": "kết quả sẽ không đúng vì nó so sánh địa chỉ bộ nhớ thay vì nội dung"
  },
  {
    "con": "Nếu bạn muốn đọc dữ liệu từ bàn phím,",
    "re": "bạn có thể sử dụng hàm scanf"
  },
  {
    "con": "Khi khai báo một biến toàn cục, nếu bạn muốn sử dụng nó trong một hàm,",
    "re": "bạn không cần phải khai báo lại biến đó trong hàm"
  },
  {
    "con": "Nếu bạn sử dụng toán tử ++ trước biến,",
    "re": "biến sẽ được tăng giá trị trước khi sử dụng trong biểu thức"
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if, nếu điều kiện là sai,",
    "re": "các câu lệnh trong khối else sẽ được thực thi"
  },
  {
    "con": "Cho đoạn chương trình sau:\n struct { int to; float soluong;} x[10];\n for (int i=0; i<10; i++) scanf(“%d%f”,&x[i].to,&x[i].soluong);\n Chọn câu đúng nhất trong các câu sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được khởi tạo giá trị ban đầu",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Khi sử dụng vòng lặp for với điều kiện dừng là i < n",
    "re": "Vòng lặp sẽ chạy n lần nếu n là số nguyên dương"
  },
  {
    "con": "Khi một hàm không trả về giá trị (void)",
    "re": "Hàm đó không thể được sử dụng trong biểu thức"
  },
  {
    "con": "Khi sử dụng toán tử == để so sánh hai biến",
    "re": "Kết quả sẽ là true nếu hai biến có giá trị bằng nhau"
  },
  {
    "con": "Khi một mảng được khai báo với kích thước cố định",
    "re": "Kích thước của mảng không thể thay đổi trong suốt quá trình thực thi chương trình"
  },
  {
    "con": "Khi sử dụng câu lệnh if mà điều kiện là false",
    "re": "Câu lệnh trong khối if sẽ không được thực thi"
  },
  {
    "con": "Khi một biến được khai báo là static",
    "re": "Biến đó sẽ giữ giá trị giữa các lần gọi hàm"
  },
  {
    "con": "Khi một chương trình có lỗi cú pháp",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Khi sử dụng toán tử ++ trên một biến số nguyên",
    "re": "Giá trị của biến đó sẽ tăng thêm 1"
  },
  {
    "con": "Để dùng danh sách liên kết, xét hai khai báo sau(cần 1KB để lưu dữ thông tin về một sinh viên):\n 1- Khai báo 1: struct SV{ thongtin; struct SV *tiep;};\n 2- Khai báo 2: struct SV {thongtin}; struct DS{struct SV* sv; struct DS* tiep;};\n (Với “thongtin” là một thành phần dữ liệu của cấu trúc); Chọn câu đúng nhất trong các câu sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn muốn kiểm tra xem một số có phải là số nguyên tố hay không,",
    "re": "thì bạn cần kiểm tra xem nó có chia hết cho bất kỳ số nào từ 2 đến căn bậc hai của nó."
  },
  {
    "con": "Nếu bạn sử dụng vòng lặp for để lặp qua một mảng,",
    "re": "thì bạn cần đảm bảo rằng chỉ số không vượt quá kích thước của mảng."
  },
  {
    "con": "Nếu bạn muốn sử dụng hàm trong chương trình của mình,",
    "re": "thì bạn cần khai báo hàm trước khi gọi nó hoặc sử dụng prototype."
  },
  {
    "con": "Nếu bạn muốn xử lý ngoại lệ trong chương trình,",
    "re": "thì bạn cần sử dụng cấu trúc try-catch để bắt lỗi."
  },
  {
    "con": "Nếu bạn muốn lưu trữ dữ liệu trong một tệp,",
    "re": "thì bạn cần mở tệp với chế độ thích hợp trước khi ghi hoặc đọc dữ liệu."
  },
  {
    "con": "Nếu bạn muốn sử dụng biến toàn cục trong một hàm,",
    "re": "thì bạn cần khai báo biến đó bên ngoài tất cả các hàm."
  },
  {
    "con": "Nếu bạn muốn tối ưu hóa mã nguồn của mình,",
    "re": "thì bạn nên tránh lặp lại mã và sử dụng các hàm để tái sử dụng."
  },
  {
    "con": "Nếu bạn muốn sử dụng kiểu dữ liệu tùy chỉnh,",
    "re": "thì bạn cần sử dụng cấu trúc (struct) hoặc lớp (class) để định nghĩa nó."
  },
  {
    "con": "Nếu bạn muốn thực hiện các phép toán trên chuỗi,",
    "re": "thì bạn cần sử dụng các hàm xử lý chuỗi có sẵn trong ngôn ngữ lập trình."
  },
  {
    "con": "Cho đoạn chương trình:\n char S[] = “Helen”;\n char *p = S;\n char c = *(p+3);\n Giá trị của c sẽ là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một biến được khai báo nhưng chưa được khởi tạo, giá trị của biến đó sẽ là:",
    "re": "Giá trị không xác định"
  },
  {
    "con": "Nếu một vòng lặp while không có điều kiện dừng, thì:",
    "re": "Vòng lặp sẽ chạy vô hạn"
  },
  {
    "con": "Khi sử dụng toán tử == để so sánh hai biến kiểu số nguyên, thì:",
    "re": "Kết quả sẽ là true nếu hai biến có giá trị bằng nhau"
  },
  {
    "con": "Nếu một hàm không trả về giá trị, thì:",
    "re": "Hàm đó phải được khai báo với kiểu trả về là void"
  },
  {
    "con": "Khi một mảng được khai báo, kích thước của mảng phải là:",
    "re": "Một số nguyên dương"
  },
  {
    "con": "Nếu một biến toàn cục và một biến cục bộ có cùng tên, thì:",
    "re": "Biến cục bộ sẽ che khuất biến toàn cục trong phạm vi của nó"
  },
  {
    "con": "Khi sử dụng toán tử ++ trước một biến, thì:",
    "re": "Giá trị của biến sẽ được tăng lên trước khi sử dụng"
  },
  {
    "con": "Nếu một chuỗi được khai báo bằng cách sử dụng dấu nháy đơn, thì:",
    "re": "Đó sẽ không phải là một chuỗi hợp lệ trong ngôn ngữ C"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp, thì:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Xem đoạn code sau:\n typedef struct ST{ int d1,d2,d3;};\n ST v= {5, 6, 7};\n ST* p=&v;\n p.d1++;\n Giá trị của biến v là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một biến được khai báo nhưng chưa được khởi tạo,",
    "re": "giá trị của biến đó sẽ không xác định."
  },
  {
    "con": "Nếu một hàm không trả về giá trị,",
    "re": "thì kiểu trả về của hàm đó phải được khai báo là void."
  },
  {
    "con": "Khi sử dụng vòng lặp for, nếu điều kiện dừng không bao giờ đạt được,",
    "re": "vòng lặp sẽ trở thành vòng lặp vô hạn."
  },
  {
    "con": "Nếu bạn sử dụng toán tử == để so sánh hai chuỗi,",
    "re": "thì kết quả sẽ không chính xác vì nó so sánh địa chỉ bộ nhớ thay vì nội dung."
  },
  {
    "con": "Khi một mảng được truyền vào hàm,",
    "re": "thì hàm nhận được địa chỉ của phần tử đầu tiên của mảng đó."
  },
  {
    "con": "Nếu bạn sử dụng toán tử ++ trước một biến,",
    "re": "thì biến đó sẽ được tăng giá trị trước khi được sử dụng trong biểu thức."
  },
  {
    "con": "Khi sử dụng cấu trúc điều kiện if-else, nếu điều kiện if là đúng,",
    "re": "thì khối lệnh trong else sẽ không được thực thi."
  },
  {
    "con": "Nếu bạn khai báo một biến toàn cục trong một hàm,",
    "re": "thì biến đó sẽ không thể được truy cập từ bên ngoài hàm."
  },
  {
    "con": "Khi sử dụng mảng, nếu bạn cố gắng truy cập vào chỉ số ngoài phạm vi của mảng,",
    "re": "thì sẽ xảy ra lỗi truy cập bộ nhớ."
  },
  {
    "con": "Xem đoạn code sau:\n typedef struct STUDENT{ int d1, d2, d3;};\n STUDENT v= {2, 3, 4};\n v.d1++;\n Giá trị trung bình của các trường trong biến v là gì:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi bạn sử dụng vòng lặp for để lặp qua một mảng có n phần tử, và bạn không thay đổi giá trị của biến điều kiện lặp,",
    "re": "vòng lặp sẽ chạy vô hạn"
  },
  {
    "con": "Nếu bạn khai báo một biến nhưng không khởi tạo giá trị cho nó,",
    "re": "giá trị của biến đó sẽ không xác định và có thể gây ra lỗi khi sử dụng"
  },
  {
    "con": "Khi bạn sử dụng hàm printf để in ra một chuỗi, và bạn quên thêm ký tự kết thúc chuỗi '\\0',",
    "re": "chương trình có thể gặp lỗi hoặc in ra dữ liệu không mong muốn"
  },
  {
    "con": "Nếu bạn sử dụng toán tử == để so sánh hai chuỗi trong C,",
    "re": "kết quả sẽ không đúng vì toán tử này so sánh địa chỉ bộ nhớ thay vì nội dung chuỗi"
  },
  {
    "con": "Khi bạn định nghĩa một hàm mà không có kiểu trả về,",
    "re": "chương trình sẽ cảnh báo hoặc lỗi vì hàm cần phải có kiểu trả về rõ ràng"
  },
  {
    "con": "Nếu bạn sử dụng mảng mà không kiểm tra kích thước của nó trước khi truy cập,",
    "re": "bạn có thể gặp lỗi tràn bộ nhớ (buffer overflow)"
  },
  {
    "con": "Khi bạn sử dụng từ khóa 'return' trong một hàm,",
    "re": "hàm sẽ kết thúc và trả về giá trị cho nơi gọi hàm"
  },
  {
    "con": "Nếu bạn không sử dụng dấu chấm phẩy ';' ở cuối câu lệnh trong C,",
    "re": "chương trình sẽ báo lỗi cú pháp"
  },
  {
    "con": "Khi bạn sử dụng biến toàn cục trong một hàm mà không khai báo lại,",
    "re": "hàm sẽ sử dụng giá trị của biến toàn cục đó"
  },
  {
    "con": "Chọn kết quả hợp lí cho chương trình sau:\nvoid main()\n{struct sv\n{ float d;\nchar ht[10];};\nstruct sv m, *p; p=&m;\nprintf(“%p”,&m);\nprintf(“%p”,p);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sử dụng biến chưa được khởi tạo trong chương trình.",
    "re": "Có thể dẫn đến kết quả không xác định"
  },
  {
    "con": "Viết một hàm không có giá trị trả về nhưng lại sử dụng từ khóa return.",
    "re": "Sẽ gây ra lỗi biên dịch"
  },
  {
    "con": "Sử dụng vòng lặp while mà không có điều kiện dừng.",
    "re": "Sẽ tạo ra vòng lặp vô hạn"
  },
  {
    "con": "Khi sử dụng mảng, truy cập vào chỉ số ngoài giới hạn của mảng.",
    "re": "Có thể gây ra lỗi truy cập bộ nhớ"
  },
  {
    "con": "Khi gọi hàm, không truyền đủ tham số cần thiết.",
    "re": "Sẽ gây ra lỗi biên dịch hoặc lỗi chạy"
  },
  {
    "con": "Sử dụng toán tử gán '=' thay vì toán tử so sánh '==' trong điều kiện.",
    "re": "Sẽ dẫn đến kết quả không như mong đợi"
  },
  {
    "con": "Khi khai báo biến, không chỉ định kiểu dữ liệu.",
    "re": "Sẽ gây ra lỗi biên dịch"
  },
  {
    "con": "Sử dụng thư viện mà không bao gồm tệp tiêu đề tương ứng.",
    "re": "Sẽ gây ra lỗi biên dịch"
  },
  {
    "con": "Khi sử dụng con trỏ, không kiểm tra xem nó có NULL hay không trước khi truy cập.",
    "re": "Có thể gây ra lỗi truy cập bộ nhớ"
  },
  {
    "con": "Chương trình sau cho kết quả là gì:\n #include <stdio.h>\n void main()\n {int *px, *py;\n int a[]={1,2,3,4,5,6};\n px=a;\n py=&a[5];\n printf(“%d”,++px-py);};",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo thì giá trị của biến đó là gì?",
    "re": "Giá trị không xác định"
  },
  {
    "con": "Nếu một hàm không trả về giá trị thì kiểu trả về của hàm đó phải là gì?",
    "re": "void"
  },
  {
    "con": "Khi sử dụng vòng lặp for, nếu điều kiện dừng không bao giờ đúng thì vòng lặp sẽ xảy ra điều gì?",
    "re": "Vòng lặp sẽ chạy vô hạn"
  },
  {
    "con": "Nếu một mảng được khai báo với kích thước n, thì chỉ số hợp lệ của mảng đó là gì?",
    "re": "Từ 0 đến n-1"
  },
  {
    "con": "Khi sử dụng toán tử == để so sánh hai biến, nếu hai biến có giá trị khác nhau thì kết quả sẽ là gì?",
    "re": "false"
  },
  {
    "con": "Nếu một chương trình không có hàm main(), thì chương trình đó sẽ như thế nào?",
    "re": "Không thể biên dịch và chạy"
  },
  {
    "con": "Nếu một biến được khai báo là const, thì biến đó có thể được thay đổi giá trị hay không?",
    "re": "Không thể thay đổi giá trị"
  },
  {
    "con": "Khi sử dụng toán tử ++ trước biến, thì giá trị của biến đó sẽ được thay đổi như thế nào?",
    "re": "Giá trị biến sẽ được tăng lên 1 trước khi sử dụng"
  },
  {
    "con": "Nếu một chương trình có nhiều hàm, thì hàm nào sẽ được gọi đầu tiên khi chương trình chạy?",
    "re": "Hàm main()"
  },
  {
    "con": "Cho khai báo sau:\nstruct Date\n{ unsigned int ngay:5;\nunsigned int thang;\nunsigned int nam: 11;} sn1;\nSố lượng bít sử dụng trong biến cấu trúc trên là bao nhiêu:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một biến được khai báo nhưng chưa được khởi tạo:",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Nếu một hàm không trả về giá trị:",
    "re": "Kiểu trả về của hàm đó phải là void"
  },
  {
    "con": "Khi sử dụng vòng lặp for:",
    "re": "Cú pháp phải bao gồm khởi tạo, điều kiện và bước lặp"
  },
  {
    "con": "Nếu một mảng được khai báo với kích thước n:",
    "re": "Chỉ số của mảng sẽ bắt đầu từ 0 và kết thúc ở n-1"
  },
  {
    "con": "Khi sử dụng toán tử so sánh trong điều kiện if:",
    "re": "Kết quả sẽ là true hoặc false"
  },
  {
    "con": "Nếu một biến được khai báo là const:",
    "re": "Giá trị của biến đó không thể thay đổi sau khi được khởi tạo"
  },
  {
    "con": "Khi sử dụng hàm printf trong C:",
    "re": "Cần phải bao gồm thư viện stdio.h"
  },
  {
    "con": "Nếu một chương trình không có hàm main:",
    "re": "Chương trình sẽ không thể biên dịch và chạy"
  },
  {
    "con": "Khi sử dụng kiểu dữ liệu pointer:",
    "re": "Cần phải sử dụng toán tử & để lấy địa chỉ của biến"
  },
  {
    "con": "Phát biểu nào sau là đúng khi nói về hàm fgets():",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một biến được khai báo nhưng không được khởi tạo:",
    "re": "Có thể chứa giá trị không xác định"
  },
  {
    "con": "Khi sử dụng vòng lặp for, điều kiện dừng không được xác định:",
    "re": "Vòng lặp có thể chạy vô hạn"
  },
  {
    "con": "Một hàm không trả về giá trị:",
    "re": "Được gọi là hàm void"
  },
  {
    "con": "Khi sử dụng mảng, chỉ số bắt đầu từ 0:",
    "re": "Chỉ số cuối cùng là kích thước mảng trừ 1"
  },
  {
    "con": "Khi một biến được khai báo là hằng số:",
    "re": "Giá trị của nó không thể thay đổi trong suốt chương trình"
  },
  {
    "con": "Khi sử dụng câu lệnh điều kiện if mà không có else:",
    "re": "Chương trình chỉ thực hiện khối lệnh if nếu điều kiện đúng"
  },
  {
    "con": "Khi một hàm được gọi trong một hàm khác:",
    "re": "Hàm gọi sẽ chờ hàm được gọi hoàn thành trước khi tiếp tục"
  },
  {
    "con": "Khi sử dụng kiểu dữ liệu chuỗi trong lập trình:",
    "re": "Chuỗi được bao quanh bởi dấu nháy đơn hoặc nháy kép"
  },
  {
    "con": "Khi một chương trình không có lỗi cú pháp:",
    "re": "Chương trình có thể biên dịch và chạy mà không gặp vấn đề"
  },
  {
    "con": "Toán tử nào sau đây sẽ truy xuất 1 thành phần của con trỏ cấu trúc:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biến được khai báo nhưng không được khởi tạo:",
    "re": "Giá trị của biến đó sẽ không xác định"
  },
  {
    "con": "Một hàm được định nghĩa nhưng không có từ khóa trả về:",
    "re": "Hàm đó sẽ trả về giá trị mặc định là null hoặc undefined"
  },
  {
    "con": "Sử dụng vòng lặp for để lặp qua một mảng:",
    "re": "Có thể truy cập từng phần tử của mảng theo chỉ số"
  },
  {
    "con": "Khi sử dụng toán tử == trong so sánh:",
    "re": "Có thể xảy ra so sánh kiểu dữ liệu khác nhau"
  },
  {
    "con": "Khi một biến được khai báo với từ khóa const:",
    "re": "Biến đó không thể được gán lại giá trị mới"
  },
  {
    "con": "Khi một hàm được gọi mà không có đối số:",
    "re": "Các tham số của hàm sẽ nhận giá trị mặc định là undefined"
  },
  {
    "con": "Khi sử dụng mảng trong một ngôn ngữ lập trình:",
    "re": "Có thể lưu trữ nhiều giá trị cùng một loại dữ liệu"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Khi sử dụng toán tử ++ trên một biến:",
    "re": "Giá trị của biến đó sẽ tăng thêm 1"
  },
  {
    "con": "Biến được khai báo mà không được khởi tạo giá trị:",
    "re": "Giá trị của biến sẽ không xác định"
  },
  {
    "con": "Sử dụng vòng lặp để lặp lại một đoạn mã:",
    "re": "Giúp tiết kiệm thời gian và công sức lập trình"
  },
  {
    "con": "Một hàm không trả về giá trị:",
    "re": "Có thể được gọi là hàm void"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện để kiểm tra một điều kiện:",
    "re": "Cho phép thực hiện các hành động khác nhau dựa trên kết quả kiểm tra"
  },
  {
    "con": "Khi sử dụng mảng, chỉ số bắt đầu từ 0:",
    "re": "Giúp truy cập phần tử đầu tiên của mảng dễ dàng hơn"
  },
  {
    "con": "Khi một biến được khai báo trong một hàm:",
    "re": "Biến đó chỉ có thể được truy cập trong phạm vi của hàm đó"
  },
  {
    "con": "Sử dụng các thư viện trong lập trình:",
    "re": "Giúp tái sử dụng mã và giảm thiểu lỗi"
  },
  {
    "con": "Khi một chương trình gặp lỗi cú pháp:",
    "re": "Chương trình sẽ không biên dịch thành công"
  },
  {
    "con": "Sử dụng kiểu dữ liệu phù hợp cho biến:",
    "re": "Giúp tối ưu hóa bộ nhớ và hiệu suất chương trình"
  },
  {
    "con": "Khi sử dụng toán tử so sánh:",
    "re": "Kết quả sẽ là true hoặc false"
  },
  {
    "con": "Một chương trình không có cú pháp đúng:",
    "re": "Chương trình sẽ không biên dịch hoặc chạy được"
  },
  {
    "con": "Biến không được khai báo trước khi sử dụng:",
    "re": "Chương trình sẽ gây ra lỗi biên dịch"
  },
  {
    "con": "Sử dụng cấu trúc điều kiện không đúng cách:",
    "re": "Chương trình có thể không hoạt động như mong đợi"
  },
  {
    "con": "Một hàm không trả về giá trị:",
    "re": "Hàm sẽ trả về giá trị mặc định hoặc không có giá trị"
  },
  {
    "con": "Sử dụng vòng lặp mà không có điều kiện dừng:",
    "re": "Chương trình sẽ rơi vào vòng lặp vô hạn"
  },
  {
    "con": "Không sử dụng chú thích trong mã nguồn:",
    "re": "Mã nguồn sẽ khó hiểu và bảo trì hơn"
  },
  {
    "con": "Không kiểm tra đầu vào của người dùng:",
    "re": "Chương trình có thể gặp lỗi hoặc hành vi không mong muốn"
  },
  {
    "con": "Sử dụng kiểu dữ liệu không phù hợp:",
    "re": "Chương trình có thể gây ra lỗi hoặc kết quả không chính xác"
  },
  {
    "con": "Không sử dụng các thư viện hoặc module có sẵn:",
    "re": "Chương trình có thể trở nên phức tạp và tốn thời gian hơn"
  },
  {
    "con": "Không thực hiện kiểm thử cho mã nguồn:",
    "re": "Chương trình có thể chứa lỗi mà không được phát hiện"
  }
]