[
  {
    "con": "Hiệu số tuổi của bố và con là 30 tuổi. Tuổi con bằng \\frac{1}{4} tuổi bố. Tuổi bố là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số là 15 và hiệu của chúng là 5. Hai số đó là:",
    "re": "10 và 5"
  },
  {
    "con": "Một hình chữ nhật có chiều dài gấp đôi chiều rộng. Nếu chiều rộng là 4 cm, thì diện tích hình chữ nhật là:",
    "re": "32 cm²"
  },
  {
    "con": "Nếu một số được nhân với 3 và sau đó cộng với 5 cho kết quả là 20, thì số đó là:",
    "re": "5"
  },
  {
    "con": "Nếu tổng của ba số liên tiếp là 36, thì số giữa là:",
    "re": "12"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 6 cm, thì chu vi của hình vuông là:",
    "re": "24 cm"
  },
  {
    "con": "Nếu một chiếc bánh có 12 miếng và bạn ăn 3 miếng, thì số miếng còn lại là:",
    "re": "9 miếng"
  },
  {
    "con": "Nếu một số được chia cho 4 và dư 2, thì số đó có thể là:",
    "re": "2, 6, 10, ..."
  },
  {
    "con": "Nếu một hình tròn có bán kính là 5 cm, thì diện tích của hình tròn là:",
    "re": "78.5 cm²"
  },
  {
    "con": "Nếu một số được cộng với 7 cho kết quả là 15, thì số đó là:",
    "re": "8"
  },
  {
    "con": "Một hình thang có đáy lớn a, đáy bé là b, chiều cao là h (a, b, h cùng đơn vị đo) thì công thức tính diện tích S của hình thang đó là:",
    "re": "S = (a + b) * h / 2"
  },
  {
    "con": "Một tam giác có đáy b và chiều cao h (b, h cùng đơn vị đo) thì công thức tính diện tích S của tam giác đó là:",
    "re": "S = b * h / 2"
  },
  {
    "con": "Một hình chữ nhật có chiều dài l và chiều rộng w (l, w cùng đơn vị đo) thì công thức tính diện tích S của hình chữ nhật đó là:",
    "re": "S = l * w"
  },
  {
    "con": "Một hình tròn có bán kính r (r cùng đơn vị đo) thì công thức tính diện tích S của hình tròn đó là:",
    "re": "S = π * r^2"
  },
  {
    "con": "Một số nguyên dương n thì tổng các số nguyên dương từ 1 đến n là:",
    "re": "T = n * (n + 1) / 2"
  },
  {
    "con": "Một số nguyên dương n thì giai thừa của n (ký hiệu là n!) được tính bằng:",
    "re": "n! = n * (n - 1) * (n - 2) * ... * 1"
  },
  {
    "con": "Một số a và b (a, b khác 0) thì tỉ lệ phần trăm của a so với b được tính bằng:",
    "re": "(a / b) * 100%"
  },
  {
    "con": "Một số nguyên dương n thì số lượng ước số của n được tính bằng cách phân tích n thành các thừa số nguyên tố.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một số thực x thì giá trị tuyệt đối của x được ký hiệu là |x| và được định nghĩa là:",
    "re": "|x| = x nếu x >= 0, |x| = -x nếu x < 0"
  },
  {
    "con": "Một số nguyên dương n thì số Fibonacci thứ n (F(n)) được tính bằng:",
    "re": "F(n) = F(n-1) + F(n-2) với F(0) = 0, F(1) = 1"
  },
  {
    "con": "Hình hộp chữ nhật có ...... mặt, ...... cạnh, ... đỉnh. Số thích hợp lần lượt điền vào chỗ chấm là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn hoặc bằng ......",
    "re": "0"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là số ......",
    "re": "chẵn"
  },
  {
    "con": "Nếu một số chia hết cho 3 thì tổng các chữ số của số đó cũng chia hết cho ......",
    "re": "3"
  },
  {
    "con": "Nếu hai góc trong một tam giác có tổng bằng 90 độ thì góc còn lại là góc ......",
    "re": "vuông"
  },
  {
    "con": "Nếu một hình tròn có bán kính gấp đôi bán kính của một hình tròn khác thì diện tích của hình tròn lớn hơn gấp ...... diện tích hình tròn nhỏ.",
    "re": "4"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì kết quả là ......",
    "re": "0"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài a thì diện tích của nó được tính bằng ......",
    "re": "a^2"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho chính nó thì kết quả là ......",
    "re": "1"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 0 hoặc 5 thì số đó chia hết cho ......",
    "re": "5"
  },
  {
    "con": "Biết 1m^{3} nước bằng 1000l nước và mỗi chai nước chứa 0,75dm^{3} nước. Hỏi một bể chứa 2250l nước có thể đóng vào bao nhiêu chai nước nói trên?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 15 và một số là 7, thì số còn lại là 8.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 10cm và chiều rộng 5cm, thì diện tích của hình chữ nhật là 50cm^{2}.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 2 và dư 1, thì số đó là số lẻ.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai số là 10 và 12, thì số còn lại là 8.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4cm, thì chu vi của hình vuông là 16cm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là 0.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3cm, thì diện tích của hình tròn là 28,26cm^{2} (làm tròn).",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số được cộng với chính nó, thì kết quả là gấp đôi số đó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 3 và dư 0, thì số đó là bội số của 3.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cho ba chữ số 2; 3; 5. Có bao nhiêu số tự nhiên có ba chữ số chia hết cho 5 được tạo thành từ ba chữ số trên?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số tự nhiên a và b bằng 10, và a lớn hơn b,",
    "re": "thì a phải lớn hơn 5."
  },
  {
    "con": "Nếu một số nguyên dương n chia hết cho 2,",
    "re": "thì n là số chẵn."
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài là l và chiều rộng là w,",
    "re": "thì diện tích của hình chữ nhật là l nhân w."
  },
  {
    "con": "Nếu một số tự nhiên n có chữ số tận cùng là 0,",
    "re": "thì n chia hết cho 10."
  },
  {
    "con": "Nếu một tam giác có ba cạnh a, b, c thỏa mãn bất đẳng thức tam giác,",
    "re": "thì tam giác đó tồn tại."
  },
  {
    "con": "Nếu một số nguyên dương n có ước số là 1 và chính nó,",
    "re": "thì n là số nguyên tố."
  },
  {
    "con": "Nếu một số thập phân có phần thập phân là 0.5,",
    "re": "thì số đó là số lẻ khi làm tròn xuống."
  },
  {
    "con": "Nếu một hình tròn có bán kính r,",
    "re": "thì chu vi của hình tròn là 2 nhân pi nhân r."
  },
  {
    "con": "Nếu một số tự nhiên n được chia cho 3 và dư 1,",
    "re": "thì n có thể được biểu diễn dưới dạng 3k + 1 với k là số nguyên."
  },
  {
    "con": "Diện tích hình tam giác có độ dài đáy 4,7dm và chiều cao 35cm là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 5 và 7 là:",
    "re": "12"
  },
  {
    "con": "Nếu một số chia cho 2 có dư 0, thì số đó là số chẵn.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 6cm, thì diện tích của nó là:",
    "re": "36cm²"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0, thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 8cm và chiều rộng 3cm, thì chu vi của nó là:",
    "re": "22cm"
  },
  {
    "con": "Nếu một số chia cho 3 có kết quả là 4, thì số đó là:",
    "re": "12"
  },
  {
    "con": "Nếu tổng của ba số 2, 3 và 5 là:",
    "re": "10"
  },
  {
    "con": "Nếu một hình tròn có bán kính 5cm, thì diện tích của nó là:",
    "re": "78.5cm²"
  },
  {
    "con": "Nếu một số nguyên âm được cộng với một số nguyên dương lớn hơn nó, thì kết quả là:",
    "re": "Số dương"
  },
  {
    "con": "Tỉ số phần trăm của 9 và 20 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn cả hai số đó:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là số chẵn:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu tổng của hai số là 10 và một số là 4, thì số còn lại là:",
    "re": "6"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng, thì diện tích của nó là:",
    "re": "Chiều rộng x 2 x Chiều rộng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0, thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau, thì đó là tam giác đều:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 5 hoặc 0, thì số đó chia hết cho 5:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho chính nó, thì kết quả là:",
    "re": "1"
  },
  {
    "con": "Nếu một hình tròn có bán kính gấp đôi bán kính của hình tròn khác, thì diện tích của nó gấp bốn lần diện tích hình tròn kia:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Số lớn nhất có bốn chữ số khác nhau và chia hết cho 9 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn hoặc bằng 2:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 và 3 thì nó cũng chia hết cho 6:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tích của hai số âm luôn là một số dương:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau thì đó là tam giác đều:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai góc trong một tam giác là 90 độ thì góc còn lại là 90 độ:",
    "re": "Câu trả lời sai"
  },
  {
    "con": "Nếu một số nguyên dương chia hết cho 5 thì chữ số tận cùng của nó là 0 hoặc 5:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì diện tích của nó là chiều rộng nhân với chiều dài:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương có chữ số tận cùng là 0 thì nó chia hết cho 10:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số là bội số của 4 thì nó cũng là bội số của 2:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trường hợp nào dưới đây làm diện tích hình chữ nhật giảm đi 40%?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn 0?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là số chẵn?",
    "re": "Đúng"
  },
  {
    "con": "Tổng của ba góc trong một tam giác luôn bằng 180 độ?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài g thì diện tích của nó là g nhân g?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì kết quả là 0?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một số chia cho chính nó thì kết quả luôn là 1 (trừ 0)?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một số âm được cộng với một số dương lớn hơn nó thì kết quả là số dương?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính r thì chu vi của nó là 2πr?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1 thì kết quả là chính nó?",
    "re": "Đúng"
  },
  {
    "con": "Số thích hợp viết vào chỗ chấm để 56g = ......kg là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 10 và một số là 4, thì số còn lại là:",
    "re": "6"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 5cm, thì diện tích của hình vuông đó là:",
    "re": "25 cm²"
  },
  {
    "con": "Nếu 1 giờ có 60 phút, thì 3 giờ có bao nhiêu phút:",
    "re": "180 phút"
  },
  {
    "con": "Nếu một số chia cho 2 có dư 1, thì số đó là:",
    "re": "Số lẻ"
  },
  {
    "con": "Nếu 1/2 của một số là 8, thì số đó là:",
    "re": "16"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 8cm và chiều rộng 3cm, thì chu vi của hình chữ nhật đó là:",
    "re": "22 cm"
  },
  {
    "con": "Nếu 5 x 6 = 30, thì 30 chia cho 5 sẽ bằng:",
    "re": "6"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả sẽ là:",
    "re": "0"
  },
  {
    "con": "Nếu 12 chia cho 4 bằng 3, thì 4 x 3 sẽ bằng:",
    "re": "12"
  },
  {
    "con": "gấp bán kính của hình tròn lên 3,5 lần",
    "re": "chu vi hình tròn đó gấp lên số lần là 3,5"
  },
  {
    "con": "cộng hai số nguyên dương",
    "re": "kết quả luôn là một số nguyên dương"
  },
  {
    "con": "nhân một số nguyên với 0",
    "re": "kết quả luôn là 0"
  },
  {
    "con": "chia một số nguyên cho chính nó (khác 0)",
    "re": "kết quả luôn là 1"
  },
  {
    "con": "cộng một số với số âm của nó",
    "re": "kết quả luôn là 0"
  },
  {
    "con": "góc trong của một tam giác",
    "re": "tổng của ba góc luôn bằng 180 độ"
  },
  {
    "con": "gấp đôi một số",
    "re": "kết quả luôn là số chẵn"
  },
  {
    "con": "trừ một số dương khỏi một số dương lớn hơn",
    "re": "kết quả luôn là một số dương"
  },
  {
    "con": "tính diện tích hình chữ nhật",
    "re": "diện tích bằng chiều dài nhân chiều rộng"
  },
  {
    "con": "tính tổng của một dãy số liên tiếp",
    "re": "kết quả có thể tính bằng công thức n(n+1)/2, với n là số lớn nhất trong dãy"
  },
  {
    "con": "Chữ số thích hợp điền vào chỗ chấm để 32,...8 < 32,18 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn 0:",
    "re": "Đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là số chẵn:",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài và chiều rộng bằng nhau thì hình đó là hình vuông:",
    "re": "Đúng"
  },
  {
    "con": "Nếu tổng của hai góc trong một tam giác bằng 90 độ thì tam giác đó là tam giác vuông:",
    "re": "Đúng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì kết quả là 0:",
    "re": "Đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho chính nó thì kết quả là 1:",
    "re": "Đúng"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 5 hoặc 0 thì số đó chia hết cho 5:",
    "re": "Đúng"
  },
  {
    "con": "Nếu một số nguyên dương có tổng các chữ số chia hết cho 3 thì số đó chia hết cho 3:",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính gấp đôi thì diện tích của nó gấp bốn lần diện tích của hình tròn ban đầu:",
    "re": "Đúng"
  },
  {
    "con": "Cho một số tự nhiên gồm các số tự nhiên liên tiếp từ 1 đến 2021 được viết theo thứ tự liền nhau như sau:\n1 2 3 4 5 6 7 8 9 10 11 12 13 ... 2019 2020 2021. Tính tổng của tất cả các chữ số đó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số tự nhiên được chia cho 2 và dư 0,",
    "re": "thì số đó là số chẵn."
  },
  {
    "con": "Nếu tổng của hai số tự nhiên là 10,",
    "re": "thì cả hai số có thể là 0 và 10, 1 và 9, 2 và 8, 3 và 7, 4 và 6, hoặc 5 và 5."
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng,",
    "re": "thì diện tích của hình chữ nhật đó là chiều rộng nhân với 2 lần chiều rộng."
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 1,",
    "re": "thì kết quả vẫn là số nguyên dương đó."
  },
  {
    "con": "Nếu một số tự nhiên được chia cho 3 và dư 1,",
    "re": "thì số đó không chia hết cho 3."
  },
  {
    "con": "Nếu một tam giác có ba cạnh đều bằng nhau,",
    "re": "thì đó là tam giác đều."
  },
  {
    "con": "Nếu một số tự nhiên lớn hơn 1 chỉ có hai ước số là 1 và chính nó,",
    "re": "thì số đó là số nguyên tố."
  },
  {
    "con": "Nếu một số tự nhiên được cộng với 0,",
    "re": "thì kết quả vẫn là số tự nhiên đó."
  },
  {
    "con": "Nếu một số tự nhiên được nhân với 0,",
    "re": "thì kết quả là 0."
  },
  {
    "con": "Tuổi trung bình của cô giáo và 29 học sinh là 12 tuổi. Biết tuổi của cô giáo nhiều hơn tuổi trung bình của 29 học sinh là 30 tuổi. Tính tuổi của cô giáo.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số là 15 và một số là 9. Tính số còn lại.",
    "re": "Số còn lại là 6"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài là 8 cm và chiều rộng là 5 cm, thì diện tích của hình chữ nhật là bao nhiêu?",
    "re": "Diện tích là 40 cm²"
  },
  {
    "con": "Nếu tổng ba số là 24 và hai số đầu tiên là 8 và 10, thì số thứ ba là bao nhiêu?",
    "re": "Số thứ ba là 6"
  },
  {
    "con": "Nếu một hình tròn có bán kính là 7 cm, thì chu vi của hình tròn đó là bao nhiêu?",
    "re": "Chu vi là 43.96 cm"
  },
  {
    "con": "Nếu một số được nhân với 4 và kết quả là 32, thì số đó là bao nhiêu?",
    "re": "Số đó là 8"
  },
  {
    "con": "Nếu một hình tam giác có độ dài ba cạnh lần lượt là 3 cm, 4 cm và 5 cm, thì hình tam giác đó có phải là tam giác vuông không?",
    "re": "Có, đó là tam giác vuông"
  },
  {
    "con": "Nếu một số được chia cho 5 và dư 2, thì số đó có thể viết dưới dạng nào?",
    "re": "Số đó có thể viết dưới dạng 5k + 2, với k là số nguyên"
  },
  {
    "con": "Nếu một số nguyên dương được cộng với 7 và kết quả là 15, thì số nguyên dương đó là bao nhiêu?",
    "re": "Số nguyên dương đó là 8"
  },
  {
    "con": "Nếu một hình vuông có diện tích là 36 cm², thì độ dài mỗi cạnh của hình vuông đó là bao nhiêu?",
    "re": "Độ dài mỗi cạnh là 6 cm"
  },
  {
    "con": "Thể tích của hình lập phương có độ dài cạnh bằng 2,6dm là:",
    "re": "17,576 dm³"
  },
  {
    "con": "Tổng của hai số 3 và 5 là:",
    "re": "8"
  },
  {
    "con": "Số 12 là số chẵn:",
    "re": "Đúng"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau thì đó là:",
    "re": "Tam giác đều"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là:",
    "re": "Số chẵn"
  },
  {
    "con": "Diện tích của hình chữ nhật có chiều dài 4m và chiều rộng 3m là:",
    "re": "12 m²"
  },
  {
    "con": "Nếu tổng của ba số là 15 và hai số là 5 và 7 thì số còn lại là:",
    "re": "3"
  },
  {
    "con": "Nếu một góc có độ lớn 90 độ thì góc đó là:",
    "re": "Góc vuông"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1 thì kết quả là:",
    "re": "Số nguyên dương đó"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3cm thì diện tích của nó là:",
    "re": "28,26 cm²"
  },
  {
    "con": "Một mảnh đất hình chữ nhật có chiều dài bằng 560m, chiều rộng bằng 250m. Tính chu vi của mảnh đất đó trên bản đồ tỉ lệ 1 \\div 1000.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một số nguyên dương được chia cho 2. Nếu số đó là số chẵn, thì số dư là 0.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Một hình tam giác có ba cạnh lần lượt là 3cm, 4cm và 5cm. Nếu tính diện tích của hình tam giác đó bằng công thức Heron, thì diện tích là 6cm².",
    "re": "Kết quả đúng"
  },
  {
    "con": "Một số nguyên dương được cộng với 1. Nếu số đó là số lẻ, thì kết quả là số chẵn.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Một hình vuông có cạnh dài 4cm. Nếu tính diện tích của hình vuông đó, thì diện tích là 16cm².",
    "re": "Kết quả đúng"
  },
  {
    "con": "Một số thập phân được nhân với 10. Nếu số đó là 0.5, thì kết quả là 5.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Một hình tròn có bán kính 3cm. Nếu tính chu vi của hình tròn đó, thì chu vi là khoảng 18.84cm.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Một số nguyên dương được chia cho 3. Nếu số đó là 9, thì số dư là 0.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Một mảnh đất hình chữ nhật có chiều dài 10m và chiều rộng 5m. Nếu tính diện tích của mảnh đất đó, thì diện tích là 50m².",
    "re": "Kết quả đúng"
  },
  {
    "con": "Một số nguyên dương được trừ đi 1. Nếu số đó là 7, thì kết quả là 6.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Phân số \\frac{25}{8} viết dưới dạng phân số thập phân là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương a và b là:",
    "re": "Một số nguyên dương"
  },
  {
    "con": "Nếu a = 3 và b = 4 thì diện tích của hình chữ nhật có chiều dài a và chiều rộng b là:",
    "re": "12 đơn vị diện tích"
  },
  {
    "con": "Nếu số nguyên n chia hết cho 2 thì n là:",
    "re": "Số chẵn"
  },
  {
    "con": "Nếu số nguyên n không chia hết cho 2 thì n là:",
    "re": "Số lẻ"
  },
  {
    "con": "Tích của hai số nguyên dương a và b là:",
    "re": "Một số nguyên dương"
  },
  {
    "con": "Nếu a = 5 và b = 2 thì thương của a chia cho b là:",
    "re": "2.5"
  },
  {
    "con": "Nếu một góc trong tam giác có giá trị lớn hơn 90 độ thì tam giác đó là:",
    "re": "Tam giác tù"
  },
  {
    "con": "Nếu tổng của ba số a, b và c bằng 180 độ thì chúng có thể là:",
    "re": "Các góc trong một tam giác"
  },
  {
    "con": "Nếu một số nguyên dương n có 2 ước số thì n là:",
    "re": "Số nguyên tố"
  },
  {
    "con": "Khi dịch chuyển dấu phẩy của số thập phân sang bên trái một chữ số, số đó thay đổi thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi cộng hai số nguyên dương, tổng của chúng luôn lớn hơn cả hai số đó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhân một số nguyên dương với 0, kết quả luôn là 0.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi chia một số nguyên dương cho chính nó, kết quả luôn là 1.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi trừ một số nguyên dương từ một số nguyên dương lớn hơn, kết quả luôn là một số nguyên dương.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi cộng một số nguyên dương với một số nguyên âm, kết quả có thể là số dương, số âm hoặc 0.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhân hai số nguyên âm, kết quả luôn là một số nguyên dương.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi chia một số nguyên dương cho một số nguyên âm, kết quả luôn là một số nguyên âm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi tính diện tích hình chữ nhật, công thức là chiều dài nhân chiều rộng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi cộng ba số, nếu hai số đầu tiên có tổng là số thứ ba, thì tổng của ba số đó là số thứ ba.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Số thập phân gồm 3 đơn vị, 4 phần mười, 6 phần nghìn là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương là:",
    "re": "Một số nguyên dương"
  },
  {
    "con": "Số chia không thể bằng 0 trong phép chia:",
    "re": "Phép chia không xác định"
  },
  {
    "con": "Tích của hai số âm là:",
    "re": "Một số dương"
  },
  {
    "con": "Số nguyên tố là số tự nhiên lớn hơn 1 chỉ chia hết cho 1 và chính nó:",
    "re": "Có đúng 2 ước số"
  },
  {
    "con": "Diện tích hình chữ nhật được tính bằng:",
    "re": "Chiều dài nhân với chiều rộng"
  },
  {
    "con": "Số đối của một số nguyên dương là:",
    "re": "Một số nguyên âm"
  },
  {
    "con": "Tổng của ba số lẻ liên tiếp là:",
    "re": "Một số lẻ"
  },
  {
    "con": "Hình tròn có chu vi được tính bằng:",
    "re": "2 nhân với pi nhân với bán kính"
  },
  {
    "con": "Số trung bình của một tập hợp số được tính bằng:",
    "re": "Tổng các số chia cho số lượng số"
  },
  {
    "con": "Tìm x, biết 4 x x = 7 giờ 40 phút.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương a và b lớn hơn 0.",
    "re": "Tổng a + b > 0"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là số chẵn.",
    "re": "Số đó có thể viết dưới dạng 2k, với k là số nguyên"
  },
  {
    "con": "Nếu a > b và b > c thì a > c.",
    "re": "Định lý bất đẳng thức"
  },
  {
    "con": "Tìm diện tích hình chữ nhật, biết chiều dài là a và chiều rộng là b.",
    "re": "Diện tích = a x b"
  },
  {
    "con": "Nếu một tam giác có hai cạnh bằng nhau thì đó là tam giác cân.",
    "re": "Hai góc đối diện với hai cạnh bằng nhau cũng bằng nhau"
  },
  {
    "con": "Nếu một số nguyên dương n có 2 ước số là 1 và n thì n là số nguyên tố.",
    "re": "Số nguyên tố chỉ có hai ước số"
  },
  {
    "con": "Tìm trung bình cộng của n số, biết các số là x1, x2, ..., xn.",
    "re": "Trung bình cộng = (x1 + x2 + ... + xn) / n"
  },
  {
    "con": "Nếu một hình tròn có bán kính r thì chu vi của nó là 2πr.",
    "re": "Công thức tính chu vi hình tròn"
  },
  {
    "con": "Nếu một số chia cho 10 thì chữ số hàng đơn vị của số đó là phần dư.",
    "re": "Phần dư = số đó % 10"
  },
  {
    "con": "Một người thợ may 5 cái quần hết 4 giờ và may 5 cái áo hết 3 giờ 20 phút. Thời gian trung bình để may mỗi bộ quần áo như vậy là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 10 và một số là 4, thì số còn lại là:",
    "re": "6"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài là 8 cm và chiều rộng là 5 cm, thì diện tích của hình chữ nhật đó là:",
    "re": "40 cm²"
  },
  {
    "con": "Nếu một số nguyên dương chia hết cho 2, thì số đó là:",
    "re": "số chẵn"
  },
  {
    "con": "Nếu tổng của ba số 2, 3 và 5 là 10, thì trung bình cộng của ba số đó là:",
    "re": "3.33"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì chu vi của hình vuông đó là:",
    "re": "16 cm"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu một hình tròn có bán kính là 3 cm, thì diện tích của hình tròn đó là:",
    "re": "28.26 cm²"
  },
  {
    "con": "Nếu một số nguyên dương lớn hơn 1 và không chia hết cho bất kỳ số nguyên dương nào khác ngoài 1 và chính nó, thì số đó là:",
    "re": "số nguyên tố"
  },
  {
    "con": "Nếu một hình tam giác có ba cạnh lần lượt là 3 cm, 4 cm và 5 cm, thì hình tam giác đó là:",
    "re": "tam giác vuông"
  },
  {
    "con": "Đổi 50 326m^{2} = ….... ha ……. m^{2} , ta được kết quả là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số nguyên dương a và b là 10, thì a + b = 10.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài là 5m và chiều rộng là 3m, thì diện tích của hình chữ nhật là 15m^{2}.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 2 và dư 0, thì số đó là số chẵn.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một tam giác có ba cạnh lần lượt là 3cm, 4cm và 5cm, thì tam giác đó là tam giác vuông.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương n lớn hơn 1, thì n có ít nhất một ước số khác ngoài 1 và chính nó.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số thập phân có phần thập phân là 0.5, thì số đó có thể được viết dưới dạng phân số là 1/2.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính r, thì chu vi của hình tròn đó là 2πr.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương n được nhân với 0, thì kết quả là 0.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương n được cộng với 1, thì kết quả sẽ lớn hơn n.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Sổ thích hợp viết vào chỗ chấm để 276 phút = ……. giờ là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 10 và một số là 4, thì số còn lại là:",
    "re": "6"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 5 cm, thì diện tích của hình vuông đó là:",
    "re": "25 cm²"
  },
  {
    "con": "Nếu 1 kg bằng 1000 gram, thì 2 kg bằng:",
    "re": "2000 gram"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 8 cm và chiều rộng 3 cm, thì chu vi của hình chữ nhật đó là:",
    "re": "22 cm"
  },
  {
    "con": "Nếu một số chia cho 2 có dư 1, thì số đó là:",
    "re": "số lẻ"
  },
  {
    "con": "Nếu 3 x 4 = 12, thì 12 chia cho 3 bằng:",
    "re": "4"
  },
  {
    "con": "Nếu một góc vuông có độ lớn là 90 độ, thì tổng của hai góc phụ của nó là:",
    "re": "90 độ"
  },
  {
    "con": "Nếu 5 x 6 = 30, thì 30 chia cho 5 bằng:",
    "re": "6"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0, thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Dãy số thập phân nào dưới đây được sắp xếp theo thứ tự tăng dần?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn hoặc bằng 2?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì nó là số chẵn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài và chiều rộng bằng nhau thì nó là hình vuông?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của ba số là 15 và hai số đầu là 5 và 7 thì số thứ ba là 3?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì kết quả là 0?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một góc trong tam giác là 90 độ thì tam giác đó là tam giác vuông?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 5 thì nó là số lẻ?",
    "re": "Câu trả lời sai"
  },
  {
    "con": "Nếu một dãy số là số Fibonacci thì mỗi số trong dãy là tổng của hai số trước đó?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính gấp đôi thì diện tích của nó gấp bốn lần diện tích hình tròn ban đầu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một hình hộp chữ nhật có chiều dài, chiều rộng, chiều cao lần lượt là 4,5cm; 3,5cm; 2,8cm. Diện tích xung quanh của hình hộp chữ nhật đó là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương a và b là 10. Nếu a = 4, thì b =",
    "re": "6"
  },
  {
    "con": "Một tam giác có ba cạnh lần lượt là 3cm, 4cm, 5cm. Tam giác này là tam giác gì?",
    "re": "Tam giác vuông"
  },
  {
    "con": "Nếu một số nguyên dương chia hết cho 2, thì số đó là:",
    "re": "Số chẵn"
  },
  {
    "con": "Một hình tròn có bán kính là 5cm. Diện tích của hình tròn đó là:",
    "re": "78,5 cm²"
  },
  {
    "con": "Nếu một số nguyên dương n lớn hơn 1, thì n có ít nhất hai ước số:",
    "re": "1 và n"
  },
  {
    "con": "Một hình vuông có cạnh dài 6cm. Chu vi của hình vuông đó là:",
    "re": "24cm"
  },
  {
    "con": "Nếu một số thập phân có phần nguyên là 3 và phần thập phân là 0,75, thì số đó là:",
    "re": "3,75"
  },
  {
    "con": "Một hình chữ nhật có chiều dài 8cm và chiều rộng 3cm. Diện tích của hình chữ nhật đó là:",
    "re": "24cm²"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai số đầu là 10 và 15, thì số thứ ba là:",
    "re": "5"
  },
  {
    "con": "Phân số \\frac{18}{7} bằng hỗn số nào dưới đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn 0?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì nó là số chẵn?",
    "re": "Đúng"
  },
  {
    "con": "Tích của hai số âm luôn là số dương?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm thì diện tích của nó là bao nhiêu?",
    "re": "16 cm²"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1 thì kết quả là chính nó?",
    "re": "Đúng"
  },
  {
    "con": "Nếu tổng của ba số là 15 và hai số đầu là 5 và 7 thì số thứ ba là bao nhiêu?",
    "re": "3"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 5 cm và chiều rộng 3 cm thì chu vi của nó là bao nhiêu?",
    "re": "16 cm"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 0 thì nó chia hết cho 10?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một phân số có tử số lớn hơn mẫu số thì nó là phân số lớn hơn 1?",
    "re": "Đúng"
  },
  {
    "con": "Số thích hợp viết vào chỗ chấm để \\frac{2}{5} km = ......m là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 10 và một số là 4, thì số còn lại là:",
    "re": "6"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì diện tích của hình vuông đó là:",
    "re": "16 cm²"
  },
  {
    "con": "Nếu 1 giờ có 60 phút, thì 3 giờ có bao nhiêu phút:",
    "re": "180 phút"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 5 cm và chiều rộng 3 cm, thì chu vi của hình chữ nhật đó là:",
    "re": "16 cm"
  },
  {
    "con": "Nếu 1/2 của một số là 8, thì số đó là:",
    "re": "16"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu 5 + x = 12, thì x bằng:",
    "re": "7"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3 cm, thì diện tích của hình tròn đó là:",
    "re": "28.26 cm² (làm tròn)"
  },
  {
    "con": "Nếu 15 chia cho 3, thì kết quả là:",
    "re": "5"
  },
  {
    "con": "250% bằng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số a và b là:",
    "re": "a + b"
  },
  {
    "con": "Hiệu của hai số a và b là:",
    "re": "a - b"
  },
  {
    "con": "Tích của hai số a và b là:",
    "re": "a × b"
  },
  {
    "con": "Thương của hai số a và b (b khác 0) là:",
    "re": "a ÷ b"
  },
  {
    "con": "Số nguyên dương có thể chia hết cho 2 là:",
    "re": "số chẵn"
  },
  {
    "con": "Số nguyên dương có thể chia hết cho 3 là:",
    "re": "số chia hết cho 3"
  },
  {
    "con": "Diện tích hình chữ nhật có chiều dài l và chiều rộng w là:",
    "re": "l × w"
  },
  {
    "con": "Chu vi hình vuông có cạnh a là:",
    "re": "4 × a"
  },
  {
    "con": "Số trung bình cộng của n số a1, a2, ..., an là:",
    "re": "(a1 + a2 + ... + an) ÷ n"
  },
  {
    "con": "Biết \\frac{2}{5} chiều dài của một mảnh đất hình chữ nhật là 10m, chiều dài hơn chiều rộng 7m. Diện tích của hình chữ nhật đó là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số là 15 và một số là 9. Số còn lại là:",
    "re": "6"
  },
  {
    "con": "Biết rằng 1/4 của một số là 8. Số đó là:",
    "re": "32"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 5cm, thì diện tích của hình vuông đó là:",
    "re": "25 cm²"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3cm, thì chu vi của hình tròn đó là:",
    "re": "18.84 cm"
  },
  {
    "con": "Nếu một số được nhân với 3 và kết quả là 21, thì số đó là:",
    "re": "7"
  },
  {
    "con": "Nếu một mảnh đất hình chữ nhật có chiều dài 12m và chiều rộng 4m, thì chu vi của hình chữ nhật đó là:",
    "re": "32 m"
  },
  {
    "con": "Nếu 5x = 25, thì giá trị của x là:",
    "re": "5"
  },
  {
    "con": "Nếu một số được chia cho 4 và kết quả là 3, thì số đó là:",
    "re": "12"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai số là 10 và 15, thì số còn lại là:",
    "re": "5"
  },
  {
    "con": "Biết 12 người làm xong một công việc trong 8 ngày. Hỏi muốn làm xong công việc đó trong 4 ngày cần bao nhiêu người? (mức làm của mỗi người như nhau)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 15 và một số là 9, thì số còn lại là 6.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 10 cm và chiều rộng 5 cm, thì diện tích của nó là 50 cm².",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là 0.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai số là 10 và 15, thì số còn lại là 5.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính 7 cm, thì chu vi của nó là khoảng 43.96 cm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương chia hết cho 2, thì nó là số chẵn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì diện tích của nó là 16 cm².",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số được cộng với chính nó, thì kết quả là gấp đôi số đó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương chia cho 1, thì kết quả là chính số đó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương",
    "re": "luôn là một số nguyên dương"
  },
  {
    "con": "Số 0 là số chẵn",
    "re": "và nó nằm giữa các số âm và dương"
  },
  {
    "con": "Nếu một số chia hết cho 2",
    "re": "thì nó là số chẵn"
  },
  {
    "con": "Tích của hai số âm",
    "re": "luôn là một số dương"
  },
  {
    "con": "Nếu một số lớn hơn 0",
    "re": "thì nó có một căn bậc hai dương"
  },
  {
    "con": "Tổng của ba số lẻ",
    "re": "luôn là một số lẻ"
  },
  {
    "con": "Nếu một hình có ba cạnh",
    "re": "thì nó là tam giác"
  },
  {
    "con": "Diện tích của hình chữ nhật",
    "re": "bằng chiều dài nhân với chiều rộng"
  },
  {
    "con": "Nếu một số là bội số của 3",
    "re": "thì tổng các chữ số của nó cũng là bội số của 3"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1",
    "re": "thì thương của phép chia là chính nó"
  },
  {
    "con": "Một vận động viên chạy được 576m trong 1 phút 36 giây. Vận tốc chạy của vận động viên đó là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 5 và 7 là:",
    "re": "12"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 10cm và chiều rộng 5cm, thì diện tích của hình chữ nhật đó là:",
    "re": "50cm²"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 2 và dư 1, thì số đó là:",
    "re": "số lẻ"
  },
  {
    "con": "Nếu tổng của ba số 2, 3 và 4 là 9, thì trung bình cộng của ba số đó là:",
    "re": "3"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4cm, thì chu vi của hình vuông đó là:",
    "re": "16cm"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3cm, thì diện tích của hình tròn đó là:",
    "re": "28.26cm² (làm tròn)"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 3 và không có dư, thì số đó là:",
    "re": "bội số của 3"
  },
  {
    "con": "Nếu một số được cộng với chính nó, thì kết quả là:",
    "re": "gấp đôi số đó"
  },
  {
    "con": "Mua 12 chiếc bút chì phải trả 54 000 đồng. Mua 5 chiếc bút chì như vậy phải trả số tiền là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn cả hai số đó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là số chẵn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì diện tích của nó là chiều rộng nhân với chiều dài.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai số đầu là 10 và 15 thì số thứ ba là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một góc vuông có độ lớn là 90 độ thì tổng của hai góc phụ của nó là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 1 thì kết quả vẫn là số đó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số chia cho chính nó thì kết quả luôn bằng 1.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau thì đó là tam giác đều.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được cộng với 0 thì kết quả vẫn là số đó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một bể nước dạng hình hộp chữ nhật có chiều dài bằng 2,4m, chiều rộng bằng 1,5m, chiều cao bằng 1,2m. Khi bể chứa đầy nước, người ta tháo ra 1,5m^{3} nước. Hỏi sau khi tháo, trong bể còn lại bao nhiêu mét khối nước?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 15 và một trong hai số là 7, thì số còn lại là 8.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4cm, thì diện tích của hình vuông đó là 16cm².",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 5m và chiều rộng 3m, thì chu vi của hình chữ nhật đó là 16m.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 2 và dư 1, thì số đó là số lẻ.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tam giác có ba cạnh lần lượt là 3cm, 4cm và 5cm, thì tam giác đó là tam giác vuông.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là 0.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3cm, thì diện tích của hình tròn đó là khoảng 28,26cm².",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số được cộng với chính nó, thì kết quả là gấp đôi số đó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 3 và không có dư, thì số đó là bội số của 3.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Năm nay mẹ hơn con 28 tuổi. Hỏi 10 năm nữa mẹ hơn con bao nhiêu tuổi?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số là 15 và một số là 9. Hỏi số còn lại là bao nhiêu?",
    "re": "Số còn lại là 6"
  },
  {
    "con": "Một hình chữ nhật có chiều dài 8 cm và chiều rộng 5 cm. Hỏi diện tích của hình chữ nhật là bao nhiêu?",
    "re": "Diện tích là 40 cm²"
  },
  {
    "con": "Nếu một số được nhân với 0 thì kết quả là gì?",
    "re": "Kết quả là 0"
  },
  {
    "con": "Tổng của ba số là 30 và hai số là 10 và 12. Hỏi số còn lại là bao nhiêu?",
    "re": "Số còn lại là 8"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì chu vi của hình vuông là bao nhiêu?",
    "re": "Chu vi là 16 cm"
  },
  {
    "con": "Nếu 5 quả táo và 3 quả cam thì tổng số trái cây là bao nhiêu?",
    "re": "Tổng số trái cây là 8"
  },
  {
    "con": "Một chiếc xe chạy với tốc độ 60 km/h trong 2 giờ. Hỏi quãng đường xe đã đi được là bao nhiêu?",
    "re": "Quãng đường là 120 km"
  },
  {
    "con": "Nếu 1/2 của một số là 10, thì số đó là bao nhiêu?",
    "re": "Số đó là 20"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3 cm, thì diện tích của hình tròn là bao nhiêu?",
    "re": "Diện tích là 28.26 cm²"
  },
  {
    "con": "Số thập phân 0,36 viết thành phân số tối giản là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn là:",
    "re": "Một số nguyên dương"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì:",
    "re": "Số đó là số chẵn"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau thì:",
    "re": "Tam giác đó là tam giác đều"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì:",
    "re": "Kết quả là 0"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho chính nó thì:",
    "re": "Kết quả là 1"
  },
  {
    "con": "Nếu tổng của ba số là 0 thì:",
    "re": "Ba số đó có thể là số dương, số âm hoặc số 0"
  },
  {
    "con": "Nếu một số là bội của 5 thì:",
    "re": "Số đó kết thúc bằng 0 hoặc 5"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm thì:",
    "re": "Diện tích của hình vuông là 16 cm²"
  },
  {
    "con": "Nếu một số thập phân có phần thập phân là 0,75 thì:",
    "re": "Số đó có thể viết thành phân số là 3/4"
  },
  {
    "con": "Chữ số 9 trong số thập phân 17,209 có giá trị là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn hoặc bằng:",
    "re": "0"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì:",
    "re": "số đó là số chẵn"
  },
  {
    "con": "Nếu một số chia hết cho 3 thì:",
    "re": "tổng các chữ số của số đó cũng chia hết cho 3"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì:",
    "re": "diện tích của hình chữ nhật là chiều rộng nhân với chiều dài"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì:",
    "re": "kết quả là 0"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 1 thì:",
    "re": "kết quả là chính số đó"
  },
  {
    "con": "Nếu một tam giác có ba cạnh đều bằng nhau thì:",
    "re": "đó là tam giác đều"
  },
  {
    "con": "Nếu tổng của hai góc trong một tam giác là 90 độ thì:",
    "re": "góc còn lại là góc vuông"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 5 hoặc 0 thì:",
    "re": "số đó chia hết cho 5"
  },
  {
    "con": "Một hồ nước thể tích là 2,5m^{3}. Vậy số lít nước được chứa đầy trong hồ là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 10 và một trong số đó là 4, thì số còn lại là:",
    "re": "6"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài là 5cm và chiều rộng là 3cm, thì diện tích của hình chữ nhật là:",
    "re": "15cm²"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu một hình tròn có bán kính là 2cm, thì chu vi của hình tròn là:",
    "re": "12,56cm"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1, thì kết quả là:",
    "re": "Số nguyên đó"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai trong số đó là 10 và 15, thì số còn lại là:",
    "re": "5"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4cm, thì chu vi của hình vuông là:",
    "re": "16cm"
  },
  {
    "con": "Nếu một số được cộng với chính nó, thì kết quả là:",
    "re": "Gấp đôi số đó"
  },
  {
    "con": "Nếu một số nguyên âm được cộng với một số nguyên dương lớn hơn nó, thì kết quả là:",
    "re": "Số nguyên dương"
  },
  {
    "con": "Phân số \\frac{4}{5} được viết dưới dạng số thập phân là:",
    "re": "0.8"
  },
  {
    "con": "Tổng của hai số nguyên dương a và b là:",
    "re": "một số nguyên dương"
  },
  {
    "con": "Số 0 là số chẵn:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tích của hai số âm là:",
    "re": "một số dương"
  },
  {
    "con": "Nếu a > b và b > c thì:",
    "re": "a > c"
  },
  {
    "con": "Diện tích hình chữ nhật có chiều dài l và chiều rộng w là:",
    "re": "l \\times w"
  },
  {
    "con": "Số nguyên tố là số tự nhiên lớn hơn 1 chỉ chia hết cho 1 và chính nó:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một góc có độ lớn 90 độ thì:",
    "re": "góc đó là góc vuông"
  },
  {
    "con": "Phân số \\frac{3}{4} lớn hơn phân số \\frac{1}{2}:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì:",
    "re": "số đó là số chẵn"
  },
  {
    "con": "Chọn số thập phân thích hợp 7km 504m = … hm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cộng hai số nguyên dương 5 và 3",
    "re": "Kết quả là 8"
  },
  {
    "con": "Nhân số nguyên 4 với 6",
    "re": "Kết quả là 24"
  },
  {
    "con": "Chia số 20 cho 4",
    "re": "Kết quả là 5"
  },
  {
    "con": "Tìm số lớn nhất trong dãy số 3, 7, 2, 9",
    "re": "Kết quả là 9"
  },
  {
    "con": "Tính diện tích hình chữ nhật có chiều dài 5m và chiều rộng 3m",
    "re": "Kết quả là 15m²"
  },
  {
    "con": "Tính chu vi hình vuông có cạnh 4cm",
    "re": "Kết quả là 16cm"
  },
  {
    "con": "Tìm số trung bình của dãy số 2, 4, 6, 8",
    "re": "Kết quả là 5"
  },
  {
    "con": "Giải phương trình 2x + 3 = 11",
    "re": "Kết quả là x = 4"
  },
  {
    "con": "Chọn số nguyên tố trong dãy số 2, 3, 4, 5, 6",
    "re": "Kết quả là 2, 3, 5"
  },
  {
    "con": "Khoảng thời gian từ lúc 7 giờ kém 20 đến 7 giờ 30 phút là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương là:",
    "re": "Một số nguyên dương"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì:",
    "re": "Số đó là số chẵn"
  },
  {
    "con": "Nếu một số chia hết cho 3 thì:",
    "re": "Tổng các chữ số của số đó cũng chia hết cho 3"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì:",
    "re": "Diện tích của hình chữ nhật là chiều rộng nhân với chiều dài"
  },
  {
    "con": "Nếu một số nguyên âm được cộng với một số nguyên dương lớn hơn nó thì:",
    "re": "Kết quả là một số nguyên dương"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau thì:",
    "re": "Tam giác đó là tam giác đều"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 0 hoặc 5 thì:",
    "re": "Số đó chia hết cho 5"
  },
  {
    "con": "Nếu một hình tròn có bán kính gấp đôi bán kính của một hình tròn khác thì:",
    "re": "Diện tích của hình tròn lớn hơn gấp 4 lần diện tích của hình tròn nhỏ"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 1 thì:",
    "re": "Kết quả vẫn là số nguyên dương đó"
  },
  {
    "con": "Đội bóng của một trường học đã thi đấu 20 trận, thắng 18 trận. Như thế tỉ số phần trăm các trận thắng của đội là:",
    "re": "90%"
  },
  {
    "con": "Nếu tổng của hai số là 10 và một số là 4, thì số còn lại là:",
    "re": "6"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 5 cm, thì diện tích của hình vuông đó là:",
    "re": "25 cm²"
  },
  {
    "con": "Nếu một chiếc bánh có 8 miếng và bạn ăn 3 miếng, thì số miếng bánh còn lại là:",
    "re": "5 miếng"
  },
  {
    "con": "Nếu bạn có 12 viên bi và chia đều cho 4 người, thì mỗi người sẽ nhận được:",
    "re": "3 viên bi"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 8 cm và chiều rộng 3 cm, thì chu vi của hình chữ nhật đó là:",
    "re": "22 cm"
  },
  {
    "con": "Nếu bạn có 5 quả táo và cho đi 2 quả, thì số táo còn lại là:",
    "re": "3 quả"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu bạn cộng 7 với 5, thì kết quả là:",
    "re": "12"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3 cm, thì diện tích của hình tròn đó là:",
    "re": "28.26 cm² (làm tròn)"
  },
  {
    "con": "Một miếng bìa hình thang có đáy lớn là 6cm, đáy bé 4cm, đường cao 5 cm. Diện tích miếng bìa là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 3 và 5 là:",
    "re": "8"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4cm, thì diện tích của hình vuông đó là:",
    "re": "16 cm²"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 8cm và chiều rộng 3cm, thì chu vi của hình chữ nhật đó là:",
    "re": "22 cm"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 2 và dư 1, thì số đó là:",
    "re": "số lẻ"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3cm, thì diện tích của hình tròn đó là:",
    "re": "28.26 cm² (làm tròn)"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho chính nó, thì kết quả là:",
    "re": "1"
  },
  {
    "con": "Nếu tổng của ba số 2, 4 và 6 là:",
    "re": "12"
  },
  {
    "con": "Nếu một góc vuông có độ lớn là 90 độ, thì tổng của các góc trong một tam giác là:",
    "re": "180 độ"
  },
  {
    "con": "Số thập phân gồm sáu phần trăm, năm phần mười, bảy phần nghìn là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương là:",
    "re": "Một số nguyên dương"
  },
  {
    "con": "Số chia hết cho 2 là:",
    "re": "Số chẵn"
  },
  {
    "con": "Số chia hết cho 3 là:",
    "re": "Tổng các chữ số của nó chia hết cho 3"
  },
  {
    "con": "Hình chữ nhật có chiều dài gấp đôi chiều rộng thì:",
    "re": "Diện tích bằng chiều rộng nhân với chiều dài"
  },
  {
    "con": "Số nguyên tố là số lớn hơn 1 và chỉ chia hết cho 1 và chính nó thì:",
    "re": "Có đúng hai ước số"
  },
  {
    "con": "Khi cộng hai số âm thì:",
    "re": "Kết quả là một số âm"
  },
  {
    "con": "Khi nhân một số dương với số 0 thì:",
    "re": "Kết quả là 0"
  },
  {
    "con": "Số thập phân có hai chữ số sau dấu phẩy thì:",
    "re": "Có thể được biểu diễn dưới dạng phân số với mẫu số 100"
  },
  {
    "con": "Hình tròn có bán kính gấp đôi bán kính của hình tròn khác thì:",
    "re": "Diện tích của nó gấp bốn lần diện tích hình tròn kia"
  },
  {
    "con": "Số thích hợp viết vào chỗ chấm của 426 giây = … phút là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn hoặc bằng:",
    "re": "0"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là:",
    "re": "số chẵn"
  },
  {
    "con": "Nếu một số chia hết cho 3 thì tổng các chữ số của số đó cũng chia hết cho:",
    "re": "3"
  },
  {
    "con": "Nếu hai góc trong một tam giác có tổng là 90 độ thì góc còn lại là:",
    "re": "góc vuông"
  },
  {
    "con": "Diện tích hình chữ nhật được tính bằng:",
    "re": "chiều dài nhân với chiều rộng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 1 thì kết quả là:",
    "re": "số đó"
  },
  {
    "con": "Nếu một hình tròn có bán kính r thì chu vi của nó được tính bằng:",
    "re": "2πr"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 5 thì số đó là:",
    "re": "số lẻ"
  },
  {
    "con": "Một hình thang có đáy bé a, đáy lớn là b, chiều cao là h (a, b, h cùng đơn vị đo) thì công thức tính diện tích S của hình thang đó là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một tam giác có đáy b và chiều cao h (b, h cùng đơn vị đo) thì công thức tính diện tích S của tam giác đó là:",
    "re": "S = (b * h) / 2"
  },
  {
    "con": "Một hình vuông có cạnh a (a là độ dài cạnh) thì công thức tính diện tích S của hình vuông đó là:",
    "re": "S = a * a"
  },
  {
    "con": "Một hình tròn có bán kính r (r là độ dài bán kính) thì công thức tính diện tích S của hình tròn đó là:",
    "re": "S = π * r * r"
  },
  {
    "con": "Một số nguyên dương n thì tổng các số nguyên dương từ 1 đến n là:",
    "re": "T = n * (n + 1) / 2"
  },
  {
    "con": "Một số nguyên dương n thì giai thừa của n (n!) được tính bằng:",
    "re": "n! = n * (n - 1) * (n - 2) * ... * 1"
  },
  {
    "con": "Một số thực x và y (x, y khác 0) thì tỉ lệ x/y có thể được tính bằng:",
    "re": "Tỉ lệ = x / y"
  },
  {
    "con": "Một số nguyên dương n thì số lượng ước số của n có thể được tính bằng:",
    "re": "Số lượng ước số = (e1 + 1) * (e2 + 1) * ... * (ek + 1) với n = p1^e1 * p2^e2 * ... * pk^ek"
  },
  {
    "con": "Một số thực x và y (x, y khác 0) thì tổng x và y được tính bằng:",
    "re": "Tổng = x + y"
  },
  {
    "con": "Một số nguyên dương n thì số Fibonacci thứ n được tính bằng:",
    "re": "F(n) = F(n-1) + F(n-2) với F(0) = 0, F(1) = 1"
  },
  {
    "con": "Số thích hợp viết vào chỗ chấm của 780g = … kg là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn hoặc bằng:",
    "re": "0"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là:",
    "re": "số chẵn"
  },
  {
    "con": "Nếu một số chia hết cho 3 thì tổng các chữ số của số đó cũng chia hết cho:",
    "re": "3"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì tỷ lệ giữa chiều dài và chiều rộng là:",
    "re": "2:1"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 1 thì kết quả là:",
    "re": "số đó"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau thì đó là:",
    "re": "tam giác đều"
  },
  {
    "con": "Nếu một số có chữ số cuối là 0 hoặc 5 thì số đó chia hết cho:",
    "re": "5"
  },
  {
    "con": "Nếu một số nguyên dương có hai chữ số thì giá trị lớn nhất của nó là:",
    "re": "99"
  },
  {
    "con": "Một xe ô tô cứ chạy quãng đường dài 70km thì tiêu thụ hết 10 lít xăng. Hỏi nếu ô tô đi quãng đường dài 280km thì tiêu thụ hết bao nhiêu lít xăng? (mức tiêu hao xăng trên 1km như nhau)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4cm thì diện tích của hình vuông đó là 16cm².",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 10 và một số là 4 thì số còn lại là 6.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chiếc bánh có giá 20.000 đồng và bạn mua 3 chiếc thì tổng số tiền bạn phải trả là 60.000 đồng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 5cm và chiều rộng 3cm thì chu vi của hình chữ nhật đó là 16cm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 2 và dư 1 thì số đó là số lẻ.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn có 12 viên bi và cho đi 4 viên thì bạn còn lại 8 viên bi.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3cm thì diện tích của hình tròn đó là khoảng 28.26cm².",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu bạn có 5 quả táo và nhận thêm 3 quả nữa thì bạn có tổng cộng 8 quả táo.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số được nhân với 0 thì kết quả luôn là 0.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một đoàn tàu băng qua một cột điện hết 8 giây. Cũng với tốc độ đó, đoàn tàu băng qua một đường hầm dài 260m hết 1 phút. Vận tốc của đoàn tàu đó là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 15 và một trong số đó là 7, thì số còn lại là:",
    "re": "8"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài là 10cm và chiều rộng là 5cm, thì diện tích của hình chữ nhật đó là:",
    "re": "50cm²"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu một hình tròn có bán kính là 3cm, thì chu vi của hình tròn đó là:",
    "re": "18.84cm"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1, thì kết quả là:",
    "re": "Số nguyên dương đó"
  },
  {
    "con": "Nếu một tam giác có độ dài ba cạnh lần lượt là 3cm, 4cm và 5cm, thì tam giác đó là:",
    "re": "Tam giác vuông"
  },
  {
    "con": "Nếu một số được cộng với chính nó, thì kết quả là:",
    "re": "Gấp đôi số đó"
  },
  {
    "con": "Nếu một số nguyên âm được cộng với một số nguyên dương lớn hơn nó, thì kết quả là:",
    "re": "Số nguyên dương"
  },
  {
    "con": "Nếu một số có 3 chữ số và chữ số hàng trăm là 5, thì số đó nằm trong khoảng:",
    "re": "500 đến 599"
  },
  {
    "con": "Một máy bay bay với vận tốc 650 km/giờ. Tính quãng đường máy bay bay được trong 2,4 giờ.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương a và b là 10. Nếu a = 4 thì b = 6.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một hình chữ nhật có chiều dài 8 cm và chiều rộng 5 cm. Tính diện tích của hình chữ nhật.",
    "re": "Diện tích là 40 cm²"
  },
  {
    "con": "Một số nguyên dương chia hết cho 2 thì nó là số chẵn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của ba số 3, 5 và 7 là 15 thì tổng của ba số 4, 6 và 8 là 18.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một hình tròn có bán kính 3 cm. Tính chu vi của hình tròn.",
    "re": "Chu vi là 18,84 cm"
  },
  {
    "con": "Nếu một số nguyên dương n lớn hơn 1 thì n có ít nhất một ước số khác 1 và chính nó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một hình vuông có cạnh dài 4 cm. Tính diện tích của hình vuông.",
    "re": "Diện tích là 16 cm²"
  },
  {
    "con": "Nếu một số thập phân có phần nguyên là 5 và phần thập phân là 0,75 thì số đó là 5,75.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương n chia cho 3 có dư 1 thì n có thể viết dưới dạng 3k + 1 với k là số nguyên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tìm số tự nhiên x để \\frac{25}{x} = \\frac{5}{6}",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tính tổng của 7 và 5",
    "re": "Kết quả là 12"
  },
  {
    "con": "Tìm số nguyên dương x sao cho 3x = 15",
    "re": "Câu trả lời đúng là x = 5"
  },
  {
    "con": "Tính diện tích hình chữ nhật có chiều dài 4 và chiều rộng 3",
    "re": "Diện tích là 12"
  },
  {
    "con": "Tìm số thập phân x sao cho x + 0.5 = 1.5",
    "re": "Câu trả lời đúng là x = 1"
  },
  {
    "con": "Tính chu vi hình vuông có cạnh dài 6",
    "re": "Chu vi là 24"
  },
  {
    "con": "Tìm số tự nhiên x sao cho 2x - 4 = 10",
    "re": "Câu trả lời đúng là x = 7"
  },
  {
    "con": "Tính trung bình cộng của các số 2, 4, 6",
    "re": "Kết quả là 4"
  },
  {
    "con": "Tìm số nguyên x sao cho x^2 = 16",
    "re": "Câu trả lời đúng là x = 4 hoặc x = -4"
  },
  {
    "con": "Tính 15% của 200",
    "re": "Kết quả là 30"
  },
  {
    "con": "Hai vòi nước cùng chảy vào một bể không chứa nước thì sau 6 giờ đầy bể. Nếu vòi thứ nhất chảy trong 2 giờ, vòi thứ hai chảy trong 3 giờ thì được \\frac{2}{5} bể. Hỏi vòi thứ nhất chảy một mình trong bao lâu thì đầy bể?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 10 và một trong hai số là 4 thì số còn lại là 6.",
    "re": "Số còn lại là 6"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài là 8 cm và chiều rộng là 5 cm thì diện tích của hình chữ nhật là 40 cm².",
    "re": "Diện tích là 40 cm²"
  },
  {
    "con": "Nếu một số nguyên dương chia hết cho 2 thì số đó là số chẵn.",
    "re": "Số đó là số chẵn"
  },
  {
    "con": "Nếu một tam giác có ba cạnh lần lượt là 3 cm, 4 cm và 5 cm thì tam giác đó là tam giác vuông.",
    "re": "Tam giác đó là tam giác vuông"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì kết quả là 0.",
    "re": "Kết quả là 0"
  },
  {
    "con": "Nếu tổng của ba số là 15 và hai trong số đó là 5 và 7 thì số còn lại là 3.",
    "re": "Số còn lại là 3"
  },
  {
    "con": "Nếu một hình tròn có bán kính là 3 cm thì chu vi của hình tròn đó là khoảng 18.84 cm.",
    "re": "Chu vi là khoảng 18.84 cm"
  },
  {
    "con": "Nếu một số được chia cho 1 thì kết quả là chính số đó.",
    "re": "Kết quả là chính số đó"
  },
  {
    "con": "Nếu một số nguyên dương chia cho 3 và dư 1 thì số đó có thể được biểu diễn dưới dạng 3k + 1 với k là số nguyên.",
    "re": "Số đó có thể được biểu diễn dưới dạng 3k + 1"
  },
  {
    "con": "Mẹ hơn con 36 tuổi, tuổi mẹ gấp 4 lần tuổi con. Tuổi con hiện nay là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số là 20 và một số lớn hơn số kia 4 đơn vị. Hai số là:",
    "re": "16 và 4"
  },
  {
    "con": "Một hình chữ nhật có chiều dài gấp đôi chiều rộng. Nếu chiều rộng là 5 cm, thì diện tích hình chữ nhật là:",
    "re": "50 cm²"
  },
  {
    "con": "Tổng của ba số là 30 và hai số đầu tiên bằng nhau. Nếu số thứ ba là 10, thì mỗi số đầu tiên là:",
    "re": "10"
  },
  {
    "con": "Một hình vuông có chu vi là 40 cm. Nếu chiều dài một cạnh là x cm, thì x là:",
    "re": "10 cm"
  },
  {
    "con": "Nếu một số được nhân với 3 và cộng thêm 5 thì kết quả là 20. Số đó là:",
    "re": "5"
  },
  {
    "con": "Nếu một hình tròn có bán kính là 7 cm, thì diện tích của hình tròn là:",
    "re": "154 cm²"
  },
  {
    "con": "Nếu một số được chia cho 4 và kết quả là 6, thì số đó là:",
    "re": "24"
  },
  {
    "con": "Nếu tổng của hai số là 50 và một số là 30, thì số còn lại là:",
    "re": "20"
  },
  {
    "con": "Nếu một hình tam giác có chiều cao là 8 cm và đáy là 6 cm, thì diện tích của hình tam giác là:",
    "re": "24 cm²"
  },
  {
    "con": "Tổng của hai số là 2020. Tìm hai số đó biết rằng giữa chúng có 5 số chẵn liên tiếp.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 2 và dư 0, thì số đó là số chẵn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai số đầu tiên là 10 và 15, thì số thứ ba là 5.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài là 8 cm và chiều rộng là 4 cm, thì diện tích của nó là 32 cm².",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 3 và dư 1, thì số đó không chia hết cho 3.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tam giác có ba cạnh lần lượt là 3 cm, 4 cm và 5 cm, thì đó là tam giác vuông.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0, thì kết quả là 0.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 50 và một số là 20, thì số còn lại là 30.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính là 5 cm, thì chu vi của nó là khoảng 31.4 cm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương là số nguyên tố, thì nó chỉ có hai ước số là 1 và chính nó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Kết quả của phép tính 12,3 + 24,05 \\times 2,5 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn là:",
    "re": "Một số nguyên dương"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì:",
    "re": "Số đó là số chẵn"
  },
  {
    "con": "Nếu một số chia hết cho 3 thì:",
    "re": "Tổng các chữ số của số đó cũng chia hết cho 3"
  },
  {
    "con": "Kết quả của phép nhân hai số âm là:",
    "re": "Một số dương"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài và chiều rộng bằng nhau thì:",
    "re": "Hình đó là hình vuông"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai số đầu là 10 và 15 thì:",
    "re": "Số thứ ba là 5"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì:",
    "re": "Kết quả là 0"
  },
  {
    "con": "Nếu một số có phần thập phân là 0,5 thì:",
    "re": "Số đó là số lẻ"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau thì:",
    "re": "Tam giác đó là tam giác đều"
  },
  {
    "con": "Thể tích của hình lập phương có cạnh bằng 5cm là:",
    "re": "125 cm³"
  },
  {
    "con": "Tổng của hai số 7 và 3 là:",
    "re": "10"
  },
  {
    "con": "Số nguyên tố nhỏ nhất là:",
    "re": "2"
  },
  {
    "con": "Khi chia 15 cho 3, thương là:",
    "re": "5"
  },
  {
    "con": "Diện tích của hình chữ nhật có chiều dài 4cm và chiều rộng 6cm là:",
    "re": "24 cm²"
  },
  {
    "con": "Số đối của -8 là:",
    "re": "8"
  },
  {
    "con": "Khi cộng 5 với 9, kết quả là:",
    "re": "14"
  },
  {
    "con": "Số lớn nhất trong dãy số 3, 7, 2, 9 là:",
    "re": "9"
  },
  {
    "con": "Khi trừ 10 đi 4, kết quả là:",
    "re": "6"
  },
  {
    "con": "Chu vi của hình vuông có cạnh 4cm là:",
    "re": "16 cm"
  },
  {
    "con": "Chị chia đào cho các em, nếu chia cho mỗi em 3 quả thì thừa 2 quả, nếu chia cho mỗi em 4 quả thì thiếu 2 quả. Hỏi có tất cả bao nhiêu quả đào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 15 và hiệu của chúng là 5, thì hai số đó là 10 và 5.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng, và diện tích của nó là 48 cm², thì chiều dài và chiều rộng lần lượt là 8 cm và 4 cm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số được nhân với 6 và kết quả là 54, thì số đó là 9.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính là 7 cm, thì chu vi của nó là khoảng 43.96 cm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của ba số liên tiếp là 36, thì số giữa là 12.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số được chia cho 4 và dư 3, thì số đó có thể viết dưới dạng 4k + 3 với k là số nguyên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tam giác có hai cạnh dài 5 cm và 12 cm, thì cạnh còn lại phải nhỏ hơn 17 cm và lớn hơn 7 cm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 2 và 3 thì nó phải là bội số của 6.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình vuông có chu vi là 40 cm, thì diện tích của nó là 100 cm².",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hiệu của hai số là 129, biết rằng nếu lấy số bé cộng với số lớn rồi cộng với tổng hai số thì được kết quả là 2020. Vậy số lớn là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số là 50, nếu số lớn gấp đôi số bé thì số lớn là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài là 10 cm và chiều rộng là 5 cm, thì diện tích của hình chữ nhật là:",
    "re": "50 cm²"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai số đầu tiên là 10 và 15, thì số thứ ba là:",
    "re": "5"
  },
  {
    "con": "Nếu một số được nhân với 4 và kết quả là 32, thì số đó là:",
    "re": "8"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 6 cm, thì chu vi của hình vuông là:",
    "re": "24 cm"
  },
  {
    "con": "Nếu một số được chia cho 3 và kết quả là 9, thì số đó là:",
    "re": "27"
  },
  {
    "con": "Nếu một hình tròn có bán kính là 7 cm, thì diện tích của hình tròn là:",
    "re": "153.94 cm²"
  },
  {
    "con": "Nếu một số được cộng với 15 và kết quả là 50, thì số đó là:",
    "re": "35"
  },
  {
    "con": "Nếu một số được trừ đi 12 và kết quả là 8, thì số đó là:",
    "re": "20"
  },
  {
    "con": "Biết 52% của một số là 507. Vậy 64% của số đó là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 30 và một số là 12, thì số còn lại là:",
    "re": "18"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài là 8 cm và chiều rộng là 5 cm, thì diện tích của hình chữ nhật là:",
    "re": "40 cm²"
  },
  {
    "con": "Nếu một số được nhân với 0 thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu 3/4 của một số là 12, thì số đó là:",
    "re": "16"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 6 cm, thì chu vi của hình vuông là:",
    "re": "24 cm"
  },
  {
    "con": "Nếu 5 + x = 12, thì giá trị của x là:",
    "re": "7"
  },
  {
    "con": "Nếu một số chia cho 2 cho kết quả là 15, thì số đó là:",
    "re": "30"
  },
  {
    "con": "Nếu 10% của một số là 25, thì số đó là:",
    "re": "250"
  },
  {
    "con": "Nếu một hình tròn có bán kính là 3 cm, thì diện tích của hình tròn là:",
    "re": "28.26 cm²"
  },
  {
    "con": "Phân số nào dưới đây có thể viết thành phân số thập phân:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn 0:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là số chẵn:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu hai góc trong một tam giác có tổng là 90 độ thì góc còn lại là góc vuông:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì kết quả là 0:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài và chiều rộng bằng nhau thì nó là hình vuông:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là số lẻ thì một trong hai số đó phải là số chẵn:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số chia cho 1 thì kết quả là chính nó:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được cộng với 1 thì kết quả luôn lớn hơn số đó:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một đa giác có 4 cạnh thì nó là hình tứ giác:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Kết quả của phép tính 5 : 1000 = … là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 3 và 4 là:",
    "re": "7"
  },
  {
    "con": "Kết quả của phép tính 8 x 7 = … là:",
    "re": "56"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 5 cm, thì diện tích của hình vuông đó là:",
    "re": "25 cm²"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 10 cm và chiều rộng 4 cm, thì chu vi của hình chữ nhật đó là:",
    "re": "28 cm"
  },
  {
    "con": "Nếu 12 chia cho 3, thì kết quả là:",
    "re": "4"
  },
  {
    "con": "Nếu 15 trừ 9, thì kết quả là:",
    "re": "6"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1, thì kết quả là:",
    "re": "Số nguyên dương đó"
  },
  {
    "con": "Nếu 2 cộng 2, thì kết quả là:",
    "re": "4"
  },
  {
    "con": "Nếu 1000 chia cho 10, thì kết quả là:",
    "re": "100"
  },
  {
    "con": "Thương của \\frac{2}{5} và  \\frac{3}{4} là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của 7 và 5 là:",
    "re": "12"
  },
  {
    "con": "Hiệu của 10 và 4 là:",
    "re": "6"
  },
  {
    "con": "Tích của 3 và 8 là:",
    "re": "24"
  },
  {
    "con": "Số nguyên dương nhỏ nhất là:",
    "re": "1"
  },
  {
    "con": "Số chẵn tiếp theo của 6 là:",
    "re": "8"
  },
  {
    "con": "Số lẻ tiếp theo của 5 là:",
    "re": "7"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì diện tích của nó là:",
    "re": "16 cm²"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 5 cm và chiều rộng 3 cm, thì chu vi của nó là:",
    "re": "16 cm"
  },
  {
    "con": "Nếu 1/2 và 1/4 được cộng lại, thì kết quả là:",
    "re": "3/4"
  },
  {
    "con": "Để vẽ hình tròn, ta sử dụng dụng cụ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi cộng hai số nguyên dương, tổng luôn lớn hơn cả hai số đó:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2, thì số đó là số chẵn:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhân một số với 0, kết quả luôn là:",
    "re": "0"
  },
  {
    "con": "Nếu một tam giác có hai cạnh bằng nhau, thì đó là tam giác cân:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi trừ một số dương từ một số dương lớn hơn, kết quả luôn là:",
    "re": "Số dương"
  },
  {
    "con": "Nếu một số chia cho chính nó, kết quả luôn là:",
    "re": "1"
  },
  {
    "con": "Khi cộng một số dương với một số âm, kết quả có thể là:",
    "re": "Số dương, số âm hoặc 0"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài và chiều rộng bằng nhau, thì đó là hình vuông:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhân hai số âm, kết quả luôn là:",
    "re": "Số dương"
  },
  {
    "con": "Bốn năm liên tiếp có tất cả bao nhiêu ngày:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn hoặc bằng 2:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là số chẵn:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tích của hai số âm luôn là một số dương:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tam giác có hai cạnh bằng nhau thì đó là tam giác cân:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai góc trong một tam giác là 90 độ thì góc còn lại là 90 độ:",
    "re": "Câu trả lời sai"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1 thì kết quả là chính nó:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số có chữ số cuối là 0 hoặc 5 thì số đó chia hết cho 5:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm thì diện tích của nó là 16 cm²:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 2 thì kết quả có thể là số nguyên hoặc số thập phân:",
    "re": "Câu trả lời sai"
  },
  {
    "con": "Lớp 5M có 32 học sinh. Số học sinh nữ bằng  \\frac{3}{5} số học sinh nam. Số học sinh nam của lớp 5M là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số là 15 và một số lớn hơn số kia 3 đơn vị. Hai số đó là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một hình chữ nhật có chiều dài gấp đôi chiều rộng. Nếu chiều rộng là 4 cm, thì diện tích hình chữ nhật là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số được nhân với 5 và kết quả là 25, thì số đó là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai số đầu tiên là 10 và 12, thì số thứ ba là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 6 cm, thì chu vi của hình vuông đó là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chiếc bánh có 12 miếng và bạn ăn 4 miếng, thì số miếng bánh còn lại là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số được chia cho 4 và kết quả là 7, thì số đó là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3 cm, thì diện tích của hình tròn đó là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được cộng với 8 và kết quả là 15, thì số đó là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tìm X, biết x \\times 2,5 =1,3",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tìm tổng của 5 và 7",
    "re": "Kết quả là 12"
  },
  {
    "con": "Tìm hiệu của 10 và 4",
    "re": "Kết quả là 6"
  },
  {
    "con": "Tìm tích của 3 và 8",
    "re": "Kết quả là 24"
  },
  {
    "con": "Tìm thương của 20 và 5",
    "re": "Kết quả là 4"
  },
  {
    "con": "Biết rằng 1/2 + 1/4",
    "re": "Kết quả là 3/4"
  },
  {
    "con": "Biết rằng 2^3",
    "re": "Kết quả là 8"
  },
  {
    "con": "Tìm diện tích của hình chữ nhật có chiều dài 5 và chiều rộng 3",
    "re": "Kết quả là 15"
  },
  {
    "con": "Tìm chu vi của hình vuông có cạnh 4",
    "re": "Kết quả là 16"
  },
  {
    "con": "Biết rằng số nguyên tố nhỏ nhất là 2",
    "re": "Kết quả đúng"
  },
  {
    "con": "Phép chia 68,37 cho 8,3 có thương là 8,23. Số dư của phép chia đó là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn cả hai số đó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1, thì thương là chính nó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0, thì kết quả là 0.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì diện tích của nó là 16 cm².",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 10 và một số là 4, thì số còn lại là 6.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau, thì đó là tam giác đều.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số là số chẵn, thì nó có thể được chia hết cho 2.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số có chữ số cuối là 5 hoặc 0, thì nó là số chia hết cho 5.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3 cm, thì chu vi của nó là khoảng 18,84 cm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Dãy phân số nào dưới được viết theo thứ tự tăng dần:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương:",
    "re": "Sẽ luôn là một số nguyên dương"
  },
  {
    "con": "Nếu một số chia hết cho 2:",
    "re": "Thì số đó là số chẵn"
  },
  {
    "con": "Nếu một số chia hết cho 3:",
    "re": "Thì tổng các chữ số của số đó cũng chia hết cho 3"
  },
  {
    "con": "Nếu hai góc trong một tam giác có tổng là 90 độ:",
    "re": "Thì góc còn lại sẽ là góc vuông"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng:",
    "re": "Thì diện tích của hình chữ nhật sẽ bằng chiều rộng nhân với 2 lần chiều rộng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0:",
    "re": "Thì kết quả sẽ luôn là 0"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 1:",
    "re": "Thì kết quả sẽ luôn là chính số đó"
  },
  {
    "con": "Nếu một số là bội số của 5:",
    "re": "Thì số đó sẽ kết thúc bằng 0 hoặc 5"
  },
  {
    "con": "Nếu một hình tròn có bán kính r:",
    "re": "Thì diện tích của hình tròn sẽ là πr²"
  },
  {
    "con": "Một xe tải chỉ có thể chở được 300 bao gạo, mỗi bao 50kg. Nếu chất lên xe tải đó loại gạo 75kg thì xe chở được nhiều nhất bao nhiêu bao gạo:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 20 và một số là 8, thì số còn lại là:",
    "re": "12"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài là 10cm và chiều rộng là 5cm, thì diện tích của hình chữ nhật đó là:",
    "re": "50cm²"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu một hình tròn có bán kính là 7cm, thì chu vi của hình tròn đó là:",
    "re": "44cm (khoảng 3.14 x 14)"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1, thì kết quả là:",
    "re": "Số đó"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai số đầu tiên là 10 và 15, thì số thứ ba là:",
    "re": "5"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4cm, thì chu vi của hình vuông đó là:",
    "re": "16cm"
  },
  {
    "con": "Nếu một số được cộng với 5 và kết quả là 12, thì số đó là:",
    "re": "7"
  },
  {
    "con": "Nếu một hình tam giác có đáy là 6cm và chiều cao là 4cm, thì diện tích của hình tam giác đó là:",
    "re": "12cm²"
  },
  {
    "con": "Số lớn nhất trong các số 4,74; 7,04; 7,4; 7,47 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 3 và 5 là:",
    "re": "8"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì diện tích của hình vuông đó là:",
    "re": "16 cm²"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 2 và dư 0, thì số đó là:",
    "re": "Số chẵn"
  },
  {
    "con": "Nếu tổng của ba số 2, 3 và 5 là:",
    "re": "10"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 6 cm và chiều rộng 3 cm, thì chu vi của hình chữ nhật đó là:",
    "re": "18 cm"
  },
  {
    "con": "Nếu số 12 được chia cho 4, thì thương là:",
    "re": "3"
  },
  {
    "con": "Nếu một góc vuông có độ lớn là 90 độ, thì tổng của hai góc phụ của nó là:",
    "re": "90 độ"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 1, thì kết quả là:",
    "re": "Số nguyên dương đó"
  },
  {
    "con": "Nếu một hình tròn có bán kính 5 cm, thì diện tích của hình tròn đó là:",
    "re": "25π cm²"
  },
  {
    "con": "Tổng của hai số nguyên dương",
    "re": "luôn là một số nguyên dương"
  },
  {
    "con": "Số 0 là số chẵn",
    "re": "nó chia hết cho 2"
  },
  {
    "con": "Tích của hai số nguyên âm",
    "re": "luôn là một số nguyên dương"
  },
  {
    "con": "Phân số có tử số lớn hơn mẫu số",
    "re": "là một số lớn hơn 1"
  },
  {
    "con": "Hai góc đối diện trong một hình chữ nhật",
    "re": "luôn bằng nhau"
  },
  {
    "con": "Tổng của ba góc trong một tam giác",
    "re": "luôn bằng 180 độ"
  },
  {
    "con": "Số nguyên tố là số lớn hơn 1",
    "re": "chỉ có hai ước số là 1 và chính nó"
  },
  {
    "con": "Hình vuông có tất cả các cạnh bằng nhau",
    "re": "và tất cả các góc đều bằng 90 độ"
  },
  {
    "con": "Nếu một số chia hết cho 3",
    "re": "thì tổng các chữ số của nó cũng chia hết cho 3"
  },
  {
    "con": "Nếu một số chia hết cho 5",
    "re": "thì chữ số tận cùng của nó là 0 hoặc 5"
  },
  {
    "con": "Phát biểu nào dưới đây sai:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Giá trị của biểu thức \\frac{1}{2} + \\frac{1}{6} + \\frac{1}{12} + \\frac{1}{20} + \\frac{1}{30} + \\frac{1}{42} + \\frac{1}{56} là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn hoặc bằng:",
    "re": "0"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là:",
    "re": "số chẵn"
  },
  {
    "con": "Nếu một số chia hết cho 3 thì tổng các chữ số của số đó cũng chia hết cho:",
    "re": "3"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì tỷ lệ giữa chiều dài và chiều rộng là:",
    "re": "2:1"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 1 thì kết quả là:",
    "re": "số đó"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau thì đó là:",
    "re": "tam giác đều"
  },
  {
    "con": "Nếu tổng của hai góc trong một tam giác là 90 độ thì góc còn lại là:",
    "re": "90 độ"
  },
  {
    "con": "Nếu một số nguyên dương có chữ số tận cùng là 5 thì số đó có thể chia hết cho:",
    "re": "5"
  },
  {
    "con": "Hỗn số 17\\frac{5}{9} chuyển thành phân số nào dưới đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn 0?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là số chẵn?",
    "re": "Đúng"
  },
  {
    "con": "Tích của hai số âm luôn là số dương?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì tỷ lệ giữa chiều dài và chiều rộng là 2:1?",
    "re": "Đúng"
  },
  {
    "con": "Nếu tổng của ba số bằng 0 thì ít nhất một trong ba số đó phải là số âm?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1 thì kết quả là chính nó?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một tam giác có hai cạnh bằng nhau thì đó là tam giác cân?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một số có chữ số cuối là 0 thì số đó chia hết cho 10?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho chính nó thì kết quả luôn là 1?",
    "re": "Đúng"
  },
  {
    "con": "Một hình lập phương có diện tích xung quanh là 676cm2. Diện tích toàn phần của hình lập phương đó là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương a và b là 15. Nếu a = 7 thì b =:",
    "re": "8"
  },
  {
    "con": "Một tam giác có ba cạnh lần lượt là 3cm, 4cm và 5cm. Nếu tam giác này là tam giác vuông thì:",
    "re": "Cạnh huyền là 5cm"
  },
  {
    "con": "Một số nguyên dương n chia hết cho 2. Nếu n = 10 thì n cũng chia hết cho:",
    "re": "5"
  },
  {
    "con": "Một hình chữ nhật có chiều dài gấp đôi chiều rộng. Nếu chiều rộng là 4cm thì diện tích của hình chữ nhật là:",
    "re": "32cm2"
  },
  {
    "con": "Một số nguyên dương n có tổng các chữ số bằng 9. Nếu n = 18 thì:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một hình tròn có bán kính r = 3cm. Nếu tính diện tích thì diện tích là:",
    "re": "28.26cm2"
  },
  {
    "con": "Một số nguyên dương n có 3 chữ số. Nếu chữ số hàng trăm là 2 và chữ số hàng đơn vị là 5 thì:",
    "re": "Chữ số hàng chục có thể là 0 đến 9"
  },
  {
    "con": "Một hình thang có đáy lớn là 10cm, đáy nhỏ là 6cm và chiều cao là 4cm. Nếu tính diện tích thì diện tích là:",
    "re": "32cm2"
  },
  {
    "con": "Một số nguyên dương n chia hết cho 3. Nếu n = 12 thì n cũng chia hết cho:",
    "re": "6"
  },
  {
    "con": "Số thích hợp viết vào chỗ chấm của 8,3ha = … m^{2} là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn 0:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là số chẵn:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài là a và chiều rộng là b, thì diện tích của nó là:",
    "re": "a * b"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai số đầu là 10 và 15, thì số thứ ba là:",
    "re": "5"
  },
  {
    "con": "Nếu một góc vuông có độ lớn là 90 độ, thì tổng của hai góc phụ thuộc vào nó là:",
    "re": "90 độ"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0, thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu một số chia cho chính nó thì kết quả là:",
    "re": "1 (trừ khi số đó là 0)"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 5 hoặc 0, thì số đó chia hết cho 5:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau, thì đó là tam giác đều:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Đường kính của hình tròn có chu vi 204,1 cm là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn hoặc bằng:",
    "re": "0"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì:",
    "re": "số đó là số chẵn"
  },
  {
    "con": "Tích của hai số âm luôn là:",
    "re": "một số dương"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài là 5 cm và chiều rộng là 3 cm thì:",
    "re": "diện tích của hình chữ nhật là 15 cm²"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai số đầu là 10 và 15 thì:",
    "re": "số thứ ba là 5"
  },
  {
    "con": "Nếu một góc trong tam giác có giá trị 90 độ thì:",
    "re": "tam giác đó là tam giác vuông"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1 thì:",
    "re": "kết quả là chính số đó"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 0 hoặc 5 thì:",
    "re": "số đó chia hết cho 5"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm thì:",
    "re": "chu vi của hình vuông là 16 cm"
  },
  {
    "con": "Số hai mươi mốt triệu không trăm tám mươi tư nghìn năm trăm linh hai viết là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn hoặc bằng:",
    "re": "0"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là:",
    "re": "số chẵn"
  },
  {
    "con": "Tích của hai số âm sẽ là:",
    "re": "số dương"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì tỷ lệ giữa chiều dài và chiều rộng là:",
    "re": "2:1"
  },
  {
    "con": "Diện tích của hình vuông được tính bằng:",
    "re": "cạnh x cạnh"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1 thì kết quả là:",
    "re": "số nguyên dương đó"
  },
  {
    "con": "Nếu tổng của ba số bằng 0 thì ít nhất một trong ba số đó phải là:",
    "re": "số âm"
  },
  {
    "con": "Nếu một góc trong tam giác là 90 độ thì tam giác đó là:",
    "re": "tam giác vuông"
  },
  {
    "con": "Nếu một số có chữ số cuối là 0 thì số đó chia hết cho:",
    "re": "10"
  },
  {
    "con": "\\frac{2}{5} bằng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương:",
    "re": "Là một số nguyên dương"
  },
  {
    "con": "Một số chia hết cho 2:",
    "re": "Là số chẵn"
  },
  {
    "con": "Một số chia hết cho 3:",
    "re": "Tổng các chữ số của nó cũng chia hết cho 3"
  },
  {
    "con": "Tích của hai số nguyên âm:",
    "re": "Là một số nguyên dương"
  },
  {
    "con": "Một hình chữ nhật có chiều dài và chiều rộng:",
    "re": "Diện tích bằng chiều dài nhân chiều rộng"
  },
  {
    "con": "Một góc vuông:",
    "re": "Có độ lớn bằng 90 độ"
  },
  {
    "con": "Một số nguyên tố:",
    "re": "Chỉ có hai ước số là 1 và chính nó"
  },
  {
    "con": "Tổng của ba số bằng nhau:",
    "re": "Bằng ba lần giá trị của một số đó"
  },
  {
    "con": "Một số thập phân có phần nguyên bằng 0:",
    "re": "Là một số dương nhỏ hơn 1"
  },
  {
    "con": "Giá hoa tháng 5 tăng 10% so với giá hoa tháng 4. Giá hoa tháng 6 tăng 10% so với giá hoa tháng 5. Hỏi giá hoa tháng 6 tăng bao nhiêu phần trăm so với giá hoa tháng 4:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương a và b là 10. Nếu a = 4 thì b = 6:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một hình chữ nhật có chiều dài gấp đôi chiều rộng. Nếu chiều rộng là x thì chiều dài là 2x:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng ba số 3, 5 và x là 15 thì x = 7:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một số nguyên dương n chia hết cho 2. Nếu n = 8 thì n cũng chia hết cho 4:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu 5x = 20 thì x = 4:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài a thì diện tích của nó là a^2:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương n có 3 chữ số thì n nằm trong khoảng từ 100 đến 999:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu 2/3 của một số là 12 thì số đó là 18:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tam giác có ba cạnh a, b, c thì tổng độ dài hai cạnh bất kỳ luôn lớn hơn độ dài cạnh còn lại:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Số thích hợp viết vào chỗ chấm của 3dm 9mm = … dm là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 10 và một số là 4,",
    "re": "thì số còn lại là 6"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 5cm và chiều rộng 3cm,",
    "re": "thì diện tích của nó là 15cm²"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 2 và dư 1,",
    "re": "thì số đó là số lẻ"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai số là 10 và 15,",
    "re": "thì số còn lại là 5"
  },
  {
    "con": "Nếu một góc vuông có độ lớn 90 độ,",
    "re": "thì tổng của hai góc còn lại là 90 độ"
  },
  {
    "con": "Nếu một hình tròn có bán kính 4cm,",
    "re": "thì chu vi của nó là khoảng 25.12cm"
  },
  {
    "con": "Nếu một số được nhân với 0,",
    "re": "thì kết quả luôn là 0"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho chính nó,",
    "re": "thì kết quả luôn là 1"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 0,",
    "re": "thì số đó chia hết cho 10"
  },
  {
    "con": "Một thửa ruộng hình chữ nhật có chu vi là 126m, chiều dài hơn chiều rộng 13m. Vụ mùa vừa qua, cứ 100m^2 thửa ruộng cho thu hoạch 70kg thóc. Hỏi cả thửa ruộng thu hoạch được bao nhiêu tạ thóc:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 30 và một số lớn hơn số kia 10, thì số lớn hơn là 20.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 5cm, thì diện tích của hình vuông đó là 25cm².",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính là 7cm, thì chu vi của hình tròn đó là khoảng 43.96cm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương chia hết cho 2 và 3, thì số đó cũng chia hết cho 6.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tam giác có ba cạnh lần lượt là 3cm, 4cm và 5cm, thì tam giác đó là tam giác vuông.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương có chữ số hàng đơn vị là 0, thì số đó chia hết cho 10.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng, và chiều rộng là 4m, thì diện tích của hình chữ nhật là 32m².",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương là số lẻ, thì số đó không chia hết cho 2.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của ba số là 60 và hai số đầu tiên là 20 và 25, thì số thứ ba là 15.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Giá tiền của một chiếc bút chì là 4000 đồng. Nếu giảm \\frac{1}{10} giá bán thì phải trả bao nhiêu tiền để mua chiếc bút chì đó:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương là 10. Nếu một số là 4 thì số còn lại là:",
    "re": "6"
  },
  {
    "con": "Một hình chữ nhật có chiều dài là 5 cm và chiều rộng là 3 cm. Nếu tính diện tích thì diện tích là:",
    "re": "15 cm²"
  },
  {
    "con": "Một chiếc bánh có giá 20.000 đồng. Nếu mua 3 chiếc thì tổng giá tiền là:",
    "re": "60.000 đồng"
  },
  {
    "con": "Một số nguyên dương chia hết cho 2. Nếu số đó là 8 thì số đó là số:",
    "re": "chẵn"
  },
  {
    "con": "Một hình vuông có cạnh dài 4 cm. Nếu tính chu vi thì chu vi là:",
    "re": "16 cm"
  },
  {
    "con": "Tổng của ba số là 30. Nếu hai số đầu là 10 và 15 thì số còn lại là:",
    "re": "5"
  },
  {
    "con": "Một chiếc xe chạy với tốc độ 60 km/h. Nếu chạy trong 2 giờ thì quãng đường đi được là:",
    "re": "120 km"
  },
  {
    "con": "Một hình tròn có bán kính 3 cm. Nếu tính diện tích thì diện tích là:",
    "re": "28.26 cm² (làm tròn)"
  },
  {
    "con": "Một số nguyên dương là 12. Nếu chia số đó cho 3 thì kết quả là:",
    "re": "4"
  },
  {
    "con": "Số đo thích hợp viết vào chỗ chấm của \\frac{1}{10}m^{3} = …  là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương a và b là:",
    "re": "Một số nguyên dương"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì:",
    "re": "Số đó là số chẵn"
  },
  {
    "con": "Nếu một số chia hết cho 3 thì:",
    "re": "Tổng các chữ số của số đó cũng chia hết cho 3"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài a và chiều rộng b thì:",
    "re": "Diện tích của hình chữ nhật là a × b"
  },
  {
    "con": "Nếu một số nguyên dương n có 2 ước số thì:",
    "re": "Số đó là số nguyên tố"
  },
  {
    "con": "Nếu một góc có độ lớn 90 độ thì:",
    "re": "Góc đó là góc vuông"
  },
  {
    "con": "Nếu một số thập phân có chữ số 0 ở phần thập phân thì:",
    "re": "Số đó có thể được viết dưới dạng số nguyên"
  },
  {
    "con": "Nếu một hình tròn có bán kính r thì:",
    "re": "Chu vi của hình tròn là 2πr"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 5 thì:",
    "re": "Số đó chia hết cho 5"
  },
  {
    "con": "Chữ số 5 trong số thập phân 7,256 thuộc hàng nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn 0?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì nó là số chẵn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài và chiều rộng bằng nhau thì nó là hình vuông?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của ba số bằng 0 thì ít nhất một trong ba số đó phải âm?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì kết quả là 0?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số thập phân có phần thập phân là 0 thì nó là số nguyên?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau thì nó là tam giác đều?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số chia cho 5 có dư 0 thì nó là bội số của 5?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên âm được cộng với một số nguyên dương lớn hơn nó thì kết quả là số dương?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Số tiếp theo của dãy số: 4,13; 4,12; 4,11; 4,10; …… là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 7 và 5 là:",
    "re": "12"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì diện tích của nó là:",
    "re": "16 cm²"
  },
  {
    "con": "Nếu số 9 được chia cho 3, thì thương là:",
    "re": "3"
  },
  {
    "con": "Nếu 15 trừ đi 6, thì kết quả là:",
    "re": "9"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 5 cm và chiều rộng 3 cm, thì chu vi của nó là:",
    "re": "16 cm"
  },
  {
    "con": "Nếu số 8 nhân với 2, thì tích là:",
    "re": "16"
  },
  {
    "con": "Nếu một góc vuông có độ lớn 90 độ, thì tổng của các góc trong tam giác là:",
    "re": "180 độ"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1, thì kết quả là:",
    "re": "Số nguyên dương đó"
  },
  {
    "con": "Nếu một dãy số tăng dần bắt đầu từ 1 và có 5 số, thì số cuối cùng là:",
    "re": "5"
  },
  {
    "con": "Hình tam giác có độ dài đáy là 24 cm, chiều cao là 6 cm. Diện tích tam giác là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Số nguyên dương n chia hết cho 2. Số n là số chẵn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Số nguyên dương n chia hết cho 3. Số n có thể được viết dưới dạng 3k với k là số nguyên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hình chữ nhật có chiều dài là 10 cm và chiều rộng là 5 cm. Diện tích hình chữ nhật là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Số nguyên dương n có chữ số cuối là 0. Số n là bội của 10.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hình vuông có độ dài cạnh là 4 cm. Chu vi hình vuông là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Số nguyên dương n có tổng các chữ số là 9. Số n có thể là 9, 18, 27, ...",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hình tròn có bán kính là 7 cm. Diện tích hình tròn là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Số nguyên dương n là số nguyên tố. Số n chỉ có hai ước số là 1 và chính nó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hình thang có hai đáy lần lượt là 8 cm và 12 cm, chiều cao là 5 cm. Diện tích hình thang là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Số liệu thống kê xếp loại học lực của học sinh Trường Nguyễn Tất Thành trong 4 năm được cho trong bảng dưới đây. Biết rằng học lực của học sinh được chia làm ba loại: Giỏi, Khá và Trung bình. Hỏi năm học nào tỉ lệ học sinh xếp loại Trung bình của trường là cao nhất?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương a và b lớn hơn 0.",
    "re": "Tổng a + b luôn là một số nguyên dương."
  },
  {
    "con": "Một hình chữ nhật có chiều dài lớn hơn chiều rộng.",
    "re": "Diện tích của hình chữ nhật luôn lớn hơn 0."
  },
  {
    "con": "Một số nguyên dương chia hết cho 2.",
    "re": "Số đó là số chẵn."
  },
  {
    "con": "Một số nguyên dương chia hết cho 3.",
    "re": "Tổng các chữ số của số đó cũng chia hết cho 3."
  },
  {
    "con": "Một tam giác có ba cạnh a, b, c thỏa mãn điều kiện a + b > c, a + c > b, b + c > a.",
    "re": "Tam giác đó là hợp lệ."
  },
  {
    "con": "Một số nguyên dương n có ước số là 1 và chính nó.",
    "re": "Số n là số nguyên tố nếu n > 1."
  },
  {
    "con": "Một số thập phân có phần nguyên là 0.",
    "re": "Số đó là số thực âm nếu phần thập phân nhỏ hơn 0."
  },
  {
    "con": "Một hình tròn có bán kính r.",
    "re": "Chu vi của hình tròn đó là 2πr."
  },
  {
    "con": "Một số nguyên dương n được viết dưới dạng a^b với a > 1 và b > 0.",
    "re": "Số n có thể được coi là lũy thừa của a."
  },
  {
    "con": "Đội tình nguyện trường Nguyễn Tất Thành làm từ thiện tại một trường học của tỉnh Hà Giang. Theo kế hoạch, đội sẽ dọn cỏ ở một mảnh đất hình chữ nhật dài 220m, rộng 130m trong khuôn viên của trường. Đội đã dọn được cỏ với diện tích 1,2 héc-ta (ha). Hỏi diện tích phần đất còn lại chưa được dọn cỏ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương chia hết cho 2 thì số đó là số chẵn.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu tổng của hai số là 10 và một trong hai số là 4 thì số còn lại là 6.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 5 cm thì diện tích của hình vuông đó là 25 cm².",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 8 m và chiều rộng 3 m thì chu vi của hình chữ nhật đó là 22 m.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì kết quả là 0.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một tam giác có ba cạnh lần lượt là 3 cm, 4 cm và 5 cm thì tam giác đó là tam giác vuông.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số thập phân có phần nguyên là 7 và phần thập phân là 0,25 thì số đó có giá trị là 7,25.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho chính nó thì kết quả là 1.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính 4 cm thì diện tích của hình tròn đó là khoảng 50,27 cm².",
    "re": "Kết quả đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn cả hai số đó.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2, thì số đó là số chẵn.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình tam giác có ba cạnh bằng nhau, thì đó là hình tam giác đều.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Tích của hai số âm luôn là một số dương.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1, thì kết quả là chính số đó.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu tổng của hai số là 0, thì cả hai số đó đều phải là số đối nhau.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng, thì diện tích của nó là gấp bốn lần diện tích của hình vuông có cạnh bằng chiều rộng.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số chia cho 10, thì chữ số hàng đơn vị của số đó sẽ là phần dư.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0, thì kết quả luôn là 0.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính gấp đôi bán kính của một hình tròn khác, thì diện tích của hình tròn đó gấp bốn lần diện tích của hình tròn kia.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Viết liên tiếp câu “TRƯỜNG NGUYỄN TẤT THÀNH” 20 lần. Hỏi âm Ê cuối cùng đứng ở vị trí thứ mấy?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 10 và một số là 4, thì số còn lại là bao nhiêu?",
    "re": "Số còn lại là 6"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 5 cm, thì diện tích của hình vuông đó là bao nhiêu?",
    "re": "Diện tích là 25 cm²"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 8 cm và chiều rộng 3 cm, thì chu vi của hình chữ nhật đó là bao nhiêu?",
    "re": "Chu vi là 22 cm"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là bao nhiêu?",
    "re": "Kết quả là 0"
  },
  {
    "con": "Nếu một số nguyên dương chia cho 1, thì kết quả là bao nhiêu?",
    "re": "Kết quả là chính số đó"
  },
  {
    "con": "Nếu một hình tròn có bán kính 4 cm, thì diện tích của hình tròn đó là bao nhiêu?",
    "re": "Diện tích là 50.24 cm²"
  },
  {
    "con": "Nếu một số được cộng với chính nó, thì kết quả là bao nhiêu?",
    "re": "Kết quả là gấp đôi số đó"
  },
  {
    "con": "Nếu một số nguyên âm được cộng với một số nguyên dương lớn hơn nó, thì kết quả là bao nhiêu?",
    "re": "Kết quả là một số nguyên dương"
  },
  {
    "con": "Nếu một số chia cho chính nó (trừ số 0), thì kết quả là bao nhiêu?",
    "re": "Kết quả là 1"
  },
  {
    "con": "Kết quả phép tính 27% \\times 45,6 + 23% \\times 45,6 bằng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 5 và 7 bằng:",
    "re": "12"
  },
  {
    "con": "Kết quả phép tính 8 \\div 2 \\times 4 bằng:",
    "re": "16"
  },
  {
    "con": "Số lớn nhất trong tập hợp {3, 5, 2, 8, 1} là:",
    "re": "8"
  },
  {
    "con": "Kết quả phép tính 15 - 9 bằng:",
    "re": "6"
  },
  {
    "con": "Kết quả phép tính 6 \\times 7 bằng:",
    "re": "42"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì diện tích của nó bằng:",
    "re": "16 cm²"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 5 cm và chiều rộng 3 cm, thì chu vi của nó bằng:",
    "re": "16 cm"
  },
  {
    "con": "Kết quả phép tính 100 - 25 \\times 2 bằng:",
    "re": "50"
  },
  {
    "con": "Nếu một số nguyên dương chia hết cho 2, thì nó là:",
    "re": "số chẵn"
  },
  {
    "con": "Bạn Hà lấy \\frac{2}{5} số khẩu trang trong hộp của mình tặng cho bạn An thì trong hộp còn lại 12 chiếc khẩu trang. Số khẩu trang trong hộp của bạn Hà lúc đầu là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 20 và một số là 8 thì số còn lại là:",
    "re": "12"
  },
  {
    "con": "Nếu bạn có 3 chiếc bánh và mỗi chiếc bánh có 4 miếng thì tổng số miếng bánh là:",
    "re": "12"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài là 5 cm và chiều rộng là 3 cm thì diện tích của hình chữ nhật là:",
    "re": "15 cm²"
  },
  {
    "con": "Nếu bạn có 10 viên bi và bạn cho đi 4 viên thì số bi còn lại là:",
    "re": "6"
  },
  {
    "con": "Nếu một số được nhân với 7 và kết quả là 42 thì số đó là:",
    "re": "6"
  },
  {
    "con": "Nếu bạn có 15 quả táo và bạn chia đều cho 3 người thì mỗi người sẽ nhận được:",
    "re": "5"
  },
  {
    "con": "Nếu bạn có 8 chiếc kẹo và bạn ăn 2 chiếc thì số kẹo còn lại là:",
    "re": "6"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm thì chu vi của hình vuông là:",
    "re": "16 cm"
  },
  {
    "con": "Nếu bạn có 5 quyển sách và bạn mua thêm 3 quyển nữa thì tổng số sách bạn có là:",
    "re": "8"
  },
  {
    "con": "Bạn Hòa đi học bằng xe đạp với vận tốc v = 12 km/giờ, bạn Hòa đi từ nhà lúc 6 giờ 35 phút sáng và đến trường lúc 7 giờ sáng cùng ngày. Quãng đường từ nhà bạn Hòa đến trường bằng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số nguyên a và b bằng 10, và a = 4, thì b bằng:",
    "re": "6"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài là 5 cm và chiều rộng là 3 cm, thì diện tích của hình chữ nhật đó bằng:",
    "re": "15 cm²"
  },
  {
    "con": "Nếu một số nguyên dương n chia hết cho 2, thì n là số chẵn.",
    "re": "Đúng"
  },
  {
    "con": "Nếu bạn có 3 quả táo và bạn mua thêm 2 quả nữa, thì tổng số quả táo bạn có là:",
    "re": "5 quả"
  },
  {
    "con": "Nếu một tam giác có ba cạnh lần lượt là 3 cm, 4 cm và 5 cm, thì tam giác đó là tam giác vuông.",
    "re": "Đúng"
  },
  {
    "con": "Nếu bạn có 12 viên bi và bạn chia đều cho 4 người, thì mỗi người sẽ nhận được:",
    "re": "3 viên bi"
  },
  {
    "con": "Nếu một số nguyên dương n lớn hơn 1, thì n có ít nhất một ước số khác ngoài 1 và chính nó.",
    "re": "Đúng"
  },
  {
    "con": "Nếu bạn cộng 7 với 5, thì kết quả là:",
    "re": "12"
  },
  {
    "con": "Nếu một hình tròn có bán kính r = 2 cm, thì chu vi của hình tròn đó bằng:",
    "re": "12.56 cm"
  },
  {
    "con": "Một hình hộp chữ nhật có thể tích bằng 336 cm^{3} và diện tích mặt đáy bằng 48 cm^{2}. Chiều cao của hình hộp chữ nhật bằng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương là 10. Nếu một số là 4, thì số còn lại là:",
    "re": "6"
  },
  {
    "con": "Một tam giác có ba cạnh lần lượt là 3 cm, 4 cm và 5 cm. Nếu tam giác này là tam giác vuông, thì diện tích của nó bằng:",
    "re": "6 cm^{2}"
  },
  {
    "con": "Nếu một số nguyên dương chia hết cho 2, thì số đó là:",
    "re": "số chẵn"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai số đầu tiên là 10 và 15, thì số thứ ba là:",
    "re": "5"
  },
  {
    "con": "Nếu một hình tròn có bán kính là 7 cm, thì diện tích của hình tròn đó bằng:",
    "re": "154 cm^{2}"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài là 8 cm và chiều rộng là 3 cm, thì diện tích của hình chữ nhật đó bằng:",
    "re": "24 cm^{2}"
  },
  {
    "con": "Nếu một số nguyên dương lớn hơn 1 và không chia hết cho bất kỳ số nguyên dương nào khác ngoài 1 và chính nó, thì số đó là:",
    "re": "số nguyên tố"
  },
  {
    "con": "Nếu một số được cộng với chính nó, thì kết quả là:",
    "re": "gấp đôi số đó"
  },
  {
    "con": "Tìm 1 số thập phân có 4 đơn vị, 3 phần mười, 5 phần nghìn. Chọn đáp án đúng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cộng 2 số nguyên dương. Chọn kết quả:",
    "re": "Kết quả là một số nguyên dương"
  },
  {
    "con": "Nhân 1 số nguyên với 0. Chọn kết quả:",
    "re": "Kết quả là 0"
  },
  {
    "con": "Chia 1 số nguyên cho chính nó (khác 0). Chọn kết quả:",
    "re": "Kết quả là 1"
  },
  {
    "con": "Tìm tổng của 3 số: 5, 7, 9. Chọn đáp án đúng:",
    "re": "Câu trả lời đúng là 21"
  },
  {
    "con": "Tìm số lớn nhất trong tập hợp: 2, 8, 5, 10. Chọn đáp án đúng:",
    "re": "Câu trả lời đúng là 10"
  },
  {
    "con": "Tìm diện tích của hình chữ nhật có chiều dài 5 và chiều rộng 3. Chọn đáp án đúng:",
    "re": "Câu trả lời đúng là 15"
  },
  {
    "con": "Tìm số trung bình của 4 số: 2, 4, 6, 8. Chọn đáp án đúng:",
    "re": "Câu trả lời đúng là 5"
  },
  {
    "con": "Tìm số đối của -7. Chọn đáp án đúng:",
    "re": "Câu trả lời đúng là 7"
  },
  {
    "con": "Tìm số phần trăm của 20 trong 80. Chọn đáp án đúng:",
    "re": "Câu trả lời đúng là 25%"
  },
  {
    "con": "Số “Ba mươi sáu phẩy năm mươi lăm\" viết là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn hoặc bằng:",
    "re": "0"
  },
  {
    "con": "Một số nguyên chia hết cho 2 thì:",
    "re": "Nó là số chẵn"
  },
  {
    "con": "Tích của hai số âm thì:",
    "re": "Nó là số dương"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau thì:",
    "re": "Nó là tam giác đều"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 0 hoặc 5 thì:",
    "re": "Nó chia hết cho 5"
  },
  {
    "con": "Nếu tổng của hai góc trong một tam giác là 90 độ thì:",
    "re": "Tam giác đó là tam giác vuông"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 3 và dư 0 thì:",
    "re": "Nó chia hết cho 3"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài và chiều rộng bằng nhau thì:",
    "re": "Nó là hình vuông"
  },
  {
    "con": "Nếu một số nguyên dương lớn hơn 1 không có ước số nào ngoài 1 và chính nó thì:",
    "re": "Nó là số nguyên tố"
  },
  {
    "con": "Chữ số 4 trong số thập phân 18,524 thuộc hàng nào ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn 0 ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là số chẵn ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tích của hai số âm luôn là số dương ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì diện tích của nó là chiều rộng nhân với chiều dài ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của ba số bằng 0 thì ít nhất một trong ba số đó phải là số âm ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1 thì kết quả là chính nó ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tam giác có hai cạnh bằng nhau thì đó là tam giác cân ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 0 thì số đó chia hết cho 10 ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được cộng với 1 thì kết quả luôn lớn hơn số ban đầu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hiệu của 35,7 và 2,46 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của 8 và 15 là:",
    "re": "Câu trả lời đúng là 23"
  },
  {
    "con": "Tích của 6 và 7 là:",
    "re": "Câu trả lời đúng là 42"
  },
  {
    "con": "Thương của 56 và 8 là:",
    "re": "Câu trả lời đúng là 7"
  },
  {
    "con": "Số nguyên dương nhỏ nhất là:",
    "re": "Câu trả lời đúng là 1"
  },
  {
    "con": "Số chẵn là số có thể chia hết cho 2, ví dụ như:",
    "re": "Câu trả lời đúng là 4"
  },
  {
    "con": "Diện tích của hình chữ nhật có chiều dài 5 và chiều rộng 3 là:",
    "re": "Câu trả lời đúng là 15"
  },
  {
    "con": "Chu vi của hình vuông có cạnh dài 4 là:",
    "re": "Câu trả lời đúng là 16"
  },
  {
    "con": "Số thập phân 0,75 có thể viết dưới dạng phân số là:",
    "re": "Câu trả lời đúng là 3/4"
  },
  {
    "con": "Tổng các góc trong một tam giác là:",
    "re": "Câu trả lời đúng là 180 độ"
  },
  {
    "con": "Thương của 64,64 và 1,6 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của 7 và 5 là:",
    "re": "12"
  },
  {
    "con": "Hiệu của 15 và 9 là:",
    "re": "6"
  },
  {
    "con": "Tích của 3 và 4 là:",
    "re": "12"
  },
  {
    "con": "Số nguyên dương nhỏ nhất là:",
    "re": "1"
  },
  {
    "con": "Số chẵn tiếp theo của 8 là:",
    "re": "10"
  },
  {
    "con": "Số lẻ tiếp theo của 5 là:",
    "re": "7"
  },
  {
    "con": "Diện tích của hình chữ nhật có chiều dài 5 và chiều rộng 3 là:",
    "re": "15"
  },
  {
    "con": "Chu vi của hình vuông có cạnh 4 là:",
    "re": "16"
  },
  {
    "con": "Số góc trong một tam giác là:",
    "re": "180 độ"
  },
  {
    "con": "1 tấn 25 kg viết dưới dạng số thập phân là :",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn là :",
    "re": "Một số nguyên dương"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì :",
    "re": "Số đó là số chẵn"
  },
  {
    "con": "Nếu một số chia hết cho 3 thì :",
    "re": "Tổng các chữ số của số đó cũng chia hết cho 3"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì :",
    "re": "Diện tích của hình chữ nhật là chiều rộng nhân với chiều dài"
  },
  {
    "con": "Nếu một số nguyên âm được cộng với một số nguyên dương lớn hơn nó thì :",
    "re": "Kết quả là một số nguyên dương"
  },
  {
    "con": "Nếu hai góc trong một tam giác có tổng là 90 độ thì :",
    "re": "Góc còn lại là góc vuông"
  },
  {
    "con": "Nếu một số thập phân có phần thập phân là 0 thì :",
    "re": "Số đó là một số nguyên"
  },
  {
    "con": "Nếu một số được nhân với 0 thì :",
    "re": "Kết quả là 0"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho chính nó thì :",
    "re": "Kết quả là 1"
  },
  {
    "con": "Số tiếp theo của dãy số: 5,13; 5,12; 5,11; 5,10;...... là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 3 và 7 là:",
    "re": "10"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 4 và chiều rộng 5, thì diện tích của nó là:",
    "re": "20"
  },
  {
    "con": "Nếu số 12 chia cho 4, thì thương là:",
    "re": "3"
  },
  {
    "con": "Nếu một góc vuông có độ lớn 90 độ, thì tổng của hai góc còn lại trong tam giác là:",
    "re": "90 độ"
  },
  {
    "con": "Nếu số 15 trừ đi 9, thì kết quả là:",
    "re": "6"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3, thì chu vi của nó là:",
    "re": "18.84 (khoảng 18.84, sử dụng π ≈ 3.14)"
  },
  {
    "con": "Nếu số 8 nhân với 7, thì tích là:",
    "re": "56"
  },
  {
    "con": "Nếu một số nguyên dương chia cho 1, thì kết quả là:",
    "re": "Số nguyên đó"
  },
  {
    "con": "Nếu một hình tam giác có ba cạnh lần lượt là 3, 4 và 5, thì nó là:",
    "re": "Hình tam giác vuông"
  },
  {
    "con": "Số thập phân gồm 15 đơn vị, 4 phần mười, 6 phần nghìn được viết là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn cả hai số đó:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2, thì số đó là số chẵn:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng, thì diện tích của nó là chiều rộng nhân với chiều dài:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai số đầu là 10 và 15, thì số thứ ba là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0, thì kết quả là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau, thì đó là tam giác đều:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số có chữ số hàng đơn vị là 5, thì số đó là số lẻ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính r, thì chu vi của nó được tính bằng công thức 2πr:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho chính nó, thì kết quả là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hỗn số 8 \\frac{25}{10} bằng số thập phân nào trong các số sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn 0",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là số chẵn",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu hai góc trong một tam giác có tổng là 90 độ thì tam giác đó là tam giác vuông",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì kết quả là 0",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài và chiều rộng bằng nhau thì hình đó là hình vuông",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu tổng của ba số là 0 thì ít nhất một trong ba số đó phải là số âm",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho chính nó thì kết quả luôn là 1",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số là bội số của 3 thì tổng các chữ số của số đó cũng là bội số của 3",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính gấp đôi bán kính của một hình tròn khác thì diện tích của hình tròn đó gấp bốn lần diện tích của hình tròn kia",
    "re": "Kết quả đúng"
  },
  {
    "con": "Số lớn nhất trong các số 5,798; 5,897; 5,978; 5,879 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của 7 và 5 là:",
    "re": "12"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì diện tích của nó là:",
    "re": "16 cm²"
  },
  {
    "con": "Nếu 3 x 4 = 12, thì 4 x 3 cũng bằng:",
    "re": "12"
  },
  {
    "con": "Nếu một số chia cho 2 và dư 0, thì số đó là:",
    "re": "số chẵn"
  },
  {
    "con": "Nếu 10 - 3 = 7, thì 10 - 4 cũng sẽ cho kết quả:",
    "re": "6"
  },
  {
    "con": "Nếu 5 + 5 = 10, thì 5 + 6 sẽ bằng:",
    "re": "11"
  },
  {
    "con": "Nếu 15 chia cho 3 bằng 5, thì 15 chia cho 5 sẽ bằng:",
    "re": "3"
  },
  {
    "con": "Nếu 2 x 6 = 12, thì 6 x 2 cũng sẽ cho kết quả:",
    "re": "12"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3 cm, thì chu vi của nó là:",
    "re": "18.84 cm (khoảng)"
  },
  {
    "con": "6tấn 15kg = ...............kg",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn 0",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là số chẵn",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số chia hết cho 3 thì tổng các chữ số của số đó cũng chia hết cho 3",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu hai góc trong một tam giác cộng lại bằng 90 độ thì góc còn lại là góc vuông",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì diện tích của nó là chiều rộng nhân với chiều dài",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì kết quả là 0",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 1 thì kết quả là chính số đó",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 0 hoặc 5 thì số đó chia hết cho 5",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính r thì chu vi của nó là 2πr",
    "re": "Kết quả đúng"
  },
  {
    "con": "25m^{2} 7dm^{2} = ...........m^{2}. Số thích hợp viết vào chỗ chấm là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương a và b là n. Nếu a = 3 và b = 5, thì n =:",
    "re": "8"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài là 10cm và chiều rộng là 5cm, thì diện tích của hình chữ nhật là:",
    "re": "50cm^{2}"
  },
  {
    "con": "Nếu 1/2 + 1/4 = x, thì x =:",
    "re": "3/4"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 2 và dư 1, thì số đó là:",
    "re": "số lẻ"
  },
  {
    "con": "Nếu 3x + 5 = 20, thì giá trị của x là:",
    "re": "5"
  },
  {
    "con": "Nếu một tam giác có ba cạnh lần lượt là 3cm, 4cm và 5cm, thì đó là tam giác:",
    "re": "vuông"
  },
  {
    "con": "Nếu 15% của 200 là x, thì x =:",
    "re": "30"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu tổng của ba số liên tiếp là 30, thì số giữa là:",
    "re": "10"
  },
  {
    "con": "Phép nhân nhẩm 34,245 \\times 100 có kết quả là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 7 và 5 là:",
    "re": "12"
  },
  {
    "con": "Phép chia 20 cho 4 có kết quả là:",
    "re": "5"
  },
  {
    "con": "Số 9 là số lẻ:",
    "re": "Đúng"
  },
  {
    "con": "Diện tích hình chữ nhật có chiều dài 5 cm và chiều rộng 3 cm là:",
    "re": "15 cm²"
  },
  {
    "con": "Số 15 là số nguyên tố:",
    "re": "Sai"
  },
  {
    "con": "Phép cộng 8 và 12 có kết quả là:",
    "re": "20"
  },
  {
    "con": "Số 0 là số chẵn:",
    "re": "Đúng"
  },
  {
    "con": "Chu vi hình vuông có cạnh 4 cm là:",
    "re": "16 cm"
  },
  {
    "con": "Phép nhân 6 \\times 7 có kết quả là:",
    "re": "42"
  },
  {
    "con": "Tìm số tự nhiên x, biết: 86,76 < x < 87,43",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tính tổng của hai số nguyên dương a và b",
    "re": "Kết quả là một số nguyên dương"
  },
  {
    "con": "Chia một số nguyên n cho 2",
    "re": "Kết quả sẽ là số nguyên nếu n là số chẵn"
  },
  {
    "con": "Tìm số nguyên x, biết: x^2 = 25",
    "re": "x có thể là 5 hoặc -5"
  },
  {
    "con": "Tính diện tích hình chữ nhật với chiều dài a và chiều rộng b",
    "re": "Kết quả là a nhân b"
  },
  {
    "con": "Tìm số thập phân x, biết: 0 < x < 1",
    "re": "x là một số thực dương nhỏ hơn 1"
  },
  {
    "con": "Tính trung bình cộng của n số a1, a2, ..., an",
    "re": "Kết quả là (a1 + a2 + ... + an) / n"
  },
  {
    "con": "Tìm số nguyên dương x, biết: x > 0 và x < 10",
    "re": "x là một số nguyên từ 1 đến 9"
  },
  {
    "con": "Tính chu vi hình tròn với bán kính r",
    "re": "Kết quả là 2πr"
  },
  {
    "con": "Tìm số nguyên x, biết: x + 3 = 10",
    "re": "x = 7"
  },
  {
    "con": "\\frac{1}{4} ha là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương là:",
    "re": "Một số nguyên dương"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì:",
    "re": "Số đó là số chẵn"
  },
  {
    "con": "Nếu một số chia hết cho 3 và 5 thì:",
    "re": "Số đó chia hết cho 15"
  },
  {
    "con": "Nếu hai góc trong một tam giác có tổng là 90 độ thì:",
    "re": "Góc còn lại là góc vuông"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì:",
    "re": "Diện tích hình chữ nhật là chiều rộng nhân với chiều dài"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì:",
    "re": "Kết quả là 0"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 1 thì:",
    "re": "Kết quả là chính số đó"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 0 hoặc 5 thì:",
    "re": "Số đó chia hết cho 5"
  },
  {
    "con": "Nếu tổng của ba số là 180 độ thì:",
    "re": "Ba số đó có thể là các góc của một tam giác"
  },
  {
    "con": "20% của 520 là:",
    "re": "104"
  },
  {
    "con": "Tổng của 7 và 5 là:",
    "re": "12"
  },
  {
    "con": "Số nguyên tố nhỏ nhất là:",
    "re": "2"
  },
  {
    "con": "Diện tích hình chữ nhật có chiều dài 5 và chiều rộng 3 là:",
    "re": "15"
  },
  {
    "con": "Công thức tính chu vi hình tròn là:",
    "re": "2πr"
  },
  {
    "con": "Số đối của -8 là:",
    "re": "8"
  },
  {
    "con": "Tích của 6 và 4 là:",
    "re": "24"
  },
  {
    "con": "Phân số 1/2 là:",
    "re": "0.5"
  },
  {
    "con": "Số lớn nhất trong dãy số 3, 7, 2, 9 là:",
    "re": "9"
  },
  {
    "con": "Công thức tính trung bình cộng của 4, 8, 6 là:",
    "re": "6"
  },
  {
    "con": "Mẹ mua 15 quyển vở hết 45000 đồng. Hỏi mua 20 quyển vở như thế hết ... đồng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 8 và 5 là ...",
    "re": "13"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 10 cm và chiều rộng 5 cm, thì diện tích của hình chữ nhật đó là ...",
    "re": "50 cm²"
  },
  {
    "con": "Nếu một số chia cho 3 dư 1, thì số đó có thể viết dưới dạng ...",
    "re": "3k + 1 với k là số nguyên"
  },
  {
    "con": "Nếu tổng của ba số 4, 6 và 10 là ...",
    "re": "20"
  },
  {
    "con": "Nếu 12 chia cho 4 thì kết quả là ...",
    "re": "3"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 6 cm, thì chu vi của hình vuông đó là ...",
    "re": "24 cm"
  },
  {
    "con": "Nếu 5 nhân với 7 thì kết quả là ...",
    "re": "35"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 2 và dư 0, thì số đó là ...",
    "re": "số chẵn"
  },
  {
    "con": "Nếu 100 trừ đi 45 thì kết quả là ...",
    "re": "55"
  },
  {
    "con": "Hỗn số 5 \\frac{1}{5} chuyển thành số thập phân là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn là:",
    "re": "Một số nguyên dương"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì:",
    "re": "Số đó là số chẵn"
  },
  {
    "con": "Nếu một số chia hết cho 3 thì:",
    "re": "Tổng các chữ số của số đó cũng chia hết cho 3"
  },
  {
    "con": "Diện tích hình chữ nhật được tính bằng:",
    "re": "Chiều dài nhân với chiều rộng"
  },
  {
    "con": "Nếu hai góc trong một tam giác có tổng là 90 độ thì:",
    "re": "Góc còn lại là góc vuông"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì:",
    "re": "Kết quả là 0"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 1 thì:",
    "re": "Kết quả là chính số đó"
  },
  {
    "con": "Nếu một hình tròn có bán kính r thì:",
    "re": "Diện tích của nó là \\pi r^2"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 5 thì:",
    "re": "Số đó chia hết cho 5"
  },
  {
    "con": "Giá trị của chữ số 5 trong số 63,539 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 7 và 8 là:",
    "re": "15"
  },
  {
    "con": "Số 12 là số chẵn:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi chia 20 cho 4, thương là:",
    "re": "5"
  },
  {
    "con": "Số 9 là số nguyên tố:",
    "re": "Câu trả lời sai"
  },
  {
    "con": "Diện tích hình chữ nhật có chiều dài 5 và chiều rộng 3 là:",
    "re": "15"
  },
  {
    "con": "Khi cộng 10 với 15, kết quả là:",
    "re": "25"
  },
  {
    "con": "Số 0 là số tự nhiên:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi trừ 5 khỏi 10, kết quả là:",
    "re": "5"
  },
  {
    "con": "Hình vuông có 4 cạnh bằng nhau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Số lớn nhất trong các số: 9,85; 9,58; 98,5; 8,95 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 7 và 5 là:",
    "re": "12"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì diện tích của nó là:",
    "re": "16 cm²"
  },
  {
    "con": "Nếu một số chia cho 2 có dư 0, thì số đó là:",
    "re": "Số chẵn"
  },
  {
    "con": "Nếu 3 x 4 = 12, thì 4 x 3 cũng bằng:",
    "re": "12"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 5 cm và chiều rộng 3 cm, thì chu vi của nó là:",
    "re": "16 cm"
  },
  {
    "con": "Nếu 10% của 200 là:",
    "re": "20"
  },
  {
    "con": "Nếu một số nguyên dương lớn hơn 1, thì số đó có ít nhất:",
    "re": "2 ước số"
  },
  {
    "con": "Nếu 15 chia cho 3, thì thương là:",
    "re": "5"
  },
  {
    "con": "Nếu một góc vuông có độ lớn là 90 độ, thì tổng của hai góc phụ của nó là:",
    "re": "90 độ"
  },
  {
    "con": "Phân số B. \\frac{45}{100} viết dưới dạng số thập phân là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương a và b là:",
    "re": "Một số nguyên dương"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau thì:",
    "re": "Đó là tam giác đều"
  },
  {
    "con": "Nếu số nguyên n chia hết cho 2 thì:",
    "re": "n là số chẵn"
  },
  {
    "con": "Nếu một số thập phân có phần thập phân là 0.5 thì:",
    "re": "Số đó là số lẻ"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài l và chiều rộng w thì:",
    "re": "Diện tích của nó là l x w"
  },
  {
    "con": "Nếu một số nguyên dương n có 2 ước số thì:",
    "re": "n là số nguyên tố"
  },
  {
    "con": "Nếu tổng của hai góc trong một tam giác là 90 độ thì:",
    "re": "Tam giác đó là tam giác vuông"
  },
  {
    "con": "Nếu một số thập phân có phần nguyên là 0 thì:",
    "re": "Số đó là số âm hoặc số 0"
  },
  {
    "con": "Nếu một số được nhân với 1 thì:",
    "re": "Kết quả là chính số đó"
  },
  {
    "con": "Giá trị của biểu thức: 8,98 + 1,02 \\times 12 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương là một số nguyên dương",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì nó là số chẵn",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số không chia hết cho 2 thì nó là số lẻ",
    "re": "Kết quả đúng"
  },
  {
    "con": "Giá trị của biểu thức: 5 \\times (3 + 2) là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của ba số là 0 thì ít nhất một trong ba số đó phải là số âm",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài và chiều rộng bằng nhau thì nó là hình vuông",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 1 thì giá trị của nó không thay đổi",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được cộng với 0 thì giá trị của nó không thay đổi",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho chính nó thì kết quả là 1",
    "re": "Kết quả đúng"
  },
  {
    "con": "Trong hộp có 30 viên bi, trong đó có 15 viên bi xanh. Tỉ số phần trăm của số bi xanh và số bi trong hộp là bao nhiêu ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 20 và một số là 12, thì số còn lại là bao nhiêu ?",
    "re": "Số còn lại là 8"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 10 cm và chiều rộng 5 cm, thì diện tích của hình chữ nhật là bao nhiêu ?",
    "re": "Diện tích là 50 cm²"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là bao nhiêu ?",
    "re": "Kết quả là 0"
  },
  {
    "con": "Nếu một hình tròn có bán kính 7 cm, thì chu vi của hình tròn là bao nhiêu ?",
    "re": "Chu vi là khoảng 43.96 cm"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1, thì kết quả là bao nhiêu ?",
    "re": "Kết quả là chính số đó"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai số là 10 và 15, thì số còn lại là bao nhiêu ?",
    "re": "Số còn lại là 5"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì diện tích của hình vuông là bao nhiêu ?",
    "re": "Diện tích là 16 cm²"
  },
  {
    "con": "Nếu một số được cộng với 0, thì kết quả là bao nhiêu ?",
    "re": "Kết quả là chính số đó"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho chính nó, thì kết quả là bao nhiêu ?",
    "re": "Kết quả là 1"
  },
  {
    "con": "Số thập phân gồm: Bảy đơn vị; sáu phần mười; hai phần nghìn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương.",
    "re": "Kết quả là một số nguyên dương"
  },
  {
    "con": "Một hình chữ nhật có chiều dài gấp đôi chiều rộng.",
    "re": "Diện tích của hình chữ nhật là chiều rộng nhân với chiều dài"
  },
  {
    "con": "Số chia không bằng 0.",
    "re": "Phép chia sẽ cho kết quả hợp lệ"
  },
  {
    "con": "Một số nguyên chia hết cho 2.",
    "re": "Số đó là số chẵn"
  },
  {
    "con": "Một số nguyên chia hết cho 3.",
    "re": "Tổng các chữ số của số đó cũng chia hết cho 3"
  },
  {
    "con": "Một tam giác có ba cạnh có độ dài khác nhau.",
    "re": "Tam giác đó là tam giác nhọn"
  },
  {
    "con": "Một số thập phân có phần nguyên và phần thập phân.",
    "re": "Số đó có thể được biểu diễn dưới dạng phân số"
  },
  {
    "con": "Một hình vuông có tất cả các cạnh bằng nhau.",
    "re": "Diện tích của hình vuông là cạnh nhân với cạnh"
  },
  {
    "con": "Một số nguyên dương lớn hơn 1.",
    "re": "Số đó có thể là số nguyên tố hoặc hợp số"
  },
  {
    "con": "Số gồm: Ba mươi hai đơn vị, 5 phần trăm của mét viết là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn hoặc bằng:",
    "re": "0"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là:",
    "re": "số chẵn"
  },
  {
    "con": "Nếu một số chia hết cho 3 thì tổng các chữ số của số đó cũng chia hết cho:",
    "re": "3"
  },
  {
    "con": "Diện tích hình chữ nhật được tính bằng:",
    "re": "chiều dài nhân với chiều rộng"
  },
  {
    "con": "Nếu một tam giác có hai cạnh bằng nhau thì đó là:",
    "re": "tam giác cân"
  },
  {
    "con": "Nếu số đo góc trong một tam giác là 90 độ thì tam giác đó là:",
    "re": "tam giác vuông"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 1 thì kết quả là:",
    "re": "số đó"
  },
  {
    "con": "Nếu hai số có cùng một chữ số cuối thì chúng có thể chia hết cho:",
    "re": "2"
  },
  {
    "con": "Đo chiều dài một sợi dây được 25dm và 52mm. Hãy viết số đo độ dài của sợi dây dưới dạng số đo có đơn vị là xăng ti mét?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tính tổng của hai số nguyên dương 7 và 5.",
    "re": "Kết quả là 12"
  },
  {
    "con": "Chia 24 cho 6.",
    "re": "Kết quả là 4"
  },
  {
    "con": "Tính diện tích của hình chữ nhật có chiều dài 8cm và chiều rộng 5cm.",
    "re": "Diện tích là 40cm²"
  },
  {
    "con": "Tìm số lớn nhất trong tập hợp số {3, 7, 2, 9, 5}.",
    "re": "Số lớn nhất là 9"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3cm, hãy tính chu vi của nó.",
    "re": "Chu vi là 18.84cm"
  },
  {
    "con": "Tính trung bình cộng của các số 4, 8, 6 và 10.",
    "re": "Trung bình cộng là 7"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 2 và dư 1, thì số đó là số lẻ.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Tính 15% của 200.",
    "re": "Kết quả là 30"
  },
  {
    "con": "Nếu một tam giác có ba cạnh lần lượt là 3cm, 4cm và 5cm, thì đó là tam giác vuông.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Số đo 2 \\frac{3}{4} kg viết dưới dạng số thập phân là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương a và b là:",
    "re": "Câu trả lời đúng là a + b"
  },
  {
    "con": "Số 0 là số chẵn:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tích của hai số âm là:",
    "re": "Câu trả lời đúng là một số dương"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau thì:",
    "re": "Câu trả lời đúng là tam giác đều"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì:",
    "re": "Câu trả lời đúng là số đó là số chẵn"
  },
  {
    "con": "Diện tích hình chữ nhật được tính bằng:",
    "re": "Câu trả lời đúng là chiều dài nhân chiều rộng"
  },
  {
    "con": "Nếu tổng của hai góc trong một tam giác là 90 độ thì:",
    "re": "Câu trả lời đúng là tam giác vuông"
  },
  {
    "con": "Nếu một số nguyên dương n có 2 ước số là 1 và chính nó thì:",
    "re": "Câu trả lời đúng là n là số nguyên tố"
  },
  {
    "con": "Nếu một số thập phân có phần thập phân là 0.5 thì:",
    "re": "Câu trả lời đúng là số đó là số lẻ"
  },
  {
    "con": "Phân số có cùng giá trị với 0,02 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn là:",
    "re": "Một số nguyên dương"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì:",
    "re": "Số đó là số chẵn"
  },
  {
    "con": "Nếu một số chia hết cho 3 thì:",
    "re": "Tổng các chữ số của số đó cũng chia hết cho 3"
  },
  {
    "con": "Nếu hai góc trong một tam giác có tổng là 90 độ thì:",
    "re": "Góc còn lại là góc vuông"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì:",
    "re": "Diện tích của hình chữ nhật là chiều rộng nhân với chiều dài"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 1 thì:",
    "re": "Kết quả vẫn là số nguyên dương đó"
  },
  {
    "con": "Nếu một số có chữ số cuối là 0 hoặc 5 thì:",
    "re": "Số đó chia hết cho 5"
  },
  {
    "con": "Nếu một hình tròn có bán kính gấp đôi bán kính của hình tròn khác thì:",
    "re": "Diện tích của hình tròn lớn gấp 4 lần diện tích của hình tròn nhỏ"
  },
  {
    "con": "Nếu một số nguyên âm được cộng với một số nguyên dương lớn hơn nó thì:",
    "re": "Kết quả là một số nguyên dương"
  },
  {
    "con": "Số thích hợp để viết vào chỗ chấm của 30dm25cm2 = .........m2 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 10 và một số là 4, thì số còn lại là:",
    "re": "6"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 5cm và chiều rộng 3cm, thì diện tích của nó là:",
    "re": "15cm2"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu một số nguyên dương chia cho 1, thì kết quả là:",
    "re": "Số nguyên dương đó"
  },
  {
    "con": "Nếu tổng của ba số là 21 và hai số là 7 và 8, thì số còn lại là:",
    "re": "6"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4cm, thì chu vi của nó là:",
    "re": "16cm"
  },
  {
    "con": "Nếu một số được cộng với chính nó, thì kết quả là:",
    "re": "Gấp đôi số đó"
  },
  {
    "con": "Nếu một số chia cho 2 và kết quả là 5, thì số đó là:",
    "re": "10"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3cm, thì diện tích của nó là:",
    "re": "28.26cm2 (làm tròn)"
  },
  {
    "con": "Số dư của phép chia 23,5 \\div 9 (chỉ lấy hai chữ số phần TP của thương) là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương a và b là:",
    "re": "Một số nguyên dương"
  },
  {
    "con": "Nếu a là số chẵn, thì a \\div 2 là:",
    "re": "Một số nguyên"
  },
  {
    "con": "Nếu b là số lẻ, thì b + 1 là:",
    "re": "Một số chẵn"
  },
  {
    "con": "Nếu diện tích hình chữ nhật có chiều dài l và chiều rộng w, thì diện tích là:",
    "re": "l \\times w"
  },
  {
    "con": "Nếu số thập phân x có phần nguyên là n và phần thập phân là d, thì x có thể viết là:",
    "re": "n + d"
  },
  {
    "con": "Nếu tổng của ba số a, b, c là 0, thì ít nhất một trong ba số đó là:",
    "re": "Số âm"
  },
  {
    "con": "Nếu a \\times b = 0, thì ít nhất một trong hai số a hoặc b là:",
    "re": "0"
  },
  {
    "con": "Nếu một tam giác có ba cạnh a, b, c, thì tổng độ dài hai cạnh bất kỳ phải lớn hơn:",
    "re": "Độ dài cạnh còn lại"
  },
  {
    "con": "Nếu một số nguyên dương n có 2 ước số, thì n là:",
    "re": "Số nguyên tố"
  },
  {
    "con": "Số chia x trong phép chia có dư: 1,05 \\div x = 0,02 (dư 0,01) là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương a và b là:",
    "re": "Số nguyên dương"
  },
  {
    "con": "Nếu a là số nguyên dương và b là số nguyên âm, thì a + b:",
    "re": "Có thể là số nguyên dương, số nguyên âm hoặc số 0"
  },
  {
    "con": "Nếu một số nguyên dương chia hết cho 2, thì:",
    "re": "Số đó là số chẵn"
  },
  {
    "con": "Nếu một số nguyên dương chia hết cho 3, thì:",
    "re": "Tổng các chữ số của số đó cũng chia hết cho 3"
  },
  {
    "con": "Nếu a và b là hai số nguyên dương, thì a x b:",
    "re": "Là số nguyên dương"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài l và chiều rộng w, thì diện tích của hình chữ nhật là:",
    "re": "l x w"
  },
  {
    "con": "Nếu một góc trong tam giác có giá trị lớn hơn 90 độ, thì:",
    "re": "Tam giác đó là tam giác tù"
  },
  {
    "con": "Nếu một số thập phân có phần thập phân là 0, thì:",
    "re": "Số đó là số nguyên"
  },
  {
    "con": "Nếu tổng của ba số a, b, c là 0, thì:",
    "re": "Ít nhất một trong ba số đó phải là số âm"
  },
  {
    "con": "Tỉ số phần trăm của 5 và 15 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn hoặc bằng:",
    "re": "0"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì:",
    "re": "Số đó là số chẵn"
  },
  {
    "con": "Nếu một số chia hết cho 3 thì:",
    "re": "Tổng các chữ số của số đó cũng chia hết cho 3"
  },
  {
    "con": "Diện tích hình chữ nhật được tính bằng:",
    "re": "Chiều dài nhân với chiều rộng"
  },
  {
    "con": "Nếu một tam giác có hai cạnh bằng nhau thì:",
    "re": "Tam giác đó là tam giác cân"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì:",
    "re": "Kết quả là 0"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 1 thì:",
    "re": "Kết quả là chính số đó"
  },
  {
    "con": "Nếu một số có chữ số cuối là 0 hoặc 5 thì:",
    "re": "Số đó chia hết cho 5"
  },
  {
    "con": "Nếu hai góc trong một tam giác có tổng là 90 độ thì:",
    "re": "Góc còn lại là góc vuông"
  },
  {
    "con": "Tổng của 2 số bằng 0,25. Thương của số bé và số lớn cũng bằng 0,25. Số lớn là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương chia hết cho 2, thì số đó là số chẵn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của 3 số bằng 30 và 2 số đầu tiên bằng 20, thì số thứ ba là:",
    "re": "10"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì diện tích của hình vuông đó là:",
    "re": "16 cm²"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 5 cm và chiều rộng 3 cm, thì chu vi của hình chữ nhật đó là:",
    "re": "16 cm"
  },
  {
    "con": "Nếu một số nguyên dương lớn hơn 1, thì số đó có ít nhất 2 ước số.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số thập phân có phần thập phân là 0,5, thì số đó có thể được viết dưới dạng phân số là:",
    "re": "1/2"
  },
  {
    "con": "Nếu một tam giác có 3 cạnh bằng nhau, thì tam giác đó là tam giác đều.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên âm cộng với một số nguyên dương có giá trị tuyệt đối lớn hơn số nguyên dương, thì tổng của chúng là:",
    "re": "Một số nguyên âm"
  },
  {
    "con": "Số bé nhất trong các số: 3,055; 3,050; 3,005; 3,505 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 7 và 5 là:",
    "re": "12"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì diện tích của nó là:",
    "re": "16 cm²"
  },
  {
    "con": "Nếu một số chia hết cho 2, thì nó là:",
    "re": "Số chẵn"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 6 cm và chiều rộng 3 cm, thì chu vi của nó là:",
    "re": "18 cm"
  },
  {
    "con": "Nếu 10 trừ đi 4 thì kết quả là:",
    "re": "6"
  },
  {
    "con": "Nếu một số là 15 và nó được nhân với 2, thì kết quả là:",
    "re": "30"
  },
  {
    "con": "Nếu một hình tròn có bán kính 5 cm, thì chu vi của nó là:",
    "re": "31.4 cm (xấp xỉ)"
  },
  {
    "con": "Nếu 3 nhân với 4 thì kết quả là:",
    "re": "12"
  },
  {
    "con": "Nếu một số là 25 và nó được chia cho 5, thì kết quả là:",
    "re": "5"
  },
  {
    "con": "Trung bình một người thợ làm một sản phẩm hết 1giờ 30 phút. Người đó làm 5 sản phẩm mất bao lâu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn cả hai số đó.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng, thì tỷ lệ giữa chiều dài và chiều rộng là 2:1.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 2 và dư 0, thì số đó là số chẵn.",
    "re": "Đúng"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai trong số đó là 10 và 15, thì số còn lại là 5.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3 cm, thì diện tích của nó là khoảng 28.26 cm².",
    "re": "Đúng"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả luôn là 0.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau, thì đó là tam giác đều.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho chính nó, thì kết quả luôn là 1.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một số thập phân có phần thập phân là 0.5, thì nó có thể được viết dưới dạng phân số là 1/2.",
    "re": "Đúng"
  },
  {
    "con": "Có bao nhiêu số thập phân ở giữa 0,5 và 0,6:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn 0:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì nó là số chẵn:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số chia hết cho 3 thì tổng các chữ số của nó cũng chia hết cho 3:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu hai góc trong một tam giác có tổng là 90 độ thì góc còn lại là góc vuông:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì diện tích của nó là chiều rộng nhân với chiều dài:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì kết quả là 0:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được cộng với 1 thì kết quả luôn lớn hơn số đó:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số là số nguyên tố thì nó chỉ có hai ước số là 1 và chính nó:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính r thì chu vi của nó là 2πr:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Hỗn số 3 \\frac{9}{100} viết thành số thập phân là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn là:",
    "re": "Một số nguyên dương"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì:",
    "re": "Số đó là số chẵn"
  },
  {
    "con": "Nếu một số chia hết cho 3 thì:",
    "re": "Tổng các chữ số của số đó cũng chia hết cho 3"
  },
  {
    "con": "Diện tích hình chữ nhật được tính bằng:",
    "re": "Chiều dài nhân với chiều rộng"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau thì:",
    "re": "Tam giác đó là tam giác đều"
  },
  {
    "con": "Nếu một số nguyên dương có chữ số tận cùng là 0 thì:",
    "re": "Số đó chia hết cho 10"
  },
  {
    "con": "Nếu hai góc trong một tam giác có tổng là 90 độ thì:",
    "re": "Góc còn lại là góc vuông"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 1 thì:",
    "re": "Kết quả vẫn là số nguyên dương đó"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 5 hoặc 0 thì:",
    "re": "Số đó chia hết cho 5"
  },
  {
    "con": "Tìm một số biết 20% của nó là 16. Số đó là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 30 và một số là 12, thì số còn lại là:",
    "re": "18"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài là 5 cm và chiều rộng là 3 cm, thì diện tích của nó là:",
    "re": "15 cm²"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu một số nguyên dương chia hết cho 2, thì số đó là:",
    "re": "số chẵn"
  },
  {
    "con": "Nếu tổng của ba số là 45 và hai số là 15 và 20, thì số còn lại là:",
    "re": "10"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì chu vi của nó là:",
    "re": "16 cm"
  },
  {
    "con": "Nếu một số được cộng với chính nó, thì kết quả là:",
    "re": "gấp đôi số đó"
  },
  {
    "con": "Nếu một số có 3 chữ số và chữ số hàng trăm là 5, thì số đó có thể là:",
    "re": "500 đến 599"
  },
  {
    "con": "Nếu một hình tròn có bán kính là 7 cm, thì diện tích của nó là:",
    "re": "154 cm² (xấp xỉ)"
  },
  {
    "con": "234,024 đọc là:",
    "re": "Hai trăm ba mươi bốn nghìn không trăm hai mươi bốn"
  },
  {
    "con": "Tổng của hai số nguyên dương là:",
    "re": "Một số nguyên dương"
  },
  {
    "con": "Số chia phải lớn hơn số chia hết:",
    "re": "Không có số nguyên nào"
  },
  {
    "con": "Một tam giác có ba cạnh và tổng ba góc bằng:",
    "re": "180 độ"
  },
  {
    "con": "Khi nhân một số với 0:",
    "re": "Kết quả là 0"
  },
  {
    "con": "Số nguyên tố là số tự nhiên lớn hơn 1:",
    "re": "Chỉ có hai ước số là 1 và chính nó"
  },
  {
    "con": "Phép cộng là phép toán giao hoán:",
    "re": "a + b = b + a"
  },
  {
    "con": "Diện tích hình chữ nhật được tính bằng:",
    "re": "Chiều dài nhân chiều rộng"
  },
  {
    "con": "Khi chia một số cho 1:",
    "re": "Kết quả là chính số đó"
  },
  {
    "con": "Một số chẵn là số có thể chia hết cho:",
    "re": "2"
  },
  {
    "con": "Viết dưới dạng số thập phân: 52 đơn vị và 4 phần trăm:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cộng hai số nguyên dương:",
    "re": "Kết quả là một số nguyên dương"
  },
  {
    "con": "Nhân một số nguyên với 0:",
    "re": "Kết quả là 0"
  },
  {
    "con": "Chia một số nguyên cho chính nó (không phải 0):",
    "re": "Kết quả là 1"
  },
  {
    "con": "Tính diện tích hình chữ nhật với chiều dài 5 và chiều rộng 3:",
    "re": "Kết quả là 15"
  },
  {
    "con": "Tính chu vi hình vuông với cạnh dài 4:",
    "re": "Kết quả là 16"
  },
  {
    "con": "Tính tổng các số chẵn từ 1 đến 10:",
    "re": "Kết quả là 30"
  },
  {
    "con": "Tìm số lớn nhất trong tập hợp {3, 7, 2, 9, 5}:",
    "re": "Kết quả là 9"
  },
  {
    "con": "Giải phương trình 2x + 3 = 7:",
    "re": "Kết quả x = 2"
  },
  {
    "con": "Tính trung bình cộng của các số {4, 8, 6, 10}:",
    "re": "Kết quả là 7"
  },
  {
    "con": "Viết số thập phân thích hợp vào chỗ chấm: 24,01< … < 24,12",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn 0",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là số chẵn",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số chia hết cho 3 thì tổng các chữ số của số đó cũng chia hết cho 3",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu hai góc trong một tam giác có tổng là 90 độ thì góc còn lại là góc vuông",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì diện tích của nó là chiều rộng nhân với chiều dài",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì kết quả là 0",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho chính nó thì kết quả là 1",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính r thì chu vi của nó là 2πr",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 0 hoặc 5 thì số đó chia hết cho 5",
    "re": "Kết quả đúng"
  },
  {
    "con": "25m^{3} 5dm^{3} = … m^{3}",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "2 + 3 = …",
    "re": "Kết quả là 5"
  },
  {
    "con": "4 x 6 = …",
    "re": "Kết quả là 24"
  },
  {
    "con": "10 - 7 = …",
    "re": "Kết quả là 3"
  },
  {
    "con": "15 ÷ 3 = …",
    "re": "Kết quả là 5"
  },
  {
    "con": "Số nguyên dương lớn hơn 0 thì là số tự nhiên",
    "re": "Kết quả đúng"
  },
  {
    "con": "Tổng của hai số chẵn luôn là số chẵn",
    "re": "Kết quả đúng"
  },
  {
    "con": "Tổng của hai số lẻ luôn là số chẵn",
    "re": "Kết quả đúng"
  },
  {
    "con": "Diện tích hình chữ nhật = chiều dài x chiều rộng",
    "re": "Công thức đúng"
  },
  {
    "con": "Chu vi hình vuông = 4 x cạnh",
    "re": "Công thức đúng"
  },
  {
    "con": "1,2 giờ = … giờ … phút",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn 0",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là số chẵn",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tích của hai số âm là một số dương",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình tam giác có ba cạnh bằng nhau thì đó là hình tam giác đều",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai góc trong một tam giác là 90 độ thì góc còn lại là 90 độ",
    "re": "Câu trả lời sai"
  },
  {
    "con": "Nếu một số nguyên chia cho 1 thì kết quả là chính nó",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 0 hoặc 5 thì số đó chia hết cho 5",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài và chiều rộng bằng nhau thì đó là hình vuông",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho chính nó thì kết quả luôn là 1",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một khu đất hình thang có đáy lớn là 180 m, đáy bé bằng đáy lớn, chiều cao bằng đáy bé.Hỏi diện tích khu đất đó là bao nhiêu héc-ta?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương là 10, và một trong số đó là 4. Hỏi số còn lại là bao nhiêu?",
    "re": "Số còn lại là 6"
  },
  {
    "con": "Một hình chữ nhật có chiều dài là 5 cm và chiều rộng là 3 cm. Hỏi diện tích của hình chữ nhật đó là bao nhiêu cm²?",
    "re": "Diện tích là 15 cm²"
  },
  {
    "con": "Một số nguyên dương chia hết cho 2 thì nó là số chẵn.",
    "re": "Kết luận đúng"
  },
  {
    "con": "Nếu một tam giác có ba cạnh đều bằng nhau thì đó là tam giác đều.",
    "re": "Kết luận đúng"
  },
  {
    "con": "Tổng của ba số 2, 3 và 5 là 10. Hỏi tổng của ba số này có đúng không?",
    "re": "Kết luận sai"
  },
  {
    "con": "Nếu một số được nhân với 0 thì kết quả là 0.",
    "re": "Kết luận đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính là 4 cm, thì diện tích của hình tròn đó là bao nhiêu cm²?",
    "re": "Diện tích là 50.24 cm²"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho chính nó thì kết quả là 1.",
    "re": "Kết luận đúng"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 5 thì nó là số lẻ.",
    "re": "Kết luận đúng"
  },
  {
    "con": "Số thích hợp điền vào chỗ chấm 2,022 : 0,01 = … là :",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số dương luôn lớn hơn 0",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là số chẵn",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số chia hết cho 3 thì tổng các chữ số của số đó cũng chia hết cho 3",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu hai góc trong một tam giác có tổng bằng 90 độ thì góc còn lại là góc vuông",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì diện tích của nó là chiều rộng nhân với chiều dài",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì kết quả là 0",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được cộng với 1 thì kết quả luôn lớn hơn số đó",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số là số nguyên tố thì nó chỉ có hai ước số là 1 và chính nó",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính r thì chu vi của nó là 2πr",
    "re": "Kết quả đúng"
  },
  {
    "con": "Kết quả của biểu thức: \\frac{1}{7} \\times \\frac{2}{3} \\div \\frac{1}{5} là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương a và b là",
    "re": "Số nguyên dương"
  },
  {
    "con": "Khi một số nguyên được chia cho 2, nếu số đó là chẵn thì",
    "re": "Kết quả là số nguyên"
  },
  {
    "con": "Khi cộng hai số âm, kết quả sẽ",
    "re": "Là một số âm"
  },
  {
    "con": "Khi nhân một số dương với một số âm, kết quả sẽ",
    "re": "Là một số âm"
  },
  {
    "con": "Khi trừ một số dương khỏi một số âm, kết quả sẽ",
    "re": "Là một số âm"
  },
  {
    "con": "Khi nhân hai số nguyên, nếu một trong số đó là 0 thì",
    "re": "Kết quả là 0"
  },
  {
    "con": "Khi chia một số dương cho một số dương khác, kết quả sẽ",
    "re": "Là một số dương"
  },
  {
    "con": "Khi tính diện tích hình chữ nhật với chiều dài a và chiều rộng b, kết quả sẽ là",
    "re": "a nhân b"
  },
  {
    "con": "Khi tính chu vi hình vuông với cạnh a, kết quả sẽ là",
    "re": "4 nhân a"
  },
  {
    "con": "Tìm x, biết : 10,2 \\div x = 0,6 + 11,4",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương a và b lớn hơn 0",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu a > b thì a - b > 0",
    "re": "Kết quả đúng"
  },
  {
    "con": "Tìm diện tích hình chữ nhật, biết chiều dài là a và chiều rộng là b",
    "re": "Diện tích = a \\times b"
  },
  {
    "con": "Nếu số nguyên n chia hết cho 2 thì n là số chẵn",
    "re": "Kết quả đúng"
  },
  {
    "con": "Tìm x, biết : 3x + 5 = 20",
    "re": "x = 5"
  },
  {
    "con": "Nếu tổng của ba số a, b, c bằng 0 thì a + b + c = 0",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một góc trong tam giác là 90 độ thì tam giác đó là tam giác vuông",
    "re": "Kết quả đúng"
  },
  {
    "con": "Tìm chu vi hình tròn, biết bán kính là r",
    "re": "Chu vi = 2\\pi r"
  },
  {
    "con": "Nếu a \\times b = 0 thì ít nhất một trong hai số a hoặc b bằng 0",
    "re": "Kết quả đúng"
  },
  {
    "con": "Diện tích hình tam giác có đáy 27cm, chiều cao 16cm là :",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 8 và 5 là :",
    "re": "13"
  },
  {
    "con": "Số 12 là số chẵn",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4cm, thì diện tích của nó là :",
    "re": "16 cm²"
  },
  {
    "con": "Nếu một số nguyên dương chia hết cho 2, thì nó là số chẵn",
    "re": "Đúng"
  },
  {
    "con": "Nếu 3 x 4 = 12, thì 12 chia cho 3 là :",
    "re": "4"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 10cm và chiều rộng 5cm, thì chu vi của nó là :",
    "re": "30 cm"
  },
  {
    "con": "Nếu 15% của 200 là :",
    "re": "30"
  },
  {
    "con": "Nếu một số có 3 chữ số, thì nó nằm trong khoảng từ 100 đến 999",
    "re": "Đúng"
  },
  {
    "con": "Nếu 9 - 4 = 5, thì 5 + 2 là :",
    "re": "7"
  },
  {
    "con": "Bạn Hoa gấp 1 cái thuyền trong 3 phút 27 giây. Hỏi Hoa gấp 3 cái thuyền trong thời gian bao lâu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương là 10. Hỏi nếu một số là 4 thì số còn lại là bao nhiêu?",
    "re": "Số còn lại là 6"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài là 5 cm và chiều rộng là 3 cm, thì diện tích của hình chữ nhật là bao nhiêu?",
    "re": "Diện tích là 15 cm²"
  },
  {
    "con": "Một chiếc bánh có 8 miếng. Nếu bạn ăn 3 miếng, thì số miếng còn lại là bao nhiêu?",
    "re": "Số miếng còn lại là 5"
  },
  {
    "con": "Nếu bạn có 12 viên bi và chia đều cho 4 bạn, thì mỗi bạn sẽ nhận được bao nhiêu viên bi?",
    "re": "Mỗi bạn sẽ nhận được 3 viên bi"
  },
  {
    "con": "Nếu 1 giờ có 60 phút, thì 3 giờ sẽ có bao nhiêu phút?",
    "re": "3 giờ sẽ có 180 phút"
  },
  {
    "con": "Nếu bạn có 5 quả táo và bạn mua thêm 7 quả nữa, thì tổng số táo bạn có là bao nhiêu?",
    "re": "Tổng số táo là 12"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì chu vi của hình vuông là bao nhiêu?",
    "re": "Chu vi là 16 cm"
  },
  {
    "con": "Nếu bạn có 10 đồng xu và bạn mất 4 đồng xu, thì bạn còn lại bao nhiêu đồng xu?",
    "re": "Bạn còn lại 6 đồng xu"
  },
  {
    "con": "Nếu một chiếc xe chạy với tốc độ 60 km/h trong 2 giờ, thì quãng đường xe đã đi được là bao nhiêu?",
    "re": "Quãng đường là 120 km"
  },
  {
    "con": "Số thập phân gồm năm đơn vị, một phần mười, ba phần nghìn được viết là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn hoặc bằng:",
    "re": "Hai số nguyên dương"
  },
  {
    "con": "Một hình chữ nhật có chiều dài gấp đôi chiều rộng thì diện tích được tính bằng:",
    "re": "Chiều rộng nhân với chiều dài"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là:",
    "re": "Số chẵn"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai số đầu là 10 và 15 thì số thứ ba là:",
    "re": "5"
  },
  {
    "con": "Nếu một góc trong tam giác có độ lớn 90 độ thì tam giác đó là:",
    "re": "Tam giác vuông"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 5 thì số đó có thể chia hết cho:",
    "re": "5"
  },
  {
    "con": "Nếu một hình tròn có bán kính là r thì chu vi được tính bằng:",
    "re": "2πr"
  },
  {
    "con": "Nếu một số nguyên âm được cộng với một số nguyên dương lớn hơn nó thì kết quả là:",
    "re": "Số nguyên dương"
  },
  {
    "con": "Một đội bóng đã thi đấu 20 trận, thắng 12 trận. Như vậy tỉ số phần trăm các trận thắng của đội là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 10 và một số là 4, thì số còn lại là:",
    "re": "6"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 5 cm và chiều rộng 3 cm, thì diện tích của hình chữ nhật là:",
    "re": "15 cm²"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì chu vi của hình vuông là:",
    "re": "16 cm"
  },
  {
    "con": "Nếu một số nguyên dương chia cho 1, thì kết quả là:",
    "re": "Số nguyên dương đó"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai số là 10 và 15, thì số còn lại là:",
    "re": "5"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3 cm, thì diện tích của hình tròn là:",
    "re": "28.26 cm² (làm tròn π = 3.14)"
  },
  {
    "con": "Nếu một số được cộng với chính nó, thì kết quả là:",
    "re": "Gấp đôi số đó"
  },
  {
    "con": "Nếu một số là 25 và bạn lấy căn bậc hai của nó, thì kết quả là:",
    "re": "5"
  },
  {
    "con": "Tấm logo trường Tiểu học Lê Ngọc Hân may trên áo đồng phục có dạng hình tròn với đường kính là 6cm. Diện tích của tấm logo đó là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một hình vuông có cạnh dài 4cm. Chu vi của hình vuông đó là:",
    "re": "16cm"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 2 và dư 0, thì số đó là:",
    "re": "số chẵn"
  },
  {
    "con": "Một hình chữ nhật có chiều dài 5cm và chiều rộng 3cm. Diện tích của hình chữ nhật đó là:",
    "re": "15cm²"
  },
  {
    "con": "Nếu tổng của hai số là 10 và một trong hai số là 4, thì số còn lại là:",
    "re": "6"
  },
  {
    "con": "Nếu một góc vuông có độ lớn là 90 độ, thì tổng của hai góc phụ của nó là:",
    "re": "90 độ"
  },
  {
    "con": "Một hình tam giác có ba cạnh lần lượt là 3cm, 4cm và 5cm. Hình tam giác đó là:",
    "re": "tam giác vuông"
  },
  {
    "con": "Nếu một số được nhân với 1, thì kết quả là:",
    "re": "số đó"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 3 và dư 1, thì số đó có thể viết dưới dạng:",
    "re": "3k + 1 (với k là số nguyên)"
  },
  {
    "con": "Một hình tròn có bán kính 3cm. Chu vi của hình tròn đó là:",
    "re": "18.84cm (làm tròn)"
  },
  {
    "con": "Một cạnh của hình lập phương gấp lên 3 lần thì thể tích của hình lập phương mới đó tăng lên bao nhiêu lần?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn hoặc bằng 2 thì tổng của chúng là số chẵn hoặc lẻ.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương chia hết cho 2 thì số đó là số chẵn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tam giác có hai cạnh bằng nhau thì đó là tam giác cân.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của ba số là 180 độ thì chúng có thể là các góc của một tam giác.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số được nhân với 0 thì kết quả luôn là 0.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì diện tích của nó gấp 2 lần diện tích của hình vuông có cạnh bằng chiều rộng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho chính nó thì kết quả luôn là 1.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương lớn hơn 1 thì nó có ít nhất một ước số khác ngoài 1 và chính nó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính gấp đôi bán kính của hình tròn khác thì diện tích của nó gấp 4 lần diện tích của hình tròn kia.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khoảng thời gian từ lúc 6 giờ kém 15 phút sáng đến 6 giờ 35 phút sáng là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương là:",
    "re": "Một số nguyên dương"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì:",
    "re": "Số đó là số chẵn"
  },
  {
    "con": "Nếu một hình tam giác có ba cạnh bằng nhau thì:",
    "re": "Hình tam giác đó là tam giác đều"
  },
  {
    "con": "Nếu một số có chữ số cuối là 0 hoặc 5 thì:",
    "re": "Số đó là số chia hết cho 5"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai số đầu là 10 và 15 thì:",
    "re": "Số thứ ba là 5"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì:",
    "re": "Diện tích của hình chữ nhật là chiều rộng nhân với chiều dài"
  },
  {
    "con": "Nếu một số nguyên âm được cộng với một số nguyên dương thì:",
    "re": "Kết quả có thể là số âm, số dương hoặc số 0"
  },
  {
    "con": "Nếu một số có hai chữ số và chữ số hàng chục lớn hơn chữ số hàng đơn vị thì:",
    "re": "Số đó là số lớn hơn 10"
  },
  {
    "con": "Nếu một hình tròn có bán kính là 3 cm thì:",
    "re": "Diện tích của hình tròn là 28.26 cm² (làm tròn)"
  },
  {
    "con": "Một hình hộp chữ nhật có chiều dài 5dm, chiều rộng 4dm, chiều cao 6dm. Vậy diện tích xung quanh của hình đó là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 3 và 5 là:",
    "re": "8"
  },
  {
    "con": "Nếu một tam giác có ba cạnh lần lượt là 3cm, 4cm và 5cm, thì nó là tam giác vuông.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một số nguyên dương chia hết cho 2 thì nó là số chẵn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính 7cm, thì diện tích của hình tròn đó là:",
    "re": "153.94 cm²"
  },
  {
    "con": "Nếu tổng của ba số 2, 4 và 6 là 12, thì trung bình cộng của chúng là:",
    "re": "4"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 3 và dư 1, thì số đó có thể được biểu diễn dưới dạng 3k + 1 với k là số nguyên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 5cm, thì chu vi của hình vuông đó là:",
    "re": "20cm"
  },
  {
    "con": "Nếu một số nguyên dương lớn hơn 1 thì nó có ít nhất một ước số là 1 và chính nó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 10cm và chiều rộng 5cm, thì diện tích của hình chữ nhật đó là:",
    "re": "50cm²"
  },
  {
    "con": "Một hình thang có đáy lớn 18cm, đáy bé bằng đáy lớn và chiều cao 12cm. Diện tích của hình thang đó là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 5 và 7 là:",
    "re": "12"
  },
  {
    "con": "Nếu một tam giác có ba cạnh lần lượt là 3cm, 4cm và 5cm, thì đó là tam giác vuông.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 2 và dư 0, thì số đó là số chẵn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4cm, thì diện tích của hình vuông đó là:",
    "re": "16 cm²"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3cm, thì chu vi của hình tròn đó là:",
    "re": "18.84 cm"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu tổng của ba số 2, 3 và 5 là:",
    "re": "10"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 3 và dư 1, thì số đó không chia hết cho 3.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 10cm và chiều rộng 5cm, thì diện tích của hình chữ nhật đó là:",
    "re": "50 cm²"
  },
  {
    "con": "Số lớn nhất trong các số 5,798; 5,897; 5,978; 5,789 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 7 và 5 là:",
    "re": "12"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì diện tích của nó là:",
    "re": "16 cm²"
  },
  {
    "con": "Nếu số 15 chia cho 3, thì thương là:",
    "re": "5"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 6 cm và chiều rộng 3 cm, thì chu vi của nó là:",
    "re": "18 cm"
  },
  {
    "con": "Nếu số 8 được nhân với 2, thì kết quả là:",
    "re": "16"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1, thì kết quả là:",
    "re": "Số nguyên dương đó"
  },
  {
    "con": "Nếu tổng của ba số 2, 3 và 4 là:",
    "re": "9"
  },
  {
    "con": "Nếu một hình tròn có bán kính 5 cm, thì diện tích của nó là:",
    "re": "25π cm²"
  },
  {
    "con": "Nếu số 100 trừ đi 45, thì kết quả là:",
    "re": "55"
  },
  {
    "con": "Chữ số 7 trong số 234, 078 có giá trị là :",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 5 và 3 là :",
    "re": "8"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì diện tích của nó là :",
    "re": "16 cm²"
  },
  {
    "con": "Nếu 12 chia cho 4, thì thương là :",
    "re": "3"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 6 cm và chiều rộng 3 cm, thì chu vi của nó là :",
    "re": "18 cm"
  },
  {
    "con": "Nếu 9 trừ 5, thì hiệu là :",
    "re": "4"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là :",
    "re": "0"
  },
  {
    "con": "Nếu 15 cộng 10, thì tổng là :",
    "re": "25"
  },
  {
    "con": "Nếu một số là số chẵn, thì nó có thể chia hết cho :",
    "re": "2"
  },
  {
    "con": "Nếu 20 chia cho 5, thì thương là :",
    "re": "4"
  },
  {
    "con": "Số lớn nhất trong các số: 5,079; 5,79; 5,709; 5,789 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 7 và 5 là:",
    "re": "12"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì diện tích của nó là:",
    "re": "16 cm²"
  },
  {
    "con": "Nếu một số nguyên dương chia hết cho 2, thì nó là:",
    "re": "Số chẵn"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 6 cm và chiều rộng 3 cm, thì chu vi của nó là:",
    "re": "18 cm"
  },
  {
    "con": "Nếu 1/2 cộng với 1/4, thì kết quả là:",
    "re": "3/4"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu 10 trừ đi 3, thì kết quả là:",
    "re": "7"
  },
  {
    "con": "Nếu một hình tròn có bán kính 5 cm, thì diện tích của nó là:",
    "re": "25π cm²"
  },
  {
    "con": "Nếu một số nguyên dương chia cho 1, thì kết quả là:",
    "re": "Số đó"
  },
  {
    "con": "Thể tích của hình lập phương có cạnh 5dm là:",
    "re": "125 dm³"
  },
  {
    "con": "Tổng của hai số 3 và 7 là:",
    "re": "10"
  },
  {
    "con": "Số nguyên tố nhỏ nhất là:",
    "re": "2"
  },
  {
    "con": "Kết quả của phép nhân 6 x 4 là:",
    "re": "24"
  },
  {
    "con": "Số đối của -5 là:",
    "re": "5"
  },
  {
    "con": "Diện tích của hình chữ nhật có chiều dài 8cm và chiều rộng 3cm là:",
    "re": "24 cm²"
  },
  {
    "con": "Số trung bình của các số 2, 4, 6 là:",
    "re": "4"
  },
  {
    "con": "Phép chia 20 cho 5 là:",
    "re": "4"
  },
  {
    "con": "Số lớn nhất trong dãy số 1, 3, 5, 7 là:",
    "re": "7"
  },
  {
    "con": "Kết quả của phép cộng 15 + 9 là:",
    "re": "24"
  },
  {
    "con": "Khoảng thời gian từ 8 giờ kém 15 phút đến 8 giờ 25 phút là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn hoặc bằng:",
    "re": "0"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì:",
    "re": "số đó là số chẵn"
  },
  {
    "con": "Nếu một hình tam giác có ba cạnh bằng nhau thì:",
    "re": "hình tam giác đó là tam giác đều"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 10 và dư 0 thì:",
    "re": "số đó là bội số của 10"
  },
  {
    "con": "Nếu tổng của hai góc trong một tam giác là 90 độ thì:",
    "re": "góc còn lại là góc vuông"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 5 thì:",
    "re": "số đó chia hết cho 5"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì:",
    "re": "diện tích hình chữ nhật là chiều rộng nhân với chiều dài"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 3 và dư 1 thì:",
    "re": "số đó không chia hết cho 3"
  },
  {
    "con": "Nếu một hình tròn có bán kính r thì:",
    "re": "chu vi của hình tròn là 2πr"
  },
  {
    "con": "Một lớp học có 21 nữ và 14 nam. Hỏi số học sinh nam chiếm bao nhiêu phần trăm số học sinh cả lớp?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số là 15 và một trong số đó là 9. Hỏi số còn lại là bao nhiêu?",
    "re": "Số còn lại là 6"
  },
  {
    "con": "Một hình chữ nhật có chiều dài 10 cm và chiều rộng 5 cm. Hỏi diện tích của hình chữ nhật là bao nhiêu?",
    "re": "Diện tích là 50 cm²"
  },
  {
    "con": "Nếu một số nguyên dương chia hết cho 2 thì số đó là số chẵn.",
    "re": "Kết luận đúng"
  },
  {
    "con": "Một hình vuông có cạnh dài 4 cm. Hỏi chu vi của hình vuông là bao nhiêu?",
    "re": "Chu vi là 16 cm"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai trong số đó là 10 và 15, thì số còn lại là bao nhiêu?",
    "re": "Số còn lại là 5"
  },
  {
    "con": "Một chiếc bánh pizza được chia thành 8 miếng. Nếu ăn 3 miếng, thì còn lại bao nhiêu miếng?",
    "re": "Còn lại 5 miếng"
  },
  {
    "con": "Nếu một số được nhân với 0 thì kết quả là bao nhiêu?",
    "re": "Kết quả là 0"
  },
  {
    "con": "Một lớp học có 30 học sinh, trong đó có 12 học sinh thích toán. Hỏi tỷ lệ học sinh thích toán là bao nhiêu phần trăm?",
    "re": "Tỷ lệ là 40%"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3 cm, thì diện tích của hình tròn là bao nhiêu?",
    "re": "Diện tích là 28.26 cm²"
  },
  {
    "con": "Giá trị của chữ số 9 trong số : 28,953 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 7 và 5 là:",
    "re": "12"
  },
  {
    "con": "Số 15 là số lẻ:",
    "re": "Câu trả lời sai"
  },
  {
    "con": "Kết quả của phép nhân 6 và 4 là:",
    "re": "24"
  },
  {
    "con": "Phân số 1/2 là lớn hơn 1/3:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Số 100 là số chẵn:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Kết quả của phép chia 20 cho 5 là:",
    "re": "4"
  },
  {
    "con": "Tổng của ba số 2, 3 và 5 là:",
    "re": "10"
  },
  {
    "con": "Số 9 là số nguyên tố:",
    "re": "Câu trả lời sai"
  },
  {
    "con": "Hình vuông có 4 cạnh bằng nhau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Kết quả của phép tính 212,6 + 133,2 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn là:",
    "re": "Một số nguyên dương"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì:",
    "re": "Số đó là số chẵn"
  },
  {
    "con": "Nếu một số chia hết cho 3 thì:",
    "re": "Tổng các chữ số của số đó cũng chia hết cho 3"
  },
  {
    "con": "Kết quả của phép nhân hai số âm là:",
    "re": "Một số dương"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm thì:",
    "re": "Diện tích của hình vuông là 16 cm²"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì:",
    "re": "Kết quả là 0"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 5 cm và chiều rộng 3 cm thì:",
    "re": "Chu vi của hình chữ nhật là 16 cm"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho chính nó thì:",
    "re": "Kết quả là 1"
  },
  {
    "con": "Nếu một số có phần thập phân là 0,5 thì:",
    "re": "Số đó là số lẻ"
  },
  {
    "con": "Kết quả của phép tính 345,6 \\div 3 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 5 và 7 là:",
    "re": "12"
  },
  {
    "con": "Kết quả của phép tính 8 \\times 6 là:",
    "re": "48"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì diện tích của nó là:",
    "re": "16 cm²"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1, thì:",
    "re": "Kết quả là chính số đó"
  },
  {
    "con": "Nếu tổng của hai số là 20 và một trong số đó là 8, thì số còn lại là:",
    "re": "12"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 5 cm và chiều rộng 3 cm, thì chu vi của nó là:",
    "re": "16 cm"
  },
  {
    "con": "Nếu 15 trừ đi 9 thì:",
    "re": "Kết quả là 6"
  },
  {
    "con": "Nếu một số được nhân với 0, thì:",
    "re": "Kết quả là 0"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho chính nó, thì:",
    "re": "Kết quả là 1"
  },
  {
    "con": "Viết thành tỉ số % của 0,88 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 3 và 5 là:",
    "re": "8"
  },
  {
    "con": "Hiệu của 10 và 4 là:",
    "re": "6"
  },
  {
    "con": "Tích của 7 và 6 là:",
    "re": "42"
  },
  {
    "con": "Thương của 20 chia cho 4 là:",
    "re": "5"
  },
  {
    "con": "Số nguyên tố nhỏ nhất là:",
    "re": "2"
  },
  {
    "con": "Chu vi của hình vuông có cạnh 4 cm là:",
    "re": "16 cm"
  },
  {
    "con": "Diện tích của hình chữ nhật có chiều dài 5 cm và chiều rộng 3 cm là:",
    "re": "15 cm²"
  },
  {
    "con": "Số đối của -7 là:",
    "re": "7"
  },
  {
    "con": "Tỉ lệ giữa 2 và 8 là:",
    "re": "1:4"
  },
  {
    "con": "Thể tích của hình hộp chữ nhật có chiều dài 2cm, chiều rộng 2,5cm, chiều cao 4cm là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 3 và 5 là:",
    "re": "8"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau thì:",
    "re": "Đó là tam giác đều"
  },
  {
    "con": "Nếu số 12 chia cho 4 thì:",
    "re": "Kết quả là 3"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 2 và không có dư thì:",
    "re": "Số đó là số chẵn"
  },
  {
    "con": "Nếu một hình tròn có bán kính 5cm thì:",
    "re": "Diện tích của nó là 78,5 cm²"
  },
  {
    "con": "Nếu một số nguyên âm được cộng với một số nguyên dương thì:",
    "re": "Kết quả có thể là số âm, số dương hoặc số 0"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4cm thì:",
    "re": "Chu vi của nó là 16cm"
  },
  {
    "con": "Nếu một số thập phân có phần nguyên là 3 và phần thập phân là 0,75 thì:",
    "re": "Số đó là 3,75"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 6cm và chiều rộng 3cm thì:",
    "re": "Diện tích của nó là 18cm²"
  },
  {
    "con": "Số lớn nhất trong các số 8,920; 8,45; 8,95; 8,405 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 5 và 7 là:",
    "re": "12"
  },
  {
    "con": "Khi chia 15 cho 3, thương là:",
    "re": "5"
  },
  {
    "con": "Số chẵn nhỏ nhất lớn hơn 0 là:",
    "re": "2"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì diện tích của nó là:",
    "re": "16 cm²"
  },
  {
    "con": "Nếu 3 x 4 = 12, thì 4 x 3 cũng bằng:",
    "re": "12"
  },
  {
    "con": "Số nguyên tố nhỏ nhất là:",
    "re": "2"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 5 cm và chiều rộng 3 cm, thì chu vi của nó là:",
    "re": "16 cm"
  },
  {
    "con": "Khi cộng 9 và 6, kết quả là:",
    "re": "15"
  },
  {
    "con": "Nếu 10% của 200 là:",
    "re": "20"
  },
  {
    "con": "Kết quả phép nhân 5,07 \\times 100 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 3 và 7 là:",
    "re": "10"
  },
  {
    "con": "Kết quả phép chia 20 cho 4 là:",
    "re": "5"
  },
  {
    "con": "Số nguyên dương nhỏ nhất là:",
    "re": "1"
  },
  {
    "con": "Kết quả phép cộng 15 và 25 là:",
    "re": "40"
  },
  {
    "con": "Kết quả phép trừ 30 và 12 là:",
    "re": "18"
  },
  {
    "con": "Kết quả phép nhân 8 \\times 7 là:",
    "re": "56"
  },
  {
    "con": "Số chẵn tiếp theo của 4 là:",
    "re": "6"
  },
  {
    "con": "Kết quả phép chia 36 cho 6 là:",
    "re": "6"
  },
  {
    "con": "Kết quả phép cộng 100 và 200 là:",
    "re": "300"
  },
  {
    "con": "Kết quả phép chia 314 \\div 0,5 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn 0:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là số chẵn:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số chia hết cho 3 thì tổng các chữ số của số đó cũng chia hết cho 3:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu hai góc trong một tam giác có tổng là 90 độ thì góc còn lại là góc vuông:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì diện tích của nó là chiều rộng nhân với chiều dài:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì kết quả là 0:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 1 thì kết quả là chính nó:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 5 hoặc 0 thì số đó chia hết cho 5:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính r thì diện tích của nó là πr²:",
    "re": "Kết quả đúng"
  },
  {
    "con": "5840g = ….kg",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "2 + 3 = …",
    "re": "Kết quả là 5"
  },
  {
    "con": "5 x 4 = …",
    "re": "Kết quả là 20"
  },
  {
    "con": "10 - 7 = …",
    "re": "Kết quả là 3"
  },
  {
    "con": "12 ÷ 3 = …",
    "re": "Kết quả là 4"
  },
  {
    "con": "Hình vuông có 4 cạnh bằng nhau",
    "re": "Chu vi = 4 x cạnh"
  },
  {
    "con": "Hình chữ nhật có chiều dài 5cm và chiều rộng 3cm",
    "re": "Diện tích = 15cm²"
  },
  {
    "con": "Số nguyên tố là số lớn hơn 1 chỉ chia hết cho 1 và chính nó",
    "re": "Ví dụ: 2, 3, 5, 7"
  },
  {
    "con": "Tổng của ba số 2, 4, 6 là …",
    "re": "Kết quả là 12"
  },
  {
    "con": "Phân số 1/2 + 1/4 = …",
    "re": "Kết quả là 3/4"
  },
  {
    "con": "6,028 m^{3} = .......dm^{3}",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của hai số là 10 và một số là 4, thì số còn lại là .......",
    "re": "6"
  },
  {
    "con": "Nếu 5 + x = 12, thì x = .......",
    "re": "7"
  },
  {
    "con": "Nếu 3 x 4 = ......., thì kết quả là 12",
    "re": "12"
  },
  {
    "con": "Nếu 15 chia cho 3 bằng ......., thì kết quả là 5",
    "re": "5"
  },
  {
    "con": "Nếu 2^{3} = ......., thì kết quả là 8",
    "re": "8"
  },
  {
    "con": "Nếu 10% của 200 là ......., thì kết quả là 20",
    "re": "20"
  },
  {
    "con": "Nếu diện tích hình chữ nhật là 20 m^{2} và chiều dài là 5 m, thì chiều rộng là .......",
    "re": "4 m"
  },
  {
    "con": "Nếu 1/2 + 1/4 = ......., thì kết quả là 3/4",
    "re": "3/4"
  },
  {
    "con": "Nếu 9 - 3 = ......., thì kết quả là 6",
    "re": "6"
  },
  {
    "con": "Diện tích toàn phần hình lập phương có cạnh 5 cm là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 3 và 4 là:",
    "re": "7"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau thì đó là:",
    "re": "Tam giác đều"
  },
  {
    "con": "Nếu số 12 chia cho 4 thì thương là:",
    "re": "3"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 8 cm và chiều rộng 3 cm thì diện tích là:",
    "re": "24 cm²"
  },
  {
    "con": "Nếu số 15 trừ đi 9 thì kết quả là:",
    "re": "6"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 2 thì kết quả sẽ là:",
    "re": "Số nguyên hoặc số thập phân"
  },
  {
    "con": "Nếu một hình tròn có bán kính 7 cm thì chu vi là:",
    "re": "44 cm (xấp xỉ)"
  },
  {
    "con": "Nếu số 5 nhân với 6 thì tích là:",
    "re": "30"
  },
  {
    "con": "Nếu một số là số chẵn thì nó có thể được chia hết cho:",
    "re": "2"
  },
  {
    "con": "Chu vi hình tròn có bán kính 2,5 cm là?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 3 và 5 là?",
    "re": "8"
  },
  {
    "con": "Số nguyên tố nhỏ nhất là?",
    "re": "2"
  },
  {
    "con": "Diện tích hình chữ nhật có chiều dài 4 cm và chiều rộng 3 cm là?",
    "re": "12 cm²"
  },
  {
    "con": "Kết quả của phép nhân 6 x 7 là?",
    "re": "42"
  },
  {
    "con": "Phân số 1/2 cộng với 1/4 là?",
    "re": "3/4"
  },
  {
    "con": "Số đối của -5 là?",
    "re": "5"
  },
  {
    "con": "Tổng ba góc của một tam giác là?",
    "re": "180 độ"
  },
  {
    "con": "Số lớn nhất trong dãy số 2, 5, 8, 3 là?",
    "re": "8"
  },
  {
    "con": "Phép chia 20 cho 4 là?",
    "re": "5"
  },
  {
    "con": "Phân số \\frac{2}{5} viết dưới dạng số thập phân nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn 0?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là số chẵn?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 5 cm và chiều rộng 3 cm, thì diện tích của nó là bao nhiêu?",
    "re": "15 cm²"
  },
  {
    "con": "Nếu tổng của ba số là 30 và hai số đầu là 10 và 15, thì số thứ ba là bao nhiêu?",
    "re": "5"
  },
  {
    "con": "Nếu một góc vuông có độ lớn 90 độ, thì tổng của hai góc còn lại trong tam giác là bao nhiêu?",
    "re": "90 độ"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0, thì kết quả là bao nhiêu?",
    "re": "0"
  },
  {
    "con": "Nếu một hình tròn có bán kính 4 cm, thì chu vi của nó là bao nhiêu?",
    "re": "25.12 cm"
  },
  {
    "con": "Nếu một số nguyên âm được cộng với một số nguyên dương lớn hơn nó, thì kết quả là số gì?",
    "re": "Số dương"
  },
  {
    "con": "Nếu một phân số có tử số lớn hơn mẫu số, thì phân số đó là gì?",
    "re": "Phân số lớn hơn 1"
  },
  {
    "con": "Số thập phân gồm có 3 trăm, 4 đơn vị, 5 phần mười và 6 phần nghìn được viết là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số nguyên dương luôn lớn hơn cả hai số đó:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là số chẵn:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu tổng của hai số là số lẻ thì một trong hai số đó phải là số chẵn và số còn lại là số lẻ:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài gấp đôi chiều rộng thì tỷ lệ giữa chiều dài và chiều rộng là:",
    "re": "2:1"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0 thì kết quả là:",
    "re": "0"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 1 thì kết quả là:",
    "re": "Số đó"
  },
  {
    "con": "Nếu một tam giác có ba cạnh bằng nhau thì đó là tam giác đều:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số có chữ số cuối là 0 hoặc 5 thì số đó chia hết cho 5:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương có tổng các chữ số chia hết cho 3 thì số đó chia hết cho 3:",
    "re": "Kết quả đúng"
  },
  {
    "con": "Trong số thập phân 956,82 chữ số 2 thuộc hàng nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 5 và 7 là bao nhiêu?",
    "re": "Câu trả lời đúng là 12"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì diện tích của nó là bao nhiêu?",
    "re": "Câu trả lời đúng là 16 cm²"
  },
  {
    "con": "Nếu một số nguyên dương chia hết cho 2, thì nó là số chẵn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tổng của ba số 2, 3 và 5 là 10, thì tổng của chúng là bao nhiêu?",
    "re": "Câu trả lời đúng là 10"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 6 cm và chiều rộng 3 cm, thì chu vi của nó là bao nhiêu?",
    "re": "Câu trả lời đúng là 18 cm"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là bao nhiêu?",
    "re": "Câu trả lời đúng là 0"
  },
  {
    "con": "Nếu một số nguyên dương lớn hơn 1, thì nó có thể là số nguyên tố.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính 5 cm, thì diện tích của nó là bao nhiêu?",
    "re": "Câu trả lời đúng là 78,5 cm²"
  },
  {
    "con": "Nếu một số thập phân có phần nguyên là 3 và phần thập phân là 0,75, thì số đó là bao nhiêu?",
    "re": "Câu trả lời đúng là 3,75"
  },
  {
    "con": "Số 0,45 viết dưới dạng tỉ số phần trăm nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 3 và 5 là bao nhiêu?",
    "re": "Câu trả lời đúng là 8"
  },
  {
    "con": "Nếu một hình vuông có cạnh dài 4 cm, thì diện tích của nó là bao nhiêu?",
    "re": "Câu trả lời đúng là 16 cm²"
  },
  {
    "con": "Nếu một số nguyên dương chia hết cho 2, thì nó là số gì?",
    "re": "Câu trả lời đúng là số chẵn"
  },
  {
    "con": "Nếu 5 + x = 10, thì giá trị của x là bao nhiêu?",
    "re": "Câu trả lời đúng là 5"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 6 cm và chiều rộng 3 cm, thì chu vi của nó là bao nhiêu?",
    "re": "Câu trả lời đúng là 18 cm"
  },
  {
    "con": "Nếu 12 chia cho 4, thì kết quả là bao nhiêu?",
    "re": "Câu trả lời đúng là 3"
  },
  {
    "con": "Nếu một số nguyên âm là -7, thì giá trị tuyệt đối của nó là bao nhiêu?",
    "re": "Câu trả lời đúng là 7"
  },
  {
    "con": "Nếu 3 x 4 = x, thì giá trị của x là bao nhiêu?",
    "re": "Câu trả lời đúng là 12"
  },
  {
    "con": "Nếu một góc vuông có độ lớn là 90 độ, thì nó thuộc loại góc gì?",
    "re": "Câu trả lời đúng là góc vuông"
  },
  {
    "con": "Thể tích của một hình lập ph­ương có cạnh 5 dm là bao nhiêu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 7 và 3 là bao nhiêu?",
    "re": "10"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 8 cm và chiều rộng 4 cm, thì diện tích của nó là bao nhiêu?",
    "re": "32 cm²"
  },
  {
    "con": "Nếu số 15 được chia cho 3, thì thương là bao nhiêu?",
    "re": "5"
  },
  {
    "con": "Nếu một góc vuông có độ lớn 90 độ, thì tổng của hai góc phụ của nó là bao nhiêu?",
    "re": "90 độ"
  },
  {
    "con": "Nếu một số nguyên dương được nhân với 0, thì kết quả là bao nhiêu?",
    "re": "0"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3 cm, thì chu vi của nó là bao nhiêu?",
    "re": "18.84 cm"
  },
  {
    "con": "Nếu một số nguyên dương được cộng với chính nó, thì kết quả là bao nhiêu?",
    "re": "Gấp đôi số đó"
  },
  {
    "con": "Nếu một hình tam giác có ba cạnh lần lượt là 3 cm, 4 cm và 5 cm, thì nó có phải là tam giác vuông không?",
    "re": "Có"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1, thì kết quả là bao nhiêu?",
    "re": "Số đó"
  },
  {
    "con": "Diện tích hình tròn có bán kính bằng 10cm là bao nhiêu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 3 và 5 là bao nhiêu?",
    "re": "Câu trả lời đúng là 8"
  },
  {
    "con": "Số nguyên tố nhỏ nhất là số nào?",
    "re": "Câu trả lời đúng là 2"
  },
  {
    "con": "Hình chữ nhật có chiều dài 4cm và chiều rộng 6cm có diện tích là bao nhiêu?",
    "re": "Câu trả lời đúng là 24cm²"
  },
  {
    "con": "Phép nhân của 7 và 8 là bao nhiêu?",
    "re": "Câu trả lời đúng là 56"
  },
  {
    "con": "Số 15 có phải là số chẵn không?",
    "re": "Câu trả lời đúng là không"
  },
  {
    "con": "Tổng của các góc trong một tam giác là bao nhiêu độ?",
    "re": "Câu trả lời đúng là 180 độ"
  },
  {
    "con": "Phép chia 20 cho 4 là bao nhiêu?",
    "re": "Câu trả lời đúng là 5"
  },
  {
    "con": "Số 100 có phải là số chính phương không?",
    "re": "Câu trả lời đúng là có"
  },
  {
    "con": "Hình vuông có cạnh dài 5cm có diện tích là bao nhiêu?",
    "re": "Câu trả lời đúng là 25cm²"
  },
  {
    "con": "Chọn cách tính đúng diện tích hình thang có đáy lớn là 25 cm, đáy nhỏ 21 cm và chiều cao 8 cm nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tính tổng của hai số 7 và 5.",
    "re": "Kết quả là 12"
  },
  {
    "con": "Chia 20 cho 4.",
    "re": "Kết quả là 5"
  },
  {
    "con": "Tìm số lớn nhất trong dãy số 3, 7, 2, 9, 5.",
    "re": "Kết quả là 9"
  },
  {
    "con": "Tính diện tích hình chữ nhật có chiều dài 10 cm và chiều rộng 4 cm.",
    "re": "Kết quả là 40 cm²"
  },
  {
    "con": "Tìm số nguyên tố nhỏ nhất lớn hơn 5.",
    "re": "Kết quả là 7"
  },
  {
    "con": "Tính chu vi hình vuông có cạnh dài 6 cm.",
    "re": "Kết quả là 24 cm"
  },
  {
    "con": "Tính giá trị của biểu thức 3 x (4 + 2).",
    "re": "Kết quả là 18"
  },
  {
    "con": "Tìm số trung bình của dãy số 2, 4, 6, 8.",
    "re": "Kết quả là 5"
  },
  {
    "con": "Tính số phần còn lại khi 15 chia cho 4.",
    "re": "Kết quả là 3"
  },
  {
    "con": "Một xe máy đi quãng đường 90 km mất 2 giờ 30 phút. Hỏi xe máy đó đi với vận tốc nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng của hai số 5 và 7 là bao nhiêu?",
    "re": "Kết quả là 12"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài 10 cm và chiều rộng 5 cm, thì diện tích của hình chữ nhật đó là bao nhiêu?",
    "re": "Diện tích là 50 cm²"
  },
  {
    "con": "Nếu một số nguyên dương chia hết cho 2, thì số đó là số chẵn.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu tổng của ba số 2, 3 và 4 là 9, thì tổng của ba số này là đúng.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hình tròn có bán kính 3 cm, thì chu vi của hình tròn đó là bao nhiêu?",
    "re": "Chu vi là 18.84 cm"
  },
  {
    "con": "Nếu một số được nhân với 0, thì kết quả là bao nhiêu?",
    "re": "Kết quả là 0"
  },
  {
    "con": "Nếu một hình tam giác có ba cạnh lần lượt là 3 cm, 4 cm và 5 cm, thì hình tam giác đó là tam giác vuông.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một số nguyên dương được chia cho 1, thì kết quả là bao nhiêu?",
    "re": "Kết quả là chính số đó"
  },
  {
    "con": "Nếu một số có chữ số tận cùng là 5, thì số đó là số lẻ.",
    "re": "Kết quả đúng"
  },
  {
    "con": "46,75 + 24,48 =?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu số nguyên dương a chia hết cho 2 thì a là số chẵn",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu số nguyên dương b chia hết cho 3 thì b có tổng các chữ số chia hết cho 3",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu c là số nguyên dương và c > 1 thì c có ít nhất một ước số khác ngoài 1 và c",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu d là một tam giác có hai cạnh bằng nhau thì d là tam giác cân",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu e là một hình chữ nhật thì diện tích của e bằng chiều dài nhân chiều rộng",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu f là một số thập phân thì f có thể được viết dưới dạng phân số",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu g là một số nguyên âm thì g < 0",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu h là một số nguyên dương và h là bội số của 5 thì h có thể viết dưới dạng 5n với n là số nguyên",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu i là một số nguyên dương và i là số nguyên tố thì i chỉ có hai ước số là 1 và i",
    "re": "Kết quả đúng"
  },
  {
    "con": "26,4 \\div 2,2 =?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "2 + 3 = ?",
    "re": "Câu trả lời đúng là 5"
  },
  {
    "con": "5 \\times 4 = ?",
    "re": "Câu trả lời đúng là 20"
  },
  {
    "con": "9 - 6 = ?",
    "re": "Câu trả lời đúng là 3"
  },
  {
    "con": "12 \\div 3 = ?",
    "re": "Câu trả lời đúng là 4"
  },
  {
    "con": "Cạnh của hình vuông là 4 cm, diện tích là ?",
    "re": "Câu trả lời đúng là 16 cm²"
  },
  {
    "con": "Tổng của 7 và 8 là ?",
    "re": "Câu trả lời đúng là 15"
  },
  {
    "con": "Số nguyên tố nhỏ nhất là ?",
    "re": "Câu trả lời đúng là 2"
  },
  {
    "con": "Hình chữ nhật có chiều dài 5 cm và chiều rộng 3 cm, chu vi là ?",
    "re": "Câu trả lời đúng là 16 cm"
  },
  {
    "con": "Tỉ lệ 1:2 có tổng là 30, số lớn hơn là ?",
    "re": "Câu trả lời đúng là 20"
  },
  {
    "con": "40,8 \\div 12 – 2,03 =?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "2 + 3 = 5",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "5 \\times 6 = 30",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "9 - 4 = 5",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "12 \\div 4 = 3",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "3 + 7 = 10",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "15 - 9 = 6",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "8 \\times 2 = 16",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "20 \\div 5 = 4",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "5 + 5 = 10",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Để tìm một số biết 30% của số đó là 180 ta làm như sau:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi cộng hai số nguyên dương, tổng của chúng luôn lớn hơn cả hai số đó:",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một số chia hết cho 2 thì số đó là số chẵn:",
    "re": "Điều này đúng"
  },
  {
    "con": "Khi nhân một số với 0, kết quả luôn là 0:",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một hình chữ nhật có chiều dài và chiều rộng bằng nhau thì nó là hình vuông:",
    "re": "Điều này đúng"
  },
  {
    "con": "Khi trừ một số dương khỏi một số dương khác mà lớn hơn, kết quả sẽ là số dương:",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu tổng của hai số là 10 và một trong số đó là 4, thì số còn lại là 6:",
    "re": "Điều này đúng"
  },
  {
    "con": "Khi chia một số cho chính nó (khác 0), kết quả luôn là 1:",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một số là bội của 3 thì nó có thể được chia hết cho 3:",
    "re": "Điều này đúng"
  },
  {
    "con": "Khi cộng ba số 0, 0 và 0, tổng sẽ là 0:",
    "re": "Điều này đúng"
  }
]