[
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Thực vật quang hợp trong ánh sáng mặt trời",
    "re": "Chúng sẽ sản xuất oxy và glucose"
  },
  {
    "con": "Động vật có xương sống có cấu trúc cơ thể phức tạp",
    "re": "Chúng sẽ có khả năng di chuyển và sinh sản hiệu quả hơn"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính",
    "re": "Ánh sáng sẽ bị phân tán thành các màu sắc khác nhau"
  },
  {
    "con": "Khi một vật thể được thả từ độ cao",
    "re": "Nó sẽ rơi xuống đất do lực hấp dẫn"
  },
  {
    "con": "Khi một chất bị đun nóng",
    "re": "Nó sẽ nở ra và có thể thay đổi trạng thái"
  },
  {
    "con": "Khi có sự thay đổi trong môi trường sống",
    "re": "Các loài sinh vật sẽ phải thích nghi hoặc di cư"
  },
  {
    "con": "Khi một chất hòa tan trong nước",
    "re": "Nó sẽ tạo thành dung dịch"
  },
  {
    "con": "Khi có sự va chạm giữa hai vật thể",
    "re": "Năng lượng có thể được chuyển giao giữa chúng"
  },
  {
    "con": "Sự bay hơi xảy ra khi nhiệt độ tăng",
    "re": "Chất lỏng sẽ chuyển thành hơi"
  },
  {
    "con": "Đặc điểm nào sau đây là của chung cho cả đồng và nhôm?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được làm nóng đến 100 độ C ở áp suất bình thường?",
    "re": "Nước sẽ sôi"
  },
  {
    "con": "Một vật thể có khối lượng lớn hơn nước?",
    "re": "Vật thể sẽ chìm trong nước"
  },
  {
    "con": "Nếu cây nhận đủ ánh sáng mặt trời và nước?",
    "re": "Cây sẽ phát triển tốt"
  },
  {
    "con": "Nếu một chất có nhiệt độ thấp hơn điểm đông đặc của nó?",
    "re": "Chất đó sẽ ở trạng thái rắn"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao lớn?",
    "re": "Vật thể sẽ rơi xuống đất do trọng lực"
  },
  {
    "con": "Nếu một chất được hòa tan trong nước?",
    "re": "Chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Nếu một động vật có xương sống?",
    "re": "Động vật đó thuộc nhóm động vật có xương"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra?",
    "re": "Sẽ có sự thay đổi về năng lượng và chất"
  },
  {
    "con": "Nếu một vật thể có hình dạng không cố định?",
    "re": "Vật thể đó là chất lỏng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào ở mức áp suất bình thường?",
    "re": "100 độ C"
  },
  {
    "con": "Các sinh vật sống cần gì để tồn tại?",
    "re": "Nước, thức ăn, không khí và môi trường sống"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, điều gì xảy ra?",
    "re": "Ánh sáng bị khúc xạ"
  },
  {
    "con": "Các hành tinh trong hệ mặt trời quay quanh gì?",
    "re": "Mặt trời"
  },
  {
    "con": "Khi một vật nóng được đặt vào một vật lạnh, điều gì xảy ra?",
    "re": "Nhiệt độ của vật nóng giảm và nhiệt độ của vật lạnh tăng"
  },
  {
    "con": "Cây xanh sản xuất oxy thông qua quá trình nào?",
    "re": "Quang hợp"
  },
  {
    "con": "Khi nước đông lại, nó sẽ trở thành gì?",
    "re": "Đá"
  },
  {
    "con": "Các động vật có xương sống bao gồm những nhóm nào?",
    "re": "Cá, lưỡng cư, bò sát, chim và thú"
  },
  {
    "con": "Khi một vật di chuyển nhanh hơn âm thanh, điều gì xảy ra?",
    "re": "Nó tạo ra tiếng nổ siêu thanh"
  },
  {
    "con": "Khi một chất rắn tan trong nước, nó tạo ra gì?",
    "re": "Dung dịch"
  },
  {
    "con": "Nước được làm nóng đến nhiệt độ sôi",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái hơi"
  },
  {
    "con": "Một vật thể được thả từ độ cao",
    "re": "Vật thể sẽ rơi xuống đất do lực hấp dẫn"
  },
  {
    "con": "Thực vật nhận ánh sáng mặt trời",
    "re": "Thực vật sẽ thực hiện quá trình quang hợp để tạo ra năng lượng"
  },
  {
    "con": "Một chất được hòa tan trong nước",
    "re": "Chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Nhiệt độ môi trường tăng cao",
    "re": "Chất rắn có thể chuyển sang trạng thái lỏng"
  },
  {
    "con": "Một động vật sống trong môi trường nước",
    "re": "Động vật đó sẽ có các đặc điểm thích nghi như vây và mang"
  },
  {
    "con": "Một vật thể có khối lượng lớn hơn không khí",
    "re": "Vật thể đó sẽ không bay lên mà sẽ rơi xuống"
  },
  {
    "con": "Một hệ sinh thái bị phá hủy",
    "re": "Sẽ dẫn đến sự mất cân bằng và ảnh hưởng đến các loài sống trong đó"
  },
  {
    "con": "Một nguồn năng lượng tái tạo được sử dụng",
    "re": "Nguồn năng lượng đó sẽ giúp giảm thiểu ô nhiễm môi trường"
  },
  {
    "con": "Một chất có tính axit",
    "re": "Chất đó sẽ có khả năng phản ứng với các chất bazơ để tạo ra muối và nước"
  },
  {
    "con": "Việc làm nào dưới đây chỉ có phụ nữ làm được?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp",
    "re": "Chúng sẽ sản xuất ra oxy và glucose"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao",
    "re": "Nó sẽ rơi xuống đất do lực hấp dẫn"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Nếu một chất được hòa tan trong nước",
    "re": "Chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Khi có điện chạy qua dây dẫn",
    "re": "Dây dẫn sẽ nóng lên"
  },
  {
    "con": "Nếu một sinh vật không có đủ thức ăn",
    "re": "Nó sẽ không thể sống sót lâu dài"
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính",
    "re": "Ánh sáng sẽ bị khúc xạ và tạo ra cầu vồng"
  },
  {
    "con": "Nếu một vật thể có khối lượng lớn",
    "re": "Nó sẽ có lực hấp dẫn mạnh hơn"
  },
  {
    "con": "Khi nước bay hơi",
    "re": "Nó sẽ chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Nên làm gì để phòng bệnh viêm gan A ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước ở trạng thái lỏng có nhiệt độ từ 0 độ C đến 100 độ C ?",
    "re": "Nước sẽ không đóng băng hoặc bay hơi"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp ?",
    "re": "Thực vật sẽ sản xuất oxy và năng lượng"
  },
  {
    "con": "Động vật có xương sống có hệ thống tuần hoàn kín ?",
    "re": "Động vật sẽ có khả năng vận chuyển máu hiệu quả hơn"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, nó sẽ rơi xuống ?",
    "re": "Vật thể sẽ chịu tác động của trọng lực"
  },
  {
    "con": "Nếu nhiệt độ môi trường giảm xuống dưới 0 độ C ?",
    "re": "Nước sẽ chuyển sang trạng thái rắn (đóng băng)"
  },
  {
    "con": "Nếu một chất được đun nóng, nó sẽ giãn nở ?",
    "re": "Chất sẽ chiếm nhiều không gian hơn"
  },
  {
    "con": "Nếu một con vật không có khả năng tự sản xuất thức ăn ?",
    "re": "Con vật đó sẽ cần phải ăn thực phẩm từ nguồn khác"
  },
  {
    "con": "Nếu một hệ sinh thái bị mất đi một loài ?",
    "re": "Sự cân bằng sinh thái có thể bị ảnh hưởng"
  },
  {
    "con": "Nếu ánh sáng mặt trời chiếu vào một bề mặt màu đen ?",
    "re": "Bề mặt đó sẽ hấp thụ nhiều nhiệt hơn"
  },
  {
    "con": "Nếu một chất lỏng có mật độ thấp hơn nước ?",
    "re": "Chất lỏng đó sẽ nổi trên mặt nước"
  },
  {
    "con": "Nếu một vật thể được làm từ kim loại ?",
    "re": "Vật thể đó sẽ dẫn điện tốt hơn so với vật liệu phi kim loại"
  },
  {
    "con": "Bệnh nào dưới đây không lây do muỗi truyền ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "nước được đun sôi ở nhiệt độ 100 độ C",
    "re": "nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "các sinh vật sống cần nước để tồn tại",
    "re": "chúng sẽ không thể sống nếu thiếu nước"
  },
  {
    "con": "các vật thể nặng hơn sẽ rơi nhanh hơn khi không có lực cản",
    "re": "chúng sẽ chạm đất cùng một lúc"
  },
  {
    "con": "cây xanh quang hợp vào ban ngày",
    "re": "chúng sẽ sản xuất oxy"
  },
  {
    "con": "nếu ánh sáng mặt trời chiếu vào một vật thể",
    "re": "vật thể đó sẽ hấp thụ hoặc phản xạ ánh sáng"
  },
  {
    "con": "nếu một chất rắn được nung nóng",
    "re": "chất đó sẽ có thể chuyển sang trạng thái lỏng"
  },
  {
    "con": "nếu có sự thay đổi nhiệt độ",
    "re": "các chất có thể thay đổi trạng thái"
  },
  {
    "con": "nếu một sinh vật ăn thực vật",
    "re": "nó sẽ nhận được năng lượng từ thực vật"
  },
  {
    "con": "nếu một vật thể di chuyển với tốc độ không đổi",
    "re": "quỹ đạo của nó sẽ là một đường thẳng"
  },
  {
    "con": "nếu có sự va chạm giữa hai vật thể",
    "re": "năng lượng có thể được chuyển giao giữa chúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường?",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Cây xanh cần ánh sáng mặt trời để quang hợp?",
    "re": "Cây sẽ sản xuất oxy và thức ăn"
  },
  {
    "con": "Động vật cần thức ăn để sống?",
    "re": "Động vật sẽ có năng lượng để hoạt động"
  },
  {
    "con": "Trái đất quay quanh mặt trời?",
    "re": "Trái đất sẽ có các mùa khác nhau"
  },
  {
    "con": "Nước có thể tồn tại ở ba trạng thái: rắn, lỏng và khí?",
    "re": "Nước sẽ thay đổi trạng thái tùy thuộc vào nhiệt độ"
  },
  {
    "con": "Khi một vật nóng lên, nó sẽ nở ra?",
    "re": "Vật sẽ chiếm không gian lớn hơn"
  },
  {
    "con": "Sự sống cần nước để tồn tại?",
    "re": "Các sinh vật sẽ phát triển và sinh sản"
  },
  {
    "con": "Khi ánh sáng đi qua một lăng kính, nó sẽ bị khúc xạ?",
    "re": "Ánh sáng sẽ tạo ra cầu vồng"
  },
  {
    "con": "Khi có lực tác động lên một vật, vật đó sẽ chuyển động?",
    "re": "Vật sẽ thay đổi vị trí hoặc trạng thái"
  },
  {
    "con": "Các loài động vật có thể thích nghi với môi trường sống của chúng?",
    "re": "Chúng sẽ tồn tại và phát triển tốt hơn"
  },
  {
    "con": "Cần làm để phòng tránh tai nạn khi đi xe đạp?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cơ quan nào trong cơ thể quyết định giới tính của mỗi người?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có nhiệt độ 0 độ C thì trạng thái của nó là gì?",
    "re": "Nước sẽ ở trạng thái rắn (đá)"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, thì nó sẽ làm gì?",
    "re": "Vật thể sẽ rơi xuống đất do trọng lực"
  },
  {
    "con": "Khi cây xanh quang hợp, thì nó sẽ tạo ra gì?",
    "re": "Cây sẽ tạo ra oxy và glucose"
  },
  {
    "con": "Nếu một chất được đun nóng, thì thể tích của nó sẽ thay đổi như thế nào?",
    "re": "Thể tích của chất sẽ tăng lên"
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính, thì nó sẽ xảy ra hiện tượng gì?",
    "re": "Ánh sáng sẽ bị khúc xạ và phân tách thành các màu sắc khác nhau"
  },
  {
    "con": "Nếu một động vật có xương sống, thì nó thuộc nhóm nào?",
    "re": "Động vật có xương sống thuộc nhóm động vật cao cấp"
  },
  {
    "con": "Khi nước bay hơi, thì nó chuyển sang trạng thái nào?",
    "re": "Nước chuyển sang trạng thái khí (hơi nước)"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác, thì lực hấp dẫn giữa chúng sẽ như thế nào?",
    "re": "Lực hấp dẫn sẽ mạnh hơn"
  },
  {
    "con": "Khi một chất thay đổi từ trạng thái rắn sang lỏng, thì quá trình này gọi là gì?",
    "re": "Quá trình này gọi là nóng chảy"
  },
  {
    "con": "Nước được làm nóng đến nhiệt độ sôi",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Một vật thể có khối lượng lớn hơn không khí",
    "re": "Vật thể sẽ chìm xuống"
  },
  {
    "con": "Cây xanh nhận ánh sáng mặt trời",
    "re": "Cây sẽ thực hiện quá trình quang hợp"
  },
  {
    "con": "Một chất được hòa tan trong nước",
    "re": "Chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Một vật thể được thả từ độ cao",
    "re": "Vật thể sẽ rơi xuống đất do trọng lực"
  },
  {
    "con": "Nhiệt độ giảm xuống dưới 0 độ C",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Một động vật sống trong môi trường nước",
    "re": "Động vật đó sẽ có khả năng bơi lội"
  },
  {
    "con": "Một chất có tính axit",
    "re": "Chất đó sẽ có khả năng làm đổi màu giấy chỉ thị pH"
  },
  {
    "con": "Một nguồn năng lượng được sử dụng để phát điện",
    "re": "Nguồn năng lượng đó sẽ tạo ra điện năng"
  },
  {
    "con": "Một hệ sinh thái có nhiều loài khác nhau",
    "re": "Hệ sinh thái đó sẽ có sự cân bằng sinh học"
  },
  {
    "con": "Tác nhân gây ra bệnh sốt xuất huyết là?",
    "re": "Virus dengue"
  },
  {
    "con": "Nước sôi ở nhiệt độ bao nhiêu độ C?",
    "re": "100 độ C"
  },
  {
    "con": "Thực vật cần những yếu tố nào để quang hợp?",
    "re": "Ánh sáng, nước và carbon dioxide"
  },
  {
    "con": "Trái đất quay quanh mặt trời trong bao lâu?",
    "re": "Một năm"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C, nước sẽ làm gì?",
    "re": "Đóng băng thành băng"
  },
  {
    "con": "Các loài động vật có xương sống bao gồm những nhóm nào?",
    "re": "Cá, lưỡng cư, bò sát, chim và thú"
  },
  {
    "con": "Khi ánh sáng đi qua một lăng kính, nó sẽ làm gì?",
    "re": "Bị khúc xạ và phân tán thành các màu sắc khác nhau"
  },
  {
    "con": "Sự chuyển động của các mảnh đất trong lòng đất gọi là gì?",
    "re": "Địa chấn"
  },
  {
    "con": "Năng lượng mặt trời có thể được chuyển đổi thành năng lượng nào?",
    "re": "Năng lượng điện"
  },
  {
    "con": "Khi một vật nóng chạm vào một vật lạnh, điều gì xảy ra?",
    "re": "Nhiệt độ của vật nóng giảm và nhiệt độ của vật lạnh tăng"
  },
  {
    "con": "Kim loại hay hợp kim nào dẫn điện và dẫn nhiệt tốt nhất?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước ở trạng thái lỏng sẽ chuyển thành hơi nước khi nhiệt độ đạt 100 độ C?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật được thả từ độ cao, thì vật đó sẽ rơi xuống đất do lực hấp dẫn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu cây xanh không có ánh sáng mặt trời, thì cây sẽ không thể quang hợp?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có nhiệt độ cao hơn chất khác, thì chất đó sẽ truyền nhiệt cho chất kia?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn, thì nó sẽ có trọng lực lớn hơn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu không có không khí, thì âm thanh sẽ không thể truyền đi?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất thay đổi trạng thái từ rắn sang lỏng, thì quá trình này gọi là nóng chảy?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật di chuyển với tốc độ không đổi, thì quãng đường đi được sẽ tỉ lệ thuận với thời gian?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7, thì chất đó được coi là axit?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước ở trạng thái lỏng có thể chuyển thành hơi nước khi được đun nóng:",
    "re": "Quá trình bay hơi xảy ra"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời, nước và chất dinh dưỡng để phát triển:",
    "re": "Chúng sẽ quang hợp và sinh trưởng tốt"
  },
  {
    "con": "Khi một vật thể được thả từ độ cao, nó sẽ rơi xuống đất:",
    "re": "Do tác động của lực hấp dẫn"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C, nước sẽ đóng băng:",
    "re": "Hình thành băng hoặc đá"
  },
  {
    "con": "Khi một chất rắn được nung nóng, nó sẽ giãn nở:",
    "re": "Thể tích của chất rắn sẽ tăng lên"
  },
  {
    "con": "Khi có ánh sáng chiếu vào một vật thể, nó có thể phản xạ ánh sáng:",
    "re": "Vật thể sẽ trở nên có thể nhìn thấy"
  },
  {
    "con": "Khi một chất lỏng được khuấy đều, các phân tử của nó sẽ phân tán đồng đều:",
    "re": "Chất lỏng sẽ có tính chất đồng nhất"
  },
  {
    "con": "Khi một vật thể di chuyển nhanh hơn âm thanh, nó sẽ tạo ra sóng xung:",
    "re": "Hiện tượng siêu âm xảy ra"
  },
  {
    "con": "Khi một cây xanh bị thiếu nước, lá của nó sẽ héo:",
    "re": "Cây sẽ không thể quang hợp hiệu quả"
  },
  {
    "con": "Khi một chất hóa học phản ứng với một chất khác, có thể tạo ra sản phẩm mới:",
    "re": "Phản ứng hóa học xảy ra"
  },
  {
    "con": "Bệnh sốt rét do muỗi nào truyền bệnh?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào?",
    "re": "100 độ C ở áp suất 1 atm"
  },
  {
    "con": "Thực vật cần yếu tố nào để quang hợp?",
    "re": "Ánh sáng mặt trời, nước và carbon dioxide"
  },
  {
    "con": "Động vật nào có khả năng bay?",
    "re": "Chim và một số loài côn trùng"
  },
  {
    "con": "Năng lượng mặt trời được chuyển đổi thành năng lượng nào trong thực vật?",
    "re": "Năng lượng hóa học"
  },
  {
    "con": "Khi nước đông lại, nó sẽ trở thành gì?",
    "re": "Đá"
  },
  {
    "con": "Sự thay đổi nào xảy ra khi nhiệt độ giảm?",
    "re": "Chất khí có thể ngưng tụ thành chất lỏng"
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính, nó sẽ xảy ra hiện tượng gì?",
    "re": "Khúc xạ ánh sáng"
  },
  {
    "con": "Động vật nào sống dưới nước và có thể thở bằng mang?",
    "re": "Cá"
  },
  {
    "con": "Khi một vật nóng chạm vào một vật lạnh, điều gì xảy ra?",
    "re": "Nhiệt độ của vật nóng giảm và nhiệt độ của vật lạnh tăng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào?",
    "re": "Câu trả lời đúng là 100 độ C ở áp suất khí quyển bình thường"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để làm gì?",
    "re": "Chúng cần để thực hiện quá trình quang hợp"
  },
  {
    "con": "Khi nhiệt độ giảm, thể tích của khí sẽ như thế nào?",
    "re": "Thể tích của khí sẽ giảm theo quy luật Charles"
  },
  {
    "con": "Sự chuyển động của các hành tinh quanh mặt trời là do đâu?",
    "re": "Là do lực hấp dẫn giữa các hành tinh và mặt trời"
  },
  {
    "con": "Khi một vật nóng chạm vào một vật lạnh, điều gì xảy ra?",
    "re": "Nhiệt sẽ truyền từ vật nóng sang vật lạnh cho đến khi đạt được cân bằng nhiệt"
  },
  {
    "con": "Khi nước bị đông lại, nó sẽ làm gì?",
    "re": "Nó sẽ mở rộng thể tích và trở thành băng"
  },
  {
    "con": "Sự sống trên trái đất phụ thuộc vào yếu tố nào?",
    "re": "Phụ thuộc vào nước, ánh sáng mặt trời và không khí"
  },
  {
    "con": "Khi có ánh sáng chiếu vào một vật, điều gì xảy ra?",
    "re": "Vật đó sẽ phản xạ hoặc hấp thụ ánh sáng"
  },
  {
    "con": "Khi một chất bị đun nóng, điều gì xảy ra với các phân tử của nó?",
    "re": "Các phân tử sẽ di chuyển nhanh hơn và xa nhau hơn"
  },
  {
    "con": "Khi một vật rơi tự do, nó chịu tác động của lực nào?",
    "re": "Chịu tác động của trọng lực"
  },
  {
    "con": "Nên làm gì để giữ vệ sinh cơ thể ở tuổi dậy thì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp",
    "re": "Chúng sẽ sản xuất ra oxy và glucose"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, nó sẽ rơi xuống đất",
    "re": "Vật thể sẽ chịu tác động của trọng lực"
  },
  {
    "con": "Khi nhiệt độ giảm, các phân tử trong chất rắn sẽ di chuyển chậm lại",
    "re": "Chất rắn sẽ trở nên cứng hơn"
  },
  {
    "con": "Nếu một chất hòa tan trong nước, nó sẽ tạo thành dung dịch",
    "re": "Dung dịch sẽ có tính chất khác với chất ban đầu"
  },
  {
    "con": "Khi có ánh sáng chiếu vào một vật thể, nó có thể bị phản xạ hoặc hấp thụ",
    "re": "Vật thể sẽ có màu sắc khác nhau tùy thuộc vào cách nó tương tác với ánh sáng"
  },
  {
    "con": "Nếu một động vật không có thức ăn, nó sẽ không thể sống sót",
    "re": "Động vật sẽ chết nếu không có nguồn dinh dưỡng"
  },
  {
    "con": "Khi nước đóng băng, nó sẽ trở thành đá",
    "re": "Thể tích của nước sẽ tăng lên khi chuyển sang trạng thái rắn"
  },
  {
    "con": "Nếu một chất bị đun nóng, nó sẽ nở ra",
    "re": "Khối lượng riêng của chất sẽ giảm"
  },
  {
    "con": "Nước ở trạng thái lỏng sẽ chuyển thành hơi nước khi nhiệt độ tăng lên.",
    "re": "Quá trình bay hơi xảy ra."
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để thực hiện quá trình quang hợp.",
    "re": "Chúng sản xuất ra oxy và glucose."
  },
  {
    "con": "Khi một vật thể được thả từ độ cao, nó sẽ rơi xuống đất.",
    "re": "Sự tác động của trọng lực xảy ra."
  },
  {
    "con": "Nếu một chất được đun nóng, nó sẽ mở rộng ra.",
    "re": "Khối lượng riêng của chất đó sẽ giảm."
  },
  {
    "con": "Khi có điện chạy qua dây dẫn, nó sẽ tạo ra từ trường.",
    "re": "Hiện tượng điện từ xảy ra."
  },
  {
    "con": "Nếu một sinh vật không có nước trong thời gian dài, nó sẽ chết.",
    "re": "Nước là yếu tố sống còn cho tất cả sinh vật."
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính, nó sẽ bị khúc xạ.",
    "re": "Ánh sáng sẽ phân tán thành các màu sắc khác nhau."
  },
  {
    "con": "Nếu một vật thể có khối lượng lớn hơn vật thể khác, nó sẽ có lực hấp dẫn mạnh hơn.",
    "re": "Lực hấp dẫn tỷ lệ thuận với khối lượng."
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới điểm đóng băng, nước sẽ chuyển thành băng.",
    "re": "Quá trình đông đặc xảy ra."
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường không có oxy, nó sẽ không thể hô hấp.",
    "re": "Sinh vật đó sẽ không thể sống sót."
  },
  {
    "con": "Loại nào là chất đốt ở thể lỏng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào ở mức áp suất tiêu chuẩn?",
    "re": "100 độ C"
  },
  {
    "con": "Nếu một vật nặng hơn rơi từ độ cao, thì nó sẽ có tốc độ lớn hơn khi chạm đất.",
    "re": "Tốc độ lớn hơn"
  },
  {
    "con": "Nếu ánh sáng đi qua một lăng kính, thì nó sẽ bị tán sắc thành nhiều màu.",
    "re": "Bị tán sắc thành nhiều màu"
  },
  {
    "con": "Nếu cây xanh không có ánh sáng mặt trời, thì nó sẽ không thể quang hợp.",
    "re": "Không thể quang hợp"
  },
  {
    "con": "Nếu một chất có mật độ lớn hơn nước, thì nó sẽ chìm trong nước.",
    "re": "Chìm trong nước"
  },
  {
    "con": "Nếu không có không khí, thì lửa sẽ không thể cháy.",
    "re": "Không thể cháy"
  },
  {
    "con": "Nếu một vật được làm nóng, thì nó sẽ nở ra.",
    "re": "Nở ra"
  },
  {
    "con": "Nếu một con vật có xương sống, thì nó thuộc nhóm động vật có xương.",
    "re": "Thuộc nhóm động vật có xương"
  },
  {
    "con": "Nếu một chất có thể hòa tan trong nước, thì nó được gọi là chất tan.",
    "re": "Chất tan"
  },
  {
    "con": "Vật nào dưới đây hoạt động được nhờ sử dụng năng lượng gió?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được đun sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường?",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, nó sẽ rơi xuống đất?",
    "re": "Vật thể sẽ chịu tác động của trọng lực"
  },
  {
    "con": "Nếu cây xanh không nhận đủ ánh sáng mặt trời?",
    "re": "Cây sẽ không thể thực hiện quá trình quang hợp"
  },
  {
    "con": "Nếu một chất lỏng được làm lạnh đến nhiệt độ đông đặc?",
    "re": "Chất lỏng sẽ chuyển thành trạng thái rắn"
  },
  {
    "con": "Nếu một vật thể có khối lượng lớn hơn, nó sẽ có trọng lực lớn hơn?",
    "re": "Trọng lực của vật thể sẽ tăng lên"
  },
  {
    "con": "Nếu một con vật có bộ lông dày?",
    "re": "Con vật sẽ có khả năng chịu lạnh tốt hơn"
  },
  {
    "con": "Nếu một chất được hòa tan trong nước?",
    "re": "Chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Nếu một nguồn năng lượng được sử dụng để phát điện?",
    "re": "Năng lượng sẽ được chuyển đổi thành điện năng"
  },
  {
    "con": "Nếu một con vật sống trong môi trường nước?",
    "re": "Con vật sẽ có các đặc điểm thích nghi với nước"
  },
  {
    "con": "Tài nguyên thiên nhiên là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào?",
    "re": "100 độ C ở áp suất khí quyển bình thường"
  },
  {
    "con": "Thực vật cần gì để quang hợp?",
    "re": "Ánh sáng mặt trời, nước và carbon dioxide"
  },
  {
    "con": "Trái đất quay quanh mặt trời trong bao lâu?",
    "re": "Khoảng 365 ngày"
  },
  {
    "con": "Sự sống bắt đầu từ đâu?",
    "re": "Tế bào"
  },
  {
    "con": "Khí nào chiếm phần lớn trong bầu khí quyển của trái đất?",
    "re": "Nitơ"
  },
  {
    "con": "Động vật có xương sống là gì?",
    "re": "Những động vật có bộ xương bên trong"
  },
  {
    "con": "Năng lượng mặt trời có thể được chuyển đổi thành năng lượng nào?",
    "re": "Năng lượng điện"
  },
  {
    "con": "Sự thay đổi trạng thái của nước từ lỏng sang hơi gọi là gì?",
    "re": "Bay hơi"
  },
  {
    "con": "Tại sao cây cối cần đất?",
    "re": "Để hấp thụ nước và chất dinh dưỡng"
  },
  {
    "con": "Yếu tố nào được nêu ra dưới đây có thể làm ô nhiễm nước?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, thì nó sẽ rơi xuống đất do lực hấp dẫn?",
    "re": "Đúng"
  },
  {
    "con": "Nếu cây xanh nhận đủ ánh sáng mặt trời, nước và chất dinh dưỡng, thì nó sẽ phát triển tốt?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một chất có mật độ lớn hơn nước, thì nó sẽ chìm trong nước?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một vật thể được làm từ kim loại, thì nó thường dẫn điện tốt hơn so với vật liệu phi kim loại?",
    "re": "Đúng"
  },
  {
    "con": "Nếu có sự thay đổi nhiệt độ, thì trạng thái của chất có thể thay đổi từ rắn sang lỏng hoặc từ lỏng sang khí?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, thì nó cần oxy để tồn tại?",
    "re": "Đúng"
  },
  {
    "con": "Nếu ánh sáng mặt trời chiếu vào một bề mặt tối, thì bề mặt đó sẽ hấp thụ nhiệt nhiều hơn so với bề mặt sáng?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra, thì các chất ban đầu sẽ biến đổi thành các chất mới?",
    "re": "Đúng"
  },
  {
    "con": "Nước được làm nóng đến 100 độ C",
    "re": "Nước sẽ sôi"
  },
  {
    "con": "Một vật thể được thả từ độ cao",
    "re": "Vật thể sẽ rơi xuống đất do trọng lực"
  },
  {
    "con": "Thực vật nhận ánh sáng mặt trời",
    "re": "Thực vật sẽ thực hiện quá trình quang hợp"
  },
  {
    "con": "Một chất rắn được nung nóng",
    "re": "Chất rắn có thể chuyển thành chất lỏng"
  },
  {
    "con": "Một con vật không có xương sống",
    "re": "Con vật đó thuộc nhóm động vật không xương sống"
  },
  {
    "con": "Một chất có thể hòa tan trong nước",
    "re": "Chất đó được gọi là chất tan"
  },
  {
    "con": "Một vật thể có khối lượng lớn hơn không khí",
    "re": "Vật thể đó sẽ không bay lên"
  },
  {
    "con": "Một phản ứng hóa học xảy ra",
    "re": "Sẽ có sự thay đổi về năng lượng và chất"
  },
  {
    "con": "Một con vật có lông và đẻ con",
    "re": "Con vật đó thuộc nhóm động vật có vú"
  },
  {
    "con": "Một nguồn năng lượng được sử dụng để phát điện",
    "re": "Nguồn năng lượng đó có thể là năng lượng gió hoặc năng lượng mặt trời"
  },
  {
    "con": "Hổ thường sinh sản vào mùa nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào dưới áp suất khí quyển bình thường?",
    "re": "100 độ C"
  },
  {
    "con": "Cây xanh sản xuất oxy qua quá trình nào?",
    "re": "Quang hợp"
  },
  {
    "con": "Trái đất quay quanh mặt trời trong bao lâu?",
    "re": "Một năm"
  },
  {
    "con": "Khi nhiệt độ giảm, chất khí sẽ làm gì?",
    "re": "Co lại"
  },
  {
    "con": "Sự chuyển động của các hành tinh trong hệ mặt trời được gọi là gì?",
    "re": "Quỹ đạo"
  },
  {
    "con": "Khi ánh sáng đi qua nước, nó sẽ làm gì?",
    "re": "Bị khúc xạ"
  },
  {
    "con": "Động vật nào có khả năng bay?",
    "re": "Chim"
  },
  {
    "con": "Năng lượng mặt trời được chuyển đổi thành năng lượng hóa học trong cây qua quá trình nào?",
    "re": "Quang hợp"
  },
  {
    "con": "Khi nước đông lại, nó sẽ làm gì?",
    "re": "Mở rộng"
  },
  {
    "con": "Chim và thú đều có bản năng gì trong quá trình nuôi con?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước nóng và nước lạnh có nhiệt độ khác nhau?",
    "re": "Nước nóng có nhiệt độ cao hơn nước lạnh"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp?",
    "re": "Thực vật sẽ sản xuất oxy và năng lượng"
  },
  {
    "con": "Động vật có xương sống và động vật không xương sống có cấu trúc cơ thể khác nhau?",
    "re": "Động vật có xương sống có hệ thống xương và cơ bắp phát triển hơn"
  },
  {
    "con": "Nước có thể tồn tại ở ba trạng thái khác nhau?",
    "re": "Nước có thể tồn tại dưới dạng rắn, lỏng và khí"
  },
  {
    "con": "Thực phẩm có chứa vitamin và khoáng chất cần thiết cho cơ thể?",
    "re": "Cơ thể sẽ hoạt động tốt hơn và khỏe mạnh hơn"
  },
  {
    "con": "Sự thay đổi thời tiết có thể ảnh hưởng đến môi trường sống của động vật?",
    "re": "Động vật có thể phải di chuyển hoặc thay đổi hành vi để thích nghi"
  },
  {
    "con": "Năng lượng mặt trời có thể được chuyển đổi thành điện năng?",
    "re": "Điện năng có thể được sử dụng để cung cấp năng lượng cho các thiết bị"
  },
  {
    "con": "Các loài động vật khác nhau có thể sống trong các môi trường khác nhau?",
    "re": "Mỗi loài sẽ có những đặc điểm thích nghi riêng để sinh tồn"
  },
  {
    "con": "Sự phân hủy của chất hữu cơ có thể tạo ra dinh dưỡng cho đất?",
    "re": "Đất sẽ trở nên màu mỡ hơn và hỗ trợ sự phát triển của thực vật"
  },
  {
    "con": "Yếu tố nào làm ô nhiễm nguồn nước ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào ở áp suất khí quyển bình thường ?",
    "re": "100 độ C"
  },
  {
    "con": "Thực vật cần yếu tố nào để quang hợp ?",
    "re": "Ánh sáng mặt trời"
  },
  {
    "con": "Khi nhiệt độ tăng, thể tích của khí sẽ như thế nào ?",
    "re": "Tăng lên"
  },
  {
    "con": "Sự chuyển động của các vật thể chịu tác động của lực nào ?",
    "re": "Lực tác động"
  },
  {
    "con": "Khi nước đóng băng, thể tích của nó sẽ như thế nào ?",
    "re": "Tăng lên"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nó sẽ như thế nào ?",
    "re": "Bị khúc xạ"
  },
  {
    "con": "Khi một vật nóng chạm vào một vật lạnh, nhiệt sẽ di chuyển như thế nào ?",
    "re": "Từ vật nóng sang vật lạnh"
  },
  {
    "con": "Khi có sự thay đổi nhiệt độ, trạng thái của nước có thể chuyển từ dạng nào sang dạng nào ?",
    "re": "Từ lỏng sang hơi hoặc từ lỏng sang rắn"
  },
  {
    "con": "Khi một vật rơi tự do, nó sẽ chịu tác động của lực nào ?",
    "re": "Lực hấp dẫn"
  },
  {
    "con": "Nước ở trạng thái lỏng khi nhiệt độ trên 0 độ C?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Động vật có xương sống có hệ thống tuần hoàn kín?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trái đất quay quanh mặt trời trong một năm?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khí carbon dioxide cần thiết cho quá trình quang hợp?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Năng lượng mặt trời là nguồn năng lượng tái tạo?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ của nước sôi là 100 độ C ở áp suất bình thường?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sự sống trên trái đất phụ thuộc vào nước?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các loài động vật khác nhau có thể sống trong các môi trường khác nhau?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sự phân hủy là quá trình tự nhiên giúp tái chế chất dinh dưỡng trong đất?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ bao nhiêu độ C ở áp suất khí quyển bình thường?",
    "re": "100 độ C"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn thì lực hấp dẫn tác động lên nó sẽ như thế nào?",
    "re": "Lực hấp dẫn sẽ lớn hơn"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, hiện tượng gì xảy ra?",
    "re": "Ánh sáng bị khúc xạ"
  },
  {
    "con": "Nếu một cây xanh không nhận đủ ánh sáng mặt trời, điều gì sẽ xảy ra?",
    "re": "Cây sẽ không phát triển tốt"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C, nước sẽ chuyển thành trạng thái gì?",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Nếu một vật di chuyển với tốc độ không đổi, thì quãng đường đi được sẽ như thế nào?",
    "re": "Quãng đường đi được sẽ tỉ lệ thuận với thời gian"
  },
  {
    "con": "Khi một chất rắn được nung nóng, điều gì sẽ xảy ra với các phân tử của nó?",
    "re": "Các phân tử sẽ di chuyển nhanh hơn và xa nhau hơn"
  },
  {
    "con": "Nếu một sinh vật không có khả năng thích nghi với môi trường sống của nó, điều gì sẽ xảy ra?",
    "re": "Sinh vật đó có thể bị tuyệt chủng"
  },
  {
    "con": "Khi một chất lỏng bay hơi, điều gì xảy ra với nhiệt độ của chất lỏng đó?",
    "re": "Nhiệt độ của chất lỏng sẽ giảm"
  },
  {
    "con": "Nếu một nguồn sáng được che khuất, điều gì sẽ xảy ra với bóng của nó?",
    "re": "Bóng sẽ xuất hiện và có hình dạng tương ứng với nguồn sáng"
  },
  {
    "con": "Vật nào sau đây dùng để làm cầu bắc qua sông, làm đường ray tàu hỏa?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được làm nóng đến 100 độ C ở áp suất bình thường?",
    "re": "Nước sẽ sôi"
  },
  {
    "con": "Một vật thể được thả từ độ cao, không có lực cản?",
    "re": "Vật thể sẽ rơi tự do"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt, chỉ có thể chuyển đổi từ dạng này sang dạng khác?",
    "re": "Đó là định luật bảo toàn năng lượng"
  },
  {
    "con": "Một cây xanh có thể quang hợp trong ánh sáng mặt trời?",
    "re": "Cây sẽ sản xuất oxy"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C, nước sẽ đông lại?",
    "re": "Nước sẽ chuyển thành băng"
  },
  {
    "con": "Khi một vật thể di chuyển nhanh hơn âm thanh?",
    "re": "Vật thể sẽ tạo ra sóng xung kích"
  },
  {
    "con": "Khi một chất lỏng được đun nóng, thể tích của nó sẽ tăng lên?",
    "re": "Chất lỏng sẽ giãn nở"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nó sẽ bị khúc xạ?",
    "re": "Ánh sáng sẽ thay đổi hướng"
  },
  {
    "con": "Một động vật có xương sống và có khả năng bay?",
    "re": "Đó là một loài chim"
  },
  {
    "con": "Nước được cấu tạo từ hai nguyên tố là gì?",
    "re": "Hydro và Oxy"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, thì nó sẽ rơi xuống đất do lực nào?",
    "re": "Lực hấp dẫn"
  },
  {
    "con": "Nếu cây xanh không có ánh sáng mặt trời, thì nó sẽ như thế nào?",
    "re": "Không thể quang hợp và sẽ chết"
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên, thì thể tích của chất đó sẽ ra sao?",
    "re": "Thể tích sẽ tăng lên (đối với chất lỏng và khí)"
  },
  {
    "con": "Nếu một con vật có xương sống, thì nó thuộc nhóm nào?",
    "re": "Động vật có xương sống"
  },
  {
    "con": "Nếu một chất không hòa tan trong nước, thì nó được gọi là gì?",
    "re": "Chất không tan"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra, thì điều gì sẽ xảy ra với các nguyên tố ban đầu?",
    "re": "Chúng sẽ tạo ra các hợp chất mới"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, thì nó có thể có đặc điểm gì?",
    "re": "Có thể có mang hoặc vây"
  },
  {
    "con": "Nếu ánh sáng mặt trời chiếu vào một vật thể màu đen, thì vật thể đó sẽ như thế nào?",
    "re": "Nó sẽ hấp thụ nhiều nhiệt"
  },
  {
    "con": "Nếu một chất rắn được làm nóng, thì nó có thể xảy ra hiện tượng gì?",
    "re": "Chất rắn có thể chuyển thành chất lỏng"
  },
  {
    "con": "Thông tin sau đây nói về lứa tuổi nào?\n\"Ở lứa tuổi này chiều cao vẫn tiếp tục tăng. Hoạt động học tập của chúng ta ngày càng tăng, trí nhớ và suy nghĩ ngày càng phát triển.\"",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được đun sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái hơi"
  },
  {
    "con": "Khi ánh sáng mặt trời chiếu vào một vật thể màu xanh",
    "re": "Vật thể sẽ hấp thụ tất cả các màu sắc khác và phản xạ màu xanh"
  },
  {
    "con": "Khi một vật thể được thả từ độ cao, nó sẽ rơi xuống đất",
    "re": "Vật thể sẽ chịu tác động của trọng lực"
  },
  {
    "con": "Nếu một cây xanh không nhận đủ ánh sáng mặt trời",
    "re": "Cây sẽ không phát triển tốt và có thể chết"
  },
  {
    "con": "Khi nước bị đông lạnh ở nhiệt độ 0 độ C",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái rắn"
  },
  {
    "con": "Nếu một động vật không có thức ăn trong thời gian dài",
    "re": "Động vật sẽ bị đói và có thể chết"
  },
  {
    "con": "Khi một chất rắn được hòa tan trong nước",
    "re": "Chất rắn sẽ phân tán và tạo thành dung dịch"
  },
  {
    "con": "Nếu một cây được tưới nước đầy đủ",
    "re": "Cây sẽ phát triển mạnh mẽ và xanh tốt"
  },
  {
    "con": "Khi một vật thể nóng chạm vào một vật thể lạnh",
    "re": "Nhiệt độ sẽ truyền từ vật thể nóng sang vật thể lạnh"
  },
  {
    "con": "Kim loại nào có màu trắng bạc, có ánh kim, dẫn điện, dẫn nhiệt tốt, không bị gỉ nhưng bị một số a-xít ăn mòn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được làm nóng đến 100 độ C ở áp suất bình thường.",
    "re": "Nước sẽ sôi"
  },
  {
    "con": "Một vật thể được thả từ độ cao nhất định trong không khí.",
    "re": "Vật thể sẽ rơi xuống đất do trọng lực"
  },
  {
    "con": "Một cây xanh được cung cấp đủ ánh sáng mặt trời, nước và chất dinh dưỡng.",
    "re": "Cây sẽ quang hợp và phát triển"
  },
  {
    "con": "Một chất rắn được nung nóng đến nhiệt độ cao.",
    "re": "Chất rắn sẽ chuyển thành chất lỏng"
  },
  {
    "con": "Một con vật sống trong môi trường nước và có thể thở bằng mang.",
    "re": "Con vật đó là một loài thủy sinh"
  },
  {
    "con": "Một chất lỏng có nhiệt độ thấp hơn điểm đông đặc của nó.",
    "re": "Chất lỏng sẽ đông lại thành rắn"
  },
  {
    "con": "Một nguồn sáng chiếu vào một vật thể không trong suốt.",
    "re": "Vật thể sẽ tạo ra bóng tối"
  },
  {
    "con": "Một hệ sinh thái có sự cân bằng giữa các loài động thực vật.",
    "re": "Hệ sinh thái sẽ phát triển bền vững"
  },
  {
    "con": "Một chất có khả năng hòa tan trong nước.",
    "re": "Chất đó được gọi là chất tan"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp",
    "re": "Chúng sản xuất ra oxy và glucose"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Các loài động vật sống trong môi trường nước",
    "re": "Chúng có thể thở bằng mang hoặc phổi tùy thuộc vào loài"
  },
  {
    "con": "Khi một vật bị đẩy hoặc kéo",
    "re": "Nó sẽ di chuyển theo hướng của lực tác động"
  },
  {
    "con": "Khi ánh sáng đi qua một lăng kính",
    "re": "Nó sẽ bị khúc xạ và tạo ra cầu vồng"
  },
  {
    "con": "Khi một chất bị đun nóng",
    "re": "Nó sẽ nở ra và có thể thay đổi trạng thái"
  },
  {
    "con": "Các loài động vật có xương sống",
    "re": "Chúng có cấu trúc cơ thể phức tạp hơn so với động vật không xương sống"
  },
  {
    "con": "Khi một vật rơi tự do",
    "re": "Nó sẽ chịu tác động của trọng lực và tăng tốc"
  },
  {
    "con": "Khi có sự thay đổi trong môi trường",
    "re": "Các sinh vật có thể thích nghi hoặc bị ảnh hưởng đến sự sống còn"
  },
  {
    "con": "Các hợp kim của sắt là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước ở trạng thái lỏng khi nhiệt độ trên 0 độ C?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cây xanh cần ánh sáng mặt trời để quang hợp?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Động vật có xương sống có cấu trúc cơ thể phức tạp hơn động vật không xương sống?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhiệt độ giảm, chất khí sẽ co lại?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trái đất quay quanh mặt trời trong một năm?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Năng lượng mặt trời là nguồn năng lượng tái tạo?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sự sống trên trái đất phụ thuộc vào nước?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các loài động vật khác nhau có thể sống trong các môi trường khác nhau?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sự bay hơi xảy ra khi nước chuyển từ trạng thái lỏng sang khí?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Thực vật có thể sản xuất oxy thông qua quá trình quang hợp?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào?",
    "re": "100 độ C ở áp suất khí quyển bình thường"
  },
  {
    "con": "Cây xanh cần gì để quang hợp?",
    "re": "Ánh sáng mặt trời, nước và carbon dioxide"
  },
  {
    "con": "Trái đất quay quanh mặt trời trong bao lâu?",
    "re": "Khoảng 365 ngày"
  },
  {
    "con": "Sự sống trên trái đất phụ thuộc vào yếu tố nào?",
    "re": "Nước, không khí, ánh sáng và nhiệt độ"
  },
  {
    "con": "Động vật có xương sống có đặc điểm gì?",
    "re": "Có một bộ xương bên trong"
  },
  {
    "con": "Khi nhiệt độ giảm, chất khí sẽ làm gì?",
    "re": "Co lại và mật độ tăng lên"
  },
  {
    "con": "Tại sao bầu trời có màu xanh?",
    "re": "Do ánh sáng mặt trời bị tán xạ bởi không khí"
  },
  {
    "con": "Sự chuyển động của các hành tinh trong hệ mặt trời là gì?",
    "re": "Quay quanh mặt trời theo quỹ đạo"
  },
  {
    "con": "Năng lượng mặt trời có thể được sử dụng để làm gì?",
    "re": "Sản xuất điện và làm nóng nước"
  },
  {
    "con": "Thực vật hấp thụ nước qua bộ phận nào?",
    "re": "Rễ"
  },
  {
    "con": "Sự phân hủy là gì?",
    "re": "Quá trình phân hủy chất hữu cơ thành các chất đơn giản hơn"
  },
  {
    "con": "Tuổi dậy thì là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cần đối xử với người nhiễm HIV như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào?",
    "re": "100 độ C ở áp suất 1 atm"
  },
  {
    "con": "Thực vật cần gì để quang hợp?",
    "re": "Ánh sáng mặt trời, nước và carbon dioxide"
  },
  {
    "con": "Khi nhiệt độ giảm, thì trạng thái của nước sẽ thay đổi như thế nào?",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái rắn (đóng băng)"
  },
  {
    "con": "Khi có ánh sáng chiếu vào một vật thể, thì vật thể đó sẽ làm gì?",
    "re": "Vật thể sẽ phản xạ hoặc hấp thụ ánh sáng"
  },
  {
    "con": "Khi một vật thể di chuyển nhanh hơn âm thanh, thì nó sẽ tạo ra hiện tượng gì?",
    "re": "Hiện tượng siêu âm"
  },
  {
    "con": "Khi một chất rắn được nung nóng, thì nó sẽ xảy ra hiện tượng gì?",
    "re": "Chất rắn sẽ giãn nở và có thể chuyển sang trạng thái lỏng"
  },
  {
    "con": "Khi một con vật bị thương, thì nó cần được chăm sóc như thế nào?",
    "re": "Cần được điều trị và chăm sóc y tế kịp thời"
  },
  {
    "con": "Khi có sự thay đổi trong môi trường, thì sinh vật sẽ phản ứng như thế nào?",
    "re": "Sinh vật sẽ thích nghi hoặc di cư để sống sót"
  },
  {
    "con": "Khi một chất được hòa tan trong nước, thì nó sẽ tạo ra hiện tượng gì?",
    "re": "Chất đó sẽ phân tán đều trong nước tạo thành dung dịch"
  },
  {
    "con": "Nước ở nhiệt độ 0 độ C:",
    "re": "Chuyển thành băng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C:",
    "re": "Chuyển thành hơi nước"
  },
  {
    "con": "Cây xanh có lá:",
    "re": "Thực hiện quang hợp"
  },
  {
    "con": "Động vật có xương sống:",
    "re": "Có cấu trúc cơ thể phức tạp hơn"
  },
  {
    "con": "Ánh sáng mặt trời chiếu vào cây:",
    "re": "Cây sẽ sản xuất oxy"
  },
  {
    "con": "Chất rắn được đun nóng:",
    "re": "Có thể chuyển thành chất lỏng"
  },
  {
    "con": "Đất có độ ẩm cao:",
    "re": "Thích hợp cho sự phát triển của cây trồng"
  },
  {
    "con": "Sự sống cần nước:",
    "re": "Để duy trì các quá trình sinh học"
  },
  {
    "con": "Khí carbon dioxide được cây hấp thụ:",
    "re": "Giúp cây phát triển và sản xuất thực phẩm"
  },
  {
    "con": "Động vật sống trong môi trường nước:",
    "re": "Có thể thở bằng mang"
  },
  {
    "con": "Khi một em bé mới sinh ra, dựa vào cơ quan nào của cơ thể để biết đó là bé trai hay bé gái?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nước được đun sôi, nó sẽ chuyển từ trạng thái nào sang trạng thái nào?",
    "re": "Nước chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Khi cây quang hợp, nó sử dụng ánh sáng mặt trời để làm gì?",
    "re": "Cây sử dụng ánh sáng mặt trời để sản xuất thức ăn"
  },
  {
    "con": "Khi một vật thể rơi tự do, nó chịu tác động của lực nào?",
    "re": "Vật thể chịu tác động của lực hấp dẫn"
  },
  {
    "con": "Khi một con vật hô hấp, nó sử dụng cơ quan nào để lấy oxy?",
    "re": "Con vật sử dụng phổi hoặc mang để lấy oxy"
  },
  {
    "con": "Khi ánh sáng đi qua một lăng kính, nó sẽ xảy ra hiện tượng gì?",
    "re": "Ánh sáng sẽ bị khúc xạ và tạo ra cầu vồng"
  },
  {
    "con": "Khi đất bị xói mòn, nguyên nhân chính là gì?",
    "re": "Nguyên nhân chính là nước và gió"
  },
  {
    "con": "Khi một chất rắn tan trong nước, nó tạo ra hiện tượng gì?",
    "re": "Chất rắn tạo ra dung dịch"
  },
  {
    "con": "Khi một con vật di chuyển, nó sử dụng bộ phận nào của cơ thể?",
    "re": "Con vật sử dụng chân hoặc cánh để di chuyển"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C, nước sẽ xảy ra hiện tượng gì?",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào dưới áp suất khí quyển bình thường?",
    "re": "100 độ C"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để thực hiện quá trình nào?",
    "re": "Quang hợp"
  },
  {
    "con": "Khi nhiệt độ giảm, thể tích của khí sẽ như thế nào?",
    "re": "Giảm"
  },
  {
    "con": "Nếu một vật được thả từ độ cao, thì nó sẽ rơi xuống đất do lực nào?",
    "re": "Lực hấp dẫn"
  },
  {
    "con": "Khi nước chuyển từ thể lỏng sang thể hơi, quá trình này được gọi là gì?",
    "re": "Bốc hơi"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn, thì lực hấp dẫn tác động lên nó sẽ như thế nào?",
    "re": "Lớn hơn"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nó sẽ bị gì?",
    "re": "Khúc xạ"
  },
  {
    "con": "Nếu một sinh vật không có khả năng tự sản xuất thức ăn, thì nó được gọi là gì?",
    "re": "Động vật"
  },
  {
    "con": "Khi một chất rắn nóng chảy, nó sẽ chuyển sang trạng thái nào?",
    "re": "Thể lỏng"
  },
  {
    "con": "Nếu một vật di chuyển với tốc độ không đổi, thì lực tác động lên nó sẽ như thế nào?",
    "re": "Bằng 0"
  },
  {
    "con": "Hệ mặt trời bao gồm những gì?",
    "re": "Các hành tinh quay quanh Mặt Trời"
  },
  {
    "con": "HIV/AIDS lây qua con đường nào dưới đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Bệnh viêm gan A lây truyền qua đường nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào?",
    "re": "100 độ C ở áp suất khí quyển bình thường"
  },
  {
    "con": "Cây xanh cần gì để quang hợp?",
    "re": "Ánh sáng mặt trời, nước và carbon dioxide"
  },
  {
    "con": "Động vật có xương sống có đặc điểm gì?",
    "re": "Có hệ xương và tủy sống"
  },
  {
    "con": "Khi nước đóng băng, thể tích của nó sẽ như thế nào?",
    "re": "Tăng lên"
  },
  {
    "con": "Sự chuyển động của trái đất quanh mặt trời tạo ra hiện tượng gì?",
    "re": "Các mùa trong năm"
  },
  {
    "con": "Khi nhiệt độ tăng, chất rắn sẽ làm gì?",
    "re": "Nở ra"
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính, hiện tượng gì xảy ra?",
    "re": "Ánh sáng bị khúc xạ và phân tách thành các màu sắc"
  },
  {
    "con": "Khi một vật bị đẩy xuống nước, nó sẽ làm gì?",
    "re": "Bị nổi lên hoặc chìm xuống tùy thuộc vào trọng lượng riêng"
  },
  {
    "con": "Khi một chất bị đốt cháy, nó sẽ tạo ra gì?",
    "re": "Khí carbon dioxide và nhiệt"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp",
    "re": "Chúng sẽ sản xuất ra oxy và glucose"
  },
  {
    "con": "Khi một vật bị nung nóng, nó sẽ giãn nở",
    "re": "Thể tích của vật đó sẽ tăng lên"
  },
  {
    "con": "Khi có lực tác động lên một vật",
    "re": "Vật đó sẽ thay đổi vận tốc hoặc hướng chuyển động"
  },
  {
    "con": "Nếu một chất được hòa tan trong nước",
    "re": "Chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước",
    "re": "Ánh sáng sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Nếu một sinh vật không có đủ thức ăn",
    "re": "Nó sẽ không thể phát triển và sinh sản"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới điểm đóng băng",
    "re": "Nước sẽ chuyển thành băng"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác",
    "re": "Nó sẽ có trọng lực tác động mạnh hơn"
  },
  {
    "con": "Khi một chất bị đốt cháy",
    "re": "Nó sẽ phản ứng với oxy và tạo ra nhiệt và ánh sáng"
  },
  {
    "con": "Chúng ta chỉ nên dùng thuốc khi",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào?",
    "re": "100 độ C ở áp suất khí quyển bình thường"
  },
  {
    "con": "Thực vật cần những yếu tố nào để quang hợp?",
    "re": "Ánh sáng, nước, và carbon dioxide"
  },
  {
    "con": "Trái đất quay quanh mặt trời trong bao lâu?",
    "re": "Khoảng 365,25 ngày"
  },
  {
    "con": "Sự chuyển động của các vật thể phụ thuộc vào yếu tố nào?",
    "re": "Lực tác động lên chúng"
  },
  {
    "con": "Khi nhiệt độ giảm, chất khí sẽ làm gì?",
    "re": "Co lại và giảm thể tích"
  },
  {
    "con": "Động vật có xương sống có đặc điểm gì?",
    "re": "Có hệ xương và hệ thần kinh phát triển"
  },
  {
    "con": "Khi ánh sáng đi qua nước, nó sẽ làm gì?",
    "re": "Bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Sự phân hủy chất hữu cơ cần yếu tố nào?",
    "re": "Vi sinh vật và oxy"
  },
  {
    "con": "Khi một vật thể nóng lên, nó sẽ làm gì?",
    "re": "Nở ra và tăng thể tích"
  },
  {
    "con": "Năng lượng mặt trời có thể được chuyển đổi thành năng lượng nào?",
    "re": "Năng lượng điện thông qua pin mặt trời"
  },
  {
    "con": "Xi măng được làm từ những vật liệu nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái hơi"
  },
  {
    "con": "Khi ánh sáng mặt trời chiếu vào một vật thể màu xanh",
    "re": "Vật thể sẽ hấp thụ tất cả các màu sắc khác và phản xạ màu xanh"
  },
  {
    "con": "Khi một vật thể được thả từ độ cao",
    "re": "Vật thể sẽ rơi xuống do lực hấp dẫn"
  },
  {
    "con": "Khi thực vật quang hợp",
    "re": "Chúng chuyển đổi ánh sáng mặt trời thành năng lượng hóa học"
  },
  {
    "con": "Khi một chất rắn được nung nóng",
    "re": "Chất rắn sẽ giãn nở và có thể chuyển sang trạng thái lỏng"
  },
  {
    "con": "Khi một con vật sống trong môi trường nước",
    "re": "Nó sẽ có các đặc điểm thích nghi như mang hoặc vây"
  },
  {
    "con": "Khi một chất hòa tan trong nước",
    "re": "Chất đó sẽ phân tán đều trong nước tạo thành dung dịch"
  },
  {
    "con": "Khi có sự thay đổi nhiệt độ",
    "re": "Các phân tử trong chất sẽ di chuyển nhanh hơn hoặc chậm hơn"
  },
  {
    "con": "Khi một nguồn năng lượng được chuyển đổi",
    "re": "Năng lượng có thể thay đổi từ dạng này sang dạng khác, như từ năng lượng hóa học sang năng lượng điện"
  },
  {
    "con": "Khi một sinh vật chết đi",
    "re": "Nó sẽ phân hủy và trở thành chất dinh dưỡng cho đất"
  },
  {
    "con": "Sự chuyển thể nào xảy ra trong quá trình chưng cất nước ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào ở áp suất khí quyển bình thường ?",
    "re": "100 độ C"
  },
  {
    "con": "Nếu một vật được thả từ độ cao, thì nó sẽ rơi xuống đất do lực hấp dẫn.",
    "re": "Vật sẽ rơi xuống"
  },
  {
    "con": "Nếu cây xanh không có ánh sáng mặt trời, thì nó sẽ không thể quang hợp.",
    "re": "Cây sẽ không phát triển tốt"
  },
  {
    "con": "Nếu một chất được làm nóng, thì nó sẽ mở rộng.",
    "re": "Chất sẽ có thể chiếm nhiều không gian hơn"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác, thì nó sẽ có trọng lực lớn hơn.",
    "re": "Vật sẽ có sức hút mạnh hơn"
  },
  {
    "con": "Nếu nước bị đông lạnh, thì nó sẽ chuyển thành đá.",
    "re": "Nước sẽ trở thành trạng thái rắn"
  },
  {
    "con": "Nếu một con vật không có đủ thức ăn, thì nó sẽ không sống sót lâu dài.",
    "re": "Con vật sẽ bị suy yếu"
  },
  {
    "con": "Nếu một chất được hòa tan trong nước, thì nó sẽ tạo thành dung dịch.",
    "re": "Dung dịch sẽ có tính chất khác với chất rắn ban đầu"
  },
  {
    "con": "Nếu một nguồn năng lượng được sử dụng liên tục, thì nó sẽ cạn kiệt theo thời gian.",
    "re": "Nguồn năng lượng sẽ giảm dần"
  },
  {
    "con": "Sự biến đổi hóa học là gì ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường ?",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp ?",
    "re": "Thực vật sẽ sản xuất ra oxy và glucose"
  },
  {
    "con": "Đất có thể giữ nước ?",
    "re": "Đất sẽ cung cấp độ ẩm cho cây trồng"
  },
  {
    "con": "Sự hấp thụ nước của rễ cây diễn ra như thế nào ?",
    "re": "Nước sẽ được đưa lên các bộ phận khác của cây"
  },
  {
    "con": "Khi nhiệt độ giảm, chất khí sẽ co lại ?",
    "re": "Áp suất của chất khí sẽ tăng lên nếu thể tích không thay đổi"
  },
  {
    "con": "Sự phân hủy chất hữu cơ cần vi sinh vật ?",
    "re": "Chất hữu cơ sẽ được chuyển hóa thành các chất dinh dưỡng cho đất"
  },
  {
    "con": "Khi ánh sáng chiếu vào một vật thể, nó có thể bị phản xạ ?",
    "re": "Vật thể sẽ xuất hiện màu sắc khác nhau tùy thuộc vào ánh sáng"
  },
  {
    "con": "Khi có điện, bóng đèn sẽ sáng ?",
    "re": "Điện năng sẽ được chuyển đổi thành ánh sáng"
  },
  {
    "con": "Khi nước đóng băng, nó sẽ mở rộng ra ?",
    "re": "Nước sẽ trở thành đá và có thể nổi trên mặt nước"
  },
  {
    "con": "Dòng nào gồm các chất có thể tạo thành dung dịch ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được đun sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường ?",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Nếu một vật được thả từ độ cao, thì vật đó sẽ rơi xuống đất ?",
    "re": "Vật sẽ chịu tác động của trọng lực"
  },
  {
    "con": "Nếu cây nhận đủ ánh sáng mặt trời và nước, thì cây sẽ phát triển tốt ?",
    "re": "Cây sẽ quang hợp và sinh trưởng"
  },
  {
    "con": "Nếu một chất có nhiệt độ cao hơn chất khác, thì chất đó sẽ truyền nhiệt cho chất kia ?",
    "re": "Nhiệt độ của chất cao sẽ giảm xuống"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn, thì vật đó sẽ có trọng lực lớn hơn ?",
    "re": "Vật sẽ có sức hút mạnh hơn với các vật khác"
  },
  {
    "con": "Nếu một chất hòa tan trong nước, thì chất đó sẽ tạo thành dung dịch ?",
    "re": "Dung dịch sẽ có tính chất khác với chất ban đầu"
  },
  {
    "con": "Nếu một vật được làm nóng, thì thể tích của vật đó sẽ tăng lên ?",
    "re": "Vật sẽ giãn nở"
  },
  {
    "con": "Nếu một sinh vật không có đủ thức ăn, thì sinh vật đó sẽ không thể sống sót ?",
    "re": "Sinh vật sẽ bị suy yếu và có thể chết"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7, thì chất đó được coi là axit ?",
    "re": "Chất sẽ có tính axit và có thể gây ăn mòn"
  },
  {
    "con": "Để đề phòng dòng điện quá mạnh có thể gây cháy đường dây và cháy nhà, người ta lắp vào mạch điện vật gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nước được đun nóng đến 100 độ C, nó sẽ xảy ra hiện tượng gì?",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái hơi"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác, thì vật nào sẽ có trọng lực lớn hơn?",
    "re": "Vật có khối lượng lớn hơn sẽ có trọng lực lớn hơn"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nó sẽ xảy ra hiện tượng gì?",
    "re": "Ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Nếu cây xanh không nhận đủ ánh sáng mặt trời, thì cây sẽ gặp phải vấn đề gì?",
    "re": "Cây sẽ không thể quang hợp và có thể chết"
  },
  {
    "con": "Khi một chất rắn được nung nóng, nó sẽ xảy ra hiện tượng gì?",
    "re": "Chất rắn sẽ nở ra và có thể chuyển sang trạng thái lỏng"
  },
  {
    "con": "Nếu một con vật không có khả năng tự sản xuất thức ăn, thì nó thuộc loại gì?",
    "re": "Nó thuộc loại động vật ăn thịt hoặc ăn thực vật"
  },
  {
    "con": "Khi một chất lỏng được làm lạnh, nó sẽ xảy ra hiện tượng gì?",
    "re": "Chất lỏng sẽ đông lại thành chất rắn"
  },
  {
    "con": "Nếu một vật di chuyển với tốc độ không đổi, thì quãng đường đi được sẽ phụ thuộc vào yếu tố nào?",
    "re": "Quãng đường đi được sẽ phụ thuộc vào thời gian di chuyển"
  },
  {
    "con": "Khi một chất bị hòa tan trong nước, nó sẽ tạo ra hiện tượng gì?",
    "re": "Chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Nguồn năng lượng chủ yếu trên trái đất là:",
    "re": "Năng lượng mặt trời"
  },
  {
    "con": "Nước sôi ở nhiệt độ:",
    "re": "100 độ C ở áp suất khí quyển bình thường"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để:",
    "re": "quá trình quang hợp diễn ra"
  },
  {
    "con": "Trái đất quay quanh mặt trời trong khoảng thời gian:",
    "re": "365 ngày"
  },
  {
    "con": "Khi nhiệt độ giảm, chất khí sẽ:",
    "re": "co lại và mật độ tăng lên"
  },
  {
    "con": "Các loài động vật sống trong môi trường nước thường có:",
    "re": "cơ thể có vảy hoặc màng để thích nghi"
  },
  {
    "con": "Sự chuyển động của các vật thể chịu tác động của:",
    "re": "lực"
  },
  {
    "con": "Khi một vật thể nóng lên, nó sẽ:",
    "re": "nở ra"
  },
  {
    "con": "Mỗi loài sinh vật đều có:",
    "re": "một môi trường sống riêng biệt"
  },
  {
    "con": "Khi có ánh sáng chiếu vào một vật thể, vật thể đó sẽ:",
    "re": "phản xạ hoặc hấp thụ ánh sáng"
  },
  {
    "con": "Dòng nào gồm các loại cây có thể được mọc lên từ thân cây mẹ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được đun sôi ở nhiệt độ 100 độ C ở áp suất bình thường?",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Khi ánh sáng mặt trời chiếu vào một vật thể màu xanh lá cây?",
    "re": "Vật thể sẽ phản xạ ánh sáng màu xanh lá cây"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, nó sẽ rơi xuống đất?",
    "re": "Vật thể sẽ chịu tác động của trọng lực"
  },
  {
    "con": "Khi thực hiện thí nghiệm với nước và dầu, chúng sẽ không hòa tan vào nhau?",
    "re": "Dầu sẽ nổi lên trên bề mặt nước"
  },
  {
    "con": "Nếu một cây nhận đủ ánh sáng và nước?",
    "re": "Cây sẽ phát triển khỏe mạnh"
  },
  {
    "con": "Khi một chất rắn được nung nóng, nó sẽ giãn nở?",
    "re": "Chất rắn sẽ tăng thể tích"
  },
  {
    "con": "Nếu một con vật có xương sống, nó sẽ thuộc nhóm động vật nào?",
    "re": "Con vật đó sẽ thuộc nhóm động vật có xương sống"
  },
  {
    "con": "Khi một chất lỏng được làm lạnh, nó sẽ co lại?",
    "re": "Chất lỏng sẽ giảm thể tích"
  },
  {
    "con": "Nếu một cây được trồng trong đất có chất dinh dưỡng đầy đủ?",
    "re": "Cây sẽ phát triển tốt và cho ra hoa quả"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Nếu thực vật không nhận đủ ánh sáng mặt trời",
    "re": "Chúng sẽ không thể thực hiện quá trình quang hợp"
  },
  {
    "con": "Nếu động vật không có nước trong thời gian dài",
    "re": "Chúng sẽ bị mất nước và có thể chết"
  },
  {
    "con": "Nếu đất bị xói mòn",
    "re": "Năng suất cây trồng sẽ giảm và môi trường sống bị ảnh hưởng"
  },
  {
    "con": "Nếu có sự thay đổi nhiệt độ đột ngột",
    "re": "Nhiều loài động vật có thể bị sốc nhiệt"
  },
  {
    "con": "Nếu con người không tái chế rác thải",
    "re": "Môi trường sẽ bị ô nhiễm và tài nguyên thiên nhiên sẽ cạn kiệt"
  },
  {
    "con": "Nếu không có vi khuẩn trong đất",
    "re": "Quá trình phân hủy chất hữu cơ sẽ bị ngừng lại"
  },
  {
    "con": "Nếu không có gió",
    "re": "Không khí sẽ không được lưu thông và ô nhiễm sẽ gia tăng"
  },
  {
    "con": "Nếu các loài động vật bị tuyệt chủng",
    "re": "Hệ sinh thái sẽ mất cân bằng và ảnh hưởng đến các loài khác"
  },
  {
    "con": "Nếu con người sử dụng năng lượng tái tạo",
    "re": "Sẽ giảm thiểu tác động tiêu cực đến môi trường"
  },
  {
    "con": "Nước ở trạng thái lỏng khi nhiệt độ từ 0°C đến 100°C",
    "re": "Nước sẽ không đóng băng hoặc bay hơi"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp",
    "re": "Thực vật sẽ sản xuất oxy và năng lượng"
  },
  {
    "con": "Khi một vật được nung nóng, nó sẽ giãn nở",
    "re": "Thể tích của vật sẽ tăng lên"
  },
  {
    "con": "Khi có ánh sáng chiếu vào một vật, nó sẽ tạo ra bóng tối",
    "re": "Bóng tối sẽ xuất hiện ở phía đối diện với nguồn sáng"
  },
  {
    "con": "Khi nước bốc hơi, nó sẽ chuyển từ trạng thái lỏng sang trạng thái khí",
    "re": "Hơi nước sẽ tồn tại trong không khí"
  },
  {
    "con": "Khi một vật rơi tự do, nó sẽ chịu tác động của trọng lực",
    "re": "Vật sẽ rơi xuống với gia tốc không đổi"
  },
  {
    "con": "Khi thực hiện thí nghiệm, cần có một giả thuyết để kiểm tra",
    "re": "Kết quả sẽ giúp xác định tính đúng đắn của giả thuyết"
  },
  {
    "con": "Khi một chất hòa tan trong nước, nó sẽ tạo thành dung dịch",
    "re": "Dung dịch sẽ có tính chất khác với chất ban đầu"
  },
  {
    "con": "Khi một sinh vật chết đi, nó sẽ phân hủy",
    "re": "Chất dinh dưỡng sẽ trở lại đất và hỗ trợ sự sống mới"
  },
  {
    "con": "Khi có sự thay đổi nhiệt độ, các chất có thể thay đổi trạng thái",
    "re": "Chất có thể chuyển từ rắn sang lỏng hoặc từ lỏng sang khí"
  },
  {
    "con": "Hiện tượng đầu nhụy nhận được những hạt phấn của nhị gọi là:",
    "re": "Thụ phấn"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường:",
    "re": "Nước chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Các loài động vật sống trong môi trường nước thường có đặc điểm:",
    "re": "Chúng có vây và mang để hô hấp"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để thực hiện quá trình quang hợp:",
    "re": "Chúng sản xuất ra oxy và glucose"
  },
  {
    "con": "Khi nhiệt độ giảm, các chất rắn thường co lại:",
    "re": "Chúng trở nên dày đặc hơn"
  },
  {
    "con": "Các loài động vật ăn cỏ thường có hệ tiêu hóa dài:",
    "re": "Chúng cần thời gian để tiêu hóa thực vật"
  },
  {
    "con": "Khi một vật thể di chuyển nhanh hơn âm thanh:",
    "re": "Nó tạo ra sóng xung kích"
  },
  {
    "con": "Khi nước bốc hơi, nó chuyển từ trạng thái lỏng sang trạng thái khí:",
    "re": "Quá trình này gọi là bay hơi"
  },
  {
    "con": "Các loài cây có hoa thường có cấu trúc sinh sản phức tạp:",
    "re": "Chúng cần thụ phấn để sản xuất hạt"
  },
  {
    "con": "Khi ánh sáng đi qua một lăng kính, nó bị bẻ cong:",
    "re": "Ánh sáng được phân tách thành các màu sắc khác nhau"
  },
  {
    "con": "Khi một chất bị nung nóng, nó thường mở rộng:",
    "re": "Khối lượng riêng của chất đó giảm"
  },
  {
    "con": "Đa số loài vật được chia thành mấy giống?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ bao nhiêu độ C ở áp suất bình thường?",
    "re": "100 độ C"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn một vật khác, thì vật nào sẽ rơi nhanh hơn trong chân không?",
    "re": "Cả hai vật sẽ rơi cùng tốc độ"
  },
  {
    "con": "Nếu cây xanh không có ánh sáng mặt trời, thì cây sẽ làm gì?",
    "re": "Cây sẽ không thể quang hợp"
  },
  {
    "con": "Nếu một chất lỏng được làm nóng, thì thể tích của chất lỏng sẽ làm gì?",
    "re": "Thể tích của chất lỏng sẽ tăng lên"
  },
  {
    "con": "Nếu một vật được thả từ độ cao, thì vật đó sẽ làm gì?",
    "re": "Vật đó sẽ rơi xuống đất do trọng lực"
  },
  {
    "con": "Nếu một loài động vật sống trong nước, thì nó sẽ có đặc điểm gì?",
    "re": "Nó sẽ có vây và mang để thở"
  },
  {
    "con": "Nếu một chất rắn được nung nóng đến nhiệt độ cao, thì nó sẽ làm gì?",
    "re": "Chất rắn sẽ chuyển thành chất lỏng"
  },
  {
    "con": "Nếu một cây không có nước trong thời gian dài, thì cây sẽ làm gì?",
    "re": "Cây sẽ héo và có thể chết"
  },
  {
    "con": "Nếu ánh sáng mặt trời chiếu vào một vật màu đen, thì vật đó sẽ làm gì?",
    "re": "Vật đó sẽ hấp thụ nhiều nhiệt hơn"
  },
  {
    "con": "Nước được tạo thành từ hai nguyên tố nào?",
    "re": "Hydro và Oxy"
  },
  {
    "con": "Thực vật cần yếu tố nào để thực hiện quá trình quang hợp?",
    "re": "Ánh sáng mặt trời"
  },
  {
    "con": "Khi nhiệt độ tăng, thể tích của khí sẽ như thế nào?",
    "re": "Thể tích khí sẽ tăng"
  },
  {
    "con": "Động vật có xương sống có đặc điểm gì nổi bật?",
    "re": "Có hệ xương và tủy sống"
  },
  {
    "con": "Khi nước đóng băng, nó sẽ làm gì?",
    "re": "Nở ra và trở thành băng"
  },
  {
    "con": "Nếu một vật được thả từ độ cao, nó sẽ rơi xuống do yếu tố nào?",
    "re": "Lực hấp dẫn"
  },
  {
    "con": "Khi ánh sáng đi qua một lăng kính, nó sẽ xảy ra hiện tượng gì?",
    "re": "Khúc xạ ánh sáng"
  },
  {
    "con": "Các loài động vật sống trong nước thường có đặc điểm gì?",
    "re": "Có vây và mang"
  },
  {
    "con": "Khi một chất rắn nóng lên, nó sẽ chuyển sang trạng thái nào?",
    "re": "Trạng thái lỏng"
  },
  {
    "con": "Nếu một cây không nhận đủ nước, nó sẽ như thế nào?",
    "re": "Héo và có thể chết"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp",
    "re": "Chúng sẽ sản xuất ra oxy và glucose"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, nó sẽ rơi xuống đất",
    "re": "Vật thể sẽ chịu tác động của trọng lực"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C, nước sẽ đóng băng",
    "re": "Nước sẽ chuyển thành trạng thái rắn"
  },
  {
    "con": "Nếu một chất được hòa tan trong nước, nó sẽ tạo thành dung dịch",
    "re": "Chất đó sẽ phân tán đều trong nước"
  },
  {
    "con": "Khi có ánh sáng chiếu vào một vật thể, nó có thể bị phản xạ",
    "re": "Vật thể sẽ tạo ra bóng tối"
  },
  {
    "con": "Nếu một động vật không có thức ăn, nó sẽ không sống sót",
    "re": "Động vật sẽ chết vì thiếu dinh dưỡng"
  },
  {
    "con": "Khi một chất bị đốt cháy, nó sẽ phản ứng với oxy",
    "re": "Chất đó sẽ tạo ra nhiệt và ánh sáng"
  },
  {
    "con": "Nếu một vật thể có khối lượng lớn hơn nước, nó sẽ chìm",
    "re": "Vật thể sẽ không nổi trên mặt nước"
  },
  {
    "con": "Khi một chất thay đổi trạng thái từ lỏng sang khí, nó sẽ bay hơi",
    "re": "Chất đó sẽ mất nhiệt và trở thành hơi"
  },
  {
    "con": "Nếu một hệ sinh thái bị mất đi một loài, nó sẽ bị mất cân bằng",
    "re": "Các loài khác trong hệ sinh thái sẽ bị ảnh hưởng"
  },
  {
    "con": "Không khí và nước bị ô nhiễm sẽ gây ra tác hại gì ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước ở trạng thái lỏng có nhiệt độ từ 0°C đến 100°C là:",
    "re": "Nước sẽ tồn tại ở trạng thái lỏng"
  },
  {
    "con": "Năng lượng mặt trời được cây sử dụng để quang hợp là:",
    "re": "Năng lượng hóa học được tạo ra"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, thì:",
    "re": "Vật thể sẽ rơi xuống do lực hấp dẫn"
  },
  {
    "con": "Nếu một chất rắn được nung nóng, thì:",
    "re": "Chất rắn có thể chuyển sang trạng thái lỏng"
  },
  {
    "con": "Nếu có ánh sáng chiếu vào một vật thể màu xanh, thì:",
    "re": "Vật thể sẽ phản xạ ánh sáng màu xanh"
  },
  {
    "con": "Nếu một động vật có xương sống, thì:",
    "re": "Động vật đó thuộc nhóm động vật có xương"
  },
  {
    "con": "Nếu một chất lỏng có mật độ thấp hơn nước, thì:",
    "re": "Chất lỏng đó sẽ nổi trên mặt nước"
  },
  {
    "con": "Nếu một cây không nhận đủ ánh sáng mặt trời, thì:",
    "re": "Cây sẽ không phát triển tốt"
  },
  {
    "con": "Nếu một vật thể di chuyển với tốc độ không đổi, thì:",
    "re": "Vật thể đó sẽ đi theo một đường thẳng"
  },
  {
    "con": "Chất gây nghiện ảnh hưởng đến người xung quanh là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các chất như thủy tinh, kim loại sẽ chuyển từ thể rắn sang thể lỏng ở nhiệt độ nào ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sẽ chuyển từ thể lỏng sang thể khí khi nhiệt độ đạt đến 100 độ C ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn thì nó sẽ có trọng lực lớn hơn ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu ánh sáng mặt trời chiếu vào một vật màu đen thì vật đó sẽ nóng lên nhanh hơn so với vật màu trắng ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một cây xanh có đủ ánh sáng và nước thì nó sẽ phát triển tốt hơn ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7 thì nó được coi là axit ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật được thả từ độ cao thì nó sẽ rơi xuống đất do lực hấp dẫn ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có thể hòa tan trong nước thì nó được gọi là chất tan ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một động vật có xương sống thì nó thuộc nhóm động vật có xương ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra thì các chất ban đầu sẽ biến đổi thành các chất mới ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước ở trạng thái lỏng khi nhiệt độ trên 0 độ C và dưới 100 độ C là:",
    "re": "Nước tồn tại ở dạng lỏng"
  },
  {
    "con": "Các sinh vật sống cần ánh sáng mặt trời để thực hiện quá trình quang hợp là:",
    "re": "Thực vật"
  },
  {
    "con": "Khi một vật di chuyển nhanh hơn âm thanh, nó sẽ tạo ra hiện tượng gì?",
    "re": "Sóng xung kích"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới điểm đóng băng của nước, nước sẽ:",
    "re": "Chuyển sang trạng thái rắn"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác nhưng có thể nổi trên nước, thì:",
    "re": "Vật đó có mật độ nhỏ hơn nước"
  },
  {
    "con": "Khi một chất bị đun nóng, nó sẽ:",
    "re": "Nở ra"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời, thì đó là:",
    "re": "Sinh vật quang hợp"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước, nó sẽ:",
    "re": "Tạo thành dung dịch"
  },
  {
    "con": "Nếu một vật được thả từ độ cao, thì nó sẽ:",
    "re": "Rơi xuống đất do trọng lực"
  },
  {
    "con": "Khi có sự thay đổi nhiệt độ, các phân tử trong chất rắn sẽ:",
    "re": "Chuyển động nhanh hơn"
  },
  {
    "con": "Các cơ quan sinh dục cái và sinh dục đực của thực vật có hoa là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điều gì sẽ xảy ra khi có quá nhiều khói, khí độc thải vào không khí?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sẽ chuyển thành hơi nước khi nhiệt độ đạt 100 độ C?",
    "re": "Nước sẽ bốc hơi"
  },
  {
    "con": "Nếu cây không nhận đủ ánh sáng mặt trời, thì cây sẽ không phát triển tốt?",
    "re": "Cây sẽ còi cọc và không ra hoa trái"
  },
  {
    "con": "Nếu động vật không có nước để uống, thì chúng sẽ bị mất nước?",
    "re": "Động vật sẽ bị khát và có thể chết"
  },
  {
    "con": "Nếu đất bị ô nhiễm bởi hóa chất độc hại, thì thực vật sẽ không thể sống sót?",
    "re": "Thực vật sẽ chết hoặc phát triển kém"
  },
  {
    "con": "Nếu nhiệt độ giảm xuống dưới 0 độ C, thì nước sẽ đóng băng?",
    "re": "Nước sẽ trở thành băng"
  },
  {
    "con": "Nếu không có oxy, thì lửa sẽ không thể cháy?",
    "re": "Lửa sẽ tắt"
  },
  {
    "con": "Nếu các loài động vật bị săn bắt quá mức, thì chúng sẽ trở nên hiếm?",
    "re": "Một số loài có thể bị tuyệt chủng"
  },
  {
    "con": "Nếu con người không bảo vệ môi trường, thì hệ sinh thái sẽ bị phá hủy?",
    "re": "Nhiều loài động thực vật sẽ bị ảnh hưởng"
  },
  {
    "con": "Nếu có quá nhiều carbon dioxide trong khí quyển, thì trái đất sẽ nóng lên?",
    "re": "Hiện tượng ấm lên toàn cầu sẽ xảy ra"
  },
  {
    "con": "Vì sao hổ mẹ không rời con suốt tuần đầu sau khi sinh?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào?",
    "re": "100 độ C ở áp suất khí quyển bình thường"
  },
  {
    "con": "Tại sao cây cần ánh sáng mặt trời?",
    "re": "Để thực hiện quá trình quang hợp"
  },
  {
    "con": "Khi nào thì nước chuyển từ thể lỏng sang thể rắn?",
    "re": "Khi nhiệt độ giảm xuống dưới 0 độ C"
  },
  {
    "con": "Tại sao các loài động vật lại cần oxy?",
    "re": "Để thực hiện quá trình hô hấp và sản xuất năng lượng"
  },
  {
    "con": "Khi nào thì trái đất quay quanh mặt trời?",
    "re": "Trong suốt cả năm, hoàn thành một vòng quay mỗi 365 ngày"
  },
  {
    "con": "Tại sao mưa lại xảy ra?",
    "re": "Khi hơi nước trong không khí ngưng tụ thành giọt nước"
  },
  {
    "con": "Tại sao các loài thực vật cần nước?",
    "re": "Để duy trì sự sống và thực hiện quá trình quang hợp"
  },
  {
    "con": "Khi nào thì ánh sáng mặt trời chiếu sáng trái đất?",
    "re": "Khi trái đất quay về phía mặt trời"
  },
  {
    "con": "Tại sao các loài động vật lại có nhiều hình dạng và kích thước khác nhau?",
    "re": "Để thích nghi với môi trường sống của chúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Khi thực vật không nhận đủ ánh sáng mặt trời",
    "re": "Chúng sẽ không thể thực hiện quá trình quang hợp hiệu quả"
  },
  {
    "con": "Khi một vật thể được thả từ độ cao",
    "re": "Nó sẽ rơi xuống đất do lực hấp dẫn"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Khi một chất được hòa tan trong nước",
    "re": "Chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Khi động vật không có đủ thức ăn",
    "re": "Chúng sẽ không phát triển khỏe mạnh"
  },
  {
    "con": "Khi có sự thay đổi trong môi trường sống",
    "re": "Các loài sinh vật có thể bị ảnh hưởng hoặc phải thích nghi"
  },
  {
    "con": "Khi ánh sáng mặt trời chiếu vào một bề mặt phản chiếu",
    "re": "Ánh sáng sẽ bị phản xạ trở lại"
  },
  {
    "con": "Khi một chất bị đốt cháy",
    "re": "Nó sẽ tạo ra nhiệt và ánh sáng"
  },
  {
    "con": "Trong các biện pháp làm tăng sản lượng lương thực trên diện tích đất canh tác, biện pháp nào sẽ làm ô nhiễm môi trường đất ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trứng -> nhộng -> bướm. Tên giai đoạn còn thiếu trong chu trình phát triển của bướm là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước -> hơi nước. Khi nước bị đun nóng, nó sẽ chuyển thành:",
    "re": "hơi nước"
  },
  {
    "con": "Cây xanh -> quang hợp. Cây xanh sử dụng ánh sáng mặt trời để tạo ra:",
    "re": "thức ăn"
  },
  {
    "con": "Đất -> nước -> cây. Để cây phát triển tốt, nó cần:",
    "re": "đất và nước"
  },
  {
    "con": "Mặt trời -> ánh sáng. Mặt trời là nguồn cung cấp:",
    "re": "ánh sáng cho Trái Đất"
  },
  {
    "con": "Động vật -> thức ăn. Động vật cần thức ăn để:",
    "re": "sinh trưởng và phát triển"
  },
  {
    "con": "Nhiệt độ tăng -> nước bốc hơi. Khi nhiệt độ tăng, nước sẽ:",
    "re": "bốc hơi"
  },
  {
    "con": "Thực vật -> oxy. Thực vật sản xuất oxy trong quá trình:",
    "re": "quang hợp"
  },
  {
    "con": "Sắt -> từ tính. Sắt là một kim loại có tính chất:",
    "re": "từ tính"
  },
  {
    "con": "Trái đất -> lực hấp dẫn. Trái đất có lực hấp dẫn tác động lên:",
    "re": "mọi vật thể"
  },
  {
    "con": "Nước được làm nóng đến 100 độ C",
    "re": "Nước sẽ sôi và chuyển thành hơi nước"
  },
  {
    "con": "Một vật nặng được thả từ độ cao",
    "re": "Vật sẽ rơi xuống đất do lực hấp dẫn"
  },
  {
    "con": "Thực vật nhận ánh sáng mặt trời",
    "re": "Thực vật sẽ tiến hành quang hợp để tạo ra năng lượng"
  },
  {
    "con": "Một chất rắn được hòa tan trong nước",
    "re": "Chất rắn sẽ phân tán và tạo thành dung dịch"
  },
  {
    "con": "Nhiệt độ giảm xuống dưới 0 độ C",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Một vật được đặt trong môi trường chân không",
    "re": "Vật sẽ không bị ảnh hưởng bởi lực cản của không khí"
  },
  {
    "con": "Một phản ứng hóa học xảy ra",
    "re": "Các chất ban đầu sẽ biến đổi thành các sản phẩm mới"
  },
  {
    "con": "Một con vật không có khả năng tự sản xuất thức ăn",
    "re": "Con vật đó sẽ phải ăn thực vật hoặc động vật khác để sống"
  },
  {
    "con": "Một nguồn năng lượng như mặt trời được sử dụng",
    "re": "Năng lượng sẽ được chuyển đổi thành điện năng hoặc nhiệt năng"
  },
  {
    "con": "Một chất lỏng được làm lạnh",
    "re": "Chất lỏng sẽ co lại và có thể chuyển sang trạng thái rắn"
  },
  {
    "con": "Sự thay đổi trong môi trường sống của động vật",
    "re": "Động vật có thể phải thích nghi hoặc di cư để sống sót"
  },
  {
    "con": "Sự biến đổi hóa học xảy ra trong trường hợp nào dưới đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào?",
    "re": "100 độ C ở áp suất khí quyển bình thường"
  },
  {
    "con": "Khi ánh sáng đi qua một lăng kính, điều gì xảy ra?",
    "re": "Ánh sáng bị khúc xạ và phân tách thành các màu sắc khác nhau"
  },
  {
    "con": "Nếu một vật nặng hơn rơi từ độ cao, điều gì sẽ xảy ra?",
    "re": "Vật sẽ rơi nhanh hơn và có năng lượng va chạm lớn hơn"
  },
  {
    "con": "Khi cây quang hợp, cây cần những yếu tố nào?",
    "re": "Ánh sáng mặt trời, nước và carbon dioxide"
  },
  {
    "con": "Nếu bạn trộn nước với dầu, điều gì sẽ xảy ra?",
    "re": "Chúng sẽ không hòa tan vào nhau và tạo thành hai lớp riêng biệt"
  },
  {
    "con": "Khi nhiệt độ giảm, chất khí sẽ làm gì?",
    "re": "Chất khí sẽ co lại và giảm thể tích"
  },
  {
    "con": "Nếu bạn đặt một miếng bông vào nước, điều gì sẽ xảy ra?",
    "re": "Miếng bông sẽ thấm nước và trở nên ẩm ướt"
  },
  {
    "con": "Khi một vật chuyển động, điều gì xảy ra với năng lượng của nó?",
    "re": "Năng lượng của vật sẽ tăng lên và trở thành năng lượng động"
  },
  {
    "con": "Nếu bạn thay đổi hình dạng của một miếng đất sét, điều gì sẽ xảy ra?",
    "re": "Miếng đất sét vẫn giữ nguyên khối lượng nhưng thay đổi thể tích"
  },
  {
    "con": "Khi một chất bị nung nóng, điều gì sẽ xảy ra với các phân tử của nó?",
    "re": "Các phân tử sẽ di chuyển nhanh hơn và xa nhau hơn"
  },
  {
    "con": "Cơ quan sinh sản của thực vật có hoa là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường:",
    "re": "Nước chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Ánh sáng mặt trời chiếu vào cây xanh:",
    "re": "Cây thực hiện quá trình quang hợp để tạo ra thức ăn"
  },
  {
    "con": "Động vật có xương sống bao gồm:",
    "re": "Cá, chim, thú, bò sát và lưỡng cư"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C:",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Khi một vật di chuyển nhanh hơn âm thanh:",
    "re": "Vật đó được gọi là siêu thanh"
  },
  {
    "con": "Khi một chất bị đốt cháy:",
    "re": "Chất đó sẽ phản ứng với oxy và tạo ra nhiệt và ánh sáng"
  },
  {
    "con": "Khi một vật bị kéo dài ra:",
    "re": "Vật đó sẽ có khả năng đàn hồi"
  },
  {
    "con": "Khi có sự thay đổi nhiệt độ trong không khí:",
    "re": "Áp suất không khí cũng sẽ thay đổi"
  },
  {
    "con": "Khi một chất lỏng bay hơi:",
    "re": "Chất lỏng đó chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp",
    "re": "Thực vật sẽ sản xuất oxy và glucose"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao",
    "re": "Vật thể sẽ rơi xuống đất do trọng lực"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Nếu một chất được hòa tan trong nước",
    "re": "Chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Khi có ánh sáng chiếu vào một vật thể màu xanh",
    "re": "Vật thể sẽ phản xạ ánh sáng màu xanh"
  },
  {
    "con": "Nếu một động vật không có khả năng thích nghi với môi trường",
    "re": "Động vật đó có thể gặp nguy hiểm và có thể tuyệt chủng"
  },
  {
    "con": "Khi một chất bị đốt cháy",
    "re": "Chất đó sẽ tạo ra nhiệt và ánh sáng"
  },
  {
    "con": "Nếu một vật thể có khối lượng lớn hơn nước",
    "re": "Vật thể sẽ chìm trong nước"
  },
  {
    "con": "Khi có sự thay đổi nhiệt độ trong một chất khí",
    "re": "Áp suất của chất khí sẽ thay đổi"
  },
  {
    "con": "Trong các vật sau đây, vật nào là vật không cách điện?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu nước được đun sôi ở 100 độ C, thì nước sẽ chuyển từ trạng thái lỏng sang trạng thái hơi.",
    "re": "Nước sẽ bốc hơi"
  },
  {
    "con": "Nếu một vật được thả từ độ cao, thì vật đó sẽ rơi xuống đất do lực hấp dẫn.",
    "re": "Vật sẽ rơi xuống"
  },
  {
    "con": "Nếu cây xanh được cung cấp đủ ánh sáng mặt trời, nước và chất dinh dưỡng, thì cây sẽ phát triển tốt.",
    "re": "Cây sẽ phát triển khỏe mạnh"
  },
  {
    "con": "Nếu một chất được làm nóng, thì thể tích của chất đó sẽ tăng lên.",
    "re": "Chất sẽ nở ra"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác, thì vật đó sẽ có trọng lực lớn hơn.",
    "re": "Vật sẽ nặng hơn"
  },
  {
    "con": "Nếu ánh sáng đi qua một lăng kính, thì ánh sáng sẽ bị khúc xạ và tạo ra cầu vồng.",
    "re": "Ánh sáng sẽ phân tán thành nhiều màu"
  },
  {
    "con": "Nếu một động vật không có xương sống, thì động vật đó thuộc nhóm động vật không xương sống.",
    "re": "Động vật sẽ không có xương sống"
  },
  {
    "con": "Nếu một chất có nhiệt độ thấp hơn điểm đông đặc, thì chất đó sẽ chuyển từ trạng thái lỏng sang trạng thái rắn.",
    "re": "Chất sẽ đông đặc"
  },
  {
    "con": "Nếu một hệ sinh thái bị mất đi một loài, thì sự cân bằng trong hệ sinh thái đó có thể bị ảnh hưởng.",
    "re": "Hệ sinh thái sẽ mất cân bằng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước chuyển từ trạng thái lỏng sang trạng thái hơi"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp",
    "re": "Chúng sản xuất ra oxy và glucose"
  },
  {
    "con": "Khi nhiệt độ giảm, các phân tử trong chất rắn di chuyển chậm lại",
    "re": "Chất rắn trở nên cứng hơn"
  },
  {
    "con": "Khi một vật thể được thả từ độ cao, nó sẽ rơi xuống đất",
    "re": "Vật thể chịu tác động của trọng lực"
  },
  {
    "con": "Khi có điện chạy qua dây dẫn, nó sẽ tạo ra từ trường",
    "re": "Có thể sử dụng để vận hành động cơ điện"
  },
  {
    "con": "Khi nước bị đóng băng, nó sẽ chuyển từ trạng thái lỏng sang trạng thái rắn",
    "re": "Nước trở thành băng"
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính, nó sẽ bị khúc xạ",
    "re": "Ánh sáng sẽ phân tán thành các màu sắc khác nhau"
  },
  {
    "con": "Khi một chất bị đốt cháy, nó sẽ phản ứng với oxy",
    "re": "Tạo ra nhiệt và ánh sáng"
  },
  {
    "con": "Khi một vật thể di chuyển nhanh hơn âm thanh, nó sẽ tạo ra sóng xung kích",
    "re": "Gây ra tiếng nổ siêu thanh"
  },
  {
    "con": "Khi một sinh vật sống trong môi trường không có oxy",
    "re": "Nó sẽ phải thích nghi hoặc không thể sống sót"
  },
  {
    "con": "Biện pháp diệt ruồi tốt nhất là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Môi trường bao gồm những gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước ở trạng thái lỏng khi nhiệt độ trên 0 độ C?",
    "re": "Nước sẽ không đóng băng"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp?",
    "re": "Thực vật sẽ sản xuất oxy"
  },
  {
    "con": "Động vật có xương sống có hệ thống tuần hoàn kín?",
    "re": "Chúng có khả năng vận chuyển máu hiệu quả hơn"
  },
  {
    "con": "Khi nhiệt độ tăng, chất rắn sẽ nở ra?",
    "re": "Chất rắn sẽ chiếm nhiều không gian hơn"
  },
  {
    "con": "Khi nước bay hơi, nó chuyển từ trạng thái lỏng sang trạng thái khí?",
    "re": "Nước sẽ trở thành hơi nước"
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính, nó sẽ bị khúc xạ?",
    "re": "Ánh sáng sẽ phân tán thành nhiều màu sắc"
  },
  {
    "con": "Khi một vật bị tác động bởi lực, nó sẽ chuyển động?",
    "re": "Vật sẽ thay đổi vị trí"
  },
  {
    "con": "Khi thực hiện thí nghiệm, cần có một giả thuyết rõ ràng?",
    "re": "Giả thuyết sẽ giúp định hướng nghiên cứu"
  },
  {
    "con": "Khi một chất bị đun nóng, nó sẽ có xu hướng mở rộng?",
    "re": "Chất đó sẽ trở nên nhẹ hơn trong không khí"
  },
  {
    "con": "Nước được đun sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Các sinh vật sống cần nước để tồn tại",
    "re": "Chúng sẽ không thể sống nếu thiếu nước"
  },
  {
    "con": "Nếu ánh sáng mặt trời chiếu vào cây",
    "re": "Cây sẽ thực hiện quá trình quang hợp"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao",
    "re": "Nó sẽ rơi xuống đất do lực hấp dẫn"
  },
  {
    "con": "Khi một chất được hòa tan trong nước",
    "re": "Chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Nếu một sinh vật không có đủ thức ăn",
    "re": "Nó sẽ không phát triển và có thể chết"
  },
  {
    "con": "Khi có sự thay đổi nhiệt độ",
    "re": "Các chất có thể thay đổi trạng thái từ rắn sang lỏng hoặc khí"
  },
  {
    "con": "Nếu một vật thể có khối lượng lớn hơn vật thể khác",
    "re": "Nó sẽ có trọng lực lớn hơn"
  },
  {
    "con": "Khi một động vật di chuyển từ nơi này sang nơi khác",
    "re": "Nó đang tìm kiếm thức ăn hoặc nơi ở mới"
  },
  {
    "con": "Nếu một cây không nhận đủ ánh sáng",
    "re": "Nó sẽ không phát triển khỏe mạnh"
  },
  {
    "con": "Những việc làm sau đây không phải là tiết kiệm điện",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển sang trạng thái hơi"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp",
    "re": "Chúng sẽ sản xuất ra oxy và glucose"
  },
  {
    "con": "Khi một vật thể được thả từ độ cao, nó sẽ rơi xuống đất",
    "re": "Vật thể sẽ chịu tác động của trọng lực"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C, nước sẽ đóng băng",
    "re": "Nước sẽ chuyển sang trạng thái rắn"
  },
  {
    "con": "Khi có ánh sáng chiếu vào một vật thể trong suốt",
    "re": "Ánh sáng sẽ đi qua vật thể đó"
  },
  {
    "con": "Khi một chất được hòa tan trong nước",
    "re": "Chất đó sẽ phân tán đều trong nước"
  },
  {
    "con": "Khi có sự thay đổi nhiệt độ, các chất có thể thay đổi trạng thái",
    "re": "Chúng có thể chuyển từ rắn sang lỏng hoặc từ lỏng sang khí"
  },
  {
    "con": "Khi một động vật không có thức ăn trong thời gian dài",
    "re": "Nó sẽ bị suy dinh dưỡng và có thể chết"
  },
  {
    "con": "Khi một hệ sinh thái bị phá hủy",
    "re": "Các loài sinh vật trong đó sẽ bị ảnh hưởng nghiêm trọng"
  },
  {
    "con": "Khi có sự tiếp xúc giữa hai vật thể có nhiệt độ khác nhau",
    "re": "Nhiệt sẽ truyền từ vật thể nóng sang vật thể lạnh"
  },
  {
    "con": "Những việc làm nào bị ô nhiễm môi trường?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường:",
    "re": "Nước chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Cây xanh quang hợp vào ban ngày:",
    "re": "Cây sản xuất oxy và glucose"
  },
  {
    "con": "Động vật có xương sống có hệ thống tuần hoàn kín:",
    "re": "Máu được bơm liên tục trong cơ thể"
  },
  {
    "con": "Sự hấp thụ nước của rễ cây diễn ra qua quá trình thẩm thấu:",
    "re": "Nước di chuyển từ nơi có nồng độ thấp đến nơi có nồng độ cao"
  },
  {
    "con": "Khi ánh sáng mặt trời chiếu vào một vật thể màu đen:",
    "re": "Vật thể hấp thụ hầu hết ánh sáng và trở nên nóng hơn"
  },
  {
    "con": "Khi một vật thể di chuyển nhanh hơn âm thanh:",
    "re": "Vật thể đó tạo ra sóng xung kích"
  },
  {
    "con": "Sự thay đổi trạng thái của nước từ lỏng sang rắn xảy ra khi nhiệt độ giảm:",
    "re": "Nước đóng băng thành băng"
  },
  {
    "con": "Khi một chất bị đốt cháy trong không khí:",
    "re": "Chất đó phản ứng với oxy và tạo ra nhiệt và ánh sáng"
  },
  {
    "con": "Sự phân hủy của chất hữu cơ trong đất diễn ra nhờ vi sinh vật:",
    "re": "Chất hữu cơ được chuyển hóa thành dinh dưỡng cho cây"
  },
  {
    "con": "Khi có sự thay đổi nhiệt độ trong một chất khí:",
    "re": "Áp suất của chất khí sẽ thay đổi theo định luật Boyle"
  },
  {
    "con": "Sự di chuyển của các mảng kiến tạo trên bề mặt trái đất:",
    "re": "Gây ra động đất và núi lửa"
  },
  {
    "con": "Sự sinh sản của chim là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có thể tồn tại ở ba trạng thái khác nhau",
    "re": "Nước có thể chuyển đổi giữa rắn, lỏng và khí"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp",
    "re": "Thực vật sẽ sản xuất oxy và thức ăn cho chính mình"
  },
  {
    "con": "Động vật cần thức ăn để sống",
    "re": "Động vật sẽ có đủ năng lượng để hoạt động và phát triển"
  },
  {
    "con": "Trái đất quay quanh mặt trời",
    "re": "Ngày và đêm sẽ xảy ra do sự quay của trái đất"
  },
  {
    "con": "Nhiệt độ tăng lên sẽ làm nước bốc hơi",
    "re": "Hơi nước sẽ hình thành trong không khí"
  },
  {
    "con": "Sự sống cần nước để tồn tại",
    "re": "Các sinh vật sẽ không thể sống nếu thiếu nước"
  },
  {
    "con": "Các vật thể nặng hơn sẽ rơi nhanh hơn khi không có lực cản",
    "re": "Chúng sẽ chạm đất trước các vật thể nhẹ hơn"
  },
  {
    "con": "Khi nhiệt độ giảm, các chất khí sẽ co lại",
    "re": "Áp suất không khí sẽ tăng lên nếu thể tích không thay đổi"
  },
  {
    "con": "Sự phân hủy của chất hữu cơ cần vi sinh vật",
    "re": "Chất hữu cơ sẽ được chuyển hóa thành dinh dưỡng cho đất"
  },
  {
    "con": "Khi ánh sáng đi qua một lăng kính, nó sẽ bị khúc xạ",
    "re": "Ánh sáng sẽ tạo ra cầu vồng khi đi qua nước"
  },
  {
    "con": "Theo em, đặc điểm nào là quan trọng nhất của nước sạch?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong các nguồn năng lượng dưới đây nguồn năng lượng nào được gọi là nguồn năng lượng sạch?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nước được đun nóng đến 100 độ C, nó sẽ xảy ra hiện tượng gì?",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, thì nó sẽ làm gì?",
    "re": "Vật thể sẽ rơi xuống đất do trọng lực"
  },
  {
    "con": "Khi thực hiện quang hợp, cây xanh cần những yếu tố nào?",
    "re": "Cây cần ánh sáng mặt trời, nước và carbon dioxide"
  },
  {
    "con": "Nếu một chất rắn được nung nóng, thì nó sẽ xảy ra hiện tượng gì?",
    "re": "Chất rắn có thể chuyển thành chất lỏng"
  },
  {
    "con": "Khi một vật thể di chuyển nhanh hơn âm thanh, thì nó sẽ tạo ra hiện tượng gì?",
    "re": "Vật thể sẽ tạo ra tiếng nổ siêu thanh"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, thì nó sẽ cần gì để tồn tại?",
    "re": "Sinh vật cần oxy hòa tan trong nước"
  },
  {
    "con": "Khi ánh sáng đi qua một lăng kính, thì nó sẽ xảy ra hiện tượng gì?",
    "re": "Ánh sáng sẽ bị khúc xạ và tạo ra cầu vồng"
  },
  {
    "con": "Nếu một chất lỏng được làm lạnh, thì nó sẽ xảy ra hiện tượng gì?",
    "re": "Chất lỏng có thể đông đặc thành chất rắn"
  },
  {
    "con": "Khi một con vật thay đổi hình dạng để thích nghi với môi trường, thì hiện tượng này được gọi là gì?",
    "re": "Hiện tượng này được gọi là tiến hóa"
  },
  {
    "con": "Năng lượng sẽ chuyển hóa từ dạng này sang dạng khác",
    "re": "nếu có sự thay đổi trong hệ thống"
  },
  {
    "con": "Nước sẽ sôi ở 100 độ C",
    "re": "nếu áp suất khí quyển là 1 atm"
  },
  {
    "con": "Sự sống sẽ phát triển",
    "re": "nếu có đủ nước, ánh sáng và chất dinh dưỡng"
  },
  {
    "con": "Sự biến đổi hóa học sẽ xảy ra",
    "re": "nếu có sự kết hợp giữa các chất khác nhau"
  },
  {
    "con": "Một vật sẽ di chuyển",
    "re": "nếu có lực tác động lên nó"
  },
  {
    "con": "Nhiệt độ sẽ giảm",
    "re": "nếu vật được đặt trong môi trường lạnh hơn"
  },
  {
    "con": "Ánh sáng sẽ phản xạ",
    "re": "nếu gặp bề mặt nhẵn"
  },
  {
    "con": "Khí carbon dioxide sẽ được tạo ra",
    "re": "nếu có sự hô hấp của sinh vật"
  },
  {
    "con": "Sự phân hủy sẽ xảy ra",
    "re": "nếu có vi sinh vật và điều kiện thích hợp"
  },
  {
    "con": "Sự hấp thụ nước sẽ diễn ra",
    "re": "nếu rễ cây tiếp xúc với đất ẩm"
  },
  {
    "con": "Trong các nguồn năng lượng dưới đây, nguồn năng lượng nào không phải là năng lượng sạch?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được làm nóng đến 100 độ C thì trạng thái của nó sẽ chuyển thành gì?",
    "re": "Hơi nước"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, thì nó sẽ rơi xuống đất do lực nào?",
    "re": "Lực hấp dẫn"
  },
  {
    "con": "Khi ánh sáng đi qua một lăng kính, thì nó sẽ xảy ra hiện tượng gì?",
    "re": "Khúc xạ ánh sáng"
  },
  {
    "con": "Nếu một cây xanh không nhận đủ ánh sáng mặt trời, thì nó sẽ gặp phải vấn đề gì?",
    "re": "Chậm phát triển hoặc chết"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C, nước sẽ chuyển thành trạng thái nào?",
    "re": "Đá"
  },
  {
    "con": "Nếu một chất lỏng được đun nóng, thì thể tích của nó sẽ thay đổi như thế nào?",
    "re": "Tăng lên"
  },
  {
    "con": "Khi một vật thể di chuyển nhanh hơn âm thanh, thì nó sẽ tạo ra hiện tượng gì?",
    "re": "Sóng xung"
  },
  {
    "con": "Nếu một động vật không có khả năng thích nghi với môi trường sống của nó, thì nó sẽ gặp phải điều gì?",
    "re": "Nguy cơ tuyệt chủng"
  },
  {
    "con": "Khi một chất rắn tan trong nước, thì nó sẽ tạo ra hiện tượng gì?",
    "re": "Dung dịch"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào dưới áp suất khí quyển bình thường?",
    "re": "100 độ C"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, điều gì xảy ra?",
    "re": "Ánh sáng bị khúc xạ"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác, thì vật nào sẽ có trọng lực lớn hơn?",
    "re": "Vật có khối lượng lớn hơn"
  },
  {
    "con": "Khi cây xanh quang hợp, nó cần những yếu tố nào?",
    "re": "Ánh sáng, nước và carbon dioxide"
  },
  {
    "con": "Nếu một chất có mật độ thấp hơn nước, thì nó sẽ làm gì khi đặt vào nước?",
    "re": "Nổi trên mặt nước"
  },
  {
    "con": "Khi nhiệt độ giảm, trạng thái của nước sẽ thay đổi như thế nào?",
    "re": "Từ lỏng sang rắn (đóng băng)"
  },
  {
    "con": "Nếu bạn thêm muối vào nước, điều gì sẽ xảy ra với điểm sôi của nước?",
    "re": "Điểm sôi sẽ tăng lên"
  },
  {
    "con": "Khi một vật chuyển động, nếu không có lực tác động, nó sẽ làm gì?",
    "re": "Tiếp tục chuyển động với vận tốc không đổi"
  },
  {
    "con": "Nếu một loài động vật sống trong môi trường nước, thì nó sẽ có đặc điểm gì?",
    "re": "Có thể có vây và mang"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, điều gì sẽ xảy ra với các nguyên tố?",
    "re": "Chúng sẽ tái tổ hợp thành các hợp chất mới"
  },
  {
    "con": "Các loài hoa thụ phấn nhờ côn trùng có đặc điểm gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào dưới áp suất khí quyển bình thường?",
    "re": "100 độ C"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn thì lực hấp dẫn tác động lên nó sẽ như thế nào?",
    "re": "Lực hấp dẫn sẽ lớn hơn"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, hiện tượng gì xảy ra?",
    "re": "Ánh sáng bị khúc xạ"
  },
  {
    "con": "Nếu một cây xanh không có ánh sáng mặt trời, nó sẽ như thế nào?",
    "re": "Cây sẽ không thể quang hợp và có thể chết"
  },
  {
    "con": "Khi nhiệt độ giảm, trạng thái của nước sẽ thay đổi như thế nào?",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Nếu một vật di chuyển nhanh hơn âm thanh, nó sẽ tạo ra hiện tượng gì?",
    "re": "Hiện tượng siêu âm"
  },
  {
    "con": "Khi một chất lỏng bay hơi, điều gì xảy ra với năng lượng của nó?",
    "re": "Năng lượng của chất lỏng tăng lên"
  },
  {
    "con": "Nếu một động vật sống trong môi trường nước, nó sẽ có đặc điểm gì?",
    "re": "Động vật sẽ có vây và mang để thở"
  },
  {
    "con": "Khi một vật bị đốt cháy, nó sẽ tạo ra sản phẩm gì?",
    "re": "Khói và khí carbon dioxide"
  },
  {
    "con": "Nước ở trạng thái lỏng có nhiệt độ từ 0°C đến 100°C",
    "re": "Nước sẽ không đóng băng hoặc bay hơi"
  },
  {
    "con": "Cây xanh cần ánh sáng mặt trời để quang hợp",
    "re": "Cây sẽ sản xuất oxy và thức ăn cho chính nó"
  },
  {
    "con": "Động vật có xương sống có hệ thống tuần hoàn",
    "re": "Chúng sẽ có khả năng vận chuyển máu và oxy trong cơ thể"
  },
  {
    "con": "Trái đất quay quanh mặt trời",
    "re": "Ngày và đêm sẽ xảy ra do sự quay của trái đất"
  },
  {
    "con": "Năng lượng mặt trời có thể được chuyển đổi thành điện năng",
    "re": "Điện năng có thể được sử dụng để cung cấp năng lượng cho các thiết bị"
  },
  {
    "con": "Khí carbon dioxide được cây hấp thụ trong quá trình quang hợp",
    "re": "Cây sẽ giúp giảm lượng khí carbon dioxide trong không khí"
  },
  {
    "con": "Nhiệt độ tăng cao có thể làm tan băng",
    "re": "Mực nước biển sẽ dâng lên do sự tan chảy của băng"
  },
  {
    "con": "Sự sống trên trái đất phụ thuộc vào nước",
    "re": "Tất cả các sinh vật cần nước để tồn tại"
  },
  {
    "con": "Các vật thể nặng hơn sẽ rơi nhanh hơn trong chân không",
    "re": "Chúng sẽ không bị ảnh hưởng bởi lực cản của không khí"
  },
  {
    "con": "Sự thay đổi của mùa là do sự nghiêng của trục trái đất",
    "re": "Các mùa sẽ thay đổi theo thời gian trong năm"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước",
    "re": "Ánh sáng sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Nếu một vật được thả từ độ cao",
    "re": "Vật đó sẽ rơi xuống đất do lực hấp dẫn"
  },
  {
    "con": "Khi thực vật quang hợp",
    "re": "Chúng sử dụng ánh sáng mặt trời để tạo ra thức ăn"
  },
  {
    "con": "Nếu một chất rắn được nung nóng",
    "re": "Chất đó sẽ có thể chuyển sang trạng thái lỏng"
  },
  {
    "con": "Khi một con vật di chuyển",
    "re": "Nó sẽ sử dụng năng lượng từ thức ăn để hoạt động"
  },
  {
    "con": "Nếu có sự thay đổi nhiệt độ trong môi trường",
    "re": "Nó có thể ảnh hưởng đến sự sống của các sinh vật"
  },
  {
    "con": "Khi nước bị đóng băng",
    "re": "Nó sẽ chuyển từ trạng thái lỏng sang trạng thái rắn"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác",
    "re": "Nó sẽ có lực hấp dẫn lớn hơn đối với vật đó"
  },
  {
    "con": "Khi một chất hóa học phản ứng với chất khác",
    "re": "Nó có thể tạo ra sản phẩm mới với tính chất khác"
  },
  {
    "con": "Nước là một chất cần thiết cho sự sống của tất cả các sinh vật",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để thực hiện quá trình quang hợp",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Động vật có thể sống trong môi trường khác nhau như rừng, sa mạc và đại dương",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trái đất quay quanh mặt trời trong một năm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Năng lượng mặt trời là nguồn năng lượng tái tạo",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sự thay đổi khí hậu có thể ảnh hưởng đến hệ sinh thái",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các loài động vật có thể thích nghi với môi trường sống của chúng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất rắn, chất lỏng và khí là ba trạng thái của vật chất",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có thể chuyển đổi giữa các trạng thái khác nhau như đông đặc và bay hơi",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sự phân hủy là quá trình tự nhiên giúp tái chế chất hữu cơ trong môi trường",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhóm động vật nào sau đây là loài thú?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước ở trạng thái lỏng có nhiệt độ dưới 0 độ C?",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Một cây xanh có đủ ánh sáng và nước?",
    "re": "Cây sẽ quang hợp và phát triển"
  },
  {
    "con": "Một vật thể được thả từ độ cao?",
    "re": "Vật thể sẽ rơi xuống do trọng lực"
  },
  {
    "con": "Một con vật có lông và đẻ con?",
    "re": "Đó là loài thú"
  },
  {
    "con": "Một chất có thể hòa tan trong nước?",
    "re": "Chất đó được gọi là chất tan"
  },
  {
    "con": "Một cây cối không nhận đủ ánh sáng mặt trời?",
    "re": "Cây sẽ không phát triển tốt"
  },
  {
    "con": "Một vật thể có khối lượng lớn hơn không khí?",
    "re": "Vật thể sẽ chìm xuống"
  },
  {
    "con": "Một con vật có vảy và sống dưới nước?",
    "re": "Đó là loài cá"
  },
  {
    "con": "Một chất có thể dẫn điện tốt?",
    "re": "Chất đó được gọi là chất dẫn điện"
  },
  {
    "con": "Chất đốt lỏng bao gồm:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước ở nhiệt độ 0 độ C trở xuống:",
    "re": "Trở thành băng"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời:",
    "re": "Để thực hiện quá trình quang hợp"
  },
  {
    "con": "Trái đất quay quanh mặt trời:",
    "re": "Tạo ra các mùa trong năm"
  },
  {
    "con": "Khi nhiệt độ tăng lên:",
    "re": "Chất rắn có thể chuyển thành chất lỏng"
  },
  {
    "con": "Khi có lực tác động lên một vật:",
    "re": "Vật đó sẽ thay đổi vận tốc hoặc hướng di chuyển"
  },
  {
    "con": "Khi nước bay hơi:",
    "re": "Nó chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Các loài động vật sống trong môi trường nước:",
    "re": "Có thể thở bằng mang"
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính:",
    "re": "Nó sẽ bị tán sắc thành các màu khác nhau"
  },
  {
    "con": "Khi một vật nóng chạm vào một vật lạnh:",
    "re": "Nhiệt sẽ truyền từ vật nóng sang vật lạnh"
  },
  {
    "con": "Năng lượng gió có ích lợi:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở 100 độ C ở áp suất khí quyển bình thường:",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp:",
    "re": "Chúng sẽ sản xuất ra oxy"
  },
  {
    "con": "Động vật có xương sống có cấu trúc cơ thể phức tạp:",
    "re": "Chúng có khả năng di chuyển linh hoạt hơn"
  },
  {
    "con": "Nhiệt độ tăng lên làm tăng tốc độ phản ứng hóa học:",
    "re": "Phản ứng sẽ diễn ra nhanh hơn"
  },
  {
    "con": "Nước là dung môi tốt cho nhiều chất:",
    "re": "Nó giúp hòa tan các chất dễ dàng"
  },
  {
    "con": "Sự hấp thụ ánh sáng mặt trời bởi các bề mặt tối màu:",
    "re": "Sẽ làm tăng nhiệt độ của bề mặt đó"
  },
  {
    "con": "Sự chuyển động của các vật thể phụ thuộc vào lực tác động:",
    "re": "Vật thể sẽ thay đổi vận tốc hoặc hướng đi"
  },
  {
    "con": "Sự phân hủy của chất hữu cơ trong đất:",
    "re": "Sẽ tạo ra chất dinh dưỡng cho cây trồng"
  },
  {
    "con": "Khí carbon dioxide trong không khí tăng lên:",
    "re": "Sẽ góp phần vào hiện tượng ấm lên toàn cầu"
  },
  {
    "con": "Sơ đồ biểu diễn chu trình sinh sản của ếch là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường,",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái hơi"
  },
  {
    "con": "Cây xanh quang hợp vào ban ngày,",
    "re": "Cây sẽ sản xuất oxy và hấp thụ carbon dioxide"
  },
  {
    "con": "Động vật có xương sống có cấu trúc cơ thể phức tạp hơn động vật không xương sống,",
    "re": "Chúng thường có hệ thống tuần hoàn và hệ thần kinh phát triển hơn"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước,",
    "re": "Ánh sáng sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Sự bay hơi xảy ra khi nhiệt độ của chất lỏng tăng lên,",
    "re": "Chất lỏng sẽ chuyển thành hơi"
  },
  {
    "con": "Khi một vật thể được nung nóng,",
    "re": "Nó sẽ nở ra do sự gia tăng năng lượng của các phân tử"
  },
  {
    "con": "Khi có sự thay đổi trong môi trường sống,",
    "re": "Sinh vật có thể thích nghi hoặc bị tuyệt chủng"
  },
  {
    "con": "Năng lượng mặt trời là nguồn năng lượng tái tạo,",
    "re": "Nó có thể được sử dụng để sản xuất điện và nhiệt"
  },
  {
    "con": "Khi một chất bị hòa tan trong nước,",
    "re": "Chất đó sẽ phân tán thành các phân tử nhỏ hơn trong dung dịch"
  },
  {
    "con": "Năng lượng mặt trời là nguồn năng lượng tái tạo",
    "re": "Năng lượng mặt trời có thể được sử dụng để sản xuất điện và nhiệt"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái hơi"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp",
    "re": "Thực vật sẽ sản xuất oxy và glucose"
  },
  {
    "con": "Động vật có xương sống có hệ thống tuần hoàn kín",
    "re": "Máu sẽ được bơm từ tim đến các bộ phận khác trong cơ thể"
  },
  {
    "con": "Khí carbon dioxide là sản phẩm phụ của quá trình hô hấp",
    "re": "Khí này sẽ được thực vật hấp thụ trong quá trình quang hợp"
  },
  {
    "con": "Sự thay đổi của mùa là do sự nghiêng của trục Trái Đất",
    "re": "Các mùa sẽ thay đổi theo vị trí của Trái Đất quanh Mặt Trời"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt",
    "re": "Năng lượng chỉ có thể chuyển đổi từ dạng này sang dạng khác"
  },
  {
    "con": "Đất là nơi sinh sống của nhiều sinh vật",
    "re": "Đất cung cấp chất dinh dưỡng và môi trường cho thực vật và động vật"
  },
  {
    "con": "Nước là một chất cần thiết cho sự sống",
    "re": "Tất cả các sinh vật đều cần nước để duy trì sự sống"
  },
  {
    "con": "Sự phân hủy là quá trình tự nhiên của các chất hữu cơ",
    "re": "Quá trình này giúp tái tạo chất dinh dưỡng trong đất"
  },
  {
    "con": "Hiện tượng đầu nhụy nhận được hạt phấn của nhị gọi là gì?",
    "re": "Thụ phấn"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào dưới áp suất khí quyển bình thường?",
    "re": "100 độ C"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, hiện tượng gì xảy ra?",
    "re": "Khúc xạ ánh sáng"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác nhưng có thể nổi trên nước, thì vật đó có gì?",
    "re": "Mật độ nhỏ hơn nước"
  },
  {
    "con": "Khi cây xanh quang hợp, cây sẽ sản xuất ra gì?",
    "re": "Oxy và glucose"
  },
  {
    "con": "Nếu một chất có nhiệt độ cao hơn môi trường xung quanh, thì chất đó sẽ làm gì?",
    "re": "Tỏa nhiệt ra môi trường"
  },
  {
    "con": "Khi một vật chuyển động tròn, lực nào giữ cho vật đó không bay ra ngoài?",
    "re": "Lực hướng tâm"
  },
  {
    "con": "Nếu một chất rắn được nung nóng đến nhiệt độ cao, thì chất đó sẽ làm gì?",
    "re": "Chuyển sang trạng thái lỏng"
  },
  {
    "con": "Khi có ánh sáng chiếu vào một vật, vật đó sẽ làm gì?",
    "re": "Phản xạ ánh sáng"
  },
  {
    "con": "Nếu một sinh vật không có khả năng tự sản xuất thức ăn, thì sinh vật đó được gọi là gì?",
    "re": "Động vật"
  },
  {
    "con": "Sự biến đổi hóa học là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở 100 độ C ở áp suất khí quyển bình thường:",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp:",
    "re": "Chúng sẽ sản xuất ra oxy và glucose"
  },
  {
    "con": "Khi nhiệt độ giảm, thể tích khí sẽ giảm:",
    "re": "Áp suất của khí sẽ tăng lên"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao:",
    "re": "Nó sẽ rơi xuống do lực hấp dẫn"
  },
  {
    "con": "Khi nước đóng băng, nó sẽ mở rộng ra:",
    "re": "Đá sẽ nổi trên mặt nước"
  },
  {
    "con": "Nếu một chất dẫn điện được kết nối với nguồn điện:",
    "re": "Điện sẽ chạy qua chất đó"
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính:",
    "re": "Nó sẽ bị tán sắc thành các màu khác nhau"
  },
  {
    "con": "Nếu một sinh vật không có đủ thức ăn:",
    "re": "Nó sẽ không thể sống sót lâu dài"
  },
  {
    "con": "Khi một chất lỏng bay hơi:",
    "re": "Nó sẽ chuyển thành dạng khí"
  },
  {
    "con": "Nước được làm nóng đến 100 độ C",
    "re": "nước sẽ sôi và chuyển thành hơi nước"
  },
  {
    "con": "Một vật nặng được thả từ độ cao",
    "re": "vật đó sẽ rơi xuống đất do lực hấp dẫn"
  },
  {
    "con": "Thực vật nhận ánh sáng mặt trời",
    "re": "chúng sẽ thực hiện quá trình quang hợp để tạo ra năng lượng"
  },
  {
    "con": "Khi trộn baking soda với giấm",
    "re": "sẽ xảy ra phản ứng hóa học tạo ra khí carbon dioxide"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C",
    "re": "nước sẽ đóng băng thành băng"
  },
  {
    "con": "Khi một vật di chuyển nhanh hơn âm thanh",
    "re": "vật đó sẽ tạo ra sóng xung kích"
  },
  {
    "con": "Khi một chất lỏng được làm lạnh",
    "re": "chất lỏng sẽ co lại và có thể trở thành rắn"
  },
  {
    "con": "Khi ánh sáng chiếu vào một gương phẳng",
    "re": "ánh sáng sẽ phản xạ theo định luật phản xạ ánh sáng"
  },
  {
    "con": "Khi một động vật không có khả năng thích nghi với môi trường",
    "re": "động vật đó có thể gặp nguy hiểm và có thể bị tuyệt chủng"
  },
  {
    "con": "Khi một chất bị đốt cháy",
    "re": "sẽ tạo ra nhiệt và ánh sáng"
  },
  {
    "con": "Phải làm gì khi thấy dây điện ở nhà bị đứt hoặc người nhà bị điện giật?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các vật cho dòng điện chạy qua gọi là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước ở trạng thái lỏng khi nhiệt độ từ 0 đến 100 độ C?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một vật nặng hơn vật khác thì vật đó sẽ rơi nhanh hơn?",
    "re": "Sai, tất cả các vật rơi với tốc độ giống nhau trong chân không"
  },
  {
    "con": "Cây xanh sản xuất oxy thông qua quá trình quang hợp?",
    "re": "Đúng"
  },
  {
    "con": "Nếu ánh sáng mặt trời chiếu vào một vật thì vật đó sẽ nóng lên?",
    "re": "Đúng"
  },
  {
    "con": "Nước là một chất lỏng không có hình dạng cố định?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một vật được đun nóng thì nó sẽ nở ra?",
    "re": "Đúng"
  },
  {
    "con": "Nếu không có lực tác động thì một vật sẽ không thay đổi trạng thái chuyển động?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một chất có nhiệt độ cao hơn chất khác thì nó sẽ truyền nhiệt cho chất đó?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn thì nó sẽ luôn chìm trong nước?",
    "re": "Sai, điều này phụ thuộc vào mật độ của vật đó"
  },
  {
    "con": "Sự biến đổi hóa học là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường:",
    "re": "Nước chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp:",
    "re": "Chúng sản xuất ra oxy và glucose"
  },
  {
    "con": "Trái đất quay quanh mặt trời:",
    "re": "Tạo ra các mùa trong năm"
  },
  {
    "con": "Khi nhiệt độ giảm, các phân tử trong chất rắn di chuyển chậm lại:",
    "re": "Chất rắn trở nên cứng hơn"
  },
  {
    "con": "Sự hấp thụ nước của rễ cây:",
    "re": "Giúp cây duy trì sự sống và phát triển"
  },
  {
    "con": "Khi một vật thể được nung nóng:",
    "re": "Nó sẽ nở ra và có thể thay đổi hình dạng"
  },
  {
    "con": "Sự phân hủy của chất hữu cơ trong đất:",
    "re": "Cung cấp dinh dưỡng cho cây trồng"
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính:",
    "re": "Nó sẽ bị khúc xạ và tạo ra cầu vồng"
  },
  {
    "con": "Sự chuyển động của các hành tinh trong hệ mặt trời:",
    "re": "Được điều khiển bởi lực hấp dẫn của mặt trời"
  },
  {
    "con": "Cá heo là loài vật:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C:",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Cây xanh quang hợp:",
    "re": "Cây sẽ sản xuất oxy"
  },
  {
    "con": "Trái đất quay quanh mặt trời:",
    "re": "Trái đất sẽ trải qua các mùa"
  },
  {
    "con": "Động vật có xương sống:",
    "re": "Chúng có cấu trúc xương bên trong"
  },
  {
    "con": "Năng lượng mặt trời là nguồn năng lượng tái tạo:",
    "re": "Năng lượng này có thể được sử dụng để sản xuất điện"
  },
  {
    "con": "Nước là chất lỏng:",
    "re": "Nước có thể tồn tại ở ba trạng thái: rắn, lỏng và khí"
  },
  {
    "con": "Sắt là một kim loại:",
    "re": "Sắt có khả năng dẫn điện và dẫn nhiệt"
  },
  {
    "con": "Côn trùng có ba phần cơ thể:",
    "re": "Côn trùng có đầu, ngực và bụng"
  },
  {
    "con": "Khí carbon dioxide là sản phẩm của quá trình hô hấp:",
    "re": "Khí này được thực vật sử dụng trong quá trình quang hợp"
  },
  {
    "con": "Nước ở trạng thái lỏng có thể chuyển thành hơi nước khi nhiệt độ tăng lên?",
    "re": "Đúng, quá trình này gọi là bay hơi."
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để thực hiện quá trình quang hợp?",
    "re": "Đúng, quang hợp giúp thực vật sản xuất thức ăn."
  },
  {
    "con": "Động vật có xương sống và động vật không xương sống đều có thể sống trong môi trường nước?",
    "re": "Đúng, cả hai loại động vật này đều có thể thích nghi với môi trường nước."
  },
  {
    "con": "Khi một vật bị nung nóng, nó sẽ giãn nở ra?",
    "re": "Đúng, hiện tượng này gọi là giãn nở nhiệt."
  },
  {
    "con": "Sự sống trên Trái Đất phụ thuộc vào nước?",
    "re": "Đúng, nước là yếu tố thiết yếu cho sự sống."
  },
  {
    "con": "Khi có ánh sáng chiếu vào một vật, nó có thể tạo ra bóng tối?",
    "re": "Đúng, bóng tối hình thành khi ánh sáng bị cản trở."
  },
  {
    "con": "Các loài động vật khác nhau có thể sống trong các môi trường khác nhau như rừng, sa mạc và đại dương?",
    "re": "Đúng, mỗi loài động vật có sự thích nghi riêng với môi trường sống."
  },
  {
    "con": "Khi một chất rắn tan trong nước, nó sẽ tạo ra dung dịch?",
    "re": "Đúng, quá trình này gọi là hòa tan."
  },
  {
    "con": "Sự thay đổi của thời tiết có thể ảnh hưởng đến sự phát triển của cây trồng?",
    "re": "Đúng, thời tiết ảnh hưởng đến sự sinh trưởng và phát triển của cây."
  },
  {
    "con": "Khi một vật rơi tự do, nó sẽ chịu tác động của trọng lực?",
    "re": "Đúng, trọng lực là lực kéo vật về phía trung tâm Trái Đất."
  },
  {
    "con": "Bạn có thể làm gì để diệt trừ muỗi ngay từ trứng hoặc ấu trùng của nó?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Loài vật nào dưới đây đẻ nhiều con nhất trong một lứa?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có thể tồn tại ở ba trạng thái khác nhau?",
    "re": "Chất lỏng, chất rắn và khí"
  },
  {
    "con": "Ánh sáng mặt trời có thể giúp cây quang hợp?",
    "re": "Cây sẽ sản xuất ra oxy và thức ăn"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, nó sẽ rơi xuống đất?",
    "re": "Vật thể sẽ chịu tác động của trọng lực"
  },
  {
    "con": "Nếu nhiệt độ của nước đạt 100 độ C, nước sẽ làm gì?",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Nếu một loài động vật sống trong nước, nó sẽ có đặc điểm gì?",
    "re": "Chúng thường có vây và mang để thở"
  },
  {
    "con": "Nếu một cây không nhận đủ ánh sáng mặt trời, nó sẽ như thế nào?",
    "re": "Cây sẽ không phát triển tốt và có thể chết"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn nước, nó sẽ nổi hay chìm?",
    "re": "Vật đó sẽ chìm"
  },
  {
    "con": "Nếu một chất được đun nóng, nó sẽ xảy ra điều gì?",
    "re": "Chất đó sẽ mở rộng và có thể thay đổi trạng thái"
  },
  {
    "con": "Nếu một loài động vật có lông, nó có thể sống ở đâu?",
    "re": "Chúng có thể sống ở nhiều môi trường khác nhau, bao gồm cả trên cạn và dưới nước"
  },
  {
    "con": "Trong các nguồn năng lượng dưới đây, nguồn năng lượng nào là năng lượng sạch (Khi sử dụng năng lượng đó sẽ không tạo ra khí thải gây ô nhiễm môi trường?)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nước được đun nóng đến 100 độ C ở áp suất bình thường thì",
    "re": "nước sẽ chuyển sang trạng thái hơi"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao nhất định thì",
    "re": "vật thể đó sẽ rơi xuống đất do lực hấp dẫn"
  },
  {
    "con": "Khi thực hiện quá trình quang hợp, cây xanh sẽ",
    "re": "sản xuất ra oxy và glucose"
  },
  {
    "con": "Nếu một chất được hòa tan trong nước thì",
    "re": "chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới điểm đóng băng của nước thì",
    "re": "nước sẽ chuyển sang trạng thái rắn"
  },
  {
    "con": "Nếu một con vật có xương sống thì",
    "re": "nó thuộc vào nhóm động vật có xương sống"
  },
  {
    "con": "Khi ánh sáng mặt trời chiếu vào một vật thể màu xanh lá cây thì",
    "re": "vật thể đó sẽ phản xạ ánh sáng màu xanh lá cây"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7 thì",
    "re": "chất đó được coi là axit"
  },
  {
    "con": "Khi một vật thể di chuyển với tốc độ không đổi thì",
    "re": "vật thể đó có gia tốc bằng 0"
  },
  {
    "con": "Năng lượng mặt trời dùng để:",
    "re": "Cung cấp năng lượng cho sự sống trên Trái Đất"
  },
  {
    "con": "Nước sôi ở nhiệt độ:",
    "re": "100 độ C ở áp suất khí quyển bình thường"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để:",
    "re": "Thực hiện quá trình quang hợp"
  },
  {
    "con": "Khi nhiệt độ giảm, chất khí:",
    "re": "Sẽ co lại và có thể tạo ra áp suất thấp hơn"
  },
  {
    "con": "Động vật có xương sống bao gồm:",
    "re": "Cá, chim, bò sát, lưỡng cư và động vật có vú"
  },
  {
    "con": "Khi nước đóng băng, nó:",
    "re": "Mở rộng và trở nên nhẹ hơn so với nước lỏng"
  },
  {
    "con": "Sự hấp thụ nước của cây diễn ra qua:",
    "re": "Rễ cây"
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính, nó:",
    "re": "Bị tán sắc thành các màu khác nhau"
  },
  {
    "con": "Khi một vật chuyển động, nó có thể:",
    "re": "Thay đổi vị trí theo thời gian"
  },
  {
    "con": "Sự sống trên Trái Đất phụ thuộc vào:",
    "re": "Nước, không khí và ánh sáng mặt trời"
  },
  {
    "con": "Nước được đun sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái hơi"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp",
    "re": "Thực vật sẽ sản xuất ra oxy và glucose"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Khi một vật thể được thả từ độ cao",
    "re": "Vật thể sẽ rơi xuống do lực hấp dẫn"
  },
  {
    "con": "Khi một chất được hòa tan trong nước",
    "re": "Chất đó sẽ phân tán đều trong nước"
  },
  {
    "con": "Khi có ánh sáng chiếu vào một vật thể trong suốt",
    "re": "Ánh sáng sẽ đi qua vật thể đó"
  },
  {
    "con": "Khi một chất rắn được nung nóng",
    "re": "Chất rắn sẽ nở ra và có thể chuyển sang trạng thái lỏng"
  },
  {
    "con": "Khi có sự thay đổi nhiệt độ trong không khí",
    "re": "Áp suất không khí sẽ thay đổi"
  },
  {
    "con": "Khi một động vật không có thức ăn trong thời gian dài",
    "re": "Động vật sẽ bị suy yếu và có thể chết"
  },
  {
    "con": "Khi một chất hóa học phản ứng với chất khác",
    "re": "Sẽ tạo ra các sản phẩm mới với tính chất khác biệt"
  },
  {
    "con": "Tài nguyên thiên nhiên là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào?",
    "re": "100 độ C ở áp suất khí quyển bình thường"
  },
  {
    "con": "Thực vật cần gì để quang hợp?",
    "re": "Ánh sáng mặt trời, nước và carbon dioxide"
  },
  {
    "con": "Trái đất quay quanh mặt trời trong bao lâu?",
    "re": "Khoảng 365 ngày"
  },
  {
    "con": "Sự sống bắt đầu từ đâu?",
    "re": "Tế bào"
  },
  {
    "con": "Khi nhiệt độ giảm, chất rắn sẽ làm gì?",
    "re": "Co lại"
  },
  {
    "con": "Âm thanh di chuyển qua môi trường nào nhanh nhất?",
    "re": "Chất rắn"
  },
  {
    "con": "Năng lượng mặt trời có thể được chuyển đổi thành năng lượng nào?",
    "re": "Năng lượng điện"
  },
  {
    "con": "Khi nước đông lại, nó sẽ làm gì?",
    "re": "Mở rộng ra"
  },
  {
    "con": "Hệ sinh thái bao gồm những gì?",
    "re": "Các sinh vật sống và môi trường sống của chúng"
  },
  {
    "con": "Các chất như thuỷ tinh, kim loại sẽ chuyển từ thể rắn sang thể lỏng ở nhiệt độ nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sẽ chuyển từ thể lỏng sang thể khí khi nhiệt độ đạt đến 100 độ C ở áp suất tiêu chuẩn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, thì nó sẽ rơi xuống đất do lực hấp dẫn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu cây xanh không nhận đủ ánh sáng mặt trời, thì chúng sẽ không thể thực hiện quá trình quang hợp?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất được hòa tan trong nước, thì nó sẽ tạo thành dung dịch?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu nhiệt độ môi trường tăng lên, thì tốc độ phản ứng hóa học sẽ tăng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật thể có khối lượng lớn hơn, thì nó sẽ có trọng lực lớn hơn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một con vật có lông, thì nó có thể sống trong môi trường lạnh hơn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7, thì nó được coi là axit?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguồn năng lượng được sử dụng để làm nóng nước, thì nước sẽ chuyển từ thể lỏng sang thể khí?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào ở mức áp suất tiêu chuẩn?",
    "re": "100 độ C"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nó sẽ bị gì?",
    "re": "Khúc xạ"
  },
  {
    "con": "Nếu một vật nặng hơn rơi tự do từ độ cao, thì vật đó sẽ đạt được gì?",
    "re": "Tốc độ cao hơn khi chạm đất"
  },
  {
    "con": "Khi cây quang hợp, nó sẽ tạo ra gì?",
    "re": "Oxy và glucose"
  },
  {
    "con": "Nếu một chất rắn được nung nóng, thì nó sẽ xảy ra gì?",
    "re": "Có thể chuyển sang trạng thái lỏng"
  },
  {
    "con": "Khi nước đóng băng, nó sẽ làm gì?",
    "re": "Mở rộng thể tích"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn, thì lực hấp dẫn tác động lên nó sẽ như thế nào?",
    "re": "Lớn hơn"
  },
  {
    "con": "Khi một chất lỏng bay hơi, nó sẽ làm gì?",
    "re": "Chuyển từ trạng thái lỏng sang khí"
  },
  {
    "con": "Nếu một động vật có xương sống, thì nó thuộc nhóm nào?",
    "re": "Động vật có xương"
  },
  {
    "con": "Khi ánh sáng mặt trời chiếu vào một bề mặt phản chiếu, thì nó sẽ làm gì?",
    "re": "Phản xạ ánh sáng"
  },
  {
    "con": "Cơ quan sinh sản của thực vật có hoa là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là thành phần chính của tế bào sống?",
    "re": "Đúng"
  },
  {
    "con": "Nếu ánh sáng mặt trời chiếu vào cây thì cây sẽ thực hiện quá trình quang hợp?",
    "re": "Đúng"
  },
  {
    "con": "Nếu động vật không có môi trường sống thì chúng sẽ không thể tồn tại?",
    "re": "Đúng"
  },
  {
    "con": "Nếu nhiệt độ tăng cao thì nước sẽ chuyển từ trạng thái lỏng sang trạng thái khí?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một vật nặng hơn vật khác thì nó sẽ có trọng lực lớn hơn?",
    "re": "Đúng"
  },
  {
    "con": "Nếu thực vật không có nước thì chúng sẽ héo và chết?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một chất không hòa tan trong nước thì nó sẽ không bị phân hủy trong nước?",
    "re": "Đúng"
  },
  {
    "con": "Nếu có sự thay đổi trong môi trường thì sinh vật có thể thích nghi hoặc chết?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một vật được làm từ kim loại thì nó sẽ dẫn điện tốt hơn so với vật liệu phi kim loại?",
    "re": "Đúng"
  },
  {
    "con": "Trong các động vật dưới đây động vật nào đẻ nhiều con trong một lứa?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu nước được đun sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường,",
    "re": "nước sẽ chuyển từ trạng thái lỏng sang trạng thái hơi."
  },
  {
    "con": "Nếu cây xanh quang hợp vào ban ngày,",
    "re": "cây sẽ sản xuất ra oxy và glucose."
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao,",
    "re": "vật thể đó sẽ rơi xuống đất do lực hấp dẫn."
  },
  {
    "con": "Nếu một chất rắn được nung nóng,",
    "re": "chất đó sẽ có thể chuyển sang trạng thái lỏng."
  },
  {
    "con": "Nếu có ánh sáng chiếu vào một vật thể màu xanh,",
    "re": "vật thể đó sẽ phản xạ ánh sáng màu xanh và hấp thụ các màu khác."
  },
  {
    "con": "Nếu một động vật có xương sống,",
    "re": "động vật đó thuộc nhóm động vật có xương."
  },
  {
    "con": "Nếu một chất lỏng được cho vào một bình chứa có hình dạng khác,",
    "re": "chất lỏng sẽ chiếm toàn bộ thể tích của bình chứa."
  },
  {
    "con": "Nếu một cây được tưới nước đầy đủ,",
    "re": "cây sẽ phát triển khỏe mạnh và xanh tốt."
  },
  {
    "con": "Nếu một vật thể có khối lượng lớn hơn vật thể khác,",
    "re": "vật thể đó sẽ có trọng lực lớn hơn."
  },
  {
    "con": "Nước sôi ở nhiệt độ nào dưới áp suất khí quyển bình thường?",
    "re": "100 độ C"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nó sẽ bị hiện tượng gì?",
    "re": "Khúc xạ"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác nhưng có thể nổi trên nước, thì vật đó có thể có gì?",
    "re": "Mật độ thấp hơn nước"
  },
  {
    "con": "Khi cây xanh quang hợp, nó sử dụng ánh sáng mặt trời để làm gì?",
    "re": "Sản xuất glucose và oxy"
  },
  {
    "con": "Nếu một chất có nhiệt độ cao hơn chất khác, thì chất đó sẽ làm gì?",
    "re": "Nóng lên và truyền nhiệt cho chất kia"
  },
  {
    "con": "Khi nước chuyển từ thể lỏng sang thể hơi, quá trình này được gọi là gì?",
    "re": "Bốc hơi"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao, thì nó sẽ chịu tác động của lực nào?",
    "re": "Trọng lực"
  },
  {
    "con": "Khi một chất thay đổi trạng thái từ rắn sang lỏng, quá trình này được gọi là gì?",
    "re": "Nóng chảy"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, thì nó cần có gì để thở?",
    "re": "Oxy hòa tan trong nước"
  },
  {
    "con": "Khi một dòng điện chạy qua dây dẫn, nó sẽ tạo ra gì?",
    "re": "Từ trường"
  },
  {
    "con": "Hợp tử phát triển thành gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào dưới áp suất khí quyển bình thường?",
    "re": "100 độ C"
  },
  {
    "con": "Thực vật cần yếu tố nào để thực hiện quá trình quang hợp?",
    "re": "Ánh sáng mặt trời"
  },
  {
    "con": "Khi nhiệt độ giảm, thể tích của khí sẽ như thế nào?",
    "re": "Giảm"
  },
  {
    "con": "Khi một vật di chuyển nhanh hơn, động năng của nó sẽ như thế nào?",
    "re": "Tăng"
  },
  {
    "con": "Khi nước chuyển từ thể lỏng sang thể khí, quá trình này gọi là gì?",
    "re": "Bốc hơi"
  },
  {
    "con": "Nếu một vật nặng hơn rơi từ độ cao, thì nó sẽ có gì khi chạm đất?",
    "re": "Động năng lớn hơn"
  },
  {
    "con": "Khi ánh sáng đi qua một lăng kính, nó sẽ bị gì?",
    "re": "Khúc xạ"
  },
  {
    "con": "Nếu một sinh vật không có đủ thức ăn, thì nó sẽ gặp phải điều gì?",
    "re": "Suy dinh dưỡng"
  },
  {
    "con": "Khi một chất rắn nóng chảy, nó sẽ chuyển sang trạng thái nào?",
    "re": "Thể lỏng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào dưới áp suất khí quyển bình thường?",
    "re": "100 độ C"
  },
  {
    "con": "Cây xanh sản xuất oxy qua quá trình nào?",
    "re": "Quang hợp"
  },
  {
    "con": "Động vật nào có khả năng bay?",
    "re": "Chim"
  },
  {
    "con": "Trái đất quay quanh mặt trời trong khoảng thời gian bao lâu?",
    "re": "Một năm"
  },
  {
    "con": "Năng lượng mặt trời được chuyển đổi thành năng lượng hóa học trong quá trình nào?",
    "re": "Quang hợp"
  },
  {
    "con": "Khi nước đông lại, nó sẽ trở thành gì?",
    "re": "Đá"
  },
  {
    "con": "Sự thay đổi trạng thái từ lỏng sang khí gọi là gì?",
    "re": "Bốc hơi"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nó sẽ bị gì?",
    "re": "Khúc xạ"
  },
  {
    "con": "Động lực nào giúp các hành tinh quay quanh mặt trời?",
    "re": "Lực hấp dẫn"
  },
  {
    "con": "Khi nhiệt độ giảm, chất khí sẽ làm gì?",
    "re": "Co lại"
  },
  {
    "con": "Nước ở trạng thái lỏng có nhiệt độ dưới 0 độ C?",
    "re": "Nước sẽ chuyển sang trạng thái rắn (đóng băng)"
  },
  {
    "con": "Cây xanh có khả năng quang hợp vào ban ngày?",
    "re": "Cây sẽ sản xuất oxy và hấp thụ carbon dioxide"
  },
  {
    "con": "Động vật có xương sống có đặc điểm gì chung?",
    "re": "Chúng đều có hệ thống xương và tủy sống"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nó sẽ xảy ra hiện tượng gì?",
    "re": "Ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, nó sẽ rơi xuống?",
    "re": "Vật thể sẽ chịu tác động của trọng lực"
  },
  {
    "con": "Khi nhiệt độ tăng, thể tích của khí sẽ thay đổi?",
    "re": "Thể tích khí sẽ tăng lên theo định luật Charles"
  },
  {
    "con": "Nếu một chất không hòa tan trong nước, nó sẽ nổi lên?",
    "re": "Chất đó có thể là chất rắn hoặc chất lỏng nhẹ hơn nước"
  },
  {
    "con": "Khi một chất bị đốt cháy, nó sẽ tạo ra gì?",
    "re": "Chất đó sẽ tạo ra khí carbon dioxide và nhiệt"
  },
  {
    "con": "Nếu một sinh vật không có khả năng tự sản xuất thức ăn, nó sẽ phải làm gì?",
    "re": "Sinh vật đó sẽ phải tiêu thụ thực phẩm từ nguồn khác"
  },
  {
    "con": "Khi một vật thể di chuyển nhanh hơn âm thanh, nó sẽ tạo ra hiện tượng gì?",
    "re": "Vật thể sẽ tạo ra sóng xung kích"
  },
  {
    "con": "Loại tơ sợi nào dưới đây không có nguồn gốc từ thực vật?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào dưới áp suất khí quyển bình thường?",
    "re": "100 độ C"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để thực hiện quá trình nào?",
    "re": "Quang hợp"
  },
  {
    "con": "Khi nhiệt độ giảm, thể tích của khí sẽ như thế nào?",
    "re": "Giảm"
  },
  {
    "con": "Sự chuyển động của các hành tinh quanh mặt trời được gọi là gì?",
    "re": "Quỹ đạo"
  },
  {
    "con": "Khi một vật bị đốt cháy, nó sẽ tạo ra sản phẩm gì?",
    "re": "Khí carbon dioxide và nhiệt"
  },
  {
    "con": "Khi nước chuyển từ thể lỏng sang thể khí, quá trình này được gọi là gì?",
    "re": "Bốc hơi"
  },
  {
    "con": "Sự hấp thụ nước và khoáng chất của cây diễn ra qua bộ phận nào?",
    "re": "Rễ"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nó sẽ bị gì?",
    "re": "Khúc xạ"
  },
  {
    "con": "Khi một vật di chuyển nhanh hơn âm thanh, nó sẽ tạo ra hiện tượng gì?",
    "re": "Sóng xung"
  },
  {
    "con": "Khi một chất rắn tan trong nước, hiện tượng này được gọi là gì?",
    "re": "Hòa tan"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào?",
    "re": "100 độ C ở áp suất khí quyển bình thường"
  },
  {
    "con": "Thực vật cần gì để quang hợp?",
    "re": "Ánh sáng mặt trời, nước và carbon dioxide"
  },
  {
    "con": "Động vật có xương sống có đặc điểm gì?",
    "re": "Chúng có hệ xương và tủy sống"
  },
  {
    "con": "Khi nào thì nước chuyển thành băng?",
    "re": "Khi nhiệt độ giảm xuống dưới 0 độ C"
  },
  {
    "con": "Tại sao chúng ta cần không khí?",
    "re": "Để hô hấp và duy trì sự sống"
  },
  {
    "con": "Ánh sáng mặt trời có vai trò gì đối với Trái Đất?",
    "re": "Cung cấp năng lượng cho sự sống và điều hòa khí hậu"
  },
  {
    "con": "Khi nào thì cây cối ra hoa?",
    "re": "Khi điều kiện môi trường như ánh sáng và nước phù hợp"
  },
  {
    "con": "Tại sao động vật di cư?",
    "re": "Để tìm kiếm thức ăn và điều kiện sống tốt hơn"
  },
  {
    "con": "Chất rắn, chất lỏng và khí có điểm gì chung?",
    "re": "Chúng đều là các trạng thái của vật chất"
  },
  {
    "con": "Khi nào thì xảy ra hiện tượng thủy triều?",
    "re": "Khi có sự tác động của lực hấp dẫn từ Mặt Trăng và Mặt Trời"
  },
  {
    "con": "Nước được làm nóng",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái hơi"
  },
  {
    "con": "Thực vật nhận ánh sáng mặt trời",
    "re": "Thực vật sẽ thực hiện quá trình quang hợp để tạo ra thức ăn"
  },
  {
    "con": "Động vật sống trong môi trường có đủ thức ăn và nước",
    "re": "Động vật sẽ phát triển và sinh sản tốt hơn"
  },
  {
    "con": "Chúng ta thả một viên đá vào nước",
    "re": "Viên đá sẽ chìm xuống đáy nước"
  },
  {
    "con": "Chúng ta trồng hạt giống trong đất",
    "re": "Hạt giống sẽ nảy mầm và phát triển thành cây"
  },
  {
    "con": "Nhiệt độ giảm xuống dưới 0 độ C",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Chúng ta sử dụng nam châm gần các vật liệu sắt",
    "re": "Các vật liệu sắt sẽ bị hút bởi nam châm"
  },
  {
    "con": "Chúng ta thả một quả bóng cao su từ độ cao",
    "re": "Quả bóng sẽ rơi xuống đất và nảy lên"
  },
  {
    "con": "Chúng ta quan sát các hành tinh trong hệ mặt trời",
    "re": "Chúng ta sẽ thấy rằng các hành tinh quay quanh mặt trời"
  },
  {
    "con": "Chúng ta không tưới nước cho cây",
    "re": "Cây sẽ héo và có thể chết"
  },
  {
    "con": "Em có thể làm gì để thực hiện an toàn giao thông đường bộ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất dẻo được làm ra từ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường:",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Cây xanh quang hợp vào ban ngày:",
    "re": "Cây sẽ sản xuất oxy"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C:",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Khi ánh sáng mặt trời chiếu vào một vật thể màu đen:",
    "re": "Vật thể sẽ hấp thụ nhiều nhiệt hơn"
  },
  {
    "con": "Khi một vật thể di chuyển nhanh hơn âm thanh:",
    "re": "Vật thể sẽ tạo ra sóng xung"
  },
  {
    "con": "Khi một chất lỏng được làm nóng:",
    "re": "Chất lỏng sẽ mở rộng thể tích"
  },
  {
    "con": "Khi có lực tác động lên một vật thể:",
    "re": "Vật thể sẽ thay đổi trạng thái chuyển động"
  },
  {
    "con": "Khi một hạt nhân nguyên tử phân rã:",
    "re": "Năng lượng sẽ được giải phóng"
  },
  {
    "con": "Khi có sự thay đổi trong môi trường sống:",
    "re": "Các loài sinh vật có thể thích nghi hoặc bị tuyệt chủng"
  },
  {
    "con": "Chất dẻo có tính chất gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước ở nhiệt độ 0 độ C sẽ làm gì?",
    "re": "Trở thành băng"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để làm gì?",
    "re": "Quang hợp và sản xuất thức ăn"
  },
  {
    "con": "Khi nhiệt độ tăng, chất rắn sẽ làm gì?",
    "re": "Có thể chuyển sang trạng thái lỏng"
  },
  {
    "con": "Khi có lực tác động lên một vật, vật đó sẽ làm gì?",
    "re": "Có thể thay đổi vận tốc hoặc hướng chuyển động"
  },
  {
    "con": "Khi nước bay hơi, nó sẽ làm gì?",
    "re": "Chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Khi thực vật không có nước, chúng sẽ làm gì?",
    "re": "Héo và có thể chết"
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính, nó sẽ làm gì?",
    "re": "Bị khúc xạ và tạo ra cầu vồng"
  },
  {
    "con": "Khi một vật nóng chạm vào một vật lạnh, điều gì xảy ra?",
    "re": "Nhiệt độ của vật nóng giảm và nhiệt độ của vật lạnh tăng"
  },
  {
    "con": "Khi có sự thay đổi trong môi trường, động vật sẽ làm gì?",
    "re": "Có thể di cư hoặc thích nghi"
  },
  {
    "con": "Chất lỏng có đặc điểm gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào dưới áp suất bình thường?",
    "re": "100 độ C"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để làm gì?",
    "re": "Quá trình quang hợp"
  },
  {
    "con": "Khi nhiệt độ giảm, chất khí sẽ làm gì?",
    "re": "Co lại"
  },
  {
    "con": "Động vật có xương sống có đặc điểm gì?",
    "re": "Có hệ xương"
  },
  {
    "con": "Khi một vật bị đẩy, nó sẽ làm gì?",
    "re": "Di chuyển theo hướng lực tác động"
  },
  {
    "con": "Năng lượng mặt trời có thể được chuyển đổi thành năng lượng nào?",
    "re": "Năng lượng điện"
  },
  {
    "con": "Khi nước đóng băng, nó sẽ làm gì?",
    "re": "Trở thành đá"
  },
  {
    "con": "Các loài động vật sống trong nước thường có đặc điểm gì?",
    "re": "Có vây và mang"
  },
  {
    "con": "Khi một vật nóng lên, nó sẽ làm gì?",
    "re": "Nở ra"
  },
  {
    "con": "Tài nguyên thiên nhiên là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ bao nhiêu độ C?",
    "re": "100 độ C ở áp suất khí quyển bình thường"
  },
  {
    "con": "Thực vật cần gì để quang hợp?",
    "re": "Ánh sáng mặt trời, nước và carbon dioxide"
  },
  {
    "con": "Trái đất quay quanh mặt trời trong bao lâu?",
    "re": "Khoảng 365 ngày"
  },
  {
    "con": "Sự sống trên trái đất phụ thuộc vào yếu tố nào?",
    "re": "Nước, không khí, ánh sáng và nhiệt độ"
  },
  {
    "con": "Khi nhiệt độ giảm, chất rắn sẽ làm gì?",
    "re": "Co lại"
  },
  {
    "con": "Âm thanh di chuyển qua môi trường nào nhanh nhất?",
    "re": "Rắn"
  },
  {
    "con": "Sự chuyển động của các hành tinh trong hệ mặt trời là gì?",
    "re": "Quay quanh mặt trời theo quỹ đạo"
  },
  {
    "con": "Năng lượng mặt trời có thể được chuyển đổi thành năng lượng nào?",
    "re": "Năng lượng điện thông qua pin mặt trời"
  },
  {
    "con": "Khi nước đông lại, nó sẽ làm gì?",
    "re": "Mở rộng ra"
  },
  {
    "con": "Yếu tố nào dưới đây làm ô nhiễm nước",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Năng lượng mặt trời chiếu sáng lên cây",
    "re": "Cây sẽ thực hiện quá trình quang hợp"
  },
  {
    "con": "Nhiệt độ của nước tăng lên",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái hơi"
  },
  {
    "con": "Một vật thể được thả từ độ cao",
    "re": "Vật thể sẽ rơi xuống đất do trọng lực"
  },
  {
    "con": "Cây nhận đủ nước và ánh sáng",
    "re": "Cây sẽ phát triển khỏe mạnh"
  },
  {
    "con": "Sử dụng quá nhiều thuốc trừ sâu",
    "re": "Có thể gây hại cho các loài sinh vật khác trong môi trường"
  },
  {
    "con": "Khí carbon dioxide tăng lên trong khí quyển",
    "re": "Nhiệt độ trái đất sẽ tăng lên do hiệu ứng nhà kính"
  },
  {
    "con": "Một chất rắn được nung nóng",
    "re": "Chất rắn có thể chuyển sang trạng thái lỏng"
  },
  {
    "con": "Nước được đun sôi",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Một sinh vật sống trong môi trường không có oxy",
    "re": "Sinh vật đó sẽ không thể tồn tại lâu dài"
  },
  {
    "con": "Hươu mẹ dạy hươu con tập chạy khi nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được làm nóng đến 100 độ C thì",
    "re": "Nước sẽ sôi"
  },
  {
    "con": "Cây cần ánh sáng mặt trời thì",
    "re": "Cây sẽ quang hợp và phát triển"
  },
  {
    "con": "Động vật có xương sống thì",
    "re": "Chúng có cấu trúc xương hỗ trợ cơ thể"
  },
  {
    "con": "Khi đất bị ngập nước thì",
    "re": "Cây trồng có thể bị thối rễ"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C thì",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Khi có ánh sáng chiếu vào một vật thể thì",
    "re": "Vật thể đó có thể phản xạ hoặc hấp thụ ánh sáng"
  },
  {
    "con": "Khi một vật thể di chuyển nhanh hơn âm thanh thì",
    "re": "Nó sẽ tạo ra sóng xung kích"
  },
  {
    "con": "Khi một chất bị nung nóng thì",
    "re": "Chất đó sẽ mở rộng thể tích"
  },
  {
    "con": "Khi một sinh vật chết đi thì",
    "re": "Nó sẽ không còn thực hiện các chức năng sống"
  },
  {
    "con": "Trong các biện pháp làm tăng năng suất cây trồng, biện pháp nào có thể làm môi trường đất bị ô nhiễm?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được đun sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái hơi"
  },
  {
    "con": "Khi ánh sáng mặt trời chiếu vào một vật thể màu đen",
    "re": "Vật thể sẽ hấp thụ nhiều nhiệt hơn so với vật thể màu sáng"
  },
  {
    "con": "Khi một vật thể di chuyển nhanh hơn tốc độ âm thanh",
    "re": "Vật thể sẽ tạo ra sóng xung kích"
  },
  {
    "con": "Khi cây xanh quang hợp",
    "re": "Cây sẽ sản xuất oxy và glucose"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Khi một chất rắn được nung nóng",
    "re": "Chất rắn sẽ giãn nở và có thể chuyển sang trạng thái lỏng"
  },
  {
    "con": "Khi một con vật sống trong môi trường nước",
    "re": "Con vật đó sẽ có các đặc điểm thích nghi như mang hoặc vây"
  },
  {
    "con": "Khi một chất hóa học phản ứng với một chất khác",
    "re": "Sẽ tạo ra sản phẩm mới và có thể giải phóng năng lượng"
  },
  {
    "con": "Khi một hệ sinh thái bị mất đi một loài",
    "re": "Sự cân bằng sinh thái có thể bị ảnh hưởng nghiêm trọng"
  },
  {
    "con": "Hiện tượng đầu nhụy nhận được những hạt phấn của nhị gọi là gì?",
    "re": "Thụ phấn"
  },
  {
    "con": "Nước sôi ở nhiệt độ bao nhiêu độ C ở áp suất khí quyển bình thường?",
    "re": "100 độ C"
  },
  {
    "con": "Khi ánh sáng đi qua một lăng kính, hiện tượng gì xảy ra?",
    "re": "Tán sắc ánh sáng"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn nước thì nó sẽ làm gì khi thả vào nước?",
    "re": "Chìm xuống"
  },
  {
    "con": "Khi cây xanh quang hợp, nó sử dụng chất gì từ không khí?",
    "re": "Carbon dioxide"
  },
  {
    "con": "Nếu một chất có nhiệt độ cao hơn môi trường xung quanh, nó sẽ làm gì?",
    "re": "Tỏa nhiệt ra môi trường"
  },
  {
    "con": "Khi một vật chuyển động tròn, lực nào giữ cho vật không bay ra ngoài?",
    "re": "Lực hướng tâm"
  },
  {
    "con": "Nếu một chất rắn được nung nóng đến nhiệt độ cao, nó sẽ làm gì?",
    "re": "Chuyển thành chất lỏng"
  },
  {
    "con": "Khi nước bay hơi, nó chuyển từ trạng thái nào sang trạng thái nào?",
    "re": "Từ lỏng sang khí"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, nó cần gì để hô hấp?",
    "re": "Oxy hòa tan trong nước"
  },
  {
    "con": "Trong các con vật sau loài nào đẻ nhiều con trong một lứa:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất bình thường:",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Nếu một vật được thả từ độ cao,",
    "re": "Vật đó sẽ rơi xuống đất do lực hấp dẫn"
  },
  {
    "con": "Khi cây quang hợp,",
    "re": "Cây sẽ sản xuất ra oxy và glucose"
  },
  {
    "con": "Nếu một chất được hòa tan trong nước,",
    "re": "Chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C,",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Nếu một con vật có xương sống,",
    "re": "Nó thuộc vào nhóm động vật có xương sống"
  },
  {
    "con": "Khi ánh sáng mặt trời chiếu vào một vật thể,",
    "re": "Vật thể đó sẽ phản xạ hoặc hấp thụ ánh sáng"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7,",
    "re": "Chất đó được coi là axit"
  },
  {
    "con": "Khi một vật nóng chạm vào vật lạnh,",
    "re": "Nhiệt sẽ truyền từ vật nóng sang vật lạnh"
  },
  {
    "con": "Câu nào sau đây nói đúng về vai trò của tài nguyên thực vật và động vật:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được đun sôi ở nhiệt độ 100 độ C ở áp suất khí quyển:",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Khi ánh sáng mặt trời chiếu vào một vật thể màu đen:",
    "re": "Vật thể sẽ hấp thụ nhiều nhiệt hơn"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao nhất định:",
    "re": "Vật thể sẽ rơi xuống đất do trọng lực"
  },
  {
    "con": "Khi thực vật quang hợp, chúng sử dụng ánh sáng mặt trời:",
    "re": "Chúng tạo ra oxy và glucose"
  },
  {
    "con": "Nếu một chất rắn được làm nóng đến nhiệt độ cao:",
    "re": "Chất rắn có thể chuyển thành chất lỏng"
  },
  {
    "con": "Khi nước đóng băng ở 0 độ C:",
    "re": "Nước sẽ chuyển thành đá"
  },
  {
    "con": "Nếu một động vật không có thức ăn trong thời gian dài:",
    "re": "Động vật đó có thể chết vì thiếu dinh dưỡng"
  },
  {
    "con": "Khi một chất hóa học phản ứng với một chất khác:",
    "re": "Sẽ tạo ra một chất mới với tính chất khác"
  },
  {
    "con": "Nếu một hệ sinh thái bị mất đi một loài:",
    "re": "Sự cân bằng của hệ sinh thái có thể bị ảnh hưởng"
  },
  {
    "con": "Trong các việc làm sau đây việc làm nào gây ô nhiễm môi trường và làm cạn kiệt tài nguyên thiên nhiên?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường?",
    "re": "Nước sẽ chuyển sang trạng thái hơi nước"
  },
  {
    "con": "Khi thực vật không nhận đủ ánh sáng mặt trời?",
    "re": "Chúng sẽ không phát triển tốt và có thể chết"
  },
  {
    "con": "Khi một vật thể được thả từ độ cao, nó sẽ rơi xuống?",
    "re": "Vật thể đó sẽ chịu tác động của trọng lực"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C?",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Khi một chất được hòa tan trong nước?",
    "re": "Chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Khi động vật không có đủ thức ăn?",
    "re": "Chúng sẽ không có đủ năng lượng để sống sót"
  },
  {
    "con": "Khi một cây được tưới nước đầy đủ?",
    "re": "Cây sẽ phát triển khỏe mạnh và xanh tốt"
  },
  {
    "con": "Khi không khí bị ô nhiễm?",
    "re": "Sức khỏe con người và động vật sẽ bị ảnh hưởng"
  },
  {
    "con": "Khi các loài động vật sống trong môi trường tự nhiên bị xáo trộn?",
    "re": "Hệ sinh thái sẽ bị mất cân bằng"
  },
  {
    "con": "Các loài hoa nào sau đây thụ phấn nhờ gió?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào?",
    "re": "100 độ C ở áp suất 1 atm"
  },
  {
    "con": "Ánh sáng mặt trời có thể làm gì cho cây cối?",
    "re": "Giúp cây quang hợp"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C, nước sẽ làm gì?",
    "re": "Chuyển thành băng"
  },
  {
    "con": "Các loài động vật nào sống trong môi trường nước?",
    "re": "Cá, ếch, tôm, và nhiều loài khác"
  },
  {
    "con": "Khi một vật bị đốt cháy, nó sẽ tạo ra gì?",
    "re": "Khí carbon dioxide và nhiệt"
  },
  {
    "con": "Nếu một vật nặng hơn vật khác, thì vật nào sẽ rơi nhanh hơn?",
    "re": "Cả hai vật sẽ rơi với tốc độ như nhau trong chân không"
  },
  {
    "con": "Khi cây hấp thụ nước, nước sẽ đi đến đâu?",
    "re": "Đến các bộ phận khác của cây"
  },
  {
    "con": "Nếu một chất không hòa tan trong nước, thì nó sẽ làm gì?",
    "re": "Nó sẽ lắng xuống dưới đáy"
  },
  {
    "con": "Khi ánh sáng đi qua một lăng kính, nó sẽ làm gì?",
    "re": "Bị tán sắc thành các màu khác nhau"
  },
  {
    "con": "Dòng nào sau đây toàn là những động vật đẻ con ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường ?",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, nó sẽ rơi xuống đất ?",
    "re": "Vật thể sẽ chịu tác động của trọng lực"
  },
  {
    "con": "Nếu cây nhận đủ ánh sáng mặt trời và nước ?",
    "re": "Cây sẽ quang hợp và phát triển"
  },
  {
    "con": "Nếu một chất được nung nóng, nó sẽ giãn nở ?",
    "re": "Chất sẽ chiếm không gian lớn hơn"
  },
  {
    "con": "Nếu một động vật không có xương sống ?",
    "re": "Động vật đó thuộc nhóm động vật không xương sống"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7 ?",
    "re": "Chất đó được coi là axit"
  },
  {
    "con": "Nếu một vật thể có khối lượng lớn hơn vật thể khác ?",
    "re": "Vật thể đó sẽ có trọng lực lớn hơn"
  },
  {
    "con": "Nếu một hệ sinh thái bị mất đi một loài ?",
    "re": "Sự cân bằng sinh thái có thể bị ảnh hưởng"
  },
  {
    "con": "Nếu nước được làm lạnh xuống dưới 0 độ C ?",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Nước ở trạng thái lỏng khi nhiệt độ trên 0 độ C",
    "re": "Nước sẽ không đóng băng"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp",
    "re": "Chúng sẽ không phát triển tốt nếu thiếu ánh sáng"
  },
  {
    "con": "Động vật cần thức ăn để sống",
    "re": "Chúng sẽ không có đủ năng lượng để hoạt động"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C, nước sẽ đóng băng",
    "re": "Hình thành băng hoặc tuyết"
  },
  {
    "con": "Sự hấp thụ nước của cây diễn ra qua rễ",
    "re": "Cây sẽ có đủ nước để duy trì sự sống"
  },
  {
    "con": "Khi có ánh sáng, thực vật sẽ sản xuất oxy",
    "re": "Nồng độ oxy trong không khí sẽ tăng lên"
  },
  {
    "con": "Khi có sự thay đổi nhiệt độ, các chất có thể thay đổi trạng thái",
    "re": "Chúng có thể chuyển từ rắn sang lỏng hoặc từ lỏng sang khí"
  },
  {
    "con": "Sự phân hủy của chất hữu cơ cần vi sinh vật",
    "re": "Chất hữu cơ sẽ được tái chế thành dinh dưỡng cho đất"
  },
  {
    "con": "Khi có lực tác động lên một vật, vật đó sẽ chuyển động",
    "re": "Vật sẽ thay đổi vị trí hoặc trạng thái"
  },
  {
    "con": "Việc phá rừng gây ra hậu quả gì?",
    "re": "Mất môi trường sống cho động vật và gia tăng khí CO2 trong không khí"
  },
  {
    "con": "Con vật nào dưới đây đẻ trứng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước ở trạng thái lỏng khi nhiệt độ là 0 độ C?",
    "re": "Câu trả lời sai"
  },
  {
    "con": "Nếu cây nhận đủ ánh sáng mặt trời và nước, thì cây sẽ phát triển tốt?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật nặng hơn rơi từ độ cao, thì nó sẽ rơi nhanh hơn một vật nhẹ hơn?",
    "re": "Câu trả lời sai"
  },
  {
    "con": "Nếu một chất được đun nóng, thì nó sẽ mở rộng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu có ánh sáng, thì thực vật sẽ thực hiện quá trình quang hợp?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu không có không khí, thì lửa sẽ không cháy?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một con vật có xương sống, thì nó thuộc nhóm động vật có xương sống?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu nước bị đông lạnh, thì nó sẽ trở thành băng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có màu đen, thì nó sẽ hấp thụ nhiều ánh sáng hơn một vật có màu trắng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào?",
    "re": "100 độ C ở áp suất khí quyển bình thường"
  },
  {
    "con": "Thực vật cần gì để quang hợp?",
    "re": "Ánh sáng mặt trời, nước và carbon dioxide"
  },
  {
    "con": "Trái đất quay quanh mặt trời trong bao lâu?",
    "re": "Khoảng 365,25 ngày"
  },
  {
    "con": "Sự sống trên trái đất phụ thuộc vào yếu tố nào?",
    "re": "Nước, không khí, ánh sáng và nhiệt độ"
  },
  {
    "con": "Khi nhiệt độ giảm, chất khí sẽ làm gì?",
    "re": "Co lại và mật độ tăng lên"
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính, hiện tượng gì xảy ra?",
    "re": "Ánh sáng bị khúc xạ và phân tách thành các màu sắc"
  },
  {
    "con": "Động vật có xương sống có đặc điểm gì?",
    "re": "Có một bộ xương bên trong"
  },
  {
    "con": "Khi nước băng thành đá, thể tích của nó sẽ làm gì?",
    "re": "Tăng lên"
  },
  {
    "con": "Khi một vật nóng chạm vào một vật lạnh, điều gì xảy ra?",
    "re": "Nhiệt độ sẽ truyền từ vật nóng sang vật lạnh"
  },
  {
    "con": "Sự bay hơi xảy ra khi nào?",
    "re": "Khi chất lỏng chuyển thành hơi ở nhiệt độ bất kỳ"
  },
  {
    "con": "Hệ sinh thái bao gồm những gì?",
    "re": "Các sinh vật sống và môi trường sống của chúng"
  },
  {
    "con": "HIV có nguy cơ lây qua đường nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước ở trạng thái lỏng khi nhiệt độ từ 0 đến 100 độ C",
    "re": "Nước sẽ tồn tại ở trạng thái lỏng"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, nó sẽ chịu tác động của trọng lực",
    "re": "Vật thể sẽ rơi xuống đất"
  },
  {
    "con": "Nếu cây nhận đủ ánh sáng mặt trời và nước",
    "re": "Cây sẽ quang hợp và phát triển"
  },
  {
    "con": "Nếu một chất được đun nóng đến nhiệt độ cao",
    "re": "Chất đó có thể chuyển từ trạng thái rắn sang trạng thái lỏng"
  },
  {
    "con": "Nếu một động vật không có thức ăn",
    "re": "Động vật đó sẽ không sống sót lâu dài"
  },
  {
    "con": "Nếu một vật thể có khối lượng lớn hơn vật thể khác",
    "re": "Vật thể đó sẽ có trọng lực lớn hơn"
  },
  {
    "con": "Nếu một chất được hòa tan trong nước",
    "re": "Chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường ô nhiễm",
    "re": "Sinh vật đó có thể bị ảnh hưởng xấu đến sức khỏe"
  },
  {
    "con": "Nếu một nguồn năng lượng được sử dụng hiệu quả",
    "re": "Năng lượng đó sẽ giúp tiết kiệm tài nguyên"
  },
  {
    "con": "Nếu một vật thể quay quanh một vật thể khác",
    "re": "Vật thể đó sẽ tạo ra quỹ đạo"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào?",
    "re": "100 độ C ở áp suất khí quyển bình thường"
  },
  {
    "con": "Cây xanh cần gì để quang hợp?",
    "re": "Ánh sáng mặt trời, nước và carbon dioxide"
  },
  {
    "con": "Sự chuyển động của các hành tinh quanh mặt trời là gì?",
    "re": "Quỹ đạo hình elip"
  },
  {
    "con": "Động vật có xương sống có đặc điểm gì?",
    "re": "Có hệ xương và hệ thần kinh phát triển"
  },
  {
    "con": "Tại sao bầu trời có màu xanh vào ban ngày?",
    "re": "Do hiện tượng tán xạ ánh sáng"
  },
  {
    "con": "Sự khác biệt giữa chất rắn, lỏng và khí là gì?",
    "re": "Cách sắp xếp và chuyển động của các phân tử"
  },
  {
    "con": "Tại sao chúng ta cần nước?",
    "re": "Để duy trì sự sống và các chức năng sinh lý"
  },
  {
    "con": "Sự phân hủy là gì?",
    "re": "Quá trình phân giải chất hữu cơ thành các chất đơn giản hơn"
  },
  {
    "con": "Tại sao động vật di cư?",
    "re": "Để tìm kiếm thức ăn, nơi ở hoặc tránh thời tiết khắc nghiệt"
  },
  {
    "con": "Năng lượng mặt trời có thể được sử dụng để làm gì?",
    "re": "Sản xuất điện và làm nóng nước"
  },
  {
    "con": "Nước ở trạng thái lỏng khi nhiệt độ là:",
    "re": "0 độ C đến 100 độ C"
  },
  {
    "con": "Cây xanh sản xuất oxy thông qua quá trình:",
    "re": "Quang hợp"
  },
  {
    "con": "Động vật có xương sống bao gồm:",
    "re": "Cá, chim, thú, bò sát và lưỡng cư"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nó sẽ:",
    "re": "Bị khúc xạ"
  },
  {
    "con": "Sự thay đổi trạng thái từ rắn sang lỏng gọi là:",
    "re": "Nóng chảy"
  },
  {
    "con": "Khi một vật di chuyển, nó sẽ có:",
    "re": "Động năng"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để:",
    "re": "Tạo ra năng lượng"
  },
  {
    "con": "Khi nhiệt độ giảm, chất khí sẽ:",
    "re": "Co lại"
  },
  {
    "con": "Sự phân hủy chất hữu cơ trong đất giúp:",
    "re": "Cung cấp dinh dưỡng cho cây trồng"
  },
  {
    "con": "Khi nước bay hơi, nó sẽ chuyển từ trạng thái:",
    "re": "Lỏng sang khí"
  },
  {
    "con": "Sự hấp thụ nước và khoáng chất của cây diễn ra qua:",
    "re": "Rễ"
  },
  {
    "con": "Tác nhân gây ra bệnh sốt xuất huyết là:",
    "re": "Muỗi Aedes"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào?",
    "re": "100 độ C ở áp suất khí quyển bình thường"
  },
  {
    "con": "Thực vật cần gì để quang hợp?",
    "re": "Ánh sáng mặt trời, nước và carbon dioxide"
  },
  {
    "con": "Sự chuyển động của các hành tinh quanh mặt trời là gì?",
    "re": "Quỹ đạo hình elip"
  },
  {
    "con": "Tại sao bầu trời có màu xanh vào ban ngày?",
    "re": "Do hiện tượng tán xạ ánh sáng"
  },
  {
    "con": "Động vật có xương sống có đặc điểm gì?",
    "re": "Có cột sống và hộp sọ"
  },
  {
    "con": "Năng lượng mặt trời có thể được sử dụng để làm gì?",
    "re": "Sản xuất điện và làm nóng nước"
  },
  {
    "con": "Tại sao nước lại là chất lỏng duy nhất tồn tại ở ba trạng thái?",
    "re": "Do cấu trúc phân tử và liên kết hydro"
  },
  {
    "con": "Sự phân hủy sinh học là gì?",
    "re": "Quá trình phân hủy chất hữu cơ bởi vi sinh vật"
  },
  {
    "con": "Tại sao các loài động vật cần thức ăn?",
    "re": "Để cung cấp năng lượng và dinh dưỡng cho cơ thể"
  },
  {
    "con": "Khí carbon dioxide có vai trò gì trong môi trường?",
    "re": "Tham gia vào quá trình quang hợp của thực vật"
  },
  {
    "con": "Nước ở trạng thái lỏng sẽ chuyển thành hơi nước khi nhiệt độ tăng lên",
    "re": "Hơi nước sẽ hình thành"
  },
  {
    "con": "Khi ánh sáng mặt trời chiếu vào một vật màu đen, vật đó sẽ hấp thụ nhiều nhiệt hơn",
    "re": "Vật sẽ nóng lên nhanh chóng"
  },
  {
    "con": "Khi trồng cây, nếu đất không có đủ nước, cây sẽ không phát triển tốt",
    "re": "Cây có thể héo và chết"
  },
  {
    "con": "Khi một vật di chuyển nhanh hơn âm thanh, nó sẽ tạo ra sóng xung kích",
    "re": "Sẽ có tiếng nổ lớn"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C, nước sẽ đóng băng",
    "re": "Nước sẽ trở thành băng"
  },
  {
    "con": "Khi một chất được hòa tan trong nước, nếu nhiệt độ nước tăng lên, khả năng hòa tan của chất đó sẽ tăng",
    "re": "Chất sẽ hòa tan tốt hơn"
  },
  {
    "con": "Khi có sự thay đổi trong môi trường sống, các loài động vật có thể phải thích nghi để sống sót",
    "re": "Một số loài có thể bị tuyệt chủng"
  },
  {
    "con": "Khi thực hiện thí nghiệm khoa học, nếu không kiểm soát các biến số, kết quả có thể không chính xác",
    "re": "Kết quả sẽ không đáng tin cậy"
  },
  {
    "con": "Khi sử dụng pin, nếu không thay pin đúng cách, pin có thể bị rò rỉ",
    "re": "Có thể gây hại cho thiết bị"
  },
  {
    "con": "Khi thực hiện phản ứng hóa học, nếu không có đủ nguyên liệu, phản ứng sẽ không xảy ra hoàn toàn",
    "re": "Sản phẩm thu được sẽ không đầy đủ"
  },
  {
    "con": "Nước ở nhiệt độ 0 độ C sẽ đóng băng:",
    "re": "Trạng thái của nước sẽ chuyển từ lỏng sang rắn"
  },
  {
    "con": "Khi ánh sáng mặt trời chiếu vào một vật thể màu đen:",
    "re": "Vật thể đó sẽ hấp thụ nhiều nhiệt hơn"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao nhất định:",
    "re": "Vật thể đó sẽ rơi xuống đất do lực hấp dẫn"
  },
  {
    "con": "Khi thực vật quang hợp:",
    "re": "Chúng sẽ chuyển đổi ánh sáng mặt trời thành năng lượng hóa học"
  },
  {
    "con": "Nếu một chất lỏng được đun nóng:",
    "re": "Chất lỏng đó sẽ mở rộng và có thể chuyển thành hơi"
  },
  {
    "con": "Khi có điện chạy qua một dây dẫn:",
    "re": "Dây dẫn sẽ phát sinh nhiệt và có thể sáng lên nếu có bóng đèn"
  },
  {
    "con": "Nếu một động vật không có khả năng thích nghi với môi trường:",
    "re": "Động vật đó có thể gặp nguy hiểm và có nguy cơ tuyệt chủng"
  },
  {
    "con": "Khi một chất rắn được hòa tan trong nước:",
    "re": "Chất rắn đó sẽ phân tán và tạo thành dung dịch"
  },
  {
    "con": "Nếu một hệ sinh thái bị phá hủy:",
    "re": "Các loài sinh vật trong hệ sinh thái đó sẽ bị ảnh hưởng nghiêm trọng"
  },
  {
    "con": "Khi một vật thể di chuyển nhanh hơn âm thanh:",
    "re": "Vật thể đó sẽ tạo ra sóng xung kích"
  },
  {
    "con": "Nước ở trạng thái lỏng khi nhiệt độ trên 0 độ C:",
    "re": "Nước sẽ không đóng băng"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp:",
    "re": "Thực vật sẽ sản xuất oxy"
  },
  {
    "con": "Động vật có xương sống có hệ thống tuần hoàn:",
    "re": "Động vật sẽ có khả năng vận chuyển máu trong cơ thể"
  },
  {
    "con": "Trái đất quay quanh mặt trời:",
    "re": "Trái đất sẽ trải qua các mùa khác nhau"
  },
  {
    "con": "Năng lượng mặt trời có thể được chuyển đổi thành điện năng:",
    "re": "Điện năng có thể được sử dụng để cung cấp năng lượng cho các thiết bị"
  },
  {
    "con": "Khi nước nóng lên, nó sẽ bốc hơi:",
    "re": "Hơi nước sẽ hình thành trong không khí"
  },
  {
    "con": "Sự sống cần nước để tồn tại:",
    "re": "Các sinh vật sẽ không thể sống nếu thiếu nước"
  },
  {
    "con": "Khi một vật bị đốt cháy, nó sẽ tạo ra khói và nhiệt:",
    "re": "Quá trình cháy sẽ tiêu tốn oxy"
  },
  {
    "con": "Các loài động vật khác nhau có môi trường sống khác nhau:",
    "re": "Mỗi loài sẽ thích nghi với môi trường của nó"
  },
  {
    "con": "Khi nhiệt độ giảm, chất khí sẽ co lại:",
    "re": "Áp suất của chất khí sẽ tăng lên"
  },
  {
    "con": "Trẻ em do ai sinh ra:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp",
    "re": "Chúng sẽ sản xuất ra oxy và glucose"
  },
  {
    "con": "Động vật có xương sống có cấu trúc cơ thể phức tạp hơn động vật không xương sống",
    "re": "Chúng có khả năng di chuyển và thích nghi tốt hơn với môi trường"
  },
  {
    "con": "Khi nhiệt độ giảm, các phân tử trong chất rắn sẽ di chuyển chậm lại",
    "re": "Chất rắn sẽ trở nên cứng hơn"
  },
  {
    "con": "Khi một vật thể được thả từ độ cao, trọng lực sẽ tác động lên nó",
    "re": "Vật thể sẽ rơi xuống đất"
  },
  {
    "con": "Khi một chất hòa tan trong nước, nó sẽ tạo ra dung dịch",
    "re": "Dung dịch sẽ có tính chất khác với chất ban đầu"
  },
  {
    "con": "Khi có ánh sáng chiếu vào một vật thể, nó có thể bị phản xạ hoặc hấp thụ",
    "re": "Vật thể sẽ có màu sắc khác nhau tùy thuộc vào cách nó tương tác với ánh sáng"
  },
  {
    "con": "Khi một chất bị đốt cháy, nó sẽ phản ứng với oxy",
    "re": "Sẽ tạo ra nhiệt và ánh sáng"
  },
  {
    "con": "Khi một vật thể di chuyển nhanh hơn âm thanh, nó sẽ tạo ra sóng xung kích",
    "re": "Sẽ nghe thấy tiếng nổ lớn"
  },
  {
    "con": "Khi một sinh vật sống trong môi trường có ít thức ăn",
    "re": "Nó sẽ phải cạnh tranh để sinh tồn"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào?",
    "re": "Nước sôi ở 100 độ C ở áp suất khí quyển bình thường."
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để làm gì?",
    "re": "Thực vật cần ánh sáng mặt trời để thực hiện quá trình quang hợp."
  },
  {
    "con": "Khi nhiệt độ giảm, chất khí sẽ như thế nào?",
    "re": "Khi nhiệt độ giảm, chất khí sẽ co lại và mật độ tăng lên."
  },
  {
    "con": "Động vật có xương sống có đặc điểm gì?",
    "re": "Động vật có xương sống có bộ xương bên trong và hệ thần kinh phát triển."
  },
  {
    "con": "Khi nước chuyển từ thể lỏng sang thể hơi, hiện tượng gì xảy ra?",
    "re": "Khi nước chuyển từ thể lỏng sang thể hơi, hiện tượng bay hơi xảy ra."
  },
  {
    "con": "Tại sao cây xanh có màu xanh?",
    "re": "Cây xanh có màu xanh do sự hiện diện của chất diệp lục."
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính, hiện tượng gì xảy ra?",
    "re": "Khi ánh sáng đi qua lăng kính, hiện tượng khúc xạ xảy ra và ánh sáng bị phân tách thành các màu sắc khác nhau."
  },
  {
    "con": "Động đất xảy ra do nguyên nhân gì?",
    "re": "Động đất xảy ra do sự dịch chuyển của các mảng kiến tạo trong lòng đất."
  },
  {
    "con": "Khi một vật nóng chạm vào một vật lạnh, điều gì xảy ra?",
    "re": "Khi một vật nóng chạm vào một vật lạnh, nhiệt độ sẽ truyền từ vật nóng sang vật lạnh cho đến khi đạt được cân bằng nhiệt."
  },
  {
    "con": "Sự sống trên Trái Đất phụ thuộc vào yếu tố nào?",
    "re": "Sự sống trên Trái Đất phụ thuộc vào nước, ánh sáng mặt trời, không khí và đất."
  },
  {
    "con": "Để sản xuất xi măng, tạc tượng người ta sử dụng vật liệu nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nước được đun sôi, nó sẽ chuyển thành trạng thái nào?",
    "re": "Hơi nước"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, nó sẽ rơi xuống đất do lực nào tác động?",
    "re": "Lực hấp dẫn"
  },
  {
    "con": "Khi ánh sáng đi qua một lăng kính, nó sẽ bị hiện tượng gì?",
    "re": "Khúc xạ"
  },
  {
    "con": "Nếu một cây xanh không nhận đủ ánh sáng mặt trời, nó sẽ ảnh hưởng đến điều gì?",
    "re": "Quá trình quang hợp"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C, nước sẽ chuyển thành trạng thái nào?",
    "re": "Đá"
  },
  {
    "con": "Nếu một chất lỏng được làm nóng, nó sẽ có xu hướng làm gì?",
    "re": "Mở rộng"
  },
  {
    "con": "Khi một vật thể di chuyển nhanh hơn âm thanh, nó sẽ tạo ra hiện tượng gì?",
    "re": "Sóng xung"
  },
  {
    "con": "Nếu một động vật không có khả năng thích nghi với môi trường, nó sẽ gặp phải điều gì?",
    "re": "Nguy cơ tuyệt chủng"
  },
  {
    "con": "Khi một chất rắn được nung nóng đến nhiệt độ cao, nó sẽ xảy ra hiện tượng gì?",
    "re": "Chảy ra"
  },
  {
    "con": "Có thể chia cuộc đời con người làm mấy giai đoạn lớn?\nKhoanh vào chữ cái trước ý trả lời đúng nhất:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ bao nhiêu độ C?",
    "re": "100 độ C"
  },
  {
    "con": "Nếu thực vật không có ánh sáng mặt trời, chúng sẽ không thể quang hợp.",
    "re": "Chúng sẽ chết hoặc không phát triển được."
  },
  {
    "con": "Nếu một vật nặng hơn rơi từ độ cao, nó sẽ rơi nhanh hơn một vật nhẹ hơn.",
    "re": "Cả hai vật sẽ rơi với tốc độ như nhau trong chân không."
  },
  {
    "con": "Nếu một chất lỏng được làm nóng, nó sẽ mở rộng.",
    "re": "Thể tích của chất lỏng sẽ tăng lên."
  },
  {
    "con": "Nếu có sự thay đổi nhiệt độ, thì trạng thái của nước có thể chuyển từ lỏng sang rắn.",
    "re": "Nước sẽ đóng băng thành băng."
  },
  {
    "con": "Nếu một con vật không có đủ thức ăn, nó sẽ không thể sống sót.",
    "re": "Nó sẽ bị suy dinh dưỡng hoặc chết."
  },
  {
    "con": "Nếu một cây không có nước, nó sẽ không thể phát triển.",
    "re": "Cây sẽ héo và có thể chết."
  },
  {
    "con": "Nếu một vật được thả từ độ cao, nó sẽ rơi xuống đất.",
    "re": "Vật đó sẽ chịu tác động của trọng lực."
  },
  {
    "con": "Nếu không có không khí, thì âm thanh sẽ không thể truyền đi.",
    "re": "Chúng ta sẽ không nghe thấy âm thanh."
  },
  {
    "con": "Em bé nằm trong bụng mẹ được gọi là gì? \nKhoanh vào chữ cái trước ý trả lời đúng nhất:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất bình thường?",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Cây xanh cần ánh sáng mặt trời để quang hợp?",
    "re": "Cây sẽ sản xuất oxy và thức ăn"
  },
  {
    "con": "Động vật có xương sống có đặc điểm gì?",
    "re": "Chúng có hệ thống xương và tủy sống"
  },
  {
    "con": "Khi trời mưa, nước sẽ chảy xuống đất?",
    "re": "Nước sẽ thấm vào đất hoặc chảy vào các con sông"
  },
  {
    "con": "Khi nhiệt độ giảm, chất khí sẽ làm gì?",
    "re": "Chất khí sẽ co lại"
  },
  {
    "con": "Khi một vật được thả từ độ cao, nó sẽ rơi xuống?",
    "re": "Vật sẽ chịu tác động của trọng lực"
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính, nó sẽ bị gì?",
    "re": "Ánh sáng sẽ bị khúc xạ và tạo ra cầu vồng"
  },
  {
    "con": "Khi một chất rắn được nung nóng, nó sẽ xảy ra hiện tượng gì?",
    "re": "Chất rắn có thể chuyển thành chất lỏng"
  },
  {
    "con": "Khi một con vật bị đói, nó sẽ tìm kiếm thức ăn?",
    "re": "Con vật sẽ cố gắng tìm nguồn dinh dưỡng để sống sót"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường.",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Khi ánh sáng mặt trời chiếu vào một vật thể màu đen.",
    "re": "Vật thể sẽ hấp thụ nhiều nhiệt hơn"
  },
  {
    "con": "Khi thực vật quang hợp, chúng sử dụng ánh sáng mặt trời.",
    "re": "Chúng tạo ra oxy và glucose"
  },
  {
    "con": "Khi một vật thể di chuyển nhanh hơn âm thanh.",
    "re": "Nó sẽ tạo ra sóng xung kích"
  },
  {
    "con": "Khi nước bị đông lạnh ở nhiệt độ 0 độ C.",
    "re": "Nước sẽ chuyển thành đá"
  },
  {
    "con": "Khi một chất được đun nóng, các phân tử của nó sẽ di chuyển nhanh hơn.",
    "re": "Chất đó sẽ nở ra"
  },
  {
    "con": "Khi một con vật bị đói, nó sẽ tìm kiếm thức ăn.",
    "re": "Nó sẽ có khả năng sống sót cao hơn"
  },
  {
    "con": "Khi một cây bị thiếu ánh sáng mặt trời.",
    "re": "Cây sẽ không phát triển tốt"
  },
  {
    "con": "Khi một chất lỏng được đổ vào một bình chứa có hình dạng khác.",
    "re": "Chất lỏng sẽ chiếm toàn bộ thể tích của bình"
  },
  {
    "con": "Khi một con vật sống trong môi trường nước.",
    "re": "Nó sẽ có các đặc điểm thích nghi với nước"
  },
  {
    "con": "Khi một vật thể được thả từ độ cao, nó sẽ rơi xuống.",
    "re": "Vật thể sẽ chịu tác động của trọng lực"
  },
  {
    "con": "Nguyên nhân nào gây ra bệnh sốt rét? \nKhoanh vào chữ cái trước ý trả lời đúng nhất:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Vì sao người ta làm lưỡi dao bằng thép mà không làm bằng nhôm?\nKhoanh vào chữ cái trước ý trả lời đúng nhất:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất bình thường?",
    "re": "Nước chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Khi cây quang hợp, nó hấp thụ ánh sáng mặt trời?",
    "re": "Cây sản xuất ra oxy và glucose"
  },
  {
    "con": "Khi một vật được thả từ độ cao, nó rơi xuống đất?",
    "re": "Vật đó chịu tác động của lực hấp dẫn"
  },
  {
    "con": "Khi nhiệt độ giảm, nước sẽ đóng băng?",
    "re": "Nước chuyển từ trạng thái lỏng sang trạng thái rắn"
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính, nó sẽ bị khúc xạ?",
    "re": "Ánh sáng sẽ phân tán thành các màu sắc khác nhau"
  },
  {
    "con": "Khi một chất bị đốt cháy, nó sẽ tạo ra nhiệt và ánh sáng?",
    "re": "Quá trình này gọi là phản ứng hóa học"
  },
  {
    "con": "Khi động vật hô hấp, chúng hấp thụ oxy từ không khí?",
    "re": "Chúng thải ra carbon dioxide"
  },
  {
    "con": "Khi một vật di chuyển nhanh hơn âm thanh, nó sẽ tạo ra sóng xung kích?",
    "re": "Hiện tượng này gọi là siêu âm"
  },
  {
    "con": "Khi đất bị xói mòn, nó sẽ mất đi lớp đất màu mỡ?",
    "re": "Điều này ảnh hưởng đến khả năng trồng trọt"
  },
  {
    "con": "Bê tông được làm từ những nguyên liệu nào? \nKhoanh vào chữ cái trước ý trả lời đúng nhất:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất bình thường.",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Cây xanh cần ánh sáng mặt trời để quang hợp.",
    "re": "Cây sẽ sản xuất oxy"
  },
  {
    "con": "Động vật có xương sống có cấu trúc cơ thể phức tạp hơn động vật không xương sống.",
    "re": "Động vật có xương sống thường có khả năng di chuyển nhanh hơn"
  },
  {
    "con": "Khi nhiệt độ giảm, các chất rắn thường co lại.",
    "re": "Khối lượng riêng của chất rắn sẽ tăng lên"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nó sẽ bị khúc xạ.",
    "re": "Hình ảnh của vật sẽ bị biến dạng"
  },
  {
    "con": "Khi một vật bị tác động bởi lực, nó sẽ thay đổi trạng thái chuyển động.",
    "re": "Vật có thể dừng lại, tăng tốc hoặc thay đổi hướng"
  },
  {
    "con": "Khi một chất bị nung nóng, nó sẽ mở rộng.",
    "re": "Khối lượng riêng của chất sẽ giảm"
  },
  {
    "con": "Thực vật hấp thụ nước và khoáng chất từ đất qua rễ.",
    "re": "Thực vật sẽ phát triển và sinh trưởng tốt hơn"
  },
  {
    "con": "Khi có sự thay đổi trong môi trường, sinh vật có thể thích nghi.",
    "re": "Sinh vật sẽ có khả năng sống sót cao hơn"
  },
  {
    "con": "Nước có nhiệt độ 0 độ C và áp suất 1 atm sẽ chuyển từ trạng thái rắn sang trạng thái lỏng.",
    "re": "Nước sẽ tan chảy"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, thì vật thể đó sẽ rơi xuống đất do lực hấp dẫn.",
    "re": "Vật thể sẽ rơi"
  },
  {
    "con": "Nếu cây xanh được cung cấp đủ ánh sáng mặt trời, nước và chất dinh dưỡng, thì cây sẽ phát triển khỏe mạnh.",
    "re": "Cây sẽ phát triển"
  },
  {
    "con": "Nếu một chất được đun nóng đến nhiệt độ sôi, thì chất đó sẽ chuyển từ trạng thái lỏng sang trạng thái khí.",
    "re": "Chất sẽ bay hơi"
  },
  {
    "con": "Nếu một vật thể có khối lượng lớn hơn nước, thì vật thể đó sẽ chìm khi đặt vào nước.",
    "re": "Vật thể sẽ chìm"
  },
  {
    "con": "Nếu ánh sáng mặt trời chiếu vào một bề mặt phản chiếu, thì ánh sáng sẽ bị phản xạ.",
    "re": "Ánh sáng sẽ phản xạ"
  },
  {
    "con": "Nếu một động vật không có khả năng tự sản xuất thức ăn, thì động vật đó sẽ phải tìm kiếm thức ăn từ môi trường.",
    "re": "Động vật sẽ tìm thức ăn"
  },
  {
    "con": "Nếu một chất được hòa tan trong nước, thì chất đó sẽ tạo thành dung dịch.",
    "re": "Dung dịch sẽ hình thành"
  },
  {
    "con": "Nếu một vật thể được làm nóng, thì thể tích của vật thể đó sẽ tăng lên.",
    "re": "Thể tích sẽ tăng"
  },
  {
    "con": "Nếu một hệ sinh thái bị mất đi một loài động vật chủ chốt, thì sự cân bằng của hệ sinh thái đó sẽ bị ảnh hưởng.",
    "re": "Hệ sinh thái sẽ mất cân bằng"
  },
  {
    "con": "“Trong suốt, không gỉ, cứng, nhưng dễ vỡ. Không cháy, không hút ẩm và không bị a xít ăn mòn” là tính chất của loại vật chất nào sau đây? \nKhoanh vào chữ cái trước ý trả lời đúng nhất:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước ở trạng thái lỏng sẽ chuyển thành hơi khi nhiệt độ tăng lên?",
    "re": "Đúng"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để thực hiện quá trình quang hợp?",
    "re": "Đúng"
  },
  {
    "con": "Động vật có xương sống sẽ có hệ thống tuần hoàn kín?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một vật được thả từ độ cao, nó sẽ rơi xuống đất do lực hấp dẫn?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một chất được nung nóng, nó sẽ mở rộng và có thể thay đổi trạng thái?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn, nó sẽ có trọng lực lớn hơn?",
    "re": "Đúng"
  },
  {
    "con": "Nếu không có không khí, âm thanh sẽ không thể truyền đi?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một chất hòa tan trong nước, nó sẽ tạo thành dung dịch?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, nó sẽ có khả năng thở dưới nước?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một vật được làm từ kim loại, nó sẽ dẫn điện tốt hơn so với gỗ?",
    "re": "Đúng"
  },
  {
    "con": "Quá trình tinh trùng kết hợp với trứng được gọi là:",
    "re": "Thụ tinh"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường:",
    "re": "Chuyển thành hơi nước"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để thực hiện quá trình quang hợp:",
    "re": "Sản xuất thức ăn"
  },
  {
    "con": "Khi một vật di chuyển nhanh hơn âm thanh:",
    "re": "Gọi là siêu âm"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C:",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Khi một chất bị nung nóng, nó sẽ:",
    "re": "Nở ra"
  },
  {
    "con": "Khi ánh sáng đi qua một lăng kính:",
    "re": "Nó sẽ bị tán sắc thành các màu khác nhau"
  },
  {
    "con": "Khi một vật rơi tự do trong không khí:",
    "re": "Chịu tác động của trọng lực"
  },
  {
    "con": "Khi một chất lỏng bay hơi:",
    "re": "Nó chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Khi một động vật sống trong môi trường nước:",
    "re": "Nó có thể thở bằng mang"
  },
  {
    "con": "Cao su tự nhiên có nguồn gốc từ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở 100 độ C ở áp suất khí quyển bình thường:",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp:",
    "re": "Chúng sẽ sản xuất ra oxy và glucose"
  },
  {
    "con": "Động vật có xương sống có cấu trúc cơ thể phức tạp:",
    "re": "Chúng có hệ thống tuần hoàn và hệ thần kinh phát triển"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C:",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Khi một vật thể được thả từ độ cao:",
    "re": "Nó sẽ rơi xuống đất do trọng lực"
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính:",
    "re": "Nó sẽ bị khúc xạ và tạo ra cầu vồng"
  },
  {
    "con": "Khi một chất bị đun nóng:",
    "re": "Nó sẽ nở ra và có thể thay đổi trạng thái"
  },
  {
    "con": "Khi có sự thay đổi trong môi trường sống:",
    "re": "Các loài sinh vật có thể thích nghi hoặc bị tuyệt chủng"
  },
  {
    "con": "Khi một chất hòa tan trong nước:",
    "re": "Nó sẽ tạo thành dung dịch"
  },
  {
    "con": "Nước có thể tồn tại ở những trạng thái nào?",
    "re": "Rắn, lỏng và khí"
  },
  {
    "con": "Thực vật cần những yếu tố nào để quang hợp?",
    "re": "Ánh sáng, nước và carbon dioxide"
  },
  {
    "con": "Động vật có xương sống và không xương sống khác nhau ở điểm nào?",
    "re": "Động vật có xương sống có bộ xương, còn động vật không xương sống không có"
  },
  {
    "con": "Trái đất quay quanh mặt trời trong bao lâu?",
    "re": "Khoảng 365 ngày"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C, nước sẽ xảy ra hiện tượng gì?",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Sự chuyển động của các vật thể phụ thuộc vào yếu tố nào?",
    "re": "Lực tác động lên chúng"
  },
  {
    "con": "Âm thanh được tạo ra từ đâu?",
    "re": "Sự rung động của các vật thể"
  },
  {
    "con": "Khi ánh sáng đi qua nước, nó sẽ xảy ra hiện tượng gì?",
    "re": "Khúc xạ ánh sáng"
  },
  {
    "con": "Tại sao cây cối cần đất?",
    "re": "Để hấp thụ nước và chất dinh dưỡng"
  },
  {
    "con": "Khi một vật nóng lên, nó sẽ xảy ra hiện tượng gì?",
    "re": "Nó sẽ nở ra"
  },
  {
    "con": "Để dệt thành vải may quần, áo, chăn, màn người ta sử dụng vật liệu nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nước được đun nóng đến 100 độ C, nó sẽ xảy ra hiện tượng gì?",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Nếu cây nhận đủ ánh sáng mặt trời và nước, thì nó sẽ phát triển tốt hơn.",
    "re": "Cây sẽ xanh tốt và ra hoa"
  },
  {
    "con": "Khi một vật thể bị đẩy hoặc kéo, thì nó sẽ có hiện tượng gì?",
    "re": "Vật thể sẽ chuyển động"
  },
  {
    "con": "Nếu một chất rắn được làm nóng, thì nó sẽ xảy ra hiện tượng gì?",
    "re": "Chất rắn có thể tan chảy thành chất lỏng"
  },
  {
    "con": "Nếu một con vật không có thức ăn trong thời gian dài, thì nó sẽ gặp phải điều gì?",
    "re": "Con vật sẽ bị đói và có thể chết"
  },
  {
    "con": "Khi ánh sáng đi qua một lăng kính, thì nó sẽ xảy ra hiện tượng gì?",
    "re": "Ánh sáng sẽ bị tán sắc thành nhiều màu"
  },
  {
    "con": "Nếu một chất lỏng được làm lạnh, thì nó sẽ xảy ra hiện tượng gì?",
    "re": "Chất lỏng có thể đông đặc thành chất rắn"
  },
  {
    "con": "Nếu không có không khí, thì lửa sẽ không thể cháy.",
    "re": "Lửa sẽ tắt"
  },
  {
    "con": "Khi một vật thể va chạm với một vật thể khác, thì nó sẽ xảy ra hiện tượng gì?",
    "re": "Có thể xảy ra phản ứng hoặc thay đổi chuyển động"
  },
  {
    "con": "Nước được đun sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái hơi"
  },
  {
    "con": "Khi ánh sáng mặt trời chiếu vào một vật thể màu xanh",
    "re": "Vật thể đó sẽ phản xạ ánh sáng màu xanh và hấp thụ các màu khác"
  },
  {
    "con": "Khi một vật thể được thả từ độ cao, nó sẽ rơi xuống",
    "re": "Vật thể sẽ chịu tác động của trọng lực"
  },
  {
    "con": "Khi thực hiện thí nghiệm với các chất hóa học khác nhau",
    "re": "Có thể xảy ra phản ứng hóa học tạo ra sản phẩm mới"
  },
  {
    "con": "Khi cây xanh quang hợp dưới ánh sáng mặt trời",
    "re": "Cây sẽ sản xuất oxy và glucose"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới điểm đóng băng của nước",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái rắn"
  },
  {
    "con": "Khi một động vật bị thiếu oxy trong thời gian dài",
    "re": "Động vật đó có thể bị ngạt thở và chết"
  },
  {
    "con": "Khi một vật thể di chuyển nhanh hơn âm thanh",
    "re": "Vật thể đó sẽ tạo ra sóng xung kích"
  },
  {
    "con": "Khi một chất rắn được nung nóng",
    "re": "Chất đó có thể chuyển sang trạng thái lỏng hoặc khí"
  },
  {
    "con": "Khi một hệ sinh thái bị mất đi một loài động vật",
    "re": "Có thể gây ra sự mất cân bằng trong hệ sinh thái đó"
  },
  {
    "con": "Nước được cấu tạo từ hai nguyên tố là gì?",
    "re": "Hydro và Oxy"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, thì nó sẽ rơi xuống đất do lực nào tác động?",
    "re": "Lực hấp dẫn"
  },
  {
    "con": "Nếu cây xanh không có ánh sáng mặt trời, thì nó sẽ như thế nào?",
    "re": "Không thể quang hợp và sẽ chết"
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên, thì thể tích của chất đó sẽ ra sao?",
    "re": "Thể tích sẽ tăng lên"
  },
  {
    "con": "Nếu một động vật có xương sống, thì nó thuộc nhóm nào?",
    "re": "Động vật có xương"
  },
  {
    "con": "Nếu một chất rắn được nung nóng, thì nó sẽ xảy ra hiện tượng gì?",
    "re": "Chất rắn có thể chuyển thành chất lỏng"
  },
  {
    "con": "Nếu một sinh vật không có khả năng tự sản xuất thức ăn, thì nó được gọi là gì?",
    "re": "Sinh vật tiêu thụ"
  },
  {
    "con": "Nếu một vật thể có khối lượng lớn hơn, thì lực hấp dẫn tác động lên nó sẽ như thế nào?",
    "re": "Lực hấp dẫn sẽ lớn hơn"
  },
  {
    "con": "Nếu một chất lỏng được làm lạnh, thì nó sẽ xảy ra hiện tượng gì?",
    "re": "Chất lỏng có thể đông đặc thành rắn"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, thì nó được gọi là gì?",
    "re": "Sinh vật thủy sinh"
  },
  {
    "con": "Nước được đun sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái hơi"
  },
  {
    "con": "Khi ánh sáng mặt trời chiếu vào một vật thể màu xanh",
    "re": "Vật thể đó sẽ hấp thụ tất cả các màu khác và phản xạ màu xanh"
  },
  {
    "con": "Khi một vật thể nóng chạm vào một vật thể lạnh",
    "re": "Nhiệt sẽ truyền từ vật thể nóng sang vật thể lạnh cho đến khi đạt được nhiệt độ cân bằng"
  },
  {
    "con": "Khi một cây xanh quang hợp",
    "re": "Cây sẽ sử dụng ánh sáng mặt trời để chuyển đổi carbon dioxide và nước thành glucose và oxy"
  },
  {
    "con": "Khi có sự thay đổi nhiệt độ trong không khí",
    "re": "Áp suất không khí cũng sẽ thay đổi"
  },
  {
    "con": "Khi một chất rắn được nung nóng",
    "re": "Chất rắn sẽ giãn nở và có thể chuyển sang trạng thái lỏng"
  },
  {
    "con": "Khi một con vật di chuyển từ nơi này sang nơi khác",
    "re": "Nó sẽ sử dụng năng lượng để thực hiện chuyển động"
  },
  {
    "con": "Khi một chất lỏng được cho vào một bình chứa",
    "re": "Chất lỏng sẽ chiếm không gian trong bình và có hình dạng của bình"
  },
  {
    "con": "Khi một hạt giống được trồng trong đất",
    "re": "Hạt giống sẽ nảy mầm và phát triển thành cây con nếu có đủ nước và ánh sáng"
  },
  {
    "con": "Khi một vật thể rơi tự do",
    "re": "Nó sẽ chịu tác động của trọng lực và tăng tốc về phía mặt đất"
  },
  {
    "con": "Nước ở trạng thái lỏng sẽ chuyển thành trạng thái rắn khi nhiệt độ giảm xuống dưới 0 độ C.",
    "re": "Nước sẽ đóng băng thành băng."
  },
  {
    "con": "Khi thực hiện thí nghiệm, nếu không tuân thủ quy trình an toàn thì",
    "re": "Có thể xảy ra tai nạn hoặc sự cố không mong muốn."
  },
  {
    "con": "Nếu thực vật không nhận đủ ánh sáng mặt trời thì",
    "re": "Chúng sẽ không phát triển tốt và có thể chết."
  },
  {
    "con": "Khi một vật thể nóng được đặt vào nước lạnh thì",
    "re": "Nhiệt độ của vật thể nóng sẽ giảm xuống."
  },
  {
    "con": "Nếu không có không khí thì",
    "re": "Lửa sẽ không thể cháy."
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước thì",
    "re": "Chất đó sẽ tạo thành dung dịch."
  },
  {
    "con": "Nếu động vật không có đủ thức ăn thì",
    "re": "Chúng sẽ không sống sót lâu dài."
  },
  {
    "con": "Khi nhiệt độ tăng lên, nếu áp suất không đổi thì",
    "re": "Thể tích của khí sẽ tăng lên."
  },
  {
    "con": "Nếu một vật thể di chuyển với tốc độ không đổi thì",
    "re": "Quỹ đạo của nó sẽ là một đường thẳng."
  },
  {
    "con": "Nếu không có nước thì",
    "re": "Sự sống trên Trái Đất sẽ không tồn tại."
  },
  {
    "con": "Để bảo vệ môi trường, nếu mỗi người đều giảm thiểu rác thải nhựa thì",
    "re": "Chúng ta sẽ góp phần làm sạch hành tinh."
  },
  {
    "con": "Để phòng tránh tai nạn giao thông đường bộ, mỗi học sinh cũng như mỗi công dân cần phải làm gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được làm nóng đến 100 độ C",
    "re": "sẽ chuyển thành hơi nước"
  },
  {
    "con": "Cây xanh quang hợp vào ban ngày",
    "re": "sẽ sản xuất oxy"
  },
  {
    "con": "Động vật có xương sống như cá, chim và thú",
    "re": "thuộc về nhóm động vật có cấu trúc cơ thể phức tạp"
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính",
    "re": "nó sẽ bị phân tán thành nhiều màu sắc"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao",
    "re": "nó sẽ rơi xuống đất do trọng lực"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C",
    "re": "nước sẽ đóng băng thành băng"
  },
  {
    "con": "Nếu một sinh vật sống thiếu oxy",
    "re": "nó sẽ không thể tồn tại lâu dài"
  },
  {
    "con": "Khi một chất rắn được nung nóng",
    "re": "nó có thể chuyển thành chất lỏng"
  },
  {
    "con": "Nếu một cây không nhận đủ ánh sáng mặt trời",
    "re": "nó sẽ không phát triển khỏe mạnh"
  },
  {
    "con": "Khi một chất hóa học phản ứng với một chất khác",
    "re": "nó có thể tạo ra sản phẩm mới"
  },
  {
    "con": "Giai đoạn hoàn thiện của con người về mặt thể chất, tinh thần và xã hội được gọi là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ bao nhiêu độ C ở áp suất khí quyển bình thường?",
    "re": "100 độ C"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nó sẽ bị gì?",
    "re": "Khúc xạ"
  },
  {
    "con": "Các sinh vật sống cần gì để tồn tại?",
    "re": "Nước, thức ăn, không khí và môi trường sống"
  },
  {
    "con": "Khi một vật bị đẩy ra xa, nó sẽ có xu hướng làm gì?",
    "re": "Tiếp tục chuyển động theo hướng đó cho đến khi có lực tác động khác"
  },
  {
    "con": "Khi nhiệt độ tăng, thể tích của khí sẽ làm gì?",
    "re": "Tăng lên"
  },
  {
    "con": "Khi một chất rắn tan trong nước, nó sẽ tạo ra gì?",
    "re": "Dung dịch"
  },
  {
    "con": "Khi cây quang hợp, nó sẽ sản xuất ra gì?",
    "re": "Oxy và glucose"
  },
  {
    "con": "Khi một vật rơi tự do, nó sẽ chịu tác động của lực gì?",
    "re": "Trọng lực"
  },
  {
    "con": "Khi một chất thay đổi từ thể rắn sang thể lỏng, quá trình này được gọi là gì?",
    "re": "Nóng chảy"
  },
  {
    "con": "\"Giữ vệ sinh nhà ở và môi trường xung quanh, diệt muỗi, diệt bọ gậy, tránh để muỗi đốt.\" là cách phòng bệnh tốt nhất đối với bệnh nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở 100 độ C ở áp suất khí quyển bình thường.",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái hơi."
  },
  {
    "con": "Nếu thực vật không nhận đủ ánh sáng mặt trời.",
    "re": "Chúng sẽ không phát triển tốt và có thể chết."
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao,",
    "re": "Nó sẽ rơi xuống đất do lực hấp dẫn."
  },
  {
    "con": "Nếu không có không khí,",
    "re": "Lửa sẽ không thể cháy."
  },
  {
    "con": "Nếu động vật không có thức ăn và nước uống,",
    "re": "Chúng sẽ không sống sót."
  },
  {
    "con": "Nếu nhiệt độ giảm xuống dưới 0 độ C,",
    "re": "Nước sẽ đóng băng thành băng."
  },
  {
    "con": "Nếu các loài động vật không có môi trường sống phù hợp,",
    "re": "Chúng sẽ không thể tồn tại."
  },
  {
    "con": "Nếu một chất được hòa tan trong nước,",
    "re": "Nó sẽ tạo thành dung dịch."
  },
  {
    "con": "Nếu các tế bào trong cơ thể không được cung cấp oxy,",
    "re": "Chúng sẽ chết."
  },
  {
    "con": "Khi một đứa bé mới sinh dựa vào cơ quan nào của cơ thể để biết bé trai hay bé gái?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nước được đun sôi, nó sẽ chuyển từ trạng thái lỏng sang trạng thái nào?",
    "re": "Trạng thái khí"
  },
  {
    "con": "Khi cây quang hợp, nó sử dụng ánh sáng mặt trời để làm gì?",
    "re": "Sản xuất thức ăn"
  },
  {
    "con": "Khi một vật thể rơi tự do, nó sẽ chịu tác động của lực nào?",
    "re": "Lực hấp dẫn"
  },
  {
    "con": "Khi một con vật thay đổi môi trường sống, nó cần phải làm gì để thích nghi?",
    "re": "Thay đổi hành vi hoặc đặc điểm sinh lý"
  },
  {
    "con": "Khi một chất rắn được làm nóng, nó sẽ xảy ra hiện tượng gì?",
    "re": "Nó sẽ nở ra"
  },
  {
    "con": "Khi ánh sáng đi qua một lăng kính, nó sẽ xảy ra hiện tượng gì?",
    "re": "Khúc xạ ánh sáng"
  },
  {
    "con": "Khi một con vật ăn thức ăn, nó sẽ sử dụng năng lượng đó để làm gì?",
    "re": "Thực hiện các hoạt động sống"
  },
  {
    "con": "Khi nước đóng băng, nó sẽ chuyển từ trạng thái nào sang trạng thái nào?",
    "re": "Từ trạng thái lỏng sang trạng thái rắn"
  },
  {
    "con": "Khi một hạt giống được trồng trong đất, nó cần yếu tố nào để nảy mầm?",
    "re": "Nước và ánh sáng"
  },
  {
    "con": "Nước ở nhiệt độ 0 độ C sẽ",
    "re": "đóng băng thành đá"
  },
  {
    "con": "Nếu ánh sáng mặt trời chiếu vào một vật màu xanh dương, vật đó sẽ",
    "re": "phản xạ ánh sáng màu xanh dương"
  },
  {
    "con": "Khi cây quang hợp, nó sẽ",
    "re": "sản xuất ra oxy và glucose"
  },
  {
    "con": "Nếu một vật nặng hơn rơi từ độ cao, nó sẽ",
    "re": "rơi nhanh hơn một vật nhẹ hơn"
  },
  {
    "con": "Khi nước sôi, nó sẽ",
    "re": "biến thành hơi nước"
  },
  {
    "con": "Nếu một con vật có lông, nó sẽ",
    "re": "có khả năng giữ ấm cho cơ thể"
  },
  {
    "con": "Khi đất bị ẩm, nó sẽ",
    "re": "giúp cây trồng phát triển tốt hơn"
  },
  {
    "con": "Nếu có gió mạnh, nó sẽ",
    "re": "làm di chuyển các vật nhẹ như lá cây"
  },
  {
    "con": "Khi một chất rắn được nung nóng, nó sẽ",
    "re": "mở rộng và có thể chuyển sang trạng thái lỏng"
  },
  {
    "con": "Nếu một con vật sống trong nước, nó sẽ",
    "re": "có thể thở bằng mang"
  },
  {
    "con": "Nếu có một nguồn điện, nó sẽ",
    "re": "cung cấp năng lượng cho các thiết bị điện"
  },
  {
    "con": "Nếu có người rủ em dùng thử ma tuý, em sẽ:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào?",
    "re": "100 độ C ở áp suất khí quyển bình thường"
  },
  {
    "con": "Thực vật cần yếu tố nào để quang hợp?",
    "re": "Ánh sáng mặt trời, nước và carbon dioxide"
  },
  {
    "con": "Trái đất quay quanh mặt trời trong bao lâu?",
    "re": "Khoảng 365,25 ngày"
  },
  {
    "con": "Khi nhiệt độ giảm, chất khí sẽ làm gì?",
    "re": "Co lại và giảm áp suất"
  },
  {
    "con": "Sự sống trên trái đất phụ thuộc vào yếu tố nào?",
    "re": "Nước, không khí và ánh sáng"
  },
  {
    "con": "Khi một vật di chuyển nhanh hơn âm thanh, điều gì xảy ra?",
    "re": "Nó tạo ra sóng xung kích"
  },
  {
    "con": "Sự chuyển động của các hành tinh trong hệ mặt trời là gì?",
    "re": "Quay quanh mặt trời theo quỹ đạo hình elip"
  },
  {
    "con": "Khi nước đông lại, nó sẽ làm gì?",
    "re": "Mở rộng và giảm mật độ"
  },
  {
    "con": "Khi một vật nóng lên, điều gì xảy ra với các phân tử của nó?",
    "re": "Chúng di chuyển nhanh hơn và xa nhau hơn"
  },
  {
    "con": "Sự phân hủy của chất hữu cơ cần yếu tố nào?",
    "re": "Vi khuẩn và nấm"
  },
  {
    "con": "Hệ sinh thái bao gồm những gì?",
    "re": "Các sinh vật sống và môi trường sống của chúng"
  },
  {
    "con": "HIV không lây qua đường nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trứng kết hợp với tinh trùng trong quá trình thụ tinh tạo thành:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước bay hơi khi nhiệt độ tăng lên:",
    "re": "Nước chuyển thành hơi nước"
  },
  {
    "con": "Thực vật quang hợp trong ánh sáng mặt trời:",
    "re": "Sản xuất oxy và glucose"
  },
  {
    "con": "Động vật hô hấp bằng cách lấy oxy từ không khí:",
    "re": "Cung cấp năng lượng cho cơ thể"
  },
  {
    "con": "Trái đất quay quanh mặt trời:",
    "re": "Tạo ra các mùa trong năm"
  },
  {
    "con": "Năng lượng mặt trời được hấp thụ bởi thực vật:",
    "re": "Giúp thực vật phát triển và sinh trưởng"
  },
  {
    "con": "Nước đóng băng khi nhiệt độ giảm xuống dưới 0 độ C:",
    "re": "Tạo thành băng"
  },
  {
    "con": "Khí carbon dioxide được thải ra từ quá trình hô hấp:",
    "re": "Là một phần của chu trình carbon trong tự nhiên"
  },
  {
    "con": "Sự hấp thụ ánh sáng bởi các bề mặt tối màu:",
    "re": "Tăng nhiệt độ của bề mặt đó"
  },
  {
    "con": "Sự di chuyển của các mảnh vụn trong không khí:",
    "re": "Gây ra hiện tượng ô nhiễm không khí"
  },
  {
    "con": "Nước được đun sôi ở 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Thực vật nhận ánh sáng mặt trời",
    "re": "Chúng sẽ thực hiện quá trình quang hợp"
  },
  {
    "con": "Động vật có xương sống như cá, chim, và thú",
    "re": "Chúng thuộc nhóm động vật có cấu trúc cơ thể phức tạp hơn"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Khi một vật thể được thả từ độ cao",
    "re": "Nó sẽ rơi xuống đất do lực hấp dẫn"
  },
  {
    "con": "Khi một chất được hòa tan trong nước",
    "re": "Chất đó sẽ phân tán đều trong dung dịch"
  },
  {
    "con": "Khi có ánh sáng chiếu vào một vật thể",
    "re": "Vật thể đó có thể phản xạ hoặc hấp thụ ánh sáng"
  },
  {
    "con": "Khi một chất bị đốt cháy",
    "re": "Nó sẽ tạo ra nhiệt và ánh sáng"
  },
  {
    "con": "Khi một con vật thay đổi môi trường sống",
    "re": "Nó có thể phải thích nghi để sống sót"
  },
  {
    "con": "Khi có sự thay đổi trong môi trường",
    "re": "Các sinh vật có thể bị ảnh hưởng đến sự sống và phát triển của chúng"
  },
  {
    "con": "Nước được làm nóng đến 100 độ C",
    "re": "nước sẽ sôi"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao",
    "re": "nó sẽ rơi xuống đất do trọng lực"
  },
  {
    "con": "Nếu cây nhận đủ ánh sáng mặt trời và nước",
    "re": "cây sẽ phát triển khỏe mạnh"
  },
  {
    "con": "Nếu một chất được hòa tan trong nước",
    "re": "chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Nếu nhiệt độ giảm xuống dưới 0 độ C",
    "re": "nước sẽ đóng băng thành băng"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác",
    "re": "vật đó sẽ có trọng lực lớn hơn"
  },
  {
    "con": "Nếu một sinh vật không nhận đủ oxy",
    "re": "sinh vật đó sẽ không thể sống sót"
  },
  {
    "con": "Nếu ánh sáng chiếu vào một vật màu xanh",
    "re": "vật đó sẽ phản xạ ánh sáng màu xanh"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra",
    "re": "các chất ban đầu sẽ biến đổi thành các chất mới"
  },
  {
    "con": "Nếu một động vật không có thức ăn",
    "re": "động vật đó sẽ bị đói và có thể chết"
  },
  {
    "con": "Tại sao nói tuổi dậy thì có tầm quan trọng đặc biệt đối với cuộc đời của mỗi con người?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được đun sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái hơi"
  },
  {
    "con": "Một vật thể được thả từ độ cao nhất định",
    "re": "Vật thể sẽ rơi xuống đất do lực hấp dẫn"
  },
  {
    "con": "Thực vật nhận ánh sáng mặt trời",
    "re": "Thực vật sẽ tiến hành quang hợp để tạo ra năng lượng"
  },
  {
    "con": "Một chất được hòa tan trong nước",
    "re": "Chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Nhiệt độ của một chất tăng lên",
    "re": "Chất đó sẽ có thể chuyển từ trạng thái rắn sang trạng thái lỏng"
  },
  {
    "con": "Một con vật có xương sống",
    "re": "Con vật đó thuộc nhóm động vật có xương sống"
  },
  {
    "con": "Một chất có độ pH dưới 7",
    "re": "Chất đó được coi là axit"
  },
  {
    "con": "Một hệ sinh thái có nhiều loài khác nhau",
    "re": "Hệ sinh thái đó sẽ có sự cân bằng sinh học tốt hơn"
  },
  {
    "con": "Một vật thể được làm từ kim loại",
    "re": "Vật thể đó sẽ dẫn điện tốt hơn so với vật thể không phải kim loại"
  },
  {
    "con": "Một con vật sống trong nước",
    "re": "Con vật đó sẽ có khả năng thở bằng mang"
  },
  {
    "con": "Phát biểu nào sau đây nêu đúng nhất về bệnh sốt xuất huyết?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp",
    "re": "Chúng sẽ sản xuất ra oxy và glucose"
  },
  {
    "con": "Động vật có xương sống có cấu trúc cơ thể phức tạp hơn động vật không xương sống",
    "re": "Chúng có khả năng di chuyển và sinh tồn tốt hơn trong môi trường"
  },
  {
    "con": "Khi nhiệt độ giảm, các chất khí thường co lại",
    "re": "Áp suất của khí đó sẽ tăng lên nếu thể tích không thay đổi"
  },
  {
    "con": "Khi một vật thể bị đẩy xuống nước, nó sẽ bị nổi lên nếu lực đẩy của nước lớn hơn trọng lực của nó",
    "re": "Vật thể sẽ nổi trên mặt nước"
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính, nó sẽ bị khúc xạ",
    "re": "Ánh sáng sẽ phân tán thành các màu sắc khác nhau"
  },
  {
    "con": "Nếu một chất được đun nóng, nó sẽ mở rộng",
    "re": "Thể tích của chất đó sẽ tăng lên"
  },
  {
    "con": "Khi có sự thay đổi trong môi trường sống, các loài sinh vật sẽ thích nghi",
    "re": "Chúng có thể sống sót và phát triển trong điều kiện mới"
  },
  {
    "con": "Nếu một vật thể có khối lượng lớn hơn nước, nó sẽ chìm",
    "re": "Vật thể sẽ không nổi trên mặt nước"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, các chất ban đầu sẽ biến đổi thành các chất mới",
    "re": "Năng lượng có thể được giải phóng hoặc hấp thụ trong quá trình này"
  },
  {
    "con": "Nước ở trạng thái lỏng khi nhiệt độ trên 0 độ C",
    "re": "Nước sẽ không đóng băng"
  },
  {
    "con": "Nếu thực vật không nhận đủ ánh sáng mặt trời",
    "re": "Chúng sẽ không phát triển tốt"
  },
  {
    "con": "Khi một vật thể nóng lên",
    "re": "Nó sẽ giãn nở"
  },
  {
    "con": "Nếu một chất không hòa tan trong nước",
    "re": "Chất đó sẽ lắng xuống dưới đáy"
  },
  {
    "con": "Khi có ánh sáng chiếu vào một vật thể",
    "re": "Vật thể đó sẽ tạo ra bóng"
  },
  {
    "con": "Nếu động vật không có đủ thức ăn",
    "re": "Chúng sẽ không sống sót lâu dài"
  },
  {
    "con": "Khi nước bay hơi",
    "re": "Nó sẽ chuyển thành hơi nước"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao",
    "re": "Nó sẽ rơi xuống đất do trọng lực"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Nếu không có không khí",
    "re": "Lửa sẽ không thể cháy"
  },
  {
    "con": "Khi phải dùng thuốc, đặc biệt là thuốc kháng sinh cần chú ý điều gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nước được đun sôi, nhiệt độ của nó sẽ tăng lên đến bao nhiêu độ C?",
    "re": "Nước sẽ sôi ở 100 độ C ở áp suất khí quyển bình thường"
  },
  {
    "con": "Khi thực hiện thí nghiệm với cây xanh, nếu không có ánh sáng mặt trời thì cây sẽ như thế nào?",
    "re": "Cây sẽ không phát triển tốt và có thể chết"
  },
  {
    "con": "Khi một vật di chuyển nhanh hơn âm thanh, điều gì sẽ xảy ra?",
    "re": "Vật đó sẽ tạo ra sóng xung kích"
  },
  {
    "con": "Khi nước đóng băng, thể tích của nó sẽ thay đổi ra sao?",
    "re": "Thể tích của nước sẽ tăng lên khi đóng băng"
  },
  {
    "con": "Khi một chất rắn được nung nóng, điều gì sẽ xảy ra với cấu trúc của nó?",
    "re": "Cấu trúc của chất rắn có thể thay đổi và trở thành chất lỏng"
  },
  {
    "con": "Khi một con vật bị thiếu oxy, nó sẽ phản ứng như thế nào?",
    "re": "Con vật sẽ trở nên yếu và có thể chết nếu thiếu oxy lâu dài"
  },
  {
    "con": "Khi một chất hóa học phản ứng với một chất khác, điều gì sẽ xảy ra?",
    "re": "Sẽ tạo ra sản phẩm mới với tính chất khác biệt"
  },
  {
    "con": "Khi ánh sáng đi qua một lăng kính, nó sẽ bị thay đổi như thế nào?",
    "re": "Ánh sáng sẽ bị khúc xạ và tạo ra cầu vồng"
  },
  {
    "con": "Khi một vật nặng rơi từ độ cao lớn, điều gì sẽ xảy ra với nó?",
    "re": "Vật sẽ tăng tốc và có thể gây ra va chạm mạnh khi chạm đất"
  },
  {
    "con": "Nước ở trạng thái lỏng sẽ chuyển thành hơi nước khi nhiệt độ tăng lên.",
    "re": "Hơi nước sẽ hình thành."
  },
  {
    "con": "Nếu thực vật không nhận đủ ánh sáng mặt trời, chúng sẽ không thể thực hiện quá trình quang hợp.",
    "re": "Thực vật sẽ không phát triển tốt."
  },
  {
    "con": "Khi một vật thể được thả từ độ cao, nó sẽ rơi xuống đất do lực hấp dẫn.",
    "re": "Vật thể sẽ rơi xuống."
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên, thể tích của chất đó sẽ thường tăng theo.",
    "re": "Chất đó sẽ nở ra."
  },
  {
    "con": "Khi nước đóng băng, nó sẽ chuyển từ trạng thái lỏng sang trạng thái rắn.",
    "re": "Nước sẽ trở thành đá."
  },
  {
    "con": "Nếu một động vật không có đủ thức ăn, nó sẽ không thể sống sót.",
    "re": "Động vật sẽ chết đói."
  },
  {
    "con": "Khi ánh sáng chiếu vào một vật thể, nó có thể bị phản xạ hoặc hấp thụ.",
    "re": "Vật thể sẽ có màu sắc khác nhau."
  },
  {
    "con": "Nếu không có không khí, âm thanh sẽ không thể truyền đi.",
    "re": "Âm thanh sẽ không nghe thấy."
  },
  {
    "con": "Khi một chất bị đun nóng, nó sẽ có xu hướng chuyển động nhanh hơn.",
    "re": "Chất đó sẽ trở nên nóng hơn."
  },
  {
    "con": "Nếu một sinh vật không thích nghi với môi trường sống của nó, nó sẽ gặp khó khăn trong việc sinh tồn.",
    "re": "Sinh vật đó có thể bị tuyệt chủng."
  },
  {
    "con": "Để chủ động phòng chống dịch COVID- 19, Bộ Y tế mong muốn và kêu gọi mỗi người dân cùng nhau thực hiện Chung sống an toàn với đại dịch thực hiện tốt” Thông điệp 5K” bao gồm:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước ở trạng thái lỏng khi nhiệt độ trên 0 độ C",
    "re": "Nước sẽ không đóng băng"
  },
  {
    "con": "Nếu thực vật không nhận đủ ánh sáng mặt trời",
    "re": "Chúng sẽ không phát triển tốt"
  },
  {
    "con": "Khi một vật được nung nóng",
    "re": "Nó sẽ nở ra và có thể thay đổi hình dạng"
  },
  {
    "con": "Nếu động vật không có đủ thức ăn",
    "re": "Chúng sẽ không có đủ năng lượng để sống sót"
  },
  {
    "con": "Khi nước bay hơi",
    "re": "Nó sẽ chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Nếu một vật nặng hơn rơi từ độ cao",
    "re": "Nó sẽ rơi nhanh hơn một vật nhẹ hơn"
  },
  {
    "con": "Khi có ánh sáng chiếu vào một vật màu xanh",
    "re": "Vật đó sẽ phản xạ ánh sáng màu xanh"
  },
  {
    "con": "Nếu không có không khí",
    "re": "Lửa sẽ không thể cháy"
  },
  {
    "con": "Khi một chất bị hòa tan trong nước",
    "re": "Chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Nếu một vật được đặt trong nước",
    "re": "Nó sẽ bị nổi lên hoặc chìm xuống tùy thuộc vào mật độ"
  },
  {
    "con": "Để bảo vệ môi trường, em nên tái chế rác thải",
    "re": "Điều này sẽ giúp giảm lượng rác thải ra môi trường"
  },
  {
    "con": "Để phòng tránh nguy cơ bị xâm hại, em phải lưu ý những điều gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Mây, song là loại cây thân gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ bao nhiêu độ C?",
    "re": "100 độ C"
  },
  {
    "con": "Cây xanh cần gì để quang hợp?",
    "re": "Ánh sáng mặt trời, nước và carbon dioxide"
  },
  {
    "con": "Trái đất quay quanh mặt trời trong bao lâu?",
    "re": "Khoảng 365 ngày"
  },
  {
    "con": "Sự sống trên trái đất phụ thuộc vào yếu tố nào?",
    "re": "Nước"
  },
  {
    "con": "Khi nhiệt độ giảm, chất khí sẽ làm gì?",
    "re": "Co lại"
  },
  {
    "con": "Động vật có xương sống bao gồm những loại nào?",
    "re": "Cá, chim, bò sát, lưỡng cư và động vật có vú"
  },
  {
    "con": "Sự chuyển động của các hành tinh trong hệ mặt trời là gì?",
    "re": "Quay quanh mặt trời"
  },
  {
    "con": "Khi ánh sáng đi qua nước, nó sẽ làm gì?",
    "re": "Bị khúc xạ"
  },
  {
    "con": "Thực vật hấp thụ nước qua bộ phận nào?",
    "re": "Rễ"
  },
  {
    "con": "Nước ở nhiệt độ 0 độ C sẽ đóng băng",
    "re": "Nước trở thành băng"
  },
  {
    "con": "Năng lượng mặt trời chiếu vào cây",
    "re": "Cây thực hiện quang hợp để tạo ra thức ăn"
  },
  {
    "con": "Khi nhiệt độ tăng lên",
    "re": "Chất rắn có thể chuyển thành chất lỏng"
  },
  {
    "con": "Khi có ánh sáng chiếu vào một vật thể",
    "re": "Vật thể đó có thể phản xạ hoặc hấp thụ ánh sáng"
  },
  {
    "con": "Khi một vật thể di chuyển nhanh hơn âm thanh",
    "re": "Vật thể đó tạo ra sóng xung kích"
  },
  {
    "con": "Khi một chất bị đun nóng",
    "re": "Chất đó có thể mở rộng thể tích"
  },
  {
    "con": "Khi có sự thay đổi trong môi trường",
    "re": "Sinh vật có thể thích nghi hoặc bị ảnh hưởng"
  },
  {
    "con": "Khi nước bay hơi",
    "re": "Nước chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Khi một vật thể bị kéo xuống bởi trọng lực",
    "re": "Vật thể đó sẽ rơi xuống mặt đất"
  },
  {
    "con": "Khi một chất hóa học phản ứng với chất khác",
    "re": "Sẽ tạo ra sản phẩm mới với tính chất khác"
  },
  {
    "con": "Khi một động vật sống trong môi trường nước",
    "re": "Động vật đó có thể có các đặc điểm thích nghi như vây và mang"
  },
  {
    "con": "Thuỷ tinh có những tính chất gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước ở trạng thái lỏng sẽ chuyển thành hơi nước khi nhiệt độ đạt đến 100 độ C",
    "re": "Hơi nước sẽ hình thành"
  },
  {
    "con": "Cây xanh cần ánh sáng mặt trời để thực hiện quá trình quang hợp",
    "re": "Cây sẽ sản xuất oxy và glucose"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, nó sẽ rơi xuống đất do lực hấp dẫn",
    "re": "Vật thể sẽ rơi xuống"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C, nước sẽ đóng băng",
    "re": "Nước sẽ chuyển thành băng"
  },
  {
    "con": "Nếu một chất được hòa tan trong nước, nó sẽ tạo thành dung dịch",
    "re": "Dung dịch sẽ có tính chất khác với chất rắn ban đầu"
  },
  {
    "con": "Khi ánh sáng đi qua lăng kính, nó sẽ bị khúc xạ",
    "re": "Ánh sáng sẽ phân tán thành các màu sắc khác nhau"
  },
  {
    "con": "Nếu một động vật không có thức ăn, nó sẽ không thể sống sót",
    "re": "Động vật sẽ chết đói"
  },
  {
    "con": "Khi một vật thể nóng chạm vào một vật thể lạnh, nhiệt sẽ truyền từ vật nóng sang vật lạnh",
    "re": "Vật lạnh sẽ nóng lên"
  },
  {
    "con": "Nếu một chất có mật độ lớn hơn nước, nó sẽ chìm trong nước",
    "re": "Chất sẽ không nổi"
  },
  {
    "con": "Khi có điện chạy qua dây dẫn, nó sẽ tạo ra từ trường xung quanh",
    "re": "Từ trường sẽ xuất hiện"
  },
  {
    "con": "Kéo căng sợi dây cao su, sợi dây dãn ra. Khi buông tay, sợi dây cao su lại trở về vị trí cũ. Vậy theo em, đó là tính chất gì của cao su?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu nước được đun sôi, nó sẽ chuyển từ trạng thái lỏng sang trạng thái khí. Vậy hiện tượng này gọi là gì?",
    "re": "Sự bay hơi"
  },
  {
    "con": "Nếu một vật được thả từ độ cao, nó sẽ rơi xuống đất do lực hấp dẫn. Vậy lực này có tên gọi là gì?",
    "re": "Lực hấp dẫn"
  },
  {
    "con": "Nếu ánh sáng chiếu vào một vật màu đỏ, vật đó sẽ phản xạ ánh sáng màu gì?",
    "re": "Màu đỏ"
  },
  {
    "con": "Nếu một cây xanh được tưới nước và nhận đủ ánh sáng mặt trời, nó sẽ phát triển tốt. Vậy điều này cho thấy cây cần gì để sống?",
    "re": "Nước và ánh sáng"
  },
  {
    "con": "Nếu bạn trộn muối vào nước, muối sẽ tan ra. Vậy hiện tượng này gọi là gì?",
    "re": "Sự hòa tan"
  },
  {
    "con": "Nếu bạn làm lạnh một chất khí, nó sẽ co lại. Vậy hiện tượng này gọi là gì?",
    "re": "Sự co lại"
  },
  {
    "con": "Nếu bạn đặt một viên đá vào nước, nước sẽ dâng lên. Vậy hiện tượng này gọi là gì?",
    "re": "Sự thay thế thể tích"
  },
  {
    "con": "Nếu bạn thả một viên bi vào nước, viên bi sẽ chìm xuống. Vậy điều này cho thấy viên bi có tính chất gì?",
    "re": "Khối lượng riêng lớn hơn nước"
  },
  {
    "con": "Nếu bạn đốt một cây nến, nó sẽ tạo ra ánh sáng và nhiệt. Vậy quá trình này gọi là gì?",
    "re": "Quá trình cháy"
  },
  {
    "con": "Nước ở trạng thái lỏng có thể chuyển thành hơi nước khi nhiệt độ tăng cao",
    "re": "Hơi nước sẽ hình thành"
  },
  {
    "con": "Nếu một vật được thả từ độ cao, nó sẽ rơi xuống đất",
    "re": "Vật sẽ chịu tác động của trọng lực"
  },
  {
    "con": "Nếu cây xanh không nhận đủ ánh sáng mặt trời, nó sẽ không thể quang hợp",
    "re": "Cây sẽ không phát triển tốt"
  },
  {
    "con": "Nếu một chất được nung nóng, nó sẽ mở rộng",
    "re": "Thể tích của chất đó sẽ tăng lên"
  },
  {
    "con": "Nếu một động vật không có thức ăn, nó sẽ không sống sót",
    "re": "Động vật sẽ chết đói"
  },
  {
    "con": "Nếu nước bị đông lạnh, nó sẽ chuyển thành băng",
    "re": "Nhiệt độ sẽ giảm xuống 0 độ C hoặc thấp hơn"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn, nó sẽ có trọng lực lớn hơn",
    "re": "Trọng lực tác động lên vật sẽ mạnh hơn"
  },
  {
    "con": "Nếu một chất hòa tan trong nước, nó sẽ tạo thành dung dịch",
    "re": "Dung dịch sẽ có tính chất khác với chất ban đầu"
  },
  {
    "con": "Nếu một động vật sống trong môi trường nước, nó sẽ có các đặc điểm thích nghi với nước",
    "re": "Động vật sẽ có khả năng bơi lội tốt hơn"
  },
  {
    "con": "Nếu một vật được làm từ kim loại, nó sẽ dẫn điện",
    "re": "Vật sẽ có khả năng dẫn điện tốt"
  },
  {
    "con": "Ngoài những đặc điểm chung, giữa nam và nữ có sự khác nhau cơ bản nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tác nhân gây ra bệnh viêm não là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào?",
    "re": "100 độ C ở áp suất khí quyển bình thường"
  },
  {
    "con": "Cây xanh cần gì để quang hợp?",
    "re": "Ánh sáng mặt trời, nước và carbon dioxide"
  },
  {
    "con": "Trái đất quay quanh mặt trời trong bao lâu?",
    "re": "Khoảng 365 ngày"
  },
  {
    "con": "Sự chuyển động của các hành tinh trong hệ mặt trời là gì?",
    "re": "Quay quanh mặt trời theo quỹ đạo hình elip"
  },
  {
    "con": "Năng lượng mặt trời có thể được chuyển đổi thành năng lượng nào?",
    "re": "Năng lượng điện thông qua pin mặt trời"
  },
  {
    "con": "Động vật có xương sống bao gồm những nhóm nào?",
    "re": "Cá, lưỡng cư, bò sát, chim và thú"
  },
  {
    "con": "Thí nghiệm nào chứng minh sự tồn tại của không khí?",
    "re": "Thí nghiệm với ống nghiệm và nước"
  },
  {
    "con": "Sự phân hủy của chất hữu cơ cần yếu tố nào?",
    "re": "Vi sinh vật và oxy"
  },
  {
    "con": "Nước có thể tồn tại ở những trạng thái nào?",
    "re": "Rắn, lỏng và khí"
  },
  {
    "con": "Dòng nào nêu không đúng cách phòng bệnh viêm gan A ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có nhiệt độ cao hơn 100 độ C ?",
    "re": "Nước sẽ sôi"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp ?",
    "re": "Chúng sẽ sản xuất ra oxy"
  },
  {
    "con": "Động vật có xương sống có đặc điểm gì ?",
    "re": "Chúng có cấu trúc xương bên trong cơ thể"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao, nó sẽ rơi xuống ?",
    "re": "Vật thể sẽ chịu tác động của trọng lực"
  },
  {
    "con": "Nếu nước được làm lạnh xuống dưới 0 độ C ?",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Nếu một chất được hòa tan trong nước ?",
    "re": "Chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Nếu một cây không có đủ nước ?",
    "re": "Cây sẽ héo và có thể chết"
  },
  {
    "con": "Nếu ánh sáng chiếu vào một vật thể màu xanh ?",
    "re": "Vật thể sẽ phản xạ ánh sáng màu xanh"
  },
  {
    "con": "Nếu một con vật không có khả năng tự sản xuất thức ăn ?",
    "re": "Con vật đó sẽ phải ăn thực phẩm từ nguồn khác"
  },
  {
    "con": "Trẻ em sống trong môi trường có khói thuốc lá dễ mắc các bệnh nào ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường ?",
    "re": "Nước chuyển từ trạng thái lỏng sang trạng thái hơi"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp ?",
    "re": "Thực vật sản xuất ra oxy và năng lượng"
  },
  {
    "con": "Khi nhiệt độ giảm, chất rắn thường co lại ?",
    "re": "Khối lượng riêng của chất rắn tăng lên"
  },
  {
    "con": "Khi có ánh sáng chiếu vào một vật thể trong suốt ?",
    "re": "Ánh sáng sẽ đi qua vật thể đó"
  },
  {
    "con": "Khi một vật thể di chuyển nhanh hơn âm thanh ?",
    "re": "Vật thể đó sẽ tạo ra sóng xung kích"
  },
  {
    "con": "Khi nước bị đông lạnh ?",
    "re": "Nước chuyển từ trạng thái lỏng sang trạng thái rắn"
  },
  {
    "con": "Khi một chất bị đun nóng ?",
    "re": "Chất đó sẽ mở rộng và có thể thay đổi trạng thái"
  },
  {
    "con": "Khi có sự thay đổi trong môi trường sống ?",
    "re": "Sinh vật có thể thích nghi hoặc bị ảnh hưởng tiêu cực"
  },
  {
    "con": "Khi một vật thể bị tác động bởi lực ?",
    "re": "Vật thể sẽ thay đổi vận tốc hoặc hướng di chuyển"
  },
  {
    "con": "Nước ở trạng thái lỏng có nhiệt độ từ 0°C đến 100°C?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cây xanh cần ánh sáng mặt trời để quang hợp?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Động vật có xương sống có hệ thống tuần hoàn kín?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trái đất quay quanh mặt trời trong một năm?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khí carbon dioxide cần thiết cho quá trình quang hợp của cây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Năng lượng mặt trời là nguồn năng lượng tái tạo?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là dung môi tốt cho nhiều chất hòa tan?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sắt là một kim loại có tính dẫn điện tốt?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sự bay hơi xảy ra khi chất lỏng chuyển thành hơi?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các loài động vật có thể sống trong môi trường khác nhau nhờ vào sự thích nghi?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được làm nóng đến 100 độ C",
    "re": "Nước sẽ sôi và chuyển thành hơi nước"
  },
  {
    "con": "Một vật thể được thả từ độ cao",
    "re": "Vật thể sẽ rơi xuống đất do lực hấp dẫn"
  },
  {
    "con": "Thực vật nhận ánh sáng mặt trời",
    "re": "Thực vật sẽ thực hiện quá trình quang hợp để tạo ra thức ăn"
  },
  {
    "con": "Một chất được hòa tan trong nước",
    "re": "Chất đó sẽ phân tán đều trong nước tạo thành dung dịch"
  },
  {
    "con": "Nhiệt độ giảm xuống dưới 0 độ C",
    "re": "Nước sẽ đóng băng và chuyển thành băng"
  },
  {
    "con": "Một con vật sống trong môi trường nước",
    "re": "Con vật đó sẽ có các đặc điểm thích nghi như vây và mang"
  },
  {
    "con": "Một vật thể được đốt cháy",
    "re": "Vật thể sẽ sản sinh ra nhiệt và ánh sáng"
  },
  {
    "con": "Một chất rắn được nung nóng",
    "re": "Chất rắn sẽ có thể chuyển thành chất lỏng nếu nhiệt độ đủ cao"
  },
  {
    "con": "Một con vật ăn thực vật",
    "re": "Con vật đó được gọi là động vật ăn cỏ"
  },
  {
    "con": "Một hệ sinh thái có sự cân bằng",
    "re": "Các loài trong hệ sinh thái sẽ tồn tại và phát triển bền vững"
  },
  {
    "con": "Nên làm gì để phòng bệnh viêm gan A?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ 100 độ C ở áp suất khí quyển bình thường",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái hơi"
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để quang hợp",
    "re": "Chúng sẽ sản xuất ra oxy và glucose"
  },
  {
    "con": "Nếu một vật thể được thả từ độ cao,",
    "re": "Nó sẽ rơi xuống đất do lực hấp dẫn"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C,",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Nếu một chất được hòa tan trong nước,",
    "re": "Chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Khi có ánh sáng chiếu vào một vật thể màu xanh,",
    "re": "Vật thể đó sẽ phản xạ ánh sáng màu xanh"
  },
  {
    "con": "Nếu một động vật không có khả năng thích nghi với môi trường,",
    "re": "Nó có thể gặp nguy hiểm và có nguy cơ tuyệt chủng"
  },
  {
    "con": "Khi một chất bị đốt cháy,",
    "re": "Nó sẽ tạo ra nhiệt và ánh sáng"
  },
  {
    "con": "Nếu một hệ sinh thái bị mất đi một loài,",
    "re": "Nó có thể ảnh hưởng đến sự cân bằng sinh thái"
  },
  {
    "con": "Nước ở trạng thái lỏng sẽ chuyển thành hơi nước khi nhiệt độ tăng lên.",
    "re": "Quá trình bay hơi xảy ra."
  },
  {
    "con": "Thực vật cần ánh sáng mặt trời để thực hiện quang hợp.",
    "re": "Chúng sản xuất ra oxy và glucose."
  },
  {
    "con": "Khi một vật thể được đun nóng, nó sẽ nở ra.",
    "re": "Thể tích của vật thể tăng lên."
  },
  {
    "con": "Khi có lực tác động lên một vật thể, vật thể sẽ thay đổi chuyển động.",
    "re": "Vật thể có thể tăng tốc hoặc giảm tốc."
  },
  {
    "con": "Động vật có xương sống có hệ thống tuần hoàn kín.",
    "re": "Máu được bơm qua các mạch máu trong cơ thể."
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nó sẽ bị khúc xạ.",
    "re": "Hình ảnh của vật dưới nước sẽ bị biến dạng."
  },
  {
    "con": "Khi một chất rắn được làm nóng đến nhiệt độ cao, nó có thể chuyển thành chất lỏng.",
    "re": "Quá trình nóng chảy xảy ra."
  },
  {
    "con": "Khi có sự thay đổi nhiệt độ, các chất có thể thay đổi trạng thái.",
    "re": "Chúng có thể chuyển từ rắn sang lỏng hoặc từ lỏng sang khí."
  },
  {
    "con": "Các loài động vật khác nhau có thể sống trong các môi trường khác nhau.",
    "re": "Chúng thích nghi với điều kiện sống của môi trường đó."
  },
  {
    "con": "Khi một vật thể rơi tự do, nó sẽ chịu tác động của trọng lực.",
    "re": "Vật thể sẽ rơi xuống với gia tốc không đổi."
  },
  {
    "con": "Nước được làm nóng đến 100 độ C",
    "re": "Nước sẽ sôi"
  },
  {
    "con": "Cây nhận ánh sáng mặt trời và nước",
    "re": "Cây sẽ quang hợp và phát triển"
  },
  {
    "con": "Động vật không có khả năng tự sản xuất thức ăn",
    "re": "Động vật phải ăn thực vật hoặc động vật khác để sống"
  },
  {
    "con": "Khi một vật được thả từ độ cao",
    "re": "Vật đó sẽ rơi xuống đất do trọng lực"
  },
  {
    "con": "Khi trộn baking soda với giấm",
    "re": "Sẽ xảy ra phản ứng hóa học tạo ra khí carbon dioxide"
  },
  {
    "con": "Khi nhiệt độ giảm xuống dưới 0 độ C",
    "re": "Nước sẽ đóng băng thành băng"
  },
  {
    "con": "Khi ánh sáng chiếu vào một vật màu trắng",
    "re": "Vật đó sẽ phản xạ ánh sáng và nhìn thấy màu trắng"
  },
  {
    "con": "Khi một vật di chuyển nhanh hơn âm thanh",
    "re": "Vật đó sẽ tạo ra sóng xung kích"
  },
  {
    "con": "Khi một chất lỏng được làm nóng",
    "re": "Chất lỏng sẽ mở rộng và có thể chuyển thành hơi"
  },
  {
    "con": "Khi một động vật bị đói",
    "re": "Động vật sẽ tìm kiếm thức ăn để cung cấp năng lượng"
  },
  {
    "con": "Chất lỏng có đặc điểm gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước sôi ở nhiệt độ nào dưới áp suất bình thường?",
    "re": "100 độ C"
  },
  {
    "con": "Thực vật cần gì để thực hiện quá trình quang hợp?",
    "re": "Ánh sáng mặt trời, nước và carbon dioxide"
  },
  {
    "con": "Động vật có xương sống có đặc điểm gì?",
    "re": "Có hệ thống xương và tủy sống"
  },
  {
    "con": "Khi nhiệt độ giảm, chất rắn sẽ làm gì?",
    "re": "Co lại"
  },
  {
    "con": "Khi ánh sáng đi qua nước, nó sẽ làm gì?",
    "re": "Bị khúc xạ"
  },
  {
    "con": "Khi một vật di chuyển nhanh hơn âm thanh, nó sẽ tạo ra hiện tượng gì?",
    "re": "Sóng xung"
  },
  {
    "con": "Khi một chất bị nung nóng, nó sẽ làm gì?",
    "re": "Mở rộng"
  },
  {
    "con": "Sự sống trên Trái Đất phụ thuộc vào yếu tố nào?",
    "re": "Nước"
  },
  {
    "con": "Khi một vật rơi tự do, nó sẽ chịu tác động của lực nào?",
    "re": "Trọng lực"
  },
  {
    "con": "Nước ở trạng thái lỏng có nhiệt độ dưới 0 độ C?",
    "re": "Nước sẽ chuyển sang trạng thái rắn (đá)"
  },
  {
    "con": "Một vật thể có khối lượng lớn hơn không khí?",
    "re": "Vật thể sẽ chìm xuống"
  },
  {
    "con": "Cây xanh có khả năng quang hợp?",
    "re": "Cây sẽ sản xuất oxy và glucose"
  },
  {
    "con": "Một chất có độ pH dưới 7?",
    "re": "Chất đó được coi là axit"
  },
  {
    "con": "Năng lượng mặt trời chiếu vào bề mặt nước?",
    "re": "Nước sẽ hấp thụ năng lượng và có thể bốc hơi"
  },
  {
    "con": "Một vật thể được thả từ độ cao?",
    "re": "Vật thể sẽ rơi xuống do trọng lực"
  },
  {
    "con": "Một sinh vật sống trong môi trường nước?",
    "re": "Sinh vật đó có thể là cá hoặc động vật thủy sinh khác"
  },
  {
    "con": "Một chất có khả năng dẫn điện tốt?",
    "re": "Chất đó được gọi là dẫn điện"
  },
  {
    "con": "Một phản ứng hóa học xảy ra giữa axit và bazơ?",
    "re": "Phản ứng sẽ tạo ra muối và nước"
  },
  {
    "con": "Một vật thể được làm từ nhiều nguyên tố khác nhau?",
    "re": "Vật thể đó được gọi là hợp chất"
  },
  {
    "con": "Tính chất nào dưới đây không phải của cao su?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước ở trạng thái lỏng có nhiệt độ dưới 0 độ C",
    "re": "Nước sẽ chuyển thành băng"
  },
  {
    "con": "Một vật thể có khối lượng lớn hơn không khí",
    "re": "Vật thể đó sẽ rơi xuống đất"
  },
  {
    "con": "Cây xanh nhận ánh sáng mặt trời",
    "re": "Cây sẽ thực hiện quá trình quang hợp"
  },
  {
    "con": "Một chất có nhiệt độ cao hơn chất khác",
    "re": "Chất đó sẽ truyền nhiệt cho chất kia"
  },
  {
    "con": "Một động vật có vú sống trong nước",
    "re": "Động vật đó sẽ có khả năng bơi lội"
  },
  {
    "con": "Một vật thể được thả từ độ cao",
    "re": "Vật thể đó sẽ rơi xuống do trọng lực"
  },
  {
    "con": "Một chất có thể hòa tan trong nước",
    "re": "Chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Một loài thực vật sống trong môi trường khô cằn",
    "re": "Thực vật đó sẽ có khả năng tích trữ nước"
  },
  {
    "con": "Một động vật có khả năng bay",
    "re": "Động vật đó sẽ có cánh"
  },
  {
    "con": "Một vật thể được làm từ kim loại",
    "re": "Vật thể đó sẽ dẫn điện tốt"
  },
  {
    "con": "Một chất có nhiệt độ sôi thấp hơn 100 độ C",
    "re": "Chất đó sẽ chuyển thành hơi khi đun nóng"
  },
  {
    "con": "Đặc điểm nào sau đây là đặc điểm chung cho cả cao su và chất dẻo?",
    "re": "Câu trả lời đúng"
  }
]