[
  {
    "con": "tế bào là đơn vị cấu trúc và chức năng cơ bản của sự sống",
    "re": "tất cả sinh vật đều được cấu tạo từ tế bào"
  },
  {
    "con": "các sinh vật có khả năng sinh sản",
    "re": "chúng có thể truyền đạt gen cho thế hệ sau"
  },
  {
    "con": "nếu một sinh vật không có khả năng thích nghi với môi trường",
    "re": "nó có thể bị tuyệt chủng"
  },
  {
    "con": "các loài thực vật quang hợp",
    "re": "chúng chuyển đổi ánh sáng mặt trời thành năng lượng hóa học"
  },
  {
    "con": "nếu một loài động vật có bộ gen đa dạng",
    "re": "nó có khả năng thích nghi tốt hơn với thay đổi môi trường"
  },
  {
    "con": "nếu một tế bào bị tổn thương",
    "re": "nó có thể không thực hiện đúng chức năng của mình"
  },
  {
    "con": "các chuỗi thức ăn trong hệ sinh thái",
    "re": "chúng thể hiện mối quan hệ giữa các sinh vật và nguồn năng lượng"
  },
  {
    "con": "nếu một sinh vật sống trong môi trường nước",
    "re": "nó có thể có các đặc điểm thích nghi như mang hoặc vây"
  },
  {
    "con": "nếu một loài động vật có tính xã hội cao",
    "re": "nó có thể phát triển các hành vi hợp tác để sinh tồn"
  },
  {
    "con": "các vi sinh vật có vai trò quan trọng trong tự nhiên",
    "re": "chúng giúp phân hủy chất hữu cơ và tái chế dinh dưỡng"
  },
  {
    "con": "nếu một sinh vật có khả năng tự sản xuất thức ăn",
    "re": "nó được gọi là sinh vật tự dưỡng"
  },
  {
    "con": "Chương III của Luật Bảo vệ môi trường có nội dung nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào là đơn vị cơ bản của sự sống",
    "re": "Tất cả sinh vật đều được cấu tạo từ tế bào"
  },
  {
    "con": "Quá trình quang hợp diễn ra trong lá cây",
    "re": "Cây xanh sản xuất oxy và glucose"
  },
  {
    "con": "Gen là đơn vị di truyền",
    "re": "Gen quyết định các đặc điểm di truyền của sinh vật"
  },
  {
    "con": "Sự tiến hóa xảy ra qua quá trình chọn lọc tự nhiên",
    "re": "Các loài thích nghi tốt hơn sẽ tồn tại và phát triển"
  },
  {
    "con": "Nước là thành phần chính của tế bào",
    "re": "Nước đóng vai trò quan trọng trong các phản ứng sinh hóa"
  },
  {
    "con": "Hệ sinh thái bao gồm các sinh vật và môi trường sống của chúng",
    "re": "Sự tương tác giữa các sinh vật và môi trường tạo ra sự cân bằng"
  },
  {
    "con": "Protein được tổng hợp từ axit amin",
    "re": "Protein thực hiện nhiều chức năng quan trọng trong cơ thể"
  },
  {
    "con": "Vi khuẩn có thể sống trong nhiều môi trường khác nhau",
    "re": "Vi khuẩn đóng vai trò quan trọng trong chu trình dinh dưỡng"
  },
  {
    "con": "Sự phân chia tế bào là cần thiết cho sự phát triển",
    "re": "Phân chia tế bào giúp tái tạo và sửa chữa mô"
  },
  {
    "con": "Sự đa dạng sinh học là cần thiết cho sự bền vững của hệ sinh thái",
    "re": "Đa dạng sinh học giúp hệ sinh thái chống lại các thay đổi môi trường"
  },
  {
    "con": "Giao phối gần có thể dẫn đến hệ quả nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có ADN chứa gen lặn, thì sinh vật đó sẽ biểu hiện đặc điểm nào?",
    "re": "Đặc điểm lặn chỉ biểu hiện khi không có gen trội"
  },
  {
    "con": "Nếu môi trường sống thay đổi, thì các loài sinh vật sẽ làm gì?",
    "re": "Các loài sinh vật có thể thích nghi hoặc di cư"
  },
  {
    "con": "Nếu một tế bào nhân thực bị tổn thương, thì tế bào đó sẽ gặp phải vấn đề gì?",
    "re": "Tế bào có thể không thực hiện được chức năng bình thường"
  },
  {
    "con": "Nếu một loài động vật có cấu trúc cơ thể thích nghi với việc sống dưới nước, thì loài đó sẽ có đặc điểm gì?",
    "re": "Chúng sẽ có vây và mang để hô hấp"
  },
  {
    "con": "Nếu một loài thực vật không nhận đủ ánh sáng mặt trời, thì điều gì sẽ xảy ra?",
    "re": "Thực vật sẽ không thể thực hiện quá trình quang hợp hiệu quả"
  },
  {
    "con": "Nếu một sinh vật bị nhiễm virus, thì hệ miễn dịch sẽ phản ứng như thế nào?",
    "re": "Hệ miễn dịch sẽ sản xuất kháng thể để chống lại virus"
  },
  {
    "con": "Nếu một loài động vật có chế độ ăn uống không cân bằng, thì điều gì có thể xảy ra?",
    "re": "Động vật có thể bị thiếu hụt dinh dưỡng và sức khỏe suy giảm"
  },
  {
    "con": "Nếu một loài sinh vật bị tuyệt chủng, thì điều gì sẽ xảy ra với hệ sinh thái?",
    "re": "Hệ sinh thái có thể bị mất cân bằng và ảnh hưởng đến các loài khác"
  },
  {
    "con": "Nếu một tế bào phân chia không kiểm soát, thì điều gì có thể xảy ra?",
    "re": "Có thể dẫn đến sự hình thành khối u hoặc ung thư"
  },
  {
    "con": "Phương pháp nào dưới đây không dẫn đến hiện tượng thoái hoá giống?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào không có nhân được gọi là gì?",
    "re": "Tế bào prokaryote"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời thì nó được gọi là gì?",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài động vật có cấu trúc cơ thể tương tự với loài khác thì chúng có thể có nguồn gốc chung.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một tế bào phân chia mà không kiểm soát, nó có thể dẫn đến bệnh gì?",
    "re": "Ung thư"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, nó có thể có đặc điểm gì để thích nghi?",
    "re": "Có mang hoặc vây"
  },
  {
    "con": "Nếu một loài thực vật không có khả năng quang hợp, nó sẽ lấy năng lượng từ đâu?",
    "re": "Từ các sinh vật khác hoặc chất hữu cơ"
  },
  {
    "con": "Nếu một loài động vật có bộ gen khác biệt với loài khác, chúng sẽ không thể sinh sản với nhau.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống sót trong điều kiện khắc nghiệt, nó được gọi là gì?",
    "re": "Sinh vật cực đoan"
  },
  {
    "con": "Nếu một loài thực vật có hoa, nó thuộc nhóm nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Quá trình quang hợp diễn ra trong bộ phận nào của cây?",
    "re": "Lá cây"
  },
  {
    "con": "Nếu tế bào không có nhân thì nó thuộc loại tế bào nào?",
    "re": "Tế bào prokaryote"
  },
  {
    "con": "Nếu một loài động vật có khả năng sinh sản tốt trong môi trường sống của nó, thì nó có khả năng tồn tại lâu dài hơn.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật có ADN khác biệt với sinh vật khác, thì chúng có thể thuộc về các loài khác nhau.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó thuộc nhóm thực vật nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn, thì nó được gọi là gì?",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài động vật có vú, thì nó có đặc điểm gì nổi bật?",
    "re": "Có tuyến sữa"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, thì nó có thể có cấu trúc cơ thể nào đặc biệt?",
    "re": "Vây hoặc mang"
  },
  {
    "con": "Nếu một loài động vật có khả năng bay, thì nó thường có đặc điểm gì?",
    "re": "Cánh"
  },
  {
    "con": "Nếu một sinh vật có khả năng thích nghi tốt với môi trường, thì nó có thể sống sót và phát triển.",
    "re": "Đúng"
  },
  {
    "con": "Quá trình quang hợp diễn ra ở đâu trong tế bào thực vật?",
    "re": "Chloroplast"
  },
  {
    "con": "Nếu một sinh vật có ADN, thì nó thuộc về nhóm nào?",
    "re": "Sinh vật sống"
  },
  {
    "con": "Nếu một tế bào có nhân, thì nó được gọi là gì?",
    "re": "Tế bào nhân thực"
  },
  {
    "con": "Nếu một loài động vật có xương sống, thì nó thuộc về nhóm nào?",
    "re": "Động vật có xương sống"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn, thì nó được gọi là gì?",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó thuộc về nhóm nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một tế bào phân chia bằng cách nguyên phân, thì nó tạo ra bao nhiêu tế bào con?",
    "re": "Hai tế bào con"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, thì nó có thể có đặc điểm gì?",
    "re": "Có thể có mang hoặc vây"
  },
  {
    "con": "Nếu một loài động vật có lông, thì nó thuộc về nhóm nào?",
    "re": "Động vật có vú"
  },
  {
    "con": "Nếu một sinh vật có khả năng thích nghi với môi trường, thì nó có thể tồn tại lâu dài hơn?",
    "re": "Đúng"
  },
  {
    "con": "Trong thực tế chọn giống, người ta thường áp dụng mấy phương pháp chọn lọc cơ bản?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có ADN khác biệt với sinh vật khác,",
    "re": "thì chúng có thể có các đặc điểm di truyền khác nhau."
  },
  {
    "con": "Nếu thực vật không nhận đủ ánh sáng mặt trời,",
    "re": "thì quá trình quang hợp sẽ bị ảnh hưởng và cây có thể không phát triển tốt."
  },
  {
    "con": "Nếu một loài động vật sống trong môi trường nước,",
    "re": "thì chúng thường có các đặc điểm thích nghi như vây và mang."
  },
  {
    "con": "Nếu một tế bào bị tổn thương,",
    "re": "thì nó có thể không thực hiện được chức năng bình thường."
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản nhanh,",
    "re": "thì nó có thể tăng cường khả năng sống sót của loài trong môi trường thay đổi."
  },
  {
    "con": "Nếu một loài động vật có màu sắc nổi bật,",
    "re": "thì nó có thể sử dụng màu sắc đó để cảnh báo kẻ thù về độc tính."
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường khô hạn,",
    "re": "thì nó có thể phát triển các cơ chế tiết kiệm nước."
  },
  {
    "con": "Nếu một loài thực vật có hoa,",
    "re": "thì nó có thể thu hút côn trùng thụ phấn để sinh sản."
  },
  {
    "con": "Nếu một sinh vật có hệ miễn dịch mạnh,",
    "re": "thì nó có khả năng chống lại bệnh tật tốt hơn."
  },
  {
    "con": "Thao tác nào dưới đây có trong kĩ thuật chọn lọc cá thể?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sinh vật có DNA chứa thông tin di truyền của nó?",
    "re": "Sinh vật đó có thể truyền thông tin di truyền cho thế hệ sau"
  },
  {
    "con": "Một tế bào thực vật có thành tế bào?",
    "re": "Tế bào đó có khả năng duy trì hình dạng và bảo vệ nội dung bên trong"
  },
  {
    "con": "Một loài động vật có khả năng thích nghi với môi trường sống của nó?",
    "re": "Loài đó có khả năng sống sót và phát triển tốt hơn trong môi trường đó"
  },
  {
    "con": "Một quá trình quang hợp xảy ra trong lá cây?",
    "re": "Cây sẽ sản xuất ra glucose và oxy"
  },
  {
    "con": "Một sinh vật có hệ tuần hoàn mở?",
    "re": "Sinh vật đó có thể có hiệu suất vận chuyển chất dinh dưỡng thấp hơn so với hệ tuần hoàn kín"
  },
  {
    "con": "Một loài vi khuẩn có khả năng phân hủy chất hữu cơ?",
    "re": "Vi khuẩn đó đóng vai trò quan trọng trong chu trình tái chế chất dinh dưỡng trong môi trường"
  },
  {
    "con": "Một tế bào động vật có nhân?",
    "re": "Tế bào đó thuộc loại tế bào eukaryote"
  },
  {
    "con": "Một loài thực vật có hoa?",
    "re": "Loài đó có khả năng sinh sản hữu tính thông qua việc tạo ra hạt"
  },
  {
    "con": "Một sinh vật có khả năng tự sản xuất thức ăn?",
    "re": "Sinh vật đó được gọi là sinh vật tự dưỡng"
  },
  {
    "con": "Quá trình quang hợp diễn ra ở đâu trong tế bào thực vật?",
    "re": "Chloroplast"
  },
  {
    "con": "Nếu một sinh vật có bộ gen đồng hợp tử cho một đặc điểm, thì đặc điểm đó sẽ biểu hiện như thế nào?",
    "re": "Đặc điểm đó sẽ biểu hiện ở thế hệ con cháu"
  },
  {
    "con": "Khi nhiệt độ môi trường tăng cao, thì ảnh hưởng đến quá trình hô hấp của sinh vật như thế nào?",
    "re": "Quá trình hô hấp sẽ tăng tốc"
  },
  {
    "con": "Nếu một loài động vật có khả năng thích nghi tốt với môi trường, thì khả năng sống sót của chúng sẽ ra sao?",
    "re": "Khả năng sống sót sẽ cao hơn"
  },
  {
    "con": "Nếu một tế bào bị tổn thương DNA, thì điều gì có thể xảy ra?",
    "re": "Có thể dẫn đến sự phát triển của tế bào ung thư"
  },
  {
    "con": "Nếu một sinh vật không có khả năng tự tổng hợp thức ăn, thì nó sẽ thuộc loại nào?",
    "re": "Sinh vật dị dưỡng"
  },
  {
    "con": "Nếu một loài thực vật có hoa màu đỏ, thì điều gì có thể xảy ra với sự thu hút côn trùng thụ phấn?",
    "re": "Côn trùng sẽ bị thu hút nhiều hơn"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước ngọt, thì nó sẽ có đặc điểm gì để thích nghi?",
    "re": "Có thể có hệ thống bài tiết để điều chỉnh nồng độ muối"
  },
  {
    "con": "Nếu một loài động vật có bộ lông dày, thì điều này cho thấy điều gì về môi trường sống của chúng?",
    "re": "Chúng sống trong môi trường lạnh"
  },
  {
    "con": "Nếu một tế bào thực vật không nhận đủ nước, thì điều gì sẽ xảy ra với nó?",
    "re": "Tế bào sẽ bị co lại và có thể chết"
  },
  {
    "con": "Giống cà chua hồng lan được tạo ra nhờ phương pháp nào dưới đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào thực vật có thành tế bào, còn tế bào động vật thì không?",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời thì đó là sinh vật gì?",
    "re": "Sinh vật quang hợp"
  },
  {
    "con": "Nếu DNA bị tổn thương và không được sửa chữa, thì điều gì có thể xảy ra?",
    "re": "Có thể dẫn đến đột biến gen"
  },
  {
    "con": "Nếu một loài động vật sống trong môi trường nước, thì nó có thể có đặc điểm gì?",
    "re": "Có thể có vây và mang"
  },
  {
    "con": "Nếu một sinh vật có hệ tuần hoàn mở, thì nó thuộc nhóm động vật nào?",
    "re": "Động vật không xương sống"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó thuộc nhóm nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có khả năng thích nghi với môi trường khắc nghiệt, thì nó có thể sống ở đâu?",
    "re": "Trong các điều kiện khắc nghiệt như sa mạc hoặc vùng cực"
  },
  {
    "con": "Nếu một tế bào phân chia bằng cách nguyên phân, thì nó tạo ra bao nhiêu tế bào con?",
    "re": "Hai tế bào con giống hệt nhau"
  },
  {
    "con": "Nếu một loài động vật có tính chất di truyền từ cha mẹ, thì điều này được gọi là gì?",
    "re": "Di truyền"
  },
  {
    "con": "Quá trình quang hợp diễn ra ở đâu trong tế bào thực vật?",
    "re": "Chloroplast"
  },
  {
    "con": "Nếu một sinh vật có bộ gen đồng hợp tử cho một đặc điểm, thì nó sẽ biểu hiện đặc điểm đó như thế nào?",
    "re": "Đặc điểm đó sẽ được biểu hiện đồng nhất"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường có ít ánh sáng, thì nó sẽ thích nghi như thế nào?",
    "re": "Nó có thể phát triển lá lớn hơn để thu nhận nhiều ánh sáng hơn"
  },
  {
    "con": "Nếu một loài động vật có cấu trúc cơ thể thích nghi với việc bơi lội, thì nó sẽ có đặc điểm gì?",
    "re": "Chân hoặc vây có hình dạng phù hợp để di chuyển trong nước"
  },
  {
    "con": "Nếu một tế bào bị tổn thương, thì nó có thể phản ứng như thế nào?",
    "re": "Tế bào có thể kích hoạt quá trình tự phục hồi hoặc chết đi"
  },
  {
    "con": "Nếu một loài thực vật có hoa màu sắc rực rỡ, thì nó có thể thu hút điều gì?",
    "re": "Côn trùng thụ phấn"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản nhanh chóng, thì nó có thể ảnh hưởng đến môi trường như thế nào?",
    "re": "Nó có thể gây ra sự cạnh tranh với các loài khác"
  },
  {
    "con": "Nếu một loài động vật có khả năng sống sót trong điều kiện khắc nghiệt, thì nó có thể có đặc điểm gì?",
    "re": "Cấu trúc cơ thể hoặc hành vi thích nghi đặc biệt"
  },
  {
    "con": "Nếu một sinh vật có hệ miễn dịch mạnh mẽ, thì nó sẽ có khả năng như thế nào?",
    "re": "Nó sẽ có khả năng chống lại bệnh tật tốt hơn"
  },
  {
    "con": "Nếu một loài thực vật không nhận đủ nước, thì nó sẽ phản ứng như thế nào?",
    "re": "Nó có thể héo và giảm tốc độ sinh trưởng"
  },
  {
    "con": "Sinh vật nào dưới đây sống trong môi trường nước?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có tế bào nhân thực, thì nó thuộc về nhóm nào?",
    "re": "Nó thuộc về nhóm sinh vật nhân thực"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó thuộc về nhóm nào?",
    "re": "Nó thuộc về nhóm thực vật có hoa"
  },
  {
    "con": "Nếu một sinh vật có khả năng quang hợp, thì nó có thể sản xuất gì?",
    "re": "Nó có thể sản xuất năng lượng từ ánh sáng mặt trời"
  },
  {
    "con": "Nếu một loài động vật có xương sống, thì nó thuộc về nhóm nào?",
    "re": "Nó thuộc về nhóm động vật có xương sống"
  },
  {
    "con": "Nếu một tế bào có màng tế bào và nhân, thì nó có thể là gì?",
    "re": "Nó có thể là tế bào nhân thực"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản vô tính, thì nó có thể tạo ra con cái như thế nào?",
    "re": "Nó có thể tạo ra con cái mà không cần giao phối"
  },
  {
    "con": "Nếu một loài động vật sống trên cạn, thì nó cần gì để tồn tại?",
    "re": "Nó cần nước và thức ăn"
  },
  {
    "con": "Nếu một sinh vật có lớp vỏ cứng, thì nó có thể là gì?",
    "re": "Nó có thể là động vật giáp xác"
  },
  {
    "con": "Nếu một loài thực vật không có hoa, thì nó thuộc về nhóm nào?",
    "re": "Nó thuộc về nhóm thực vật không có hoa"
  },
  {
    "con": "Nhân tố sinh thái nào dưới đây là nhân tố vô sinh?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tế bào có nhân thì nó thuộc loại tế bào nào?",
    "re": "Tế bào nhân thực"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn thì nó được gọi là gì?",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài động vật sống trong môi trường nước thì nó có thể có đặc điểm gì?",
    "re": "Có vây và mang"
  },
  {
    "con": "Nếu một loài thực vật có hoa thì nó thuộc nhóm nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc cơ thể đối xứng thì nó thuộc loại nào?",
    "re": "Động vật đối xứng"
  },
  {
    "con": "Nếu một tế bào phân chia bằng cách nguyên phân thì nó tạo ra bao nhiêu tế bào con?",
    "re": "Hai tế bào con"
  },
  {
    "con": "Nếu một loài động vật có xương sống thì nó thuộc nhóm nào?",
    "re": "Động vật có xương sống"
  },
  {
    "con": "Nếu một sinh vật có khả năng thích nghi với môi trường sống thì nó có thể tồn tại lâu dài hơn.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài thực vật không có hoa thì nó thuộc nhóm nào?",
    "re": "Thực vật hạt trần"
  },
  {
    "con": "Điểm cực thuận về nhiệt độ của cá rô phi Việt Nam là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là thành phần chính của tế bào sống",
    "re": "Tế bào sẽ không hoạt động bình thường nếu thiếu nước"
  },
  {
    "con": "Nếu thực vật không nhận đủ ánh sáng mặt trời",
    "re": "Chúng sẽ không thể thực hiện quá trình quang hợp hiệu quả"
  },
  {
    "con": "Nếu một loài động vật bị mất môi trường sống",
    "re": "Sự sống còn của loài đó sẽ bị đe dọa"
  },
  {
    "con": "Nếu DNA bị tổn thương",
    "re": "Các tế bào có thể phát triển không bình thường hoặc gây ra bệnh tật"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản",
    "re": "Nó có thể truyền gen cho thế hệ sau"
  },
  {
    "con": "Nếu một loài động vật có đặc điểm thích nghi tốt",
    "re": "Nó có khả năng sống sót và phát triển trong môi trường của mình"
  },
  {
    "con": "Nếu một sinh vật không có đủ dinh dưỡng",
    "re": "Sự phát triển và sức khỏe của nó sẽ bị ảnh hưởng"
  },
  {
    "con": "Nếu vi khuẩn có khả năng kháng thuốc",
    "re": "Chúng sẽ sống sót và phát triển ngay cả khi có thuốc kháng sinh"
  },
  {
    "con": "Nếu một loài thực vật bị tấn công bởi sâu bệnh",
    "re": "Năng suất và chất lượng của chúng sẽ giảm"
  },
  {
    "con": "Dựa vào sự thích nghi với các điều kiện chiếu sáng khác nhau, em hãy cho biết cây nào dưới đây không cùng nhóm với những cây còn lại?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời,",
    "re": "thì sinh vật đó được gọi là thực vật quang hợp."
  },
  {
    "con": "Nếu một tế bào có nhân và các bào quan,",
    "re": "thì tế bào đó được gọi là tế bào eukaryote."
  },
  {
    "con": "Nếu một loài động vật có khả năng sống trong môi trường nước và trên cạn,",
    "re": "thì loài đó được gọi là động vật lưỡng cư."
  },
  {
    "con": "Nếu một sinh vật có cấu trúc cơ thể phân chia thành các phần khác nhau,",
    "re": "thì sinh vật đó có thể thuộc nhóm động vật có xương sống hoặc không có xương sống."
  },
  {
    "con": "Nếu một loài thực vật có hoa và quả,",
    "re": "thì loài đó được gọi là thực vật hạt kín."
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản vô tính,",
    "re": "thì sinh vật đó có thể tạo ra con cái mà không cần sự tham gia của bạn tình."
  },
  {
    "con": "Nếu một loài vi khuẩn có khả năng sống trong môi trường cực kỳ khắc nghiệt,",
    "re": "thì loài đó được gọi là vi khuẩn cực đoan."
  },
  {
    "con": "Nếu một sinh vật có hệ thống tuần hoàn mở,",
    "re": "thì sinh vật đó thường là động vật không xương sống như động vật giáp xác."
  },
  {
    "con": "Nếu một loài động vật có bộ xương bên ngoài,",
    "re": "thì loài đó được gọi là động vật có vỏ."
  },
  {
    "con": "Đối với thực vật, ánh sáng ảnh hưởng đến hoạt động sinh lý nào dưới đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tế bào không có nhân, thì chúng thuộc loại nào?",
    "re": "Chúng thuộc loại tế bào prokaryote."
  },
  {
    "con": "Nếu một sinh vật có khả năng tự tổng hợp chất dinh dưỡng từ ánh sáng mặt trời, thì nó được gọi là gì?",
    "re": "Nó được gọi là sinh vật quang hợp."
  },
  {
    "con": "Nếu một loài động vật có xương sống, thì nó thuộc nhóm nào?",
    "re": "Nó thuộc nhóm động vật có xương sống."
  },
  {
    "con": "Nếu một tế bào phân chia thành hai tế bào con giống hệt nhau, thì quá trình này gọi là gì?",
    "re": "Quá trình này gọi là phân bào nguyên phân."
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, thì nó có thể có đặc điểm gì?",
    "re": "Nó có thể có vây hoặc mang để hô hấp."
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó thuộc nhóm nào?",
    "re": "Nó thuộc nhóm thực vật hạt kín."
  },
  {
    "con": "Nếu một sinh vật có khả năng thích nghi với môi trường sống của nó, thì nó có thể tồn tại lâu dài hơn.",
    "re": "Điều này giúp nó sống sót và phát triển."
  },
  {
    "con": "Nếu một loài động vật có lông, thì nó thuộc nhóm nào?",
    "re": "Nó thuộc nhóm động vật có vú."
  },
  {
    "con": "Nếu một tế bào nhận được tín hiệu từ môi trường bên ngoài, thì nó có thể phản ứng như thế nào?",
    "re": "Nó có thể thay đổi hoạt động sinh lý của mình."
  },
  {
    "con": "Động vật nào dưới đây thường hoạt động vào ban ngày?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời, thì nó được gọi là gì?",
    "re": "Sinh vật quang hợp"
  },
  {
    "con": "Nếu một tế bào có nhân và các bào quan, thì nó thuộc loại tế bào nào?",
    "re": "Tế bào eukaryote"
  },
  {
    "con": "Nếu một loài động vật có xương sống, thì nó thuộc nhóm nào?",
    "re": "Động vật có xương sống"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong môi trường khắc nghiệt, thì nó được gọi là gì?",
    "re": "Sinh vật cực đoan"
  },
  {
    "con": "Nếu một loài thực vật không có hoa và hạt, thì nó thuộc nhóm nào?",
    "re": "Thực vật bậc thấp"
  },
  {
    "con": "Nếu một sinh vật có khả năng di chuyển và tiêu thụ thức ăn từ môi trường, thì nó thuộc nhóm nào?",
    "re": "Động vật"
  },
  {
    "con": "Nếu một tế bào phân chia thành hai tế bào con giống hệt nhau, thì quá trình này được gọi là gì?",
    "re": "Phân bào nguyên phân"
  },
  {
    "con": "Nếu một loài động vật có khả năng thích nghi với môi trường sống của nó, thì nó có thể tồn tại lâu dài hơn, đúng hay sai?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc cơ thể phức tạp hơn, thì nó có thể thuộc nhóm nào?",
    "re": "Động vật bậc cao"
  },
  {
    "con": "Đặc điểm nào dưới đây không có ở những cây ưa sáng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự tổng hợp chất dinh dưỡng từ ánh sáng mặt trời,",
    "re": "thì nó được gọi là sinh vật quang hợp."
  },
  {
    "con": "Nếu một tế bào có nhân và các bào quan,",
    "re": "thì nó được phân loại là tế bào eukaryote."
  },
  {
    "con": "Nếu một loài động vật có xương sống,",
    "re": "thì nó thuộc vào nhóm động vật có xương."
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước,",
    "re": "thì nó có thể là sinh vật thủy sinh."
  },
  {
    "con": "Nếu một loài thực vật có hoa và quả,",
    "re": "thì nó được gọi là thực vật hạt kín."
  },
  {
    "con": "Nếu một sinh vật có khả năng di chuyển và tìm kiếm thức ăn,",
    "re": "thì nó được coi là động vật."
  },
  {
    "con": "Nếu một tế bào phân chia bằng cách nguyên phân,",
    "re": "thì nó tạo ra hai tế bào con giống hệt nhau."
  },
  {
    "con": "Nếu một loài động vật có khả năng thích nghi với môi trường sống của nó,",
    "re": "thì nó có khả năng sống sót và phát triển tốt hơn."
  },
  {
    "con": "Nếu một sinh vật có cấu trúc tế bào đơn giản hơn,",
    "re": "thì nó được gọi là sinh vật prokaryote."
  },
  {
    "con": "Ở vùng ôn đới, vào mùa đông, chồi cây thường có các vảy mỏng bao bọc; thân và rễ thường có các lớp bần dày. Hiện tượng trên cho thấy rõ nhất ảnh hưởng của nhân tố nào đối với đời sống thực vật?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một sinh vật sống trong môi trường có nhiệt độ cao, nó sẽ phát triển các cơ chế để giảm nhiệt độ cơ thể.",
    "re": "Sinh vật đó có khả năng thích nghi với môi trường nóng"
  },
  {
    "con": "Nếu một loài động vật có khả năng di chuyển nhanh hơn các loài khác trong cùng môi trường, thì nó có khả năng sống sót cao hơn.",
    "re": "Động vật đó có lợi thế trong việc tìm kiếm thức ăn và tránh kẻ thù"
  },
  {
    "con": "Khi cây nhận đủ ánh sáng mặt trời, nước và chất dinh dưỡng, thì nó sẽ phát triển mạnh mẽ và ra hoa nhiều.",
    "re": "Cây đó có khả năng sinh sản tốt hơn"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc cơ thể phù hợp với môi trường sống của nó, thì nó sẽ có khả năng tồn tại lâu dài hơn.",
    "re": "Sinh vật đó có khả năng thích nghi tốt"
  },
  {
    "con": "Khi một loài vi khuẩn phát triển kháng thuốc, thì thuốc đó sẽ trở nên kém hiệu quả trong việc điều trị bệnh.",
    "re": "Sự kháng thuốc làm tăng nguy cơ bệnh tật"
  },
  {
    "con": "Nếu một loài thực vật có khả năng quang hợp tốt, thì nó sẽ sản xuất nhiều oxy hơn.",
    "re": "Thực vật đó góp phần cải thiện chất lượng không khí"
  },
  {
    "con": "Khi một sinh vật bị tấn công bởi kẻ thù, nó có thể phát triển các cơ chế phòng vệ như mùi hôi hoặc màu sắc cảnh báo.",
    "re": "Sinh vật đó có khả năng bảo vệ bản thân tốt hơn"
  },
  {
    "con": "Nếu một hệ sinh thái bị mất đi một loài chủ chốt, thì sự cân bằng của hệ sinh thái đó sẽ bị ảnh hưởng nghiêm trọng.",
    "re": "Hệ sinh thái có thể bị suy thoái"
  },
  {
    "con": "Khi một loài động vật di cư đến một vùng đất mới, thì nó có thể tạo ra sự cạnh tranh với các loài bản địa.",
    "re": "Điều này có thể dẫn đến sự thay đổi trong cấu trúc quần thể"
  },
  {
    "con": "Loài động vật nào dưới đây sống ở vùng cực?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tế bào có nhân, thì nó thuộc loại tế bào nào?",
    "re": "Tế bào eukaryote"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó thuộc nhóm nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn, thì nó được gọi là gì?",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài động vật có xương sống, thì nó thuộc nhóm nào?",
    "re": "Động vật có xương sống"
  },
  {
    "con": "Nếu một tế bào không có nhân, thì nó thuộc loại tế bào nào?",
    "re": "Tế bào prokaryote"
  },
  {
    "con": "Nếu một loài động vật có lông và sinh sản bằng cách đẻ con, thì nó thuộc nhóm nào?",
    "re": "Động vật có vú"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, thì nó có thể là gì?",
    "re": "Sinh vật thủy sinh"
  },
  {
    "con": "Nếu một loài thực vật có lá hình kim, thì nó có thể thuộc nhóm nào?",
    "re": "Thực vật hạt trần"
  },
  {
    "con": "Nếu một sinh vật có khả năng di chuyển và tiêu thụ thức ăn từ môi trường, thì nó được gọi là gì?",
    "re": "Sinh vật dị dưỡng"
  },
  {
    "con": "So với những đại diện cùng loài sống ở vùng nhiệt đới thì những loài thú sống ở vùng ôn đới có gì khác biệt?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có tế bào nhân thực thì nó sẽ có cấu trúc tế bào phức tạp hơn so với tế bào nhân sơ.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu thực vật quang hợp, thì chúng sẽ chuyển đổi ánh sáng mặt trời thành năng lượng hóa học.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một loài động vật có khả năng thích nghi tốt với môi trường, thì nó sẽ có khả năng sống sót cao hơn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu DNA bị đột biến, thì điều này có thể dẫn đến sự thay đổi trong đặc điểm di truyền của sinh vật.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật là động vật ăn thịt, thì nó sẽ tiêu thụ các sinh vật khác để lấy năng lượng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu môi trường sống của một loài bị thay đổi, thì sự đa dạng sinh học trong khu vực đó có thể bị ảnh hưởng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một loài thực vật không nhận đủ nước, thì nó có thể bị héo và chết.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có hệ miễn dịch mạnh, thì nó sẽ có khả năng chống lại bệnh tật tốt hơn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một loài động vật di cư theo mùa, thì nó sẽ tìm kiếm nguồn thức ăn và môi trường sống tốt hơn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sinh vật nào dưới đây là sinh vật biến nhiệt?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tế bào có nhân thì đó là tế bào eukaryote.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn thì đó là sinh vật tự dưỡng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một loài động vật có xương sống thì nó thuộc nhóm động vật có xương.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản thì nó có thể truyền gen cho thế hệ sau.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu môi trường sống thay đổi thì sinh vật có thể thích nghi hoặc bị tuyệt chủng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một loài thực vật có hoa thì nó thuộc nhóm thực vật hạt kín.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng di chuyển thì nó có thể tìm kiếm thức ăn và nơi ở.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tế bào có nhiều ti thể thì nó có khả năng sản xuất năng lượng cao.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có lớp vỏ cứng thì nó có thể bảo vệ bản thân khỏi kẻ thù.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Quá trình quang hợp diễn ra trong lá cây",
    "re": "Cây sản xuất oxy và glucose"
  },
  {
    "con": "Động vật có xương sống có hệ tuần hoàn kín",
    "re": "Máu được lưu thông liên tục trong cơ thể"
  },
  {
    "con": "Vi khuẩn có thể sống trong môi trường khắc nghiệt",
    "re": "Chúng có khả năng thích nghi cao"
  },
  {
    "con": "Sự di truyền xảy ra qua các gen",
    "re": "Tính trạng được truyền từ thế hệ này sang thế hệ khác"
  },
  {
    "con": "Hệ sinh thái bao gồm các sinh vật và môi trường sống của chúng",
    "re": "Tất cả các yếu tố tương tác với nhau"
  },
  {
    "con": "Sự phân hủy là quá trình chuyển hóa chất hữu cơ thành chất vô cơ",
    "re": "Giúp tái tạo dinh dưỡng cho đất"
  },
  {
    "con": "Cấu trúc tế bào thực vật có thành tế bào",
    "re": "Giúp bảo vệ và duy trì hình dạng tế bào"
  },
  {
    "con": "Động vật ăn cỏ là sinh vật tiêu thụ cấp 1",
    "re": "Chúng là nguồn thức ăn cho động vật ăn thịt"
  },
  {
    "con": "Nước là dung môi quan trọng trong các phản ứng sinh hóa",
    "re": "Giúp hòa tan và vận chuyển các chất dinh dưỡng"
  },
  {
    "con": "Sự tiến hóa xảy ra qua quá trình chọn lọc tự nhiên",
    "re": "Các cá thể thích nghi tốt hơn sẽ sống sót và sinh sản"
  },
  {
    "con": "Ví dụ nào dưới đây minh hoạ cho mối quan hệ cạnh tranh?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sinh vật có khả năng quang hợp?",
    "re": "Sẽ sản xuất oxy và glucose từ ánh sáng mặt trời"
  },
  {
    "con": "Một tế bào nhân thực có nhân tế bào?",
    "re": "Sẽ chứa DNA được bảo vệ trong nhân"
  },
  {
    "con": "Một loài động vật sống trong môi trường nước?",
    "re": "Sẽ có các đặc điểm thích nghi như vây và mang"
  },
  {
    "con": "Một loài thực vật có hoa?",
    "re": "Sẽ có khả năng sinh sản thông qua hạt"
  },
  {
    "con": "Một chuỗi thức ăn bắt đầu từ thực vật?",
    "re": "Sẽ cung cấp năng lượng cho các sinh vật ăn cỏ và sau đó là động vật ăn thịt"
  },
  {
    "con": "Một tế bào phân chia qua quá trình nguyên phân?",
    "re": "Sẽ tạo ra hai tế bào con giống hệt nhau"
  },
  {
    "con": "Một loài động vật có vú?",
    "re": "Sẽ nuôi con bằng sữa"
  },
  {
    "con": "Một sinh vật có khả năng thích nghi với môi trường sống?",
    "re": "Sẽ có khả năng sống sót và phát triển tốt hơn"
  },
  {
    "con": "Một loài vi khuẩn có thể gây bệnh?",
    "re": "Sẽ có khả năng lây nhiễm và gây ra triệu chứng bệnh"
  },
  {
    "con": "Trong mối quan hệ nào dưới đây chỉ có một loài được lợi?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời?",
    "re": "Đó là thực vật"
  },
  {
    "con": "Khi một loài động vật bị mất môi trường sống của nó?",
    "re": "Nó có thể bị đe dọa hoặc tuyệt chủng"
  },
  {
    "con": "Nếu một tế bào không có nhân?",
    "re": "Nó được gọi là tế bào prokaryote"
  },
  {
    "con": "Khi một loài sinh vật có khả năng thích nghi với môi trường sống của nó?",
    "re": "Nó có thể tồn tại và phát triển tốt hơn"
  },
  {
    "con": "Nếu một loài động vật ăn thực vật?",
    "re": "Nó được gọi là động vật ăn cỏ"
  },
  {
    "con": "Khi một sinh vật có cấu trúc tế bào phức tạp hơn?",
    "re": "Nó được gọi là tế bào eukaryote"
  },
  {
    "con": "Nếu một loài sinh vật có khả năng sinh sản nhanh chóng?",
    "re": "Nó có thể gia tăng dân số nhanh chóng"
  },
  {
    "con": "Khi một loài sinh vật có mối quan hệ tương hỗ với loài khác?",
    "re": "Cả hai loài đều có lợi"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong môi trường khắc nghiệt?",
    "re": "Nó được gọi là sinh vật cực đoan"
  },
  {
    "con": "Tập hợp nào dưới đây là một quần thể?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sinh vật có tế bào nhân thực?",
    "re": "Nó có cấu trúc phức tạp hơn tế bào nhân sơ"
  },
  {
    "con": "Năng lượng trong chuỗi thức ăn được truyền từ sinh vật này sang sinh vật khác?",
    "re": "Mỗi cấp độ sẽ giảm đi khoảng 90% năng lượng"
  },
  {
    "con": "Một loài có thể sinh sản và tạo ra con cái có khả năng sinh sản?",
    "re": "Đó là một loài sinh học"
  },
  {
    "con": "Sự phân chia tế bào xảy ra trong quá trình sinh sản vô tính?",
    "re": "Tế bào mẹ tạo ra hai tế bào con giống hệt nhau"
  },
  {
    "con": "Môi trường sống của một loài ảnh hưởng đến sự phát triển của nó?",
    "re": "Nó có thể dẫn đến sự thích nghi và tiến hóa"
  },
  {
    "con": "Sự trao đổi chất trong cơ thể sinh vật?",
    "re": "Là quá trình chuyển đổi thức ăn thành năng lượng"
  },
  {
    "con": "Một loài có thể tồn tại trong nhiều môi trường khác nhau?",
    "re": "Nó có khả năng thích nghi cao"
  },
  {
    "con": "Các gen trong tế bào quyết định đặc điểm của sinh vật?",
    "re": "Chúng được truyền từ thế hệ này sang thế hệ khác"
  },
  {
    "con": "Sự đa dạng sinh học trong một hệ sinh thái?",
    "re": "Giúp duy trì sự cân bằng và ổn định của hệ sinh thái đó"
  },
  {
    "con": "Số lượng cá thể của mỗi quần thể bị chi phối bởi yếu tố nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu thực vật không nhận đủ ánh sáng mặt trời,",
    "re": "thì quá trình quang hợp sẽ bị giảm sút."
  },
  {
    "con": "Nếu một loài động vật bị mất môi trường sống,",
    "re": "thì quần thể của loài đó có thể bị suy giảm hoặc tuyệt chủng."
  },
  {
    "con": "Nếu một tế bào không có nhân,",
    "re": "thì nó không thể điều khiển các hoạt động sống của mình."
  },
  {
    "con": "Nếu một loài có khả năng sinh sản cao,",
    "re": "thì khả năng tồn tại của loài đó trong môi trường sẽ tăng lên."
  },
  {
    "con": "Nếu nhiệt độ môi trường tăng lên,",
    "re": "thì sự phát triển của vi sinh vật có thể gia tăng."
  },
  {
    "con": "Nếu một loài động vật có đặc điểm thích nghi tốt với môi trường,",
    "re": "thì khả năng sống sót và sinh sản của nó sẽ cao hơn."
  },
  {
    "con": "Nếu các chất dinh dưỡng trong đất bị cạn kiệt,",
    "re": "thì sự phát triển của thực vật sẽ bị ảnh hưởng tiêu cực."
  },
  {
    "con": "Nếu một loài động vật ăn thịt có quá nhiều con mồi,",
    "re": "thì số lượng của loài ăn thịt đó có thể tăng lên."
  },
  {
    "con": "Nếu có sự cạnh tranh giữa các loài trong cùng một môi trường,",
    "re": "thì một số loài có thể bị loại bỏ khỏi quần thể."
  },
  {
    "con": "Đặc điểm nào dưới đây chỉ có ở quần thể người?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời,",
    "re": "thì nó là một sinh vật quang hợp."
  },
  {
    "con": "Nếu một tế bào có nhân và các bào quan,",
    "re": "thì nó là tế bào eukaryote."
  },
  {
    "con": "Nếu một loài động vật có xương sống và có khả năng điều chỉnh nhiệt độ cơ thể,",
    "re": "thì nó là động vật hằng nhiệt."
  },
  {
    "con": "Nếu một loài thực vật có hoa và hạt,",
    "re": "thì nó thuộc nhóm thực vật hạt kín."
  },
  {
    "con": "Nếu một sinh vật có cấu trúc cơ thể đối xứng hai bên,",
    "re": "thì nó có thể thuộc về nhóm động vật có xương sống."
  },
  {
    "con": "Nếu một loài vi khuẩn có khả năng sống trong môi trường khắc nghiệt,",
    "re": "thì nó được gọi là vi khuẩn cực đoan."
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản vô tính,",
    "re": "thì nó có thể tạo ra con cái mà không cần bạn tình."
  },
  {
    "con": "Nếu một loài động vật có lông và sinh sản bằng cách đẻ con,",
    "re": "thì nó thuộc nhóm động vật có vú."
  },
  {
    "con": "Nếu một tế bào có màng tế bào và chứa DNA,",
    "re": "thì nó có khả năng sinh sản và phát triển."
  },
  {
    "con": "Nước có tỉ lệ tử vong ở người trẻ tuổi cao, tỉ lệ trẻ em sinh ra hằng năm nhiều thường có dạng tháp tuổi như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu thực vật không nhận đủ ánh sáng mặt trời, chúng sẽ phát triển như thế nào?",
    "re": "Chúng sẽ phát triển chậm hơn và có thể chết"
  },
  {
    "con": "Nếu một sinh vật không có khả năng tự sản xuất năng lượng, nó sẽ lấy năng lượng từ đâu?",
    "re": "Từ các sinh vật khác hoặc môi trường xung quanh"
  },
  {
    "con": "Nếu DNA bị tổn thương, điều gì có thể xảy ra với tế bào?",
    "re": "Tế bào có thể phát triển không bình thường hoặc chết"
  },
  {
    "con": "Nếu một loài động vật sống trong môi trường nước, nó sẽ có những đặc điểm gì để thích nghi?",
    "re": "Có thể có vây, mang hoặc lớp da ẩm"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản nhanh chóng, điều này có thể dẫn đến điều gì trong quần thể?",
    "re": "Quần thể có thể tăng trưởng nhanh chóng và có thể gây ra cạnh tranh cho tài nguyên"
  },
  {
    "con": "Nếu một loài thực vật có hoa, điều này có thể chỉ ra điều gì về phương thức sinh sản của nó?",
    "re": "Nó có thể sinh sản hữu tính thông qua thụ phấn"
  },
  {
    "con": "Nếu một sinh vật có hệ miễn dịch mạnh, nó sẽ có khả năng chống lại bệnh tật như thế nào?",
    "re": "Nó sẽ có khả năng chống lại bệnh tật tốt hơn"
  },
  {
    "con": "Nếu môi trường sống của một loài bị thay đổi, điều gì có thể xảy ra với loài đó?",
    "re": "Loài đó có thể bị đe dọa hoặc tuyệt chủng"
  },
  {
    "con": "Nếu một sinh vật là động vật ăn thịt, nó sẽ có những đặc điểm gì để săn mồi?",
    "re": "Có thể có răng sắc nhọn, móng vuốt và khả năng di chuyển nhanh"
  },
  {
    "con": "Các đặc trưng của quần thể không bao gồm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào không có nhân thì",
    "re": "Đó là tế bào prokaryote"
  },
  {
    "con": "Quá trình quang hợp diễn ra trong điều kiện ánh sáng thì",
    "re": "Cây xanh sản xuất glucose và oxy"
  },
  {
    "con": "DNA có cấu trúc xoắn kép thì",
    "re": "Nó chứa thông tin di truyền"
  },
  {
    "con": "Sự phân chia tế bào diễn ra không đúng cách thì",
    "re": "Có thể dẫn đến sự hình thành khối u"
  },
  {
    "con": "Các loài sinh vật sống trong cùng một môi trường thì",
    "re": "Chúng tạo thành một hệ sinh thái"
  },
  {
    "con": "Sự tiến hóa xảy ra qua chọn lọc tự nhiên thì",
    "re": "Các đặc điểm có lợi sẽ được truyền lại cho thế hệ sau"
  },
  {
    "con": "Nước là dung môi tốt cho các phản ứng sinh hóa thì",
    "re": "Nó giúp hòa tan nhiều chất cần thiết cho sự sống"
  },
  {
    "con": "Các loài động vật có xương sống có đặc điểm chung là",
    "re": "Chúng có hệ thống tuần hoàn kín"
  },
  {
    "con": "Sự tương tác giữa các loài trong một hệ sinh thái không bao gồm",
    "re": "Sự cạnh tranh và hợp tác"
  },
  {
    "con": "Trong quần xã sinh vật, độ nhiều phản ánh điều gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản, thì nó có thể truyền gen cho thế hệ sau.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài thực vật không nhận đủ ánh sáng mặt trời, thì nó sẽ không phát triển tốt.",
    "re": "Đúng"
  },
  {
    "con": "Nếu môi trường sống bị ô nhiễm, thì sức khỏe của các sinh vật trong đó sẽ bị ảnh hưởng.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc tế bào nhân thực, thì nó có thể là thực vật, động vật hoặc nấm.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài động vật có khả năng thích nghi tốt với môi trường, thì nó có khả năng sống sót cao hơn.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật thuộc chuỗi thức ăn, thì nó có thể là sinh vật sản xuất, sinh vật tiêu thụ hoặc sinh vật phân hủy.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một tế bào bị tổn thương, thì nó có thể không thực hiện được chức năng của mình.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài động vật có bộ gen đa dạng, thì nó có khả năng thích nghi tốt hơn với thay đổi môi trường.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, thì nó có thể có các đặc điểm thích nghi như mang hoặc vây.",
    "re": "Đúng"
  },
  {
    "con": "Động vật nào dưới đây không thể đứng sau cầy trong một chuỗi thức ăn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng quang hợp,",
    "re": "thì nó thuộc nhóm thực vật."
  },
  {
    "con": "Nếu một tế bào có nhân,",
    "re": "thì nó được gọi là tế bào nhân thực."
  },
  {
    "con": "Nếu một loài động vật có xương sống,",
    "re": "thì nó thuộc nhóm động vật có xương."
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước,",
    "re": "thì nó có thể là động vật thủy sinh."
  },
  {
    "con": "Nếu một loài thực vật có hoa,",
    "re": "thì nó thuộc nhóm thực vật hạt kín."
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản vô tính,",
    "re": "thì nó có thể tạo ra con cái mà không cần giao phối."
  },
  {
    "con": "Nếu một loài động vật có lông,",
    "re": "thì nó thuộc nhóm động vật có vú."
  },
  {
    "con": "Nếu một tế bào có màng tế bào,",
    "re": "thì nó có thể là tế bào thực vật hoặc tế bào động vật."
  },
  {
    "con": "Nếu một sinh vật có khả năng thích nghi với môi trường,",
    "re": "thì nó có khả năng sống sót và phát triển."
  },
  {
    "con": "Sinh vật nào dưới đây được xếp vào nhóm sinh vật phân huỷ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tế bào có nhân thì nó thuộc loại tế bào nào?",
    "re": "Tế bào nhân thực"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời thì nó thuộc nhóm nào?",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài động vật có xương sống thì nó thuộc nhóm nào?",
    "re": "Động vật có xương"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong môi trường khắc nghiệt thì nó được gọi là gì?",
    "re": "Sinh vật cực đoan"
  },
  {
    "con": "Nếu một loài thực vật có hoa thì nó thuộc nhóm nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một tế bào phân chia bằng cách nguyên phân thì nó tạo ra bao nhiêu tế bào con?",
    "re": "Hai tế bào con"
  },
  {
    "con": "Nếu một sinh vật có khả năng di chuyển và tiêu thụ thức ăn thì nó thuộc nhóm nào?",
    "re": "Động vật"
  },
  {
    "con": "Nếu một loài vi khuẩn có khả năng sống trong môi trường không có oxy thì nó được gọi là gì?",
    "re": "Vi khuẩn kị khí"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc tế bào đơn giản và không có nhân thì nó thuộc loại tế bào nào?",
    "re": "Tế bào prokaryote"
  },
  {
    "con": "Khi nói về hệ sinh thái, điều nào dưới đây là đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi tế bào phân chia, điều gì xảy ra với DNA?",
    "re": "DNA được sao chép để đảm bảo mỗi tế bào con có bộ gen giống nhau"
  },
  {
    "con": "Khi thực vật quang hợp, điều gì xảy ra với ánh sáng mặt trời?",
    "re": "Ánh sáng mặt trời được chuyển hóa thành năng lượng hóa học"
  },
  {
    "con": "Khi động vật tiêu hóa thức ăn, điều gì xảy ra với chất dinh dưỡng?",
    "re": "Chất dinh dưỡng được hấp thụ vào máu để cung cấp năng lượng cho cơ thể"
  },
  {
    "con": "Khi nói về chu trình nước, điều nào dưới đây là đúng?",
    "re": "Nước bay hơi từ mặt đất, ngưng tụ thành mây và rơi xuống dưới dạng mưa"
  },
  {
    "con": "Khi một loài bị tuyệt chủng, điều gì xảy ra với hệ sinh thái?",
    "re": "Hệ sinh thái có thể bị mất cân bằng và ảnh hưởng đến các loài khác"
  },
  {
    "con": "Khi nói về di truyền, điều nào dưới đây là đúng?",
    "re": "Gen di truyền từ cha mẹ sang con cái thông qua các nhiễm sắc thể"
  },
  {
    "con": "Khi một sinh vật sống trong môi trường khắc nghiệt, điều gì xảy ra?",
    "re": "Sinh vật đó có thể phát triển các đặc điểm thích nghi để sống sót"
  },
  {
    "con": "Khi nói về chuỗi thức ăn, điều nào dưới đây là đúng?",
    "re": "Năng lượng được truyền từ sinh vật sản xuất đến sinh vật tiêu thụ"
  },
  {
    "con": "Khi nói về sự tiến hóa, điều gì xảy ra với các loài theo thời gian?",
    "re": "Các loài có thể thay đổi để thích nghi với môi trường sống của chúng"
  },
  {
    "con": "Việc khai thác khoáng sản bừa bãi, thiếu kiểm soát có thể dẫn đến hậu quả nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu thực vật không nhận đủ ánh sáng mặt trời,",
    "re": "chúng sẽ không thể thực hiện quá trình quang hợp hiệu quả."
  },
  {
    "con": "Nếu một loài động vật bị mất môi trường sống do con người,",
    "re": "nó có thể trở thành loài nguy cấp hoặc tuyệt chủng."
  },
  {
    "con": "Nếu tế bào không có màng tế bào,",
    "re": "chúng sẽ không thể duy trì môi trường bên trong ổn định."
  },
  {
    "con": "Nếu một sinh vật không có khả năng sinh sản,",
    "re": "loài đó sẽ không thể tồn tại lâu dài."
  },
  {
    "con": "Nếu có sự thay đổi trong chuỗi thức ăn,",
    "re": "các loài trong hệ sinh thái có thể bị ảnh hưởng nghiêm trọng."
  },
  {
    "con": "Nếu một loại vi khuẩn phát triển kháng thuốc,",
    "re": "nó có thể gây ra các bệnh khó điều trị hơn."
  },
  {
    "con": "Nếu các loài động vật ăn thịt bị giảm số lượng,",
    "re": "số lượng con mồi sẽ tăng lên nhanh chóng."
  },
  {
    "con": "Nếu nước trong môi trường bị ô nhiễm,",
    "re": "các sinh vật sống trong đó sẽ bị ảnh hưởng xấu đến sức khỏe."
  },
  {
    "con": "Nếu một loài thực vật có khả năng thích nghi tốt với môi trường,",
    "re": "nó sẽ có cơ hội sống sót cao hơn trong điều kiện thay đổi."
  },
  {
    "con": "Quá trình quang hợp diễn ra trong lá cây",
    "re": "Cây sản xuất oxy và glucose"
  },
  {
    "con": "Tế bào động vật có nhân và bào quan",
    "re": "Chúng có khả năng thực hiện các chức năng sống"
  },
  {
    "con": "Sự di truyền thông qua gen từ cha mẹ sang con cái",
    "re": "Đặc điểm di truyền được truyền lại qua các thế hệ"
  },
  {
    "con": "Nước là thành phần chính của tế bào",
    "re": "Nước đóng vai trò quan trọng trong các phản ứng sinh hóa"
  },
  {
    "con": "Sự phân hủy chất hữu cơ bởi vi sinh vật",
    "re": "Giúp tái tạo dinh dưỡng cho đất"
  },
  {
    "con": "Sự tương tác giữa các loài trong hệ sinh thái",
    "re": "Tạo ra sự cân bằng sinh thái"
  },
  {
    "con": "Sự phát triển của phôi thai trong cơ thể mẹ",
    "re": "Đảm bảo sự sống sót và phát triển của sinh vật"
  },
  {
    "con": "Sự biến đổi khí hậu ảnh hưởng đến môi trường sống",
    "re": "Có thể dẫn đến sự tuyệt chủng của nhiều loài"
  },
  {
    "con": "Chế độ ăn uống cân bằng cung cấp dinh dưỡng đầy đủ",
    "re": "Giúp cơ thể phát triển và duy trì sức khỏe"
  },
  {
    "con": "Vi khuẩn có thể gây bệnh cho con người",
    "re": "Cần có biện pháp phòng ngừa để bảo vệ sức khỏe"
  },
  {
    "con": "Vật chủ trung gian truyền bệnh sốt rét, sốt xuất huyết, giun chỉ bạch huyết, viêm não Nhật Bản là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Năng lượng trong một hệ sinh thái được truyền từ thực vật đến động vật ăn cỏ và sau đó đến động vật ăn thịt:",
    "re": "Đó là chuỗi thức ăn"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn thông qua quang hợp:",
    "re": "Nó được gọi là thực vật"
  },
  {
    "con": "Nếu một tế bào có nhân và các bào quan được bao bọc bởi màng:",
    "re": "Nó được gọi là tế bào eukaryote"
  },
  {
    "con": "Nếu một loài động vật có khả năng thích nghi với môi trường sống của nó:",
    "re": "Nó có khả năng sinh tồn cao hơn"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc di truyền giống nhau với tổ tiên của nó:",
    "re": "Nó được coi là một loài"
  },
  {
    "con": "Nếu một sinh vật có thể sống trong môi trường khắc nghiệt như sa mạc hoặc đại dương sâu:",
    "re": "Nó được gọi là sinh vật thích nghi"
  },
  {
    "con": "Nếu một loài động vật có thể sinh sản nhanh chóng và có nhiều thế hệ trong thời gian ngắn:",
    "re": "Nó có khả năng phát triển quần thể nhanh chóng"
  },
  {
    "con": "Nếu một sinh vật có thể chuyển hóa năng lượng từ thức ăn thành năng lượng sử dụng:",
    "re": "Nó có khả năng sống và phát triển"
  },
  {
    "con": "Nếu một sinh vật có hệ thống miễn dịch mạnh mẽ:",
    "re": "Nó có khả năng chống lại bệnh tật tốt hơn"
  },
  {
    "con": "Tế bào là đơn vị cơ bản của sự sống",
    "re": "Tất cả sinh vật đều được cấu tạo từ tế bào"
  },
  {
    "con": "Nếu thực vật không có ánh sáng mặt trời",
    "re": "Chúng sẽ không thể thực hiện quá trình quang hợp"
  },
  {
    "con": "Nếu một sinh vật có ADN",
    "re": "Nó có khả năng di truyền thông tin cho thế hệ sau"
  },
  {
    "con": "Nếu môi trường sống của một loài bị thay đổi",
    "re": "Loài đó có thể bị đe dọa hoặc tuyệt chủng"
  },
  {
    "con": "Nếu động vật không có nước",
    "re": "Chúng sẽ không thể sống sót lâu dài"
  },
  {
    "con": "Nếu một loài có khả năng thích nghi tốt",
    "re": "Nó sẽ có cơ hội sống sót cao hơn trong môi trường thay đổi"
  },
  {
    "con": "Nếu con người tiếp xúc với vi khuẩn có hại",
    "re": "Họ có thể mắc bệnh"
  },
  {
    "con": "Nếu một loài thực vật bị thiếu dinh dưỡng",
    "re": "Nó sẽ không phát triển khỏe mạnh"
  },
  {
    "con": "Nếu các loài sinh vật trong một hệ sinh thái mất cân bằng",
    "re": "Hệ sinh thái đó có thể bị suy thoái"
  },
  {
    "con": "Để hạn chế ô nhiễm do thuốc bảo vệ thực vật và hoá chất, chúng ta có thể áp dụng biện pháp nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tài nguyên nào dưới đây là tài nguyên không tái sinh?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sinh vật có tế bào nhân thực thì nó thuộc nhóm nào?",
    "re": "Nó thuộc nhóm động vật hoặc thực vật"
  },
  {
    "con": "Nếu một loài động vật có khả năng sinh sản nhanh chóng, thì nó có thể thích nghi tốt hơn với môi trường thay đổi.",
    "re": "Điều này giúp loài đó tồn tại lâu dài hơn"
  },
  {
    "con": "Nếu một tế bào không có nhân, thì nó được gọi là gì?",
    "re": "Nó được gọi là tế bào prokaryote"
  },
  {
    "con": "Nếu một loài thực vật có khả năng quang hợp, thì nó sản xuất ra gì?",
    "re": "Nó sản xuất ra oxy và glucose"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, thì nó có thể có cấu trúc nào đặc biệt?",
    "re": "Nó có thể có mang hoặc vây"
  },
  {
    "con": "Nếu một loài động vật có bộ xương trong, thì nó thuộc nhóm nào?",
    "re": "Nó thuộc nhóm động vật có xương sống"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn, thì nó được gọi là gì?",
    "re": "Nó được gọi là sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài động vật có màu sắc sặc sỡ, thì điều này có thể giúp nó làm gì?",
    "re": "Nó có thể giúp nó thu hút bạn tình hoặc cảnh báo kẻ thù"
  },
  {
    "con": "Nếu một sinh vật có hệ thống tuần hoàn mở, thì nó có thể có đặc điểm gì?",
    "re": "Nó có thể có máu chảy tự do trong khoang cơ thể"
  },
  {
    "con": "Cơ sở chủ yếu để phân chia tài nguyên thiên nhiên thành 3 dạng: tài nguyên tái sinh, tài nguyên không tái sinh và tài nguyên năng lượng vĩnh cửu là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tế bào không có nhân thì đó là loại tế bào gì?",
    "re": "Tế bào prokaryote"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời thì nó thuộc nhóm nào?",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài động vật có cấu trúc cơ thể đối xứng hai bên thì nó thuộc nhóm nào?",
    "re": "Động vật đối xứng"
  },
  {
    "con": "Nếu một loài thực vật có hoa và hạt thì nó thuộc nhóm nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong môi trường khắc nghiệt như nước muối hoặc nhiệt độ cao thì nó thuộc nhóm nào?",
    "re": "Vi sinh vật cực đoan"
  },
  {
    "con": "Nếu quá trình quang hợp xảy ra trong lá của thực vật thì sản phẩm chính là gì?",
    "re": "Glucose và oxy"
  },
  {
    "con": "Nếu một loài động vật có xương sống thì nó thuộc nhóm nào?",
    "re": "Động vật có xương sống"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản vô tính thì nó có thể làm gì?",
    "re": "Tạo ra con cái mà không cần giao phối"
  },
  {
    "con": "Nếu một loài thực vật có khả năng phát triển trong điều kiện thiếu nước thì nó được gọi là gì?",
    "re": "Thực vật chịu hạn"
  },
  {
    "con": "Biện pháp nào dưới đây giúp cải tạo các hệ sinh thái bị thoái hoá?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào thực vật có thành tế bào, còn tế bào động vật không có thành tế bào?",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản và phát triển, thì nó được coi là một sinh vật sống?",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một loài động vật sống trong môi trường nước, thì nó có thể có các đặc điểm thích nghi như mang hoặc vây?",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu thực vật quang hợp, thì chúng chuyển đổi ánh sáng mặt trời thành năng lượng hóa học?",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu DNA chứa thông tin di truyền, thì nó quyết định các đặc điểm của sinh vật?",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một sinh vật có hệ tuần hoàn mở, thì máu không hoàn toàn nằm trong mạch máu?",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một loài động vật có vú, thì nó có tuyến sữa để nuôi con non?",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường khô hạn, thì nó có thể có các đặc điểm như lá nhỏ hoặc thân mọng nước?",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự vệ, thì nó có thể phát triển các cơ chế như màu sắc cảnh báo hoặc độc tố?",
    "re": "Điều này đúng"
  },
  {
    "con": "Tế bào là đơn vị cơ bản của sự sống?",
    "re": "Đúng, tất cả các sinh vật đều được cấu tạo từ tế bào."
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản, thì nó có thể truyền gen cho thế hệ sau?",
    "re": "Đúng, sinh sản là cách mà gen được truyền từ thế hệ này sang thế hệ khác."
  },
  {
    "con": "Nếu thực vật quang hợp, thì chúng sẽ tạo ra oxy?",
    "re": "Đúng, quang hợp là quá trình mà thực vật sử dụng ánh sáng mặt trời để tạo ra oxy và glucose."
  },
  {
    "con": "Nếu động vật ăn thực vật, thì chúng được gọi là động vật ăn cỏ?",
    "re": "Đúng, động vật ăn cỏ là những động vật chủ yếu tiêu thụ thực vật."
  },
  {
    "con": "Nếu một sinh vật có ADN, thì nó có thể di truyền thông tin di truyền?",
    "re": "Đúng, ADN chứa thông tin di truyền cần thiết cho sự phát triển và chức năng của sinh vật."
  },
  {
    "con": "Nếu môi trường sống thay đổi, thì sinh vật có thể thích nghi để sống sót?",
    "re": "Đúng, khả năng thích nghi là yếu tố quan trọng giúp sinh vật tồn tại trong môi trường thay đổi."
  },
  {
    "con": "Nếu một loài động vật bị tuyệt chủng, thì nó sẽ không còn tồn tại trên Trái Đất?",
    "re": "Đúng, tuyệt chủng có nghĩa là không còn cá thể nào của loài đó tồn tại."
  },
  {
    "con": "Nếu vi khuẩn có thể sinh sản nhanh chóng, thì chúng có thể gây ra dịch bệnh?",
    "re": "Đúng, sự sinh sản nhanh chóng của vi khuẩn có thể dẫn đến sự bùng phát dịch bệnh."
  },
  {
    "con": "Nếu một sinh vật là động vật ăn thịt, thì nó chủ yếu tiêu thụ các sinh vật khác?",
    "re": "Đúng, động vật ăn thịt chủ yếu săn bắt và tiêu thụ động vật khác."
  },
  {
    "con": "Luật Bảo vệ môi trường ở Việt Nam quy định như thế nào về việc săn bắt động vật hoang dã?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các loài giun sán kí sinh sống trong môi trường nào sau đây:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào thực vật có thành tế bào và chứa chất diệp lục:",
    "re": "Tế bào thực vật có khả năng quang hợp"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản và phát triển:",
    "re": "Nó được coi là một sinh vật sống"
  },
  {
    "con": "Nếu một loài động vật có bộ xương bên trong:",
    "re": "Nó thuộc nhóm động vật có xương sống"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn:",
    "re": "Nó được gọi là sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài thực vật không có hoa:",
    "re": "Nó thuộc nhóm thực vật hạt trần hoặc thực vật không có hoa"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước:",
    "re": "Nó có thể là động vật thủy sinh hoặc thực vật thủy sinh"
  },
  {
    "con": "Nếu một loài vi khuẩn có khả năng sống trong điều kiện khắc nghiệt:",
    "re": "Nó được gọi là vi khuẩn cực đoan"
  },
  {
    "con": "Nếu một loài động vật có lông và sinh sản bằng cách đẻ con:",
    "re": "Nó thuộc nhóm động vật có vú"
  },
  {
    "con": "Nếu một sinh vật có khả năng thích nghi với môi trường sống:",
    "re": "Nó có khả năng tồn tại và phát triển trong điều kiện thay đổi"
  },
  {
    "con": "Con người đã sử dụng mối quan hệ nào sau đây giữa sinh vật với sinh vật để trừ sâu hại?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn thông qua quang hợp, thì nó thuộc nhóm nào?",
    "re": "Nó thuộc nhóm thực vật"
  },
  {
    "con": "Nếu một tế bào có nhân và các bào quan, thì nó được phân loại là gì?",
    "re": "Nó được phân loại là tế bào eukaryote"
  },
  {
    "con": "Nếu một loài động vật có xương sống, thì nó thuộc nhóm nào trong phân loại sinh học?",
    "re": "Nó thuộc nhóm động vật có xương sống"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong môi trường khắc nghiệt, thì nó có thể được gọi là gì?",
    "re": "Nó có thể được gọi là sinh vật cực đoan"
  },
  {
    "con": "Nếu một loài thực vật có hoa và hạt, thì nó thuộc nhóm nào?",
    "re": "Nó thuộc nhóm thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có khả năng tiêu thụ thức ăn từ các sinh vật khác, thì nó được gọi là gì?",
    "re": "Nó được gọi là sinh vật ăn thịt hoặc động vật ăn tạp"
  },
  {
    "con": "Nếu một tế bào phân chia để tạo ra hai tế bào con giống hệt nhau, thì quá trình này được gọi là gì?",
    "re": "Quá trình này được gọi là phân bào nguyên phân"
  },
  {
    "con": "Nếu một sinh vật có khả năng thích nghi với môi trường sống của nó, thì nó có thể tồn tại lâu dài hơn trong điều kiện thay đổi?",
    "re": "Đúng, nó có khả năng tồn tại lâu dài hơn"
  },
  {
    "con": "Nếu một loài động vật có bộ lông dày và sống ở vùng lạnh, thì nó có thể có đặc điểm gì?",
    "re": "Nó có thể có khả năng giữ ấm tốt hơn"
  },
  {
    "con": "Hiện tượng tảo sống cùng với nấm tạo thành dạng sống mới là địa y phản ánh mối quan hệ",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các sinh vật sống trong môi trường nước có thể hô hấp qua mang",
    "re": "Chúng có khả năng lấy oxy từ nước"
  },
  {
    "con": "Khi cây xanh quang hợp, nó sử dụng ánh sáng mặt trời để tạo ra thức ăn",
    "re": "Cây sản xuất glucose và oxy"
  },
  {
    "con": "Nếu một loài động vật có khả năng sinh sản nhanh chóng trong môi trường thuận lợi",
    "re": "Số lượng cá thể của loài đó sẽ tăng lên nhanh chóng"
  },
  {
    "con": "Khi một sinh vật bị thay đổi môi trường sống đột ngột",
    "re": "Nó có thể gặp khó khăn trong việc thích nghi"
  },
  {
    "con": "Nếu một loài thực vật có hoa màu sắc sặc sỡ",
    "re": "Nó có thể thu hút nhiều loài thụ phấn"
  },
  {
    "con": "Khi một sinh vật ăn thực vật, nó sẽ nhận được năng lượng từ thực vật đó",
    "re": "Năng lượng này sẽ được chuyển hóa thành năng lượng cho sinh vật ăn thịt"
  },
  {
    "con": "Nếu một loài động vật có bộ lông dày",
    "re": "Nó có thể sống sót tốt hơn trong môi trường lạnh"
  },
  {
    "con": "Khi vi khuẩn phân hủy chất hữu cơ",
    "re": "Chúng giúp tái chế chất dinh dưỡng trong đất"
  },
  {
    "con": "Nếu một loài động vật có khả năng ngụy trang",
    "re": "Nó có thể tránh được kẻ thù và tăng khả năng sống sót"
  },
  {
    "con": "Tế bào được coi là đơn vị cơ bản của sự sống",
    "re": "Tất cả sinh vật đều được cấu tạo từ tế bào"
  },
  {
    "con": "Năng lượng mặt trời được hấp thụ bởi cây xanh",
    "re": "Cây xanh thực hiện quá trình quang hợp để tạo ra thức ăn"
  },
  {
    "con": "Gen di truyền được truyền từ cha mẹ sang con cái",
    "re": "Con cái sẽ có những đặc điểm di truyền từ cha mẹ"
  },
  {
    "con": "Môi trường sống thay đổi",
    "re": "Sinh vật phải thích nghi để tồn tại"
  },
  {
    "con": "Nước là thành phần chính của tế bào",
    "re": "Tế bào cần nước để duy trì các quá trình sinh hóa"
  },
  {
    "con": "Sự phân chia tế bào xảy ra khi tế bào lớn lên",
    "re": "Tế bào sẽ tạo ra hai tế bào con mới"
  },
  {
    "con": "Các loài sinh vật có thể tương tác với nhau",
    "re": "Có thể xảy ra các mối quan hệ sinh thái như cạnh tranh hoặc hợp tác"
  },
  {
    "con": "Sự tiến hóa diễn ra qua hàng triệu năm",
    "re": "Các loài có thể thay đổi để thích nghi với môi trường"
  },
  {
    "con": "Chất dinh dưỡng cần thiết cho sự phát triển",
    "re": "Sinh vật cần chất dinh dưỡng để duy trì sức khỏe và phát triển"
  },
  {
    "con": "Vi khuẩn có thể sống trong nhiều môi trường khác nhau",
    "re": "Chúng có thể tồn tại trong điều kiện khắc nghiệt và đóng vai trò quan trọng trong hệ sinh thái"
  },
  {
    "con": "Nhóm nào dưới đây gồm những mối quan hệ đôi bên cùng có lợi?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Vì sao tập hợp những con cá sống trong một hồ nước tự nhiên lại không được xem là một quần thể?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào thực vật có thành tế bào, trong khi tế bào động vật không có thành tế bào.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản và tạo ra con cái, thì nó được xem là một loài.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài động vật sống trong môi trường nước, thì nó có thể có các đặc điểm thích nghi như mang hoặc vây.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng quang hợp, thì nó thường là thực vật hoặc tảo.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một tế bào không có nhân, thì nó được gọi là tế bào prokaryote.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc cơ thể phân chia thành nhiều phần, thì nó có thể là động vật thuộc nhóm động vật có xương sống.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài động vật có khả năng di cư theo mùa, thì nó có thể là một loài chim.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong môi trường khắc nghiệt, thì nó có thể được gọi là sinh vật cực đoan.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó thuộc nhóm thực vật có hoa (Angiosperms).",
    "re": "Đúng"
  },
  {
    "con": "Có mấy dạng tháp tuổi chính?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào có nhân được gọi là gì?",
    "re": "Eukaryote"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn thì nó được gọi là gì?",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một sinh vật không thể tự sản xuất thức ăn thì nó được gọi là gì?",
    "re": "Sinh vật dị dưỡng"
  },
  {
    "con": "Nếu một loài động vật có xương sống thì nó thuộc nhóm nào?",
    "re": "Động vật có xương"
  },
  {
    "con": "Nếu một loài thực vật có hoa thì nó thuộc nhóm nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một tế bào phân chia thành hai tế bào con thì quá trình này gọi là gì?",
    "re": "Phân bào"
  },
  {
    "con": "Nếu một sinh vật có khả năng thích nghi với môi trường sống của nó thì nó có thể tồn tại lâu dài hơn.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài động vật có khả năng di cư thì nó có thể tìm kiếm nguồn thức ăn mới.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc di truyền giống nhau thì chúng thuộc về cùng một loài.",
    "re": "Đúng"
  },
  {
    "con": "Trong một hệ sinh thái, lớp lá mục trên mặt đất được xếp vào",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn thông qua quang hợp",
    "re": "Thì nó được gọi là thực vật"
  },
  {
    "con": "Nếu DNA của một sinh vật bị biến đổi",
    "re": "Thì có thể dẫn đến sự thay đổi trong đặc điểm di truyền của nó"
  },
  {
    "con": "Nếu một loài động vật sống trong môi trường nước",
    "re": "Thì nó có thể có các đặc điểm thích nghi như vây và mang"
  },
  {
    "con": "Nếu một sinh vật thuộc nhóm động vật có xương sống",
    "re": "Thì nó có cấu trúc xương và hệ thần kinh phát triển"
  },
  {
    "con": "Nếu một loài thực vật không có khả năng quang hợp",
    "re": "Thì nó phải lấy dinh dưỡng từ môi trường xung quanh"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản hữu tính",
    "re": "Thì nó cần có sự kết hợp giữa tế bào sinh dục của hai cá thể khác nhau"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường khô hạn",
    "re": "Thì nó có thể phát triển các cơ chế tiết kiệm nước"
  },
  {
    "con": "Nếu một loài vi khuẩn có khả năng phân hủy chất hữu cơ",
    "re": "Thì nó đóng vai trò quan trọng trong chu trình dinh dưỡng của hệ sinh thái"
  },
  {
    "con": "Nếu một loài động vật có tập tính di cư",
    "re": "Thì nó thường di chuyển đến nơi có điều kiện sống tốt hơn theo mùa"
  },
  {
    "con": "Sinh vật nào dưới đây không thể là thức ăn của chuột đồng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng quang hợp,",
    "re": "thì nó thuộc nhóm thực vật."
  },
  {
    "con": "Nếu tế bào có nhân,",
    "re": "thì nó được gọi là tế bào nhân thực."
  },
  {
    "con": "Nếu một loài động vật có vú,",
    "re": "thì nó sẽ nuôi con bằng sữa."
  },
  {
    "con": "Nếu một sinh vật có khả năng di chuyển,",
    "re": "thì nó có thể thuộc nhóm động vật."
  },
  {
    "con": "Nếu một loài thực vật có hoa,",
    "re": "thì nó thuộc nhóm thực vật có hoa."
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước,",
    "re": "thì nó có thể là động vật thủy sinh."
  },
  {
    "con": "Nếu một loài vi khuẩn có khả năng gây bệnh,",
    "re": "thì nó được gọi là vi khuẩn gây bệnh."
  },
  {
    "con": "Nếu một sinh vật có bộ gen khác biệt với loài khác,",
    "re": "thì nó có thể được coi là một loài mới."
  },
  {
    "con": "Nếu một sinh vật có cấu trúc tế bào đơn giản,",
    "re": "thì nó thuộc nhóm sinh vật đơn bào."
  },
  {
    "con": "Hiện tượng thoái hoá giống biểu hiện ở điều nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào thực vật có thành tế bào, còn tế bào động vật không có thành tế bào.",
    "re": "Đây là sự khác biệt chính giữa tế bào thực vật và tế bào động vật."
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời,",
    "re": "thì nó được gọi là sinh vật tự dưỡng."
  },
  {
    "con": "Nếu một loài động vật có khả năng thích nghi với môi trường sống của nó,",
    "re": "thì nó có khả năng sống sót và phát triển tốt hơn."
  },
  {
    "con": "Nếu DNA của một sinh vật bị thay đổi do đột biến,",
    "re": "thì có thể dẫn đến sự thay đổi trong đặc điểm di truyền của nó."
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước,",
    "re": "thì nó có thể có các đặc điểm như vây và mang để thích nghi."
  },
  {
    "con": "Nếu một loài thực vật không nhận đủ ánh sáng mặt trời,",
    "re": "thì nó có thể không phát triển tốt và không ra hoa."
  },
  {
    "con": "Nếu một sinh vật ăn thịt,",
    "re": "thì nó sẽ nằm ở đỉnh của chuỗi thức ăn trong hệ sinh thái."
  },
  {
    "con": "Nếu một loài động vật di cư theo mùa,",
    "re": "thì nó có thể tìm kiếm nguồn thức ăn và điều kiện sống tốt hơn."
  },
  {
    "con": "Nếu một sinh vật có hệ thống tuần hoàn mở,",
    "re": "thì máu sẽ không chỉ lưu thông trong các mạch máu mà còn chảy tự do trong khoang cơ thể."
  },
  {
    "con": "Ở thực vật, phương pháp tự thụ phấn qua nhiều thế hệ được áp dụng khi nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có ADN, thì nó có khả năng di truyền các đặc điểm cho thế hệ sau.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài động vật sống trong môi trường nước, thì nó có thể có các đặc điểm thích nghi như mang hoặc vây.",
    "re": "Đúng"
  },
  {
    "con": "Nếu tế bào không nhận đủ oxy, thì nó sẽ chuyển sang quá trình lên men để tạo ra năng lượng.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó có khả năng sinh sản hữu tính.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật có hệ thống miễn dịch mạnh, thì nó có khả năng chống lại bệnh tật tốt hơn.",
    "re": "Đúng"
  },
  {
    "con": "Nếu môi trường sống thay đổi, thì các sinh vật có thể phải thích nghi hoặc di cư để sống sót.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài động vật có vú, thì nó sẽ nuôi con bằng sữa.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một tế bào bị tổn thương, thì nó có thể kích hoạt quá trình tự chết tế bào để bảo vệ cơ thể.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc tế bào prokaryote, thì nó không có nhân tế bào rõ ràng.",
    "re": "Đúng"
  },
  {
    "con": "các tế bào phân chia và phát triển",
    "re": "sinh ra các tế bào mới và duy trì sự sống"
  },
  {
    "con": "một sinh vật có ADN khác biệt với sinh vật khác",
    "re": "sinh vật đó sẽ có các đặc điểm di truyền khác nhau"
  },
  {
    "con": "nhiệt độ môi trường tăng cao",
    "re": "các enzyme trong cơ thể có thể hoạt động kém hiệu quả hơn"
  },
  {
    "con": "các loài sinh vật sống trong cùng một môi trường",
    "re": "chúng sẽ cạnh tranh với nhau về tài nguyên"
  },
  {
    "con": "các tế bào thực vật có chứa diệp lục",
    "re": "chúng có khả năng thực hiện quang hợp để tạo ra năng lượng"
  },
  {
    "con": "một sinh vật có hệ miễn dịch khỏe mạnh",
    "re": "sinh vật đó có khả năng chống lại bệnh tật tốt hơn"
  },
  {
    "con": "các loài động vật sống trong môi trường nước",
    "re": "chúng sẽ có các đặc điểm thích nghi như vây và mang"
  },
  {
    "con": "các chất dinh dưỡng được hấp thụ qua ruột",
    "re": "cơ thể sẽ có đủ năng lượng và chất dinh dưỡng để hoạt động"
  },
  {
    "con": "một sinh vật trải qua quá trình tiến hóa",
    "re": "sinh vật đó sẽ phát triển các đặc điểm thích nghi với môi trường"
  },
  {
    "con": "các tế bào chết đi và được thay thế",
    "re": "cơ thể sẽ duy trì sự khỏe mạnh và chức năng bình thường"
  },
  {
    "con": "Ưu thế lai được biểu hiện rõ nhất khi",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Quá trình quang hợp diễn ra trong lá cây",
    "re": "Cây sản xuất oxy và glucose"
  },
  {
    "con": "Tế bào động vật không có thành tế bào",
    "re": "Chúng có cấu trúc linh hoạt hơn so với tế bào thực vật"
  },
  {
    "con": "DNA chứa thông tin di truyền",
    "re": "Nó quyết định đặc điểm của sinh vật"
  },
  {
    "con": "Sự phân chia tế bào xảy ra trong quá trình sinh sản",
    "re": "Nó tạo ra các tế bào con mới"
  },
  {
    "con": "Hệ tuần hoàn vận chuyển máu trong cơ thể",
    "re": "Cung cấp oxy và chất dinh dưỡng cho các tế bào"
  },
  {
    "con": "Các loài sinh vật có thể thích nghi với môi trường",
    "re": "Chúng có khả năng sống sót và phát triển tốt hơn"
  },
  {
    "con": "Vi khuẩn có thể sống trong môi trường khắc nghiệt",
    "re": "Chúng có thể tồn tại ở nhiệt độ cao hoặc pH cực đoan"
  },
  {
    "con": "Sự tiến hóa xảy ra qua nhiều thế hệ",
    "re": "Nó dẫn đến sự thay đổi trong đặc điểm di truyền của loài"
  },
  {
    "con": "Mỗi sinh vật đều có vai trò trong hệ sinh thái",
    "re": "Chúng duy trì sự cân bằng sinh thái"
  },
  {
    "con": "Sự tiêu hóa bắt đầu từ miệng",
    "re": "Thức ăn được nghiền nát và trộn với nước bọt"
  },
  {
    "con": "Lai khác dòng là phương pháp tạo ưu thế lai chủ yếu ở",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chọn lọc hàng loạt 3 lần sẽ được diễn ra trong mấy mùa vụ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tế bào không có nhân thì đó là tế bào gì?",
    "re": "Tế bào prokaryote"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn thì nó thuộc nhóm nào?",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu môi trường sống thay đổi, thì sinh vật có thể làm gì để thích nghi?",
    "re": "Thay đổi hành vi hoặc cấu trúc cơ thể"
  },
  {
    "con": "Nếu một loài động vật có đặc điểm di truyền tốt hơn, thì khả năng sống sót của nó sẽ như thế nào?",
    "re": "Cao hơn so với loài khác"
  },
  {
    "con": "Nếu quá trình quang hợp diễn ra, thì sản phẩm chính là gì?",
    "re": "Glucose và oxy"
  },
  {
    "con": "Nếu một loài thực vật không nhận đủ ánh sáng mặt trời, thì điều gì sẽ xảy ra?",
    "re": "Nó sẽ phát triển kém và có thể chết"
  },
  {
    "con": "Nếu một sinh vật có hệ thống tuần hoàn mở, thì nó thuộc nhóm nào?",
    "re": "Động vật không xương sống như côn trùng"
  },
  {
    "con": "Nếu một loài động vật có khả năng sinh sản nhanh chóng, thì điều này có thể dẫn đến điều gì?",
    "re": "Tăng trưởng dân số nhanh chóng"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc tế bào phức tạp, thì nó thuộc nhóm nào?",
    "re": "Tế bào eukaryote"
  },
  {
    "con": "Quá trình quang hợp diễn ra ở đâu trong tế bào thực vật?",
    "re": "Chloroplast"
  },
  {
    "con": "Nếu tế bào không có nhân thì nó thuộc loại tế bào nào?",
    "re": "Tế bào prokaryote"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn thì nó được gọi là gì?",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài động vật có đặc điểm thích nghi với môi trường sống của nó, thì nó có khả năng sống sót tốt hơn.",
    "re": "Đúng"
  },
  {
    "con": "Nếu DNA bị tổn thương, thì điều gì có thể xảy ra?",
    "re": "Có thể dẫn đến đột biến gen"
  },
  {
    "con": "Nếu một loài sinh vật bị tuyệt chủng, thì điều gì sẽ xảy ra với hệ sinh thái?",
    "re": "Có thể gây mất cân bằng sinh thái"
  },
  {
    "con": "Nếu một tế bào phân chia không kiểm soát, thì điều gì có thể xảy ra?",
    "re": "Có thể dẫn đến ung thư"
  },
  {
    "con": "Nếu một loài động vật có cấu trúc cơ thể tương tự với loài khác, thì chúng có thể có nguồn gốc chung.",
    "re": "Đúng"
  },
  {
    "con": "Nếu môi trường sống thay đổi, thì sinh vật có thể phải thích nghi hoặc di cư.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó thuộc nhóm thực vật nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Giống lúa DT17 được tạo ra nhờ phương pháp nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào thực vật có thành tế bào, còn tế bào động vật không có thành tế bào.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản, thì nó có thể truyền gen cho thế hệ sau.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một loài động vật sống trong môi trường nước, thì nó có thể có các đặc điểm thích nghi như mang hoặc vây.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một cây có hoa, thì nó có khả năng sinh sản hữu tính.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một sinh vật có DNA, thì nó có thể được phân loại là một sinh vật sống.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một loài thực vật có khả năng quang hợp, thì nó có thể tạo ra năng lượng từ ánh sáng mặt trời.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một sinh vật có hệ tuần hoàn, thì nó có khả năng vận chuyển chất dinh dưỡng và oxy trong cơ thể.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một loài động vật có vú, thì nó có tuyến sữa để nuôi con.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường khô cằn, thì nó có thể có các đặc điểm thích nghi như lá nhỏ hoặc thân mọng nước.",
    "re": "Điều này đúng"
  },
  {
    "con": "Tế bào là đơn vị cơ bản của sự sống?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời thì nó thuộc nhóm nào?",
    "re": "Thực vật"
  },
  {
    "con": "Nếu một loài động vật có bộ gen khác biệt với loài khác thì chúng có thể sinh sản với nhau không?",
    "re": "Không"
  },
  {
    "con": "Nếu môi trường sống thay đổi, thì sinh vật có thể thích nghi như thế nào?",
    "re": "Thay đổi hành vi hoặc hình thái"
  },
  {
    "con": "Nếu một loài động vật có vú, thì nó có đặc điểm gì nổi bật?",
    "re": "Có tuyến sữa"
  },
  {
    "con": "Nếu một tế bào không có nhân, thì nó thuộc loại tế bào nào?",
    "re": "Tế bào prokaryote"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc di truyền giống nhau, thì chúng có thể được coi là gì?",
    "re": "Cùng loài"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó thuộc nhóm nào?",
    "re": "Thực vật có hoa"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, thì nó có thể có đặc điểm gì?",
    "re": "Có vây hoặc mang"
  },
  {
    "con": "Nếu một loài động vật có khả năng bay, thì nó có thể có cấu trúc nào đặc biệt?",
    "re": "Cánh"
  },
  {
    "con": "Khi nói về phương pháp cải tạo giống địa phương, điều nào sau đây là đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi tế bào phân chia, điều gì xảy ra với DNA?",
    "re": "DNA được sao chép để đảm bảo mỗi tế bào con có bộ gen giống nhau"
  },
  {
    "con": "Khi một sinh vật sống trong môi trường có ít thức ăn, điều gì xảy ra?",
    "re": "Sinh vật đó có thể giảm sinh sản hoặc chết do thiếu dinh dưỡng"
  },
  {
    "con": "Khi nói về chu trình nước, điều gì xảy ra khi nước bốc hơi?",
    "re": "Nước chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Khi một loài động vật bị săn bắt quá mức, điều gì có thể xảy ra?",
    "re": "Số lượng loài đó có thể giảm mạnh và dẫn đến nguy cơ tuyệt chủng"
  },
  {
    "con": "Khi thực vật quang hợp, điều gì được sản xuất?",
    "re": "Oxy và glucose được sản xuất từ ánh sáng mặt trời, nước và carbon dioxide"
  },
  {
    "con": "Khi nói về chuỗi thức ăn, điều gì xảy ra với năng lượng?",
    "re": "Năng lượng giảm dần khi di chuyển từ cấp độ này sang cấp độ khác"
  },
  {
    "con": "Khi một sinh vật có đặc điểm di truyền từ cả cha và mẹ, điều gì xảy ra?",
    "re": "Sinh vật đó có thể biểu hiện các đặc điểm di truyền từ cả hai nguồn"
  },
  {
    "con": "Khi môi trường sống bị ô nhiễm, điều gì có thể xảy ra với sinh vật sống?",
    "re": "Sinh vật sống có thể bị ảnh hưởng xấu đến sức khỏe và sự sinh sản"
  },
  {
    "con": "Khi nói về sự tiến hóa, điều gì xảy ra với các loài theo thời gian?",
    "re": "Các loài có thể thay đổi để thích nghi với môi trường sống của chúng"
  },
  {
    "con": "Đất – không khí là môi trường sống của sinh vật nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là thành phần chính cấu tạo nên tế bào sống?",
    "re": "Đúng, nước chiếm khoảng 70% trọng lượng tế bào"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự tổng hợp chất hữu cơ từ ánh sáng mặt trời thì đó là sinh vật gì?",
    "re": "Sinh vật quang hợp"
  },
  {
    "con": "Nếu một loài động vật có xương sống thì nó thuộc nhóm nào?",
    "re": "Động vật có xương"
  },
  {
    "con": "Nếu một sinh vật có khả năng di chuyển và tiêu thụ thức ăn thì nó thuộc nhóm nào?",
    "re": "Động vật"
  },
  {
    "con": "Nếu một loài thực vật có hoa và quả thì nó thuộc nhóm nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một tế bào có nhân và các bào quan thì nó thuộc loại tế bào nào?",
    "re": "Tế bào eukaryote"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong môi trường khắc nghiệt thì nó được gọi là gì?",
    "re": "Vi sinh vật cực đoan"
  },
  {
    "con": "Nếu một loài động vật có khả năng sinh sản vô tính thì nó có thể làm gì?",
    "re": "Tạo ra con cái mà không cần giao phối"
  },
  {
    "con": "Nếu một sinh vật có chu trình sống phức tạp với nhiều giai đoạn thì nó thuộc loại nào?",
    "re": "Sinh vật có chu trình sống hoàn chỉnh"
  },
  {
    "con": "Hiện tượng vào mùa đông, chim én bay về phương Nam còn khi xuân đến, chúng lại bay ngược về phương Bắc cho thấy ảnh hưởng của nhân tố nào đối với đời sống sinh vật?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu cây xanh nhận đủ ánh sáng mặt trời và nước, thì chúng sẽ quang hợp và sản xuất oxy.",
    "re": "Cây sẽ phát triển khỏe mạnh và cung cấp oxy cho môi trường."
  },
  {
    "con": "Nếu động vật không có đủ thức ăn, thì chúng sẽ không thể sinh trưởng và phát triển bình thường.",
    "re": "Điều này có thể dẫn đến sự suy giảm dân số của loài đó."
  },
  {
    "con": "Nếu môi trường sống bị ô nhiễm, thì sức khỏe của sinh vật trong đó sẽ bị ảnh hưởng nghiêm trọng.",
    "re": "Nhiều loài có thể bị tuyệt chủng hoặc giảm số lượng."
  },
  {
    "con": "Nếu một loài sinh vật có khả năng thích nghi tốt với môi trường, thì chúng sẽ có khả năng sống sót cao hơn.",
    "re": "Điều này giúp loài đó tồn tại lâu dài trong tự nhiên."
  },
  {
    "con": "Nếu các tế bào trong cơ thể không nhận đủ dinh dưỡng, thì chúng sẽ không hoạt động hiệu quả.",
    "re": "Điều này có thể dẫn đến các vấn đề sức khỏe nghiêm trọng."
  },
  {
    "con": "Nếu một loài động vật có cấu trúc cơ thể phù hợp với môi trường sống của nó, thì chúng sẽ dễ dàng tìm kiếm thức ăn và tránh kẻ thù.",
    "re": "Điều này giúp tăng khả năng sống sót của loài đó."
  },
  {
    "con": "Nếu có sự cạnh tranh giữa các loài trong cùng một môi trường, thì một số loài có thể bị loại bỏ.",
    "re": "Điều này dẫn đến sự thay đổi trong cấu trúc quần thể sinh vật."
  },
  {
    "con": "Nếu nhiệt độ môi trường thay đổi đột ngột, thì sinh vật có thể gặp khó khăn trong việc điều chỉnh thân nhiệt.",
    "re": "Điều này có thể gây ra stress và ảnh hưởng đến sức khỏe của chúng."
  },
  {
    "con": "Nếu một loài sinh vật có khả năng sinh sản nhanh, thì chúng có thể chiếm ưu thế trong môi trường sống.",
    "re": "Điều này có thể dẫn đến sự gia tăng dân số nhanh chóng."
  },
  {
    "con": "Đặc điểm nào dưới đây có ở những cây sống nơi quang đãng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nấm có khả năng phân hủy chất hữu cơ?",
    "re": "Nấm đóng vai trò quan trọng trong chu trình dinh dưỡng của hệ sinh thái"
  },
  {
    "con": "Một tế bào có nhân và các bào quan?",
    "re": "Đó là tế bào eukaryote"
  },
  {
    "con": "Cây xanh có khả năng quang hợp?",
    "re": "Cây xanh sản xuất oxy và glucose từ ánh sáng mặt trời"
  },
  {
    "con": "Động vật có xương sống có đặc điểm gì chung?",
    "re": "Chúng có hệ thống xương và hệ thần kinh phát triển"
  },
  {
    "con": "Khi nhiệt độ môi trường tăng lên?",
    "re": "Nhiều loài động vật có thể thay đổi hành vi để thích nghi"
  },
  {
    "con": "Sự di truyền gen từ cha mẹ sang con cái?",
    "re": "Được quy định bởi các gen nằm trên nhiễm sắc thể"
  },
  {
    "con": "Khi một loài bị tuyệt chủng?",
    "re": "Hệ sinh thái có thể bị mất đi sự đa dạng sinh học"
  },
  {
    "con": "Vi khuẩn có thể sống ở đâu?",
    "re": "Chúng có thể sống trong nhiều môi trường khác nhau, bao gồm cả môi trường khắc nghiệt"
  },
  {
    "con": "Khi một loài phát triển nhanh chóng trong môi trường mới?",
    "re": "Có thể dẫn đến sự cạnh tranh với các loài bản địa"
  },
  {
    "con": "Cây nào dưới đây có khả năng điều tiết nước linh hoạt hơn những cây còn lại?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có tế bào nhân thực, thì nó thuộc về nhóm nào?",
    "re": "Nó thuộc về nhóm sinh vật nhân thực"
  },
  {
    "con": "Nếu một loài động vật có xương sống, thì nó có đặc điểm gì nổi bật?",
    "re": "Nó có hệ thống xương và tủy sống"
  },
  {
    "con": "Nếu một tế bào thực vật có lục lạp, thì nó có khả năng làm gì?",
    "re": "Nó có khả năng quang hợp"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, thì nó có thể có đặc điểm gì?",
    "re": "Nó có thể có vây hoặc mang để hô hấp"
  },
  {
    "con": "Nếu một loài động vật có khả năng bay, thì nó thường có đặc điểm gì?",
    "re": "Nó thường có cánh và bộ xương nhẹ"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó có thể sinh sản bằng cách nào?",
    "re": "Nó có thể sinh sản bằng hạt"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn, thì nó thuộc loại nào?",
    "re": "Nó thuộc loại sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài động vật có khả năng sống trên cạn, thì nó có thể có đặc điểm gì?",
    "re": "Nó có thể có phổi để hô hấp"
  },
  {
    "con": "Nếu một tế bào có màng tế bào, thì nó có thể là tế bào của loại nào?",
    "re": "Nó có thể là tế bào của cả thực vật và động vật"
  },
  {
    "con": "Thực vật quang hợp",
    "re": "sản xuất oxy và glucose"
  },
  {
    "con": "Động vật hô hấp",
    "re": "tiêu thụ oxy và thải ra carbon dioxide"
  },
  {
    "con": "Nước là thành phần chính của tế bào",
    "re": "cần thiết cho các phản ứng sinh hóa"
  },
  {
    "con": "Gen di truyền từ cha mẹ",
    "re": "quyết định đặc điểm của con cái"
  },
  {
    "con": "Vi khuẩn có thể sống trong môi trường khắc nghiệt",
    "re": "có khả năng thích nghi cao"
  },
  {
    "con": "Hệ tuần hoàn vận chuyển máu",
    "re": "cung cấp oxy và dinh dưỡng cho tế bào"
  },
  {
    "con": "Sự tiến hóa xảy ra qua nhiều thế hệ",
    "re": "dẫn đến sự đa dạng sinh học"
  },
  {
    "con": "Năng lượng trong chuỗi thức ăn",
    "re": "giảm dần từ cấp độ này sang cấp độ khác"
  },
  {
    "con": "Sự phân hủy chất hữu cơ",
    "re": "giúp tái chế dinh dưỡng trong hệ sinh thái"
  },
  {
    "con": "Hệ miễn dịch bảo vệ cơ thể",
    "re": "chống lại các tác nhân gây bệnh"
  },
  {
    "con": "So với các đại diện cùng loài sống ở vùng ôn đới, khi sống ở vùng nhiệt đới thì động vật nào dưới đây thường có kích thước lớn hơn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một tế bào phân chia, nếu nó không sao chép DNA của mình một cách chính xác, thì điều gì có thể xảy ra?",
    "re": "Tế bào có thể phát triển thành tế bào ung thư"
  },
  {
    "con": "Nếu một loài thực vật sống trong môi trường có ánh sáng yếu, thì nó sẽ phát triển như thế nào?",
    "re": "Nó sẽ có lá lớn hơn để hấp thụ nhiều ánh sáng hơn"
  },
  {
    "con": "Nếu một sinh vật có hệ thống tuần hoàn mở, thì máu của nó sẽ làm gì?",
    "re": "Chảy tự do trong khoang cơ thể thay vì trong mạch máu"
  },
  {
    "con": "Nếu một loài động vật có khả năng thích nghi tốt với môi trường, thì nó sẽ có khả năng sống sót như thế nào?",
    "re": "Cao hơn trong điều kiện thay đổi"
  },
  {
    "con": "Khi một loài động vật di cư đến một môi trường mới, nếu nó không thể thích nghi, thì điều gì sẽ xảy ra?",
    "re": "Loài đó có thể bị tuyệt chủng"
  },
  {
    "con": "Nếu một tế bào thực vật bị thiếu nước, thì nó sẽ phản ứng như thế nào?",
    "re": "Giảm sự mở khí khổng để tiết kiệm nước"
  },
  {
    "con": "Nếu một loài vi khuẩn phát triển kháng thuốc, thì điều gì có thể xảy ra với các loại thuốc hiện có?",
    "re": "Chúng có thể trở nên kém hiệu quả hơn"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc cơ thể đối xứng, thì nó có thể có lợi ích gì?",
    "re": "Giúp di chuyển hiệu quả hơn trong môi trường của nó"
  },
  {
    "con": "Nếu một loài động vật có chế độ ăn uống đa dạng, thì nó sẽ có lợi ích gì?",
    "re": "Cải thiện khả năng sống sót và sức khỏe tổng thể"
  },
  {
    "con": "Sinh vật nào dưới đây có nhiệt độ cơ thể phụ thuộc vào nhiệt độ môi trường?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tế bào được chia thành hai tế bào con,",
    "re": "thì quá trình này gọi là phân bào."
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời,",
    "re": "thì nó được gọi là sinh vật tự dưỡng."
  },
  {
    "con": "Nếu một loài động vật có xương sống,",
    "re": "thì nó thuộc vào nhóm động vật có xương."
  },
  {
    "con": "Nếu một sinh vật có cấu trúc tế bào đơn giản hơn,",
    "re": "thì nó thuộc vào nhóm vi sinh vật."
  },
  {
    "con": "Nếu một loài thực vật có hoa và hạt,",
    "re": "thì nó được gọi là thực vật hạt kín."
  },
  {
    "con": "Nếu một sinh vật có khả năng thích nghi với môi trường sống của nó,",
    "re": "thì nó có khả năng sống sót và phát triển tốt hơn."
  },
  {
    "con": "Nếu một tế bào chứa DNA,",
    "re": "thì nó có khả năng di truyền thông tin di truyền."
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước,",
    "re": "thì nó có thể có các đặc điểm thích nghi như mang hoặc vây."
  },
  {
    "con": "Nếu một loài động vật ăn thực vật,",
    "re": "thì nó được gọi là động vật ăn cỏ."
  },
  {
    "con": "Dựa vào sự thích nghi với các điều kiện độ ẩm khác nhau, thực vật được phân chia làm mấy nhóm chính?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tế bào không có nhân, thì chúng được gọi là loại tế bào nào?",
    "re": "Tế bào prokaryote"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời, thì nó thuộc nhóm nào?",
    "re": "Sinh vật quang hợp"
  },
  {
    "con": "Nếu một loài động vật có xương sống, thì nó thuộc nhóm nào trong phân loại sinh học?",
    "re": "Động vật có xương sống"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong môi trường cực kỳ khắc nghiệt, thì nó được gọi là gì?",
    "re": "Sinh vật cực đoan"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó thuộc nhóm nào trong phân loại thực vật?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc cơ thể phân chia thành nhiều phần, thì nó thuộc nhóm nào?",
    "re": "Động vật đối xứng"
  },
  {
    "con": "Nếu một tế bào có màng nhân và các bào quan, thì nó được gọi là loại tế bào nào?",
    "re": "Tế bào eukaryote"
  },
  {
    "con": "Nếu một loài động vật có khả năng bay, thì nó thường thuộc nhóm nào?",
    "re": "Động vật có cánh"
  },
  {
    "con": "Nếu một sinh vật có khả năng phân hủy chất hữu cơ, thì nó được gọi là gì?",
    "re": "Sinh vật phân hủy"
  },
  {
    "con": "Chọn từ thích hợp để điền vào chỗ trống trong câu sau: … là động vật ưa sống nơi ẩm ướt.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu thực vật không nhận đủ ánh sáng mặt trời,",
    "re": "thì chúng sẽ không thể thực hiện quá trình quang hợp hiệu quả."
  },
  {
    "con": "Nếu một sinh vật có bộ gen đồng hợp tử cho một đặc điểm,",
    "re": "thì nó sẽ biểu hiện đặc điểm đó một cách nhất quán."
  },
  {
    "con": "Nếu môi trường sống của một loài bị thay đổi nhanh chóng,",
    "re": "thì loài đó có thể gặp nguy cơ tuyệt chủng."
  },
  {
    "con": "Nếu một tế bào bị tổn thương DNA,",
    "re": "thì nó có thể phát triển thành tế bào ung thư."
  },
  {
    "con": "Nếu động vật ăn thực vật,",
    "re": "thì chúng được gọi là động vật ăn cỏ."
  },
  {
    "con": "Nếu một loài có khả năng sinh sản cao,",
    "re": "thì nó có khả năng phát triển quần thể nhanh chóng."
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước,",
    "re": "thì nó có thể có các đặc điểm thích nghi như mang hoặc vây."
  },
  {
    "con": "Nếu một loài có cấu trúc cơ thể phức tạp hơn,",
    "re": "thì nó thường có khả năng thích nghi tốt hơn với môi trường."
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn,",
    "re": "thì nó được gọi là sinh vật tự dưỡng."
  },
  {
    "con": "Động vật nào dưới đây có lối sống bầy đàn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tế bào được chia thành hai tế bào con,",
    "re": "thì quá trình này gọi là phân bào."
  },
  {
    "con": "Nếu thực vật không có ánh sáng mặt trời,",
    "re": "thì chúng sẽ không thể thực hiện quá trình quang hợp."
  },
  {
    "con": "Nếu một sinh vật có ADN,",
    "re": "thì nó có khả năng di truyền thông tin di truyền."
  },
  {
    "con": "Nếu một loài động vật sống trong môi trường nước,",
    "re": "thì chúng thường có các đặc điểm thích nghi như vây và mang."
  },
  {
    "con": "Nếu một sinh vật là động vật ăn thịt,",
    "re": "thì nó sẽ săn bắt các sinh vật khác để lấy thức ăn."
  },
  {
    "con": "Nếu một loài thực vật có hoa,",
    "re": "thì nó có khả năng sinh sản hữu tính."
  },
  {
    "con": "Nếu một sinh vật có hệ thống tuần hoàn,",
    "re": "thì nó có khả năng vận chuyển chất dinh dưỡng và oxy đến các tế bào."
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường khô cằn,",
    "re": "thì nó có thể phát triển các đặc điểm như lá nhỏ hoặc thân mọng nước để giữ nước."
  },
  {
    "con": "Nếu một loài động vật có lông,",
    "re": "thì nó có thể giữ ấm cho cơ thể trong môi trường lạnh."
  },
  {
    "con": "Quá trình quang hợp xảy ra ở đâu trong tế bào thực vật?",
    "re": "Chloroplast"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời, thì nó được gọi là gì?",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài động vật có bộ xương bên trong, thì nó thuộc nhóm nào?",
    "re": "Động vật có xương sống"
  },
  {
    "con": "Nếu một tế bào có nhân và các bào quan, thì nó được gọi là gì?",
    "re": "Tế bào eukaryote"
  },
  {
    "con": "Nếu một loài thực vật không có hoa và hạt, thì nó thuộc nhóm nào?",
    "re": "Thực vật bậc thấp"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, thì nó có thể được gọi là gì?",
    "re": "Sinh vật thủy sinh"
  },
  {
    "con": "Nếu một loài động vật có khả năng bay, thì nó thường có đặc điểm gì?",
    "re": "Cánh"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong điều kiện khắc nghiệt, thì nó được gọi là gì?",
    "re": "Sinh vật cực đoan"
  },
  {
    "con": "Nếu một loài động vật ăn thịt, thì nó thuộc nhóm nào?",
    "re": "Động vật ăn thịt"
  },
  {
    "con": "Nếu một tế bào phân chia để tạo ra hai tế bào con giống hệt nhau, thì quá trình này được gọi là gì?",
    "re": "Phân bào nguyên phân"
  },
  {
    "con": "Trong quần thể nào dưới đây, mật độ có thể được tính theo cả đơn vị diện tích và thể tích?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời,",
    "re": "thì nó được gọi là sinh vật tự dưỡng."
  },
  {
    "con": "Nếu tế bào không có nhân,",
    "re": "thì nó được gọi là tế bào prokaryote."
  },
  {
    "con": "Nếu một loài động vật có xương sống,",
    "re": "thì nó thuộc vào nhóm động vật có xương."
  },
  {
    "con": "Nếu một loài thực vật có hoa và hạt,",
    "re": "thì nó được phân loại là thực vật hạt kín."
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong môi trường khắc nghiệt,",
    "re": "thì nó được gọi là sinh vật cực đoan."
  },
  {
    "con": "Nếu một tế bào chia thành hai tế bào con thông qua quá trình phân bào,",
    "re": "thì đó là quá trình nguyên phân."
  },
  {
    "con": "Nếu một loài động vật có khả năng bay,",
    "re": "thì nó có thể thuộc vào nhóm chim hoặc côn trùng."
  },
  {
    "con": "Nếu một sinh vật có cấu trúc tế bào phức tạp với nhiều bào quan,",
    "re": "thì nó được gọi là tế bào eukaryote."
  },
  {
    "con": "Nếu một loài thực vật không có mạch dẫn,",
    "re": "thì nó được gọi là thực vật không mạch."
  },
  {
    "con": "Sự tăng dân số quá nhanh có thể dẫn đến hậu quả nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu thực vật không có ánh sáng mặt trời thì",
    "re": "chúng sẽ không thể thực hiện quá trình quang hợp."
  },
  {
    "con": "Nếu một loài động vật bị mất môi trường sống thì",
    "re": "sự sống sót và phát triển của chúng sẽ bị đe dọa."
  },
  {
    "con": "Nếu tế bào không có màng tế bào thì",
    "re": "chúng sẽ không thể duy trì môi trường nội bào ổn định."
  },
  {
    "con": "Nếu một loài sinh vật có khả năng sinh sản cao thì",
    "re": "dân số của loài đó có thể tăng nhanh chóng."
  },
  {
    "con": "Nếu các loài sinh vật trong một hệ sinh thái không có sự cân bằng thì",
    "re": "hệ sinh thái đó có thể bị phá vỡ."
  },
  {
    "con": "Nếu một sinh vật có ADN biến đổi thì",
    "re": "các đặc điểm di truyền của nó có thể thay đổi."
  },
  {
    "con": "Nếu một loài động vật là động vật ăn thịt thì",
    "re": "nó sẽ đóng vai trò quan trọng trong chuỗi thức ăn."
  },
  {
    "con": "Nếu nước trong môi trường sống bị ô nhiễm thì",
    "re": "sức khỏe của các sinh vật sống trong đó sẽ bị ảnh hưởng."
  },
  {
    "con": "Nếu vi khuẩn có khả năng kháng thuốc thì",
    "re": "việc điều trị các bệnh nhiễm trùng sẽ trở nên khó khăn hơn."
  },
  {
    "con": "Trong quần xã, chỉ số nào thể hiện mức độ phong phú về số lượng loài trong quần xã?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn, thì nó được gọi là gì?",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài động vật sống trong môi trường nước, thì nó có thể có đặc điểm gì để thích nghi?",
    "re": "Có vây và mang"
  },
  {
    "con": "Nếu một tế bào không có nhân, thì nó thuộc loại tế bào nào?",
    "re": "Tế bào prokaryote"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó thuộc nhóm nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc cơ thể đối xứng tỏa tròn, thì nó thuộc nhóm nào?",
    "re": "Động vật đối xứng tỏa tròn"
  },
  {
    "con": "Nếu một loài động vật có khả năng bay, thì nó thường có đặc điểm gì?",
    "re": "Có cánh và xương rỗng"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong môi trường khắc nghiệt, thì nó được gọi là gì?",
    "re": "Sinh vật cực đoan"
  },
  {
    "con": "Nếu một tế bào có nhiều ti thể, thì nó thường có chức năng gì?",
    "re": "Sản xuất năng lượng"
  },
  {
    "con": "Nếu một loài động vật có vú nuôi con bằng sữa, thì nó thuộc nhóm nào?",
    "re": "Động vật có vú"
  },
  {
    "con": "Cây nào dưới đây được xếp vào nhóm sinh vật tiêu thụ trong một hệ sinh thái?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự tổng hợp chất hữu cơ từ ánh sáng mặt trời, thì sinh vật đó được gọi là gì?",
    "re": "Sinh vật quang hợp"
  },
  {
    "con": "Nếu một tế bào có nhân và các bào quan, thì tế bào đó thuộc loại nào?",
    "re": "Tế bào eukaryote"
  },
  {
    "con": "Nếu một loài động vật có xương sống, thì nó thuộc nhóm nào?",
    "re": "Động vật có xương sống"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong môi trường khắc nghiệt, thì nó được gọi là gì?",
    "re": "Sinh vật cực đoan"
  },
  {
    "con": "Nếu một loài thực vật có hoa và hạt, thì nó thuộc nhóm nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có khả năng phân hủy chất hữu cơ, thì nó được gọi là gì?",
    "re": "Sinh vật phân hủy"
  },
  {
    "con": "Nếu một tế bào nhân đôi bằng cách phân chia, thì quá trình này được gọi là gì?",
    "re": "Phân bào"
  },
  {
    "con": "Nếu một loài động vật có khả năng thích nghi với môi trường sống của nó, thì nó có thể tồn tại lâu dài hơn, đúng hay sai?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc cơ thể đối xứng, thì nó thuộc nhóm nào?",
    "re": "Động vật đối xứng"
  },
  {
    "con": "Sơ đồ nào dưới đây phản ánh đúng về một chuỗi thức ăn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời,",
    "re": "thì nó được gọi là sinh vật tự dưỡng."
  },
  {
    "con": "Nếu một tế bào có nhân và các bào quan,",
    "re": "thì nó được gọi là tế bào eukaryote."
  },
  {
    "con": "Nếu một loài động vật có xương sống,",
    "re": "thì nó thuộc nhóm động vật có xương sống."
  },
  {
    "con": "Nếu một loài thực vật có hoa và hạt,",
    "re": "thì nó thuộc nhóm thực vật hạt kín."
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước,",
    "re": "thì nó có thể có các đặc điểm thích nghi như mang hoặc vây."
  },
  {
    "con": "Nếu một loài vi khuẩn có khả năng sống trong điều kiện khắc nghiệt,",
    "re": "thì nó được gọi là vi khuẩn cực đoan."
  },
  {
    "con": "Nếu một sinh vật có khả năng di chuyển và tìm kiếm thức ăn,",
    "re": "thì nó được gọi là động vật."
  },
  {
    "con": "Nếu một loài thực vật không có mạch dẫn,",
    "re": "thì nó được gọi là thực vật không mạch."
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản vô tính,",
    "re": "thì nó có thể tạo ra con cái mà không cần bạn tình."
  },
  {
    "con": "Hoạt động săn bắt động vật hoang dã không dẫn đến hậu quả nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Năng lượng từ mặt trời được cây xanh hấp thụ qua quá trình quang hợp?",
    "re": "Cây xanh sản xuất oxy và glucose"
  },
  {
    "con": "Các tế bào trong cơ thể người có chứa DNA?",
    "re": "DNA chứa thông tin di truyền"
  },
  {
    "con": "Sự phân chia tế bào diễn ra trong quá trình sinh sản của sinh vật?",
    "re": "Tế bào mới được tạo ra từ tế bào mẹ"
  },
  {
    "con": "Động vật có xương sống có hệ thống tuần hoàn kín?",
    "re": "Máu được bơm qua các mạch máu"
  },
  {
    "con": "Vi khuẩn có thể sống trong môi trường khắc nghiệt?",
    "re": "Chúng có khả năng thích nghi cao"
  },
  {
    "con": "Sự tiến hóa xảy ra khi có sự thay đổi trong gen của quần thể?",
    "re": "Quần thể có thể thích nghi với môi trường"
  },
  {
    "con": "Thực vật có khả năng tự sản xuất thức ăn thông qua quang hợp?",
    "re": "Chúng là sinh vật tự dưỡng"
  },
  {
    "con": "Hệ sinh thái bao gồm các sinh vật sống và môi trường sống của chúng?",
    "re": "Tất cả các yếu tố tương tác với nhau"
  },
  {
    "con": "Sự đa dạng sinh học là chỉ số cho sức khỏe của một hệ sinh thái?",
    "re": "Hệ sinh thái đa dạng thường ổn định hơn"
  },
  {
    "con": "Tế bào nào là đơn vị cơ bản của sự sống?",
    "re": "Tế bào"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời, thì nó thuộc nhóm nào?",
    "re": "Thực vật"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc cơ thể phức tạp và có nhiều tế bào, thì nó thuộc nhóm nào?",
    "re": "Động vật"
  },
  {
    "con": "Nếu một loài động vật có khả năng bay, thì nó có thể có đặc điểm nào?",
    "re": "Cánh"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong môi trường khắc nghiệt, thì nó có thể được gọi là gì?",
    "re": "Vi sinh vật"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó thuộc nhóm nào?",
    "re": "Thực vật có hoa"
  },
  {
    "con": "Nếu một sinh vật có hệ tiêu hóa phức tạp, thì nó có thể tiêu hóa thức ăn như thế nào?",
    "re": "Bằng cách phân giải thức ăn thành các chất dinh dưỡng"
  },
  {
    "con": "Nếu một loài động vật có vú, thì nó có đặc điểm nào nổi bật?",
    "re": "Có tuyến sữa"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản vô tính, thì nó có thể tạo ra con cái như thế nào?",
    "re": "Bằng cách phân chia tế bào"
  },
  {
    "con": "Nếu một sinh vật có màu sắc sặc sỡ, thì nó có thể có mục đích gì trong tự nhiên?",
    "re": "Thu hút bạn tình hoặc cảnh báo kẻ thù"
  },
  {
    "con": "Nước là thành phần chính của tế bào",
    "re": "Tế bào sẽ không hoạt động bình thường nếu thiếu nước"
  },
  {
    "con": "Thực vật quang hợp trong ánh sáng mặt trời",
    "re": "Chúng sẽ sản xuất oxy và glucose"
  },
  {
    "con": "Động vật ăn thực vật",
    "re": "Chúng sẽ nhận được năng lượng từ thực vật"
  },
  {
    "con": "Gen di truyền được truyền từ cha mẹ sang con cái",
    "re": "Con cái sẽ có những đặc điểm di truyền từ cha mẹ"
  },
  {
    "con": "Vi khuẩn có thể sống trong môi trường khắc nghiệt",
    "re": "Chúng có khả năng thích nghi và tồn tại trong điều kiện khó khăn"
  },
  {
    "con": "Sự phân chia tế bào xảy ra trong quá trình sinh sản",
    "re": "Tạo ra các tế bào mới cho cơ thể"
  },
  {
    "con": "Hệ tuần hoàn vận chuyển máu trong cơ thể",
    "re": "Cung cấp oxy và chất dinh dưỡng cho các tế bào"
  },
  {
    "con": "Sự tiến hóa xảy ra qua hàng triệu năm",
    "re": "Các loài có thể thay đổi để thích nghi với môi trường"
  },
  {
    "con": "Các loài động vật có xương sống có cấu trúc cơ thể phức tạp",
    "re": "Chúng có hệ thống nội tạng phát triển hơn so với động vật không xương sống"
  },
  {
    "con": "Việc sử dụng thuốc kháng sinh không đúng cách",
    "re": "Có thể dẫn đến sự kháng thuốc ở vi khuẩn"
  },
  {
    "con": "Biện pháp nào dưới đây góp phần hạn chế ô nhiễm không khí, ô nhiễm nguồn nước và ô nhiễm tiếng ồn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào có cấu trúc và chức năng giống nhau sẽ tạo thành",
    "re": "mô"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản và phát triển trong môi trường nhất định",
    "re": "thì nó có thể thích nghi với môi trường đó"
  },
  {
    "con": "Nếu một loài động vật có đặc điểm di truyền tốt hơn",
    "re": "thì nó có khả năng sống sót và sinh sản cao hơn"
  },
  {
    "con": "Nếu cây xanh quang hợp hiệu quả",
    "re": "thì nó sẽ sản xuất nhiều oxy hơn"
  },
  {
    "con": "Nếu một sinh vật bị thiếu dinh dưỡng",
    "re": "thì nó sẽ phát triển kém và có thể chết"
  },
  {
    "con": "Nếu môi trường sống của một loài bị thay đổi",
    "re": "thì loài đó có thể bị đe dọa hoặc tuyệt chủng"
  },
  {
    "con": "Nếu một sinh vật có hệ miễn dịch mạnh",
    "re": "thì nó sẽ chống lại bệnh tật tốt hơn"
  },
  {
    "con": "Nếu một loài thực vật không nhận đủ ánh sáng mặt trời",
    "re": "thì nó sẽ không phát triển tốt"
  },
  {
    "con": "Nếu một sinh vật có khả năng di chuyển nhanh",
    "re": "thì nó có thể dễ dàng thoát khỏi kẻ săn mồi"
  },
  {
    "con": "Tài nguyên nào dưới đây là tài nguyên năng lượng vĩnh cửu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sinh vật có tế bào nhân thực sẽ có cấu trúc tế bào phức tạp hơn tế bào nhân sơ?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài thực vật không nhận đủ ánh sáng mặt trời, thì nó sẽ không thể thực hiện quá trình quang hợp hiệu quả?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật có ADN khác biệt với sinh vật khác, thì chúng sẽ có những đặc điểm di truyền khác nhau?",
    "re": "Đúng"
  },
  {
    "con": "Nếu môi trường sống của một loài thay đổi nhanh chóng, thì loài đó có thể gặp nguy hiểm về sự sống sót?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài động vật có khả năng sinh sản cao, thì khả năng tồn tại của loài đó trong môi trường tự nhiên sẽ tăng lên?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một tế bào bị tổn thương DNA, thì tế bào đó có thể phát triển thành tế bào ung thư?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài động vật có đặc điểm thích nghi tốt với môi trường, thì nó sẽ có khả năng sống sót và sinh sản cao hơn?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật không có đủ nước, thì nó sẽ không thể duy trì các chức năng sinh lý cần thiết?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài thực vật có rễ sâu, thì nó có khả năng hấp thụ nước và chất dinh dưỡng tốt hơn trong điều kiện khô hạn?",
    "re": "Đúng"
  },
  {
    "con": "Tế bào là đơn vị cơ bản của sự sống",
    "re": "Tất cả các sinh vật đều được cấu tạo từ tế bào"
  },
  {
    "con": "Khi thực vật quang hợp, chúng sử dụng ánh sáng mặt trời",
    "re": "Chúng tạo ra oxy và glucose"
  },
  {
    "con": "Nếu một sinh vật không có khả năng thích nghi với môi trường",
    "re": "Nó có thể bị tuyệt chủng"
  },
  {
    "con": "Khi DNA bị đột biến",
    "re": "Nó có thể dẫn đến sự thay đổi trong đặc điểm di truyền của sinh vật"
  },
  {
    "con": "Nếu một loài động vật sống trong môi trường nước",
    "re": "Nó sẽ có các đặc điểm thích nghi như vây và mang"
  },
  {
    "con": "Khi các sinh vật cạnh tranh cho tài nguyên",
    "re": "Sẽ xảy ra sự chọn lọc tự nhiên"
  },
  {
    "con": "Nếu một sinh vật ăn thực vật",
    "re": "Nó được gọi là động vật ăn cỏ"
  },
  {
    "con": "Khi một sinh vật chết đi và phân hủy",
    "re": "Nó sẽ cung cấp chất dinh dưỡng cho đất"
  },
  {
    "con": "Nếu một loài có nhiều cá thể",
    "re": "Nó có khả năng sống sót cao hơn trong môi trường thay đổi"
  },
  {
    "con": "Khi một sinh vật bị tấn công bởi vi khuẩn",
    "re": "Hệ miễn dịch sẽ phản ứng để bảo vệ cơ thể"
  },
  {
    "con": "Đâu là tên một hệ sinh thái nước mặn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng quang hợp, thì nó thuộc nhóm nào?",
    "re": "Nó thuộc nhóm thực vật."
  },
  {
    "con": "Nếu tế bào có nhân, thì nó được gọi là gì?",
    "re": "Nó được gọi là tế bào eukaryote."
  },
  {
    "con": "Nếu một loài động vật có xương sống, thì nó thuộc nhóm nào?",
    "re": "Nó thuộc nhóm động vật có xương sống."
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, thì nó có thể được gọi là gì?",
    "re": "Nó có thể được gọi là sinh vật thủy sinh."
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó thuộc nhóm nào?",
    "re": "Nó thuộc nhóm thực vật hạt kín."
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản vô tính, thì nó có thể tạo ra con cái như thế nào?",
    "re": "Nó có thể tạo ra con cái từ một phần của cơ thể nó."
  },
  {
    "con": "Nếu một loài động vật có lông, thì nó thuộc nhóm nào?",
    "re": "Nó thuộc nhóm động vật có vú."
  },
  {
    "con": "Nếu một sinh vật có khả năng thích nghi với môi trường, thì nó có thể sống sót trong điều kiện nào?",
    "re": "Nó có thể sống sót trong điều kiện khắc nghiệt."
  },
  {
    "con": "Nếu một tế bào không có nhân, thì nó được gọi là gì?",
    "re": "Nó được gọi là tế bào prokaryote."
  },
  {
    "con": "Loại cây trồng chủ yếu ở vùng Trung du phía Bắc là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tế bào không có nhân thì đó là loại tế bào gì?",
    "re": "Tế bào prokaryote"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời thì nó thuộc nhóm nào?",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài động vật có xương sống thì nó thuộc nhóm nào?",
    "re": "Động vật có xương sống"
  },
  {
    "con": "Nếu một loài thực vật có hoa và quả thì nó thuộc nhóm nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong môi trường khắc nghiệt thì nó được gọi là gì?",
    "re": "Sinh vật cực đoan"
  },
  {
    "con": "Nếu một tế bào có nhiều ti thể thì nó có khả năng sản xuất năng lượng cao hơn, đúng hay sai?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài động vật có khả năng bay thì nó thường có đặc điểm gì?",
    "re": "Cánh"
  },
  {
    "con": "Nếu một sinh vật có hệ thống tuần hoàn mở thì nó thuộc nhóm nào?",
    "re": "Động vật không xương sống"
  },
  {
    "con": "Nếu một loài thực vật có lá hình kim thì nó thường sống ở đâu?",
    "re": "Khu vực lạnh hoặc khô"
  },
  {
    "con": "Tế bào là đơn vị cơ bản của sự sống?",
    "re": "Đúng, tất cả các sinh vật đều được cấu tạo từ tế bào."
  },
  {
    "con": "Thực vật quang hợp để tạo ra năng lượng?",
    "re": "Đúng, quang hợp giúp thực vật chuyển đổi ánh sáng mặt trời thành năng lượng hóa học."
  },
  {
    "con": "DNA chứa thông tin di truyền?",
    "re": "Đúng, DNA là phân tử mang thông tin di truyền của sinh vật."
  },
  {
    "con": "Các loài động vật có xương sống đều có hệ tuần hoàn kín?",
    "re": "Đúng, động vật có xương sống có hệ tuần hoàn kín để vận chuyển máu."
  },
  {
    "con": "Vi khuẩn là sinh vật đơn bào?",
    "re": "Đúng, vi khuẩn là sinh vật đơn bào và không có nhân tế bào."
  },
  {
    "con": "Sự tiến hóa là quá trình thay đổi của các loài theo thời gian?",
    "re": "Đúng, sự tiến hóa diễn ra thông qua chọn lọc tự nhiên và biến đổi gen."
  },
  {
    "con": "Hệ sinh thái bao gồm các sinh vật và môi trường sống của chúng?",
    "re": "Đúng, hệ sinh thái là sự tương tác giữa sinh vật và môi trường."
  },
  {
    "con": "Protein được tổng hợp từ axit amin?",
    "re": "Đúng, protein là chuỗi dài của axit amin liên kết với nhau."
  },
  {
    "con": "Nước là dung môi quan trọng trong các phản ứng sinh hóa?",
    "re": "Đúng, nước đóng vai trò là dung môi trong nhiều phản ứng sinh hóa."
  },
  {
    "con": "Sự phân hủy là quá trình tái chế chất dinh dưỡng trong môi trường?",
    "re": "Đúng, sự phân hủy giúp tái chế chất dinh dưỡng cho đất và thực vật."
  },
  {
    "con": "Khi nào số lượng cá thể trong quần thể tăng cao?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản,",
    "re": "thì nó có thể truyền gen cho thế hệ sau."
  },
  {
    "con": "Nếu môi trường sống thay đổi đáng kể,",
    "re": "thì quần thể sinh vật có thể bị ảnh hưởng và có thể dẫn đến sự tuyệt chủng."
  },
  {
    "con": "Nếu một loài có nhiều kẻ thù tự nhiên,",
    "re": "thì số lượng cá thể của loài đó có thể giảm."
  },
  {
    "con": "Nếu cây xanh quang hợp hiệu quả,",
    "re": "thì nó sẽ sản xuất nhiều oxy hơn cho môi trường."
  },
  {
    "con": "Nếu một sinh vật có cấu trúc cơ thể thích nghi với môi trường,",
    "re": "thì nó có khả năng sống sót và phát triển tốt hơn."
  },
  {
    "con": "Nếu các tế bào trong cơ thể không hoạt động đúng cách,",
    "re": "thì có thể dẫn đến các bệnh lý."
  },
  {
    "con": "Nếu một loài thực vật không nhận đủ ánh sáng mặt trời,",
    "re": "thì nó sẽ không phát triển tốt và có thể chết."
  },
  {
    "con": "Nếu có sự cạnh tranh giữa các loài trong cùng một môi trường,",
    "re": "thì một số loài có thể bị loại bỏ."
  },
  {
    "con": "Nếu một sinh vật có khả năng tự vệ,",
    "re": "thì nó có thể sống sót lâu hơn trong tự nhiên."
  },
  {
    "con": "Tế bào không có nhân",
    "re": "là tế bào prokaryote"
  },
  {
    "con": "Thực vật có khả năng quang hợp",
    "re": "sẽ sản xuất oxy và glucose"
  },
  {
    "con": "Gen nằm trên nhiễm sắc thể",
    "re": "quy định các đặc điểm di truyền"
  },
  {
    "con": "Nước là dung môi tốt",
    "re": "giúp hòa tan nhiều chất cần thiết cho sự sống"
  },
  {
    "con": "Sự phân bào giảm phân xảy ra",
    "re": "để tạo ra giao tử trong sinh sản hữu tính"
  },
  {
    "con": "Sự tiến hóa diễn ra",
    "re": "khi có sự chọn lọc tự nhiên"
  },
  {
    "con": "Hệ sinh thái có sự tương tác giữa các sinh vật",
    "re": "sẽ duy trì sự cân bằng sinh thái"
  },
  {
    "con": "Protein được tổng hợp từ axit amin",
    "re": "có vai trò quan trọng trong cấu trúc và chức năng tế bào"
  },
  {
    "con": "Vi khuẩn có thể sống trong môi trường khắc nghiệt",
    "re": "cho thấy khả năng thích nghi của chúng"
  },
  {
    "con": "Sự phân loại sinh vật dựa trên đặc điểm di truyền",
    "re": "giúp hiểu rõ mối quan hệ tiến hóa giữa các loài"
  },
  {
    "con": "Tháp tuổi không có dạng nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Những dạng năng lượng nào sau đây là năng lượng sạch?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào có nhân được gọi là gì?",
    "re": "Eukaryote"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn, thì nó được gọi là gì?",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài động vật sống trong môi trường nước, thì nó được gọi là gì?",
    "re": "Động vật thủy sinh"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc tế bào đơn giản, thì nó thuộc nhóm nào?",
    "re": "Prokaryote"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó thuộc nhóm nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có khả năng di chuyển và tiêu thụ thức ăn từ môi trường, thì nó được gọi là gì?",
    "re": "Động vật"
  },
  {
    "con": "Nếu một loài vi khuẩn có khả năng sống trong điều kiện khắc nghiệt, thì nó được gọi là gì?",
    "re": "Vi khuẩn cực đoan"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản vô tính, thì nó có thể tạo ra con cái mà không cần gì?",
    "re": "Cần một cá thể khác"
  },
  {
    "con": "Nếu một loài động vật có vú, thì nó có đặc điểm gì nổi bật?",
    "re": "Có tuyến sữa"
  },
  {
    "con": "Một dãy gồm nhiều loài sinh vật có quan hệ dinh dưỡng với nhau. Mỗi loài là một mắt xích vừa tiêu thụ mắt xích trước, nó vừa bị mắt xích sau nó tiêu thụ. Dãy các loài sinh vật trên được gọi là gì?",
    "re": "Chuỗi thức ăn"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn thông qua quá trình quang hợp, thì sinh vật đó được gọi là gì?",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một sinh vật không thể tự sản xuất thức ăn và phải tiêu thụ sinh vật khác để sống, thì sinh vật đó được gọi là gì?",
    "re": "Sinh vật dị dưỡng"
  },
  {
    "con": "Nếu một tế bào có nhân và các bào quan được bao bọc bởi màng, thì tế bào đó thuộc loại nào?",
    "re": "Tế bào eukaryote"
  },
  {
    "con": "Nếu một loài sinh vật có khả năng thích nghi với môi trường sống của nó qua nhiều thế hệ, thì hiện tượng này được gọi là gì?",
    "re": "Tiến hóa"
  },
  {
    "con": "Nếu một loài sinh vật có cấu trúc di truyền giống nhau và có khả năng sinh sản với nhau, thì nhóm sinh vật đó được gọi là gì?",
    "re": "Loài"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong môi trường khắc nghiệt như sa mạc hoặc vùng cực, thì sinh vật đó được gọi là gì?",
    "re": "Sinh vật thích nghi"
  },
  {
    "con": "Nếu một loài sinh vật có vai trò quan trọng trong việc duy trì sự cân bằng sinh thái của một hệ sinh thái, thì loài đó được gọi là gì?",
    "re": "Loài chỉ thị"
  },
  {
    "con": "Nếu một quá trình sinh học diễn ra trong tế bào để chuyển đổi glucose thành năng lượng, thì quá trình đó được gọi là gì?",
    "re": "Hô hấp tế bào"
  },
  {
    "con": "Nếu một loài sinh vật có cấu trúc cơ thể được phân chia thành nhiều phần tương tự nhau, thì loài đó thuộc nhóm nào?",
    "re": "Đối xứng tỏa tròn"
  },
  {
    "con": "Cách sống của con người trong thời kỳ nguyên thủy như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Thực vật quang hợp như thế nào?",
    "re": "Chúng sử dụng ánh sáng mặt trời để chuyển đổi carbon dioxide và nước thành glucose và oxy."
  },
  {
    "con": "Các tế bào động vật và thực vật khác nhau ở điểm nào?",
    "re": "Tế bào thực vật có thành tế bào và lục lạp, trong khi tế bào động vật không có."
  },
  {
    "con": "Sự tiến hóa của các loài diễn ra như thế nào?",
    "re": "Thông qua quá trình chọn lọc tự nhiên, các loài thích nghi với môi trường sống của chúng."
  },
  {
    "con": "Chức năng của DNA trong tế bào là gì?",
    "re": "DNA chứa thông tin di truyền cần thiết cho sự phát triển và chức năng của sinh vật."
  },
  {
    "con": "Hệ sinh thái bao gồm những thành phần nào?",
    "re": "Hệ sinh thái bao gồm các sinh vật sống và môi trường sống của chúng, tương tác với nhau."
  },
  {
    "con": "Quá trình tiêu hóa thức ăn diễn ra như thế nào?",
    "re": "Thức ăn được phân hủy thành các chất dinh dưỡng mà cơ thể có thể hấp thụ."
  },
  {
    "con": "Vai trò của vi khuẩn trong môi trường là gì?",
    "re": "Vi khuẩn giúp phân hủy chất hữu cơ và tái chế các chất dinh dưỡng trong đất."
  },
  {
    "con": "Sự phân chia tế bào diễn ra như thế nào?",
    "re": "Sự phân chia tế bào diễn ra qua quá trình nguyên phân và giảm phân."
  },
  {
    "con": "Tại sao nước là yếu tố quan trọng cho sự sống?",
    "re": "Nước là dung môi cho nhiều phản ứng hóa học và cần thiết cho sự sống của tất cả các sinh vật."
  },
  {
    "con": "Hệ sinh thái là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào là đơn vị cơ bản của sự sống?",
    "re": "Đúng"
  },
  {
    "con": "Quá trình quang hợp xảy ra ở thực vật?",
    "re": "Đúng"
  },
  {
    "con": "DNA chứa thông tin di truyền?",
    "re": "Đúng"
  },
  {
    "con": "Sự tiến hóa là quá trình thay đổi của các loài theo thời gian?",
    "re": "Đúng"
  },
  {
    "con": "Nước là thành phần chính của tế bào?",
    "re": "Đúng"
  },
  {
    "con": "Các sinh vật sống cần năng lượng để tồn tại?",
    "re": "Đúng"
  },
  {
    "con": "Hệ tuần hoàn vận chuyển oxy và chất dinh dưỡng trong cơ thể?",
    "re": "Đúng"
  },
  {
    "con": "Vi khuẩn là sinh vật đơn bào?",
    "re": "Đúng"
  },
  {
    "con": "Sự phân hủy là quá trình tái chế chất dinh dưỡng trong môi trường?",
    "re": "Đúng"
  },
  {
    "con": "Tự thụ phấn bắt buộc ở thực vật và giao phối gần ở động vật qua nhiều thế hệ sẽ dẫn đến hiện tượng thoái hoá giống vì",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Năng lượng từ mặt trời được thực vật hấp thụ qua quá trình quang hợp sẽ tạo ra oxy và glucose vì",
    "re": "Đây là nguồn năng lượng chính cho hầu hết các sinh vật trên Trái Đất"
  },
  {
    "con": "Sự phân chia tế bào qua mitosis sẽ tạo ra hai tế bào con giống hệt nhau vì",
    "re": "Điều này giúp duy trì số lượng nhiễm sắc thể trong sinh vật"
  },
  {
    "con": "Sự di truyền tính trạng từ cha mẹ sang con cái thông qua gen sẽ dẫn đến sự đa dạng di truyền trong quần thể vì",
    "re": "Điều này giúp sinh vật thích nghi với môi trường"
  },
  {
    "con": "Sự tương tác giữa các sinh vật trong một hệ sinh thái sẽ ảnh hưởng đến sự sống còn của chúng vì",
    "re": "Mỗi sinh vật đều đóng vai trò quan trọng trong chuỗi thức ăn"
  },
  {
    "con": "Sự thay đổi môi trường sống sẽ ảnh hưởng đến sự phân bố của các loài sinh vật vì",
    "re": "Sinh vật cần điều kiện sống phù hợp để tồn tại và phát triển"
  },
  {
    "con": "Quá trình tiến hóa diễn ra qua hàng triệu năm sẽ dẫn đến sự hình thành các loài mới vì",
    "re": "Sự chọn lọc tự nhiên tác động lên các đặc điểm di truyền"
  },
  {
    "con": "Sự hấp thụ nước và khoáng chất từ đất qua rễ cây sẽ giúp cây phát triển khỏe mạnh vì",
    "re": "Nước và khoáng chất là yếu tố cần thiết cho quá trình quang hợp và sinh trưởng"
  },
  {
    "con": "Sự phân hủy chất hữu cơ bởi vi sinh vật sẽ tái tạo dinh dưỡng cho đất vì",
    "re": "Điều này giúp duy trì sự cân bằng trong hệ sinh thái"
  },
  {
    "con": "Sự tương tác giữa các loài trong một chuỗi thức ăn sẽ tạo ra sự cân bằng sinh thái vì",
    "re": "Mỗi loài đều có vai trò riêng trong việc duy trì hệ sinh thái"
  },
  {
    "con": "Trong chăn nuôi người ta thường đem lợn ỉ Móng Cái lai với lợn Đại Bạch để tạo ra thế hệ con tăng trọng nhanh, tỉ lệ thịt nạc cao. Phép lai trên được gọi là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu thực vật không nhận đủ ánh sáng mặt trời thì",
    "re": "quá trình quang hợp sẽ bị giảm sút"
  },
  {
    "con": "Nếu một loài động vật bị mất môi trường sống thì",
    "re": "sự sinh sản và tồn tại của loài đó sẽ bị đe dọa"
  },
  {
    "con": "Nếu tế bào không có màng tế bào thì",
    "re": "tế bào sẽ không thể duy trì cấu trúc và chức năng"
  },
  {
    "con": "Nếu một loài thực vật có hoa màu sắc rực rỡ thì",
    "re": "nó có khả năng thu hút côn trùng thụ phấn cao hơn"
  },
  {
    "con": "Nếu nhiệt độ môi trường tăng cao thì",
    "re": "nhiều loài động vật có thể gặp khó khăn trong việc duy trì nhiệt độ cơ thể"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn thì",
    "re": "nó được gọi là sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài vi khuẩn có khả năng kháng thuốc thì",
    "re": "nó có thể sống sót và phát triển ngay cả khi có sự hiện diện của kháng sinh"
  },
  {
    "con": "Nếu một loài động vật có cấu trúc cơ thể thích nghi với môi trường sống của nó thì",
    "re": "nó có khả năng sinh tồn cao hơn trong điều kiện tự nhiên"
  },
  {
    "con": "Nếu một sinh vật có hệ thống tuần hoàn mở thì",
    "re": "máu sẽ không chỉ lưu thông trong các mạch mà còn chảy tự do trong khoang cơ thể"
  },
  {
    "con": "Cơ sở khoa học (di truyền) của hiện tượng ưu thế lai là gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào được cấu tạo từ các thành phần nào?",
    "re": "Tế bào được cấu tạo từ màng tế bào, chất tế bào và nhân tế bào."
  },
  {
    "con": "Quá trình quang hợp diễn ra ở đâu trong tế bào thực vật?",
    "re": "Quá trình quang hợp diễn ra ở lục lạp."
  },
  {
    "con": "Nếu một sinh vật có 2 alen giống nhau cho một gen thì nó được gọi là gì?",
    "re": "Sinh vật đó được gọi là đồng hợp tử."
  },
  {
    "con": "Nếu một sinh vật có 2 alen khác nhau cho một gen thì nó được gọi là gì?",
    "re": "Sinh vật đó được gọi là dị hợp tử."
  },
  {
    "con": "Hệ thống phân loại sinh vật được chia thành những cấp nào?",
    "re": "Hệ thống phân loại sinh vật được chia thành các cấp: Vương quốc, Ngành, Lớp, Bộ, Họ, Giống, Loài."
  },
  {
    "con": "Nếu một loài sinh vật có khả năng sinh sản và tạo ra thế hệ mới thì nó được coi là gì?",
    "re": "Loài sinh vật đó được coi là có khả năng sinh sản."
  },
  {
    "con": "Chức năng chính của DNA trong tế bào là gì?",
    "re": "Chức năng chính của DNA là lưu trữ và truyền đạt thông tin di truyền."
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước thì nó có thể có đặc điểm gì?",
    "re": "Sinh vật đó có thể có các đặc điểm như vây, mang hoặc lớp da ẩm."
  },
  {
    "con": "Quá trình phân bào giảm phân xảy ra trong loại tế bào nào?",
    "re": "Quá trình phân bào giảm phân xảy ra trong tế bào sinh dục."
  },
  {
    "con": "Quần thể người có đặc trưng nào sau đây khác so với quần thể sinh vật?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào thực vật có thành tế bào, trong khi tế bào động vật không có thành tế bào.",
    "re": "Tế bào thực vật và tế bào động vật có cấu trúc khác nhau"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản, thì nó có thể truyền gen cho thế hệ sau.",
    "re": "Sinh vật đó có vai trò trong quá trình tiến hóa"
  },
  {
    "con": "Nếu một loài động vật sống trong môi trường nước, thì nó có thể có các đặc điểm thích nghi như mang hoặc vây.",
    "re": "Đặc điểm thích nghi giúp sinh vật tồn tại trong môi trường sống"
  },
  {
    "con": "Nếu một sinh vật thuộc nhóm động vật có xương sống, thì nó có hệ thống xương và tủy sống.",
    "re": "Động vật có xương sống có cấu trúc cơ thể phức tạp hơn"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó có khả năng sinh sản hữu tính.",
    "re": "Sinh sản hữu tính giúp tạo ra sự đa dạng di truyền"
  },
  {
    "con": "Nếu một sinh vật có khả năng quang hợp, thì nó có thể chuyển đổi ánh sáng mặt trời thành năng lượng.",
    "re": "Quá trình quang hợp là nguồn năng lượng cho nhiều sinh vật khác"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường khô hạn, thì nó có thể có các đặc điểm như lá nhỏ hoặc thân mọng nước.",
    "re": "Đặc điểm này giúp sinh vật tiết kiệm nước"
  },
  {
    "con": "Nếu một sinh vật có hệ tiêu hóa phức tạp, thì nó có thể tiêu hóa nhiều loại thức ăn khác nhau.",
    "re": "Hệ tiêu hóa phức tạp giúp sinh vật có chế độ ăn đa dạng"
  },
  {
    "con": "Nếu một loài động vật có khả năng di cư, thì nó có thể tìm kiếm nguồn thức ăn hoặc môi trường sống tốt hơn.",
    "re": "Di cư là một chiến lược sinh tồn trong tự nhiên"
  },
  {
    "con": "Cá chép có giới hạn chịu đựng về nhiệt độ là: 2°C đến 44°C, điểm cực thuận là 28°C. Cá rô phi có giới hạn chịu đựng về nhiệt độ là: 5°C đến 42°C, điểm cực thuận là 30°C. Nhận định nào sau đây là đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn thông qua quang hợp, thì nó được gọi là thực vật.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tế bào có nhân và các bào quan, thì nó được gọi là tế bào eukaryote.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một loài động vật có xương sống, thì nó thuộc vào nhóm động vật có xương.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản vô tính, thì nó có thể tạo ra con cái mà không cần sự tham gia của bạn tình.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó thuộc vào nhóm thực vật hạt kín.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng thích nghi với môi trường sống của nó, thì nó có khả năng sống sót và phát triển.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một loài động vật có khả năng di cư theo mùa, thì nó có thể tìm kiếm nguồn thức ăn hoặc môi trường sống tốt hơn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có hệ thống tuần hoàn mở, thì máu không hoàn toàn nằm trong mạch máu.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một loài vi khuẩn có khả năng sống trong môi trường cực kỳ khắc nghiệt, thì nó được gọi là vi khuẩn cực đoan.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Quan hệ giữa hai loài sinh vật, trong đó một bên có lợi còn bên kia không có có lợi và cũng không có hại gì, mối quan hệ đó được gọi là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào có nhân và các bào quan được bao bọc bởi màng, loại tế bào này được gọi là",
    "re": "Tế bào eukaryote"
  },
  {
    "con": "Quá trình chuyển đổi ánh sáng mặt trời thành năng lượng hóa học trong thực vật diễn ra ở",
    "re": "Lá cây"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời, sinh vật đó được gọi là",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài động vật ăn thực vật, loài động vật đó được gọi là",
    "re": "Sinh vật ăn cỏ"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước và có khả năng hô hấp qua mang, sinh vật đó được gọi là",
    "re": "Động vật thủy sinh"
  },
  {
    "con": "Nếu một loài sinh vật có cấu trúc cơ thể phân chia thành nhiều phần giống nhau, loài đó được gọi là",
    "re": "Động vật đối xứng tỏa tròn"
  },
  {
    "con": "Nếu một loài thực vật có hoa và hạt, loài đó được gọi là",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong điều kiện khắc nghiệt, sinh vật đó được gọi là",
    "re": "Sinh vật cực đoan"
  },
  {
    "con": "Nếu một loài vi khuẩn có khả năng sống trong môi trường không có oxy, loài đó được gọi là",
    "re": "Vi khuẩn kỵ khí"
  },
  {
    "con": "Mật độ của quần thể tăng cao khi",
    "re": "cạnh tranh về tài nguyên gia tăng"
  },
  {
    "con": "Năng lượng trong một chuỗi thức ăn giảm dần khi",
    "re": "di chuyển từ cấp độ sinh vật sản xuất lên cấp độ sinh vật tiêu thụ"
  },
  {
    "con": "Sự phân chia tế bào xảy ra khi",
    "re": "tế bào cần phát triển hoặc sửa chữa"
  },
  {
    "con": "Quá trình quang hợp xảy ra khi",
    "re": "có ánh sáng mặt trời, nước và carbon dioxide"
  },
  {
    "con": "Gen di truyền được truyền từ cha mẹ sang con cái khi",
    "re": "các tế bào sinh dục kết hợp trong quá trình thụ tinh"
  },
  {
    "con": "Sự tiến hóa của loài xảy ra khi",
    "re": "có sự chọn lọc tự nhiên và biến đổi di truyền"
  },
  {
    "con": "Hệ sinh thái có thể bị ảnh hưởng khi",
    "re": "có sự thay đổi về khí hậu hoặc môi trường sống"
  },
  {
    "con": "Sự đa dạng sinh học giảm khi",
    "re": "các loài bị tuyệt chủng hoặc môi trường sống bị phá hủy"
  },
  {
    "con": "Chức năng của hệ tuần hoàn là",
    "re": "vận chuyển oxy và chất dinh dưỡng đến các tế bào"
  },
  {
    "con": "Sự hấp thụ nước và khoáng chất xảy ra chủ yếu ở",
    "re": "rễ của cây"
  },
  {
    "con": "Một quần thể chim sẻ có số lượng cá thể ở các nhóm tuổi như sau:\n- Nhóm tuổi trước sinh sản: 53 con/ha.\n- Nhóm tuổi sinh sản: 29 con/ha.\n- Nhóm tuổi sau sinh sản: 17 con/ha.\nBiểu đồ tháp tuổi của quần thể này đang ở dạng tháp",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tế bào thực vật có chứa lục lạp và thành tế bào",
    "re": "Thì tế bào đó có khả năng thực hiện quang hợp"
  },
  {
    "con": "Nếu một loài động vật có hệ tiêu hóa phức tạp với nhiều bộ phận khác nhau",
    "re": "Thì loài đó có khả năng tiêu hóa nhiều loại thức ăn khác nhau"
  },
  {
    "con": "Nếu một quần thể sinh vật có tỷ lệ sinh sản cao hơn tỷ lệ tử vong",
    "re": "Thì quần thể đó sẽ có xu hướng tăng trưởng về số lượng"
  },
  {
    "con": "Nếu một loài thực vật sống trong môi trường khô hạn",
    "re": "Thì loài đó có thể phát triển các đặc điểm thích nghi như lá nhỏ hoặc thân mọng nước"
  },
  {
    "con": "Nếu một sinh vật có ADN chứa thông tin di truyền",
    "re": "Thì sinh vật đó có khả năng truyền đạt đặc điểm di truyền cho thế hệ sau"
  },
  {
    "con": "Nếu một sinh vật có mối quan hệ tương hỗ với loài khác",
    "re": "Thì cả hai loài có thể nhận được lợi ích từ sự tương tác này"
  },
  {
    "con": "Nếu một quần thể sinh vật bị tách rời khỏi môi trường sống ban đầu",
    "re": "Thì quần thể đó có thể phát triển thành một loài mới qua quá trình tiến hóa"
  },
  {
    "con": "Nếu một loài động vật có khả năng di cư theo mùa",
    "re": "Thì loài đó có thể tìm kiếm nguồn thức ăn và môi trường sống tốt hơn"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc cơ thể đối xứng",
    "re": "Thì sinh vật đó có thể di chuyển một cách hiệu quả hơn trong môi trường sống của nó"
  },
  {
    "con": "Lưới thức ăn là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào là đơn vị cơ bản của sự sống",
    "re": "Tất cả sinh vật đều được cấu tạo từ tế bào"
  },
  {
    "con": "Quá trình quang hợp xảy ra ở thực vật",
    "re": "Thực vật sản xuất ra oxy và glucose"
  },
  {
    "con": "DNA chứa thông tin di truyền",
    "re": "DNA quyết định đặc điểm của sinh vật"
  },
  {
    "con": "Hệ sinh thái bao gồm các sinh vật và môi trường sống của chúng",
    "re": "Hệ sinh thái duy trì sự cân bằng sinh học"
  },
  {
    "con": "Sự tiến hóa xảy ra qua quá trình chọn lọc tự nhiên",
    "re": "Các loài thích nghi với môi trường sẽ tồn tại lâu hơn"
  },
  {
    "con": "Protein được tổng hợp từ axit amin",
    "re": "Protein đóng vai trò quan trọng trong cấu trúc và chức năng tế bào"
  },
  {
    "con": "Nước là dung môi quan trọng trong các phản ứng sinh hóa",
    "re": "Nước giúp duy trì sự sống cho tất cả sinh vật"
  },
  {
    "con": "Vi khuẩn có thể sống trong nhiều môi trường khác nhau",
    "re": "Vi khuẩn có vai trò quan trọng trong chu trình dinh dưỡng"
  },
  {
    "con": "Sự phân bào là quá trình tế bào nhân đôi",
    "re": "Phân bào giúp sinh sản và phát triển của sinh vật"
  },
  {
    "con": "Quá trình quang hợp diễn ra ở thực vật xanh:",
    "re": "Thực vật sản xuất oxy và glucose"
  },
  {
    "con": "Tế bào là đơn vị cấu trúc và chức năng cơ bản của sự sống:",
    "re": "Tất cả sinh vật đều được cấu tạo từ tế bào"
  },
  {
    "con": "Di truyền học nghiên cứu cách thức truyền đạt đặc điểm từ thế hệ này sang thế hệ khác:",
    "re": "Gen là đơn vị di truyền chính"
  },
  {
    "con": "Hệ sinh thái bao gồm các sinh vật sống và môi trường sống của chúng:",
    "re": "Các yếu tố sinh thái tương tác với nhau"
  },
  {
    "con": "Sự tiến hóa là quá trình thay đổi của các loài theo thời gian:",
    "re": "Các loài thích nghi với môi trường sống của chúng"
  },
  {
    "con": "Nước là thành phần thiết yếu cho sự sống:",
    "re": "Nước tham gia vào nhiều phản ứng sinh hóa trong tế bào"
  },
  {
    "con": "Các loài động vật có xương sống và không xương sống có cấu trúc cơ thể khác nhau:",
    "re": "Động vật có xương sống thường có hệ thống xương và nội tạng phức tạp hơn"
  },
  {
    "con": "Vi khuẩn là sinh vật đơn bào nhỏ bé:",
    "re": "Chúng có thể sống trong nhiều môi trường khác nhau"
  },
  {
    "con": "Sự phân hủy là quá trình phân giải chất hữu cơ thành các chất đơn giản hơn:",
    "re": "Nó giúp tái chế chất dinh dưỡng trong hệ sinh thái"
  },
  {
    "con": "Sự tương tác giữa các loài trong một hệ sinh thái có thể là cạnh tranh hoặc hợp tác:",
    "re": "Điều này ảnh hưởng đến sự tồn tại và phát triển của các loài"
  },
  {
    "con": "Ô nhiễm môi trường là hiện tượng môi trường tự nhiên bị bẩn:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tài nguyên nào sau đây thuộc tài nguyên không tái sinh?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sinh vật có tế bào nhân thực?",
    "re": "Nó có cấu trúc phức tạp hơn tế bào nhân sơ"
  },
  {
    "con": "Năng lượng trong một chuỗi thức ăn được truyền từ sinh vật này sang sinh vật khác?",
    "re": "Mỗi cấp độ sẽ mất đi một phần năng lượng do tiêu hao"
  },
  {
    "con": "Một loài động vật có khả năng thích nghi với môi trường sống của nó?",
    "re": "Nó có thể sống sót và sinh sản tốt hơn"
  },
  {
    "con": "Sự phân chia tế bào xảy ra trong quá trình sinh sản vô tính?",
    "re": "Tạo ra các tế bào con giống hệt tế bào mẹ"
  },
  {
    "con": "Một loài thực vật có hoa?",
    "re": "Nó thuộc về nhóm thực vật có hạt"
  },
  {
    "con": "Một sinh vật có khả năng quang hợp?",
    "re": "Nó có thể chuyển đổi ánh sáng mặt trời thành năng lượng hóa học"
  },
  {
    "con": "Một loài động vật có xương sống?",
    "re": "Nó thuộc về nhóm động vật có cấu trúc xương"
  },
  {
    "con": "Một sinh vật sống trong môi trường nước?",
    "re": "Nó có thể có các đặc điểm thích nghi như mang hoặc vây"
  },
  {
    "con": "Một tế bào có ADN?",
    "re": "Nó có thông tin di truyền cần thiết cho sự phát triển và chức năng"
  },
  {
    "con": "Tế bào là đơn vị cơ bản của sự sống",
    "re": "Tất cả sinh vật đều được cấu tạo từ tế bào"
  },
  {
    "con": "Quá trình quang hợp diễn ra ở thực vật",
    "re": "Thực vật sản xuất ra oxy và glucose"
  },
  {
    "con": "DNA chứa thông tin di truyền",
    "re": "DNA quyết định đặc điểm của sinh vật"
  },
  {
    "con": "Sự tiến hóa xảy ra qua thời gian dài",
    "re": "Các loài có thể thay đổi để thích nghi với môi trường"
  },
  {
    "con": "Hệ sinh thái bao gồm các sinh vật và môi trường sống của chúng",
    "re": "Các yếu tố sinh học và phi sinh học tương tác với nhau"
  },
  {
    "con": "Protein được tổng hợp từ axit amin",
    "re": "Protein thực hiện nhiều chức năng quan trọng trong cơ thể"
  },
  {
    "con": "Nước là thành phần thiết yếu cho sự sống",
    "re": "Nước tham gia vào nhiều phản ứng sinh hóa trong tế bào"
  },
  {
    "con": "Sự phân chia tế bào là cần thiết cho sự phát triển",
    "re": "Phân chia tế bào giúp tạo ra tế bào mới"
  },
  {
    "con": "Các loài động vật có thể có mối quan hệ tương tác",
    "re": "Mối quan hệ này có thể là cộng sinh, cạnh tranh hoặc ký sinh"
  },
  {
    "con": "Thực vật có thể hấp thụ ánh sáng mặt trời",
    "re": "Ánh sáng mặt trời là nguồn năng lượng cho quá trình quang hợp"
  },
  {
    "con": "Quá trình quang hợp diễn ra ở thực vật xanh, vì:",
    "re": "thực vật sử dụng ánh sáng mặt trời để chuyển đổi carbon dioxide và nước thành glucose và oxy"
  },
  {
    "con": "Nếu tế bào không có nhân, thì:",
    "re": "đó là tế bào prokaryote, như vi khuẩn"
  },
  {
    "con": "Nếu một loài động vật có cấu trúc cơ thể tương tự với loài khác, thì:",
    "re": "có thể chúng có nguồn gốc chung trong quá trình tiến hóa"
  },
  {
    "con": "Nếu môi trường sống thay đổi, thì:",
    "re": "các loài sinh vật có thể phải thích nghi hoặc di cư để sống sót"
  },
  {
    "con": "Nếu một gen bị đột biến, thì:",
    "re": "nó có thể dẫn đến sự thay đổi trong đặc điểm của sinh vật"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản cao, thì:",
    "re": "nó có thể góp phần vào sự gia tăng dân số của loài đó"
  },
  {
    "con": "Nếu một loài thực vật không nhận đủ ánh sáng, thì:",
    "re": "nó có thể không phát triển tốt và sản xuất ít năng lượng hơn"
  },
  {
    "con": "Nếu một sinh vật là động vật ăn thịt, thì:",
    "re": "nó sẽ săn bắt và tiêu thụ các sinh vật khác để lấy năng lượng"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, thì:",
    "re": "nó có thể có các đặc điểm thích nghi như mang hoặc vây để hỗ trợ cho việc di chuyển và hô hấp"
  },
  {
    "con": "Nếu một loài động vật có bộ gen đa dạng, thì:",
    "re": "nó có khả năng thích nghi tốt hơn với các thay đổi trong môi trường"
  },
  {
    "con": "Tế bào là đơn vị cơ bản của sự sống",
    "re": "Tất cả sinh vật đều được cấu tạo từ tế bào"
  },
  {
    "con": "Năng lượng trong hệ sinh thái được truyền từ sinh vật này sang sinh vật khác",
    "re": "Các chuỗi thức ăn mô tả cách năng lượng di chuyển trong tự nhiên"
  },
  {
    "con": "Thực vật quang hợp sử dụng ánh sáng mặt trời",
    "re": "Chúng chuyển đổi carbon dioxide và nước thành glucose và oxy"
  },
  {
    "con": "Gen là đơn vị di truyền",
    "re": "Chúng quyết định các đặc điểm di truyền của sinh vật"
  },
  {
    "con": "Sự tiến hóa xảy ra qua quá trình chọn lọc tự nhiên",
    "re": "Các cá thể thích nghi tốt hơn sẽ có khả năng sinh sản cao hơn"
  },
  {
    "con": "Hệ tuần hoàn vận chuyển máu trong cơ thể",
    "re": "Nó cung cấp oxy và chất dinh dưỡng cho các tế bào"
  },
  {
    "con": "Vi khuẩn có thể sống trong nhiều môi trường khác nhau",
    "re": "Chúng có thể tồn tại trong đất, nước, và thậm chí trong cơ thể sinh vật khác"
  },
  {
    "con": "Sự phân hủy là quá trình quan trọng trong hệ sinh thái",
    "re": "Nó giúp tái chế chất dinh dưỡng và duy trì sự cân bằng sinh thái"
  },
  {
    "con": "Các loài động vật có xương sống và không xương sống có cấu trúc cơ thể khác nhau",
    "re": "Điều này ảnh hưởng đến cách chúng di chuyển và sinh tồn"
  },
  {
    "con": "Sự tương tác giữa các sinh vật trong một hệ sinh thái là rất đa dạng",
    "re": "Chúng bao gồm cạnh tranh, hợp tác và ký sinh"
  },
  {
    "con": "Các tác nhân vật lý gây đột biến nhân tạo là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là một thành phần thiết yếu trong tế bào sống,",
    "re": "tế bào sẽ không thể duy trì các chức năng sống cơ bản."
  },
  {
    "con": "Nếu một sinh vật không có khả năng tự sản xuất thức ăn,",
    "re": "nó sẽ phải phụ thuộc vào các sinh vật khác để tồn tại."
  },
  {
    "con": "Nếu DNA bị tổn thương và không được sửa chữa,",
    "re": "sinh vật có thể phát triển các bệnh di truyền hoặc ung thư."
  },
  {
    "con": "Nếu một loài động vật sống trong môi trường khô hạn,",
    "re": "nó sẽ phát triển các đặc điểm thích nghi để tiết kiệm nước."
  },
  {
    "con": "Nếu một tế bào phân chia không đúng cách,",
    "re": "nó có thể dẫn đến sự hình thành khối u."
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản nhanh chóng,",
    "re": "nó có thể chiếm ưu thế trong môi trường cạnh tranh."
  },
  {
    "con": "Nếu một loài thực vật không nhận đủ ánh sáng mặt trời,",
    "re": "nó sẽ không thể thực hiện quá trình quang hợp hiệu quả."
  },
  {
    "con": "Nếu một sinh vật có hệ miễn dịch yếu,",
    "re": "nó sẽ dễ bị nhiễm bệnh hơn so với các sinh vật khác."
  },
  {
    "con": "Nếu môi trường sống của một loài bị thay đổi nhanh chóng,",
    "re": "loài đó có thể bị đe dọa đến sự tồn tại."
  },
  {
    "con": "Tế bào là đơn vị cơ bản của sự sống",
    "re": "Tất cả sinh vật đều được cấu tạo từ tế bào"
  },
  {
    "con": "Năng lượng trong hệ sinh thái được truyền từ sinh vật này sang sinh vật khác",
    "re": "Năng lượng giảm dần khi di chuyển lên các bậc thang thức ăn"
  },
  {
    "con": "Quá trình quang hợp xảy ra ở thực vật",
    "re": "Thực vật chuyển đổi ánh sáng mặt trời thành năng lượng hóa học"
  },
  {
    "con": "Di truyền gen từ cha mẹ sang con cái",
    "re": "Con cái sẽ có những đặc điểm di truyền từ cả cha và mẹ"
  },
  {
    "con": "Mỗi loài sinh vật có một môi trường sống riêng",
    "re": "Môi trường sống ảnh hưởng đến sự phát triển và sinh trưởng của loài đó"
  },
  {
    "con": "Sự tiến hóa xảy ra qua thời gian dài",
    "re": "Các loài sinh vật có thể thay đổi để thích nghi với môi trường"
  },
  {
    "con": "Protein được tổng hợp từ axit amin",
    "re": "Protein đóng vai trò quan trọng trong cấu trúc và chức năng của tế bào"
  },
  {
    "con": "Hệ tuần hoàn vận chuyển máu trong cơ thể",
    "re": "Máu mang oxy và chất dinh dưỡng đến các tế bào"
  },
  {
    "con": "Sự phân hủy chất hữu cơ bởi vi sinh vật",
    "re": "Vi sinh vật giúp tái chế chất dinh dưỡng trong môi trường"
  },
  {
    "con": "Sự tương tác giữa các loài trong một hệ sinh thái",
    "re": "Tương tác này có thể là cạnh tranh, hợp tác hoặc ăn thịt"
  },
  {
    "con": "Theo nghĩa đúng nhất, môi trường sống của sinh vật là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời,",
    "re": "thì nó được gọi là sinh vật tự dưỡng."
  },
  {
    "con": "Nếu tế bào không có nhân,",
    "re": "thì nó được gọi là tế bào prokaryote."
  },
  {
    "con": "Nếu một loài sinh vật có khả năng thích nghi với môi trường sống của nó,",
    "re": "thì nó có khả năng sống sót và phát triển tốt hơn."
  },
  {
    "con": "Nếu quá trình quang hợp diễn ra,",
    "re": "thì cây xanh sẽ sản xuất oxy và glucose."
  },
  {
    "con": "Nếu một sinh vật thuộc nhóm động vật có xương sống,",
    "re": "thì nó có cấu trúc xương và hệ thần kinh phát triển."
  },
  {
    "con": "Nếu một loài sinh vật bị đe dọa tuyệt chủng,",
    "re": "thì nó cần được bảo vệ và bảo tồn."
  },
  {
    "con": "Nếu một tế bào phân chia qua quá trình nguyên phân,",
    "re": "thì nó tạo ra hai tế bào con giống hệt nhau."
  },
  {
    "con": "Nếu một sinh vật có hệ tiêu hóa phức tạp,",
    "re": "thì nó có khả năng tiêu hóa nhiều loại thức ăn khác nhau."
  },
  {
    "con": "Nếu một loài sinh vật có đặc điểm di truyền từ cha mẹ,",
    "re": "thì nó sẽ truyền lại những đặc điểm đó cho thế hệ sau."
  },
  {
    "con": "Tế bào là đơn vị cơ bản của sự sống",
    "re": "Tất cả sinh vật đều được cấu tạo từ tế bào"
  },
  {
    "con": "Năng lượng từ ánh sáng mặt trời được thực vật hấp thụ",
    "re": "Thực vật có khả năng quang hợp để sản xuất thức ăn"
  },
  {
    "con": "Mỗi loài sinh vật đều có bộ gen riêng",
    "re": "Bộ gen quyết định các đặc điểm di truyền của sinh vật"
  },
  {
    "con": "Sự phân chia tế bào diễn ra trong quá trình sinh sản",
    "re": "Tế bào mới được tạo ra từ tế bào mẹ"
  },
  {
    "con": "Môi trường sống ảnh hưởng đến sự phát triển của sinh vật",
    "re": "Sinh vật có thể thay đổi hành vi hoặc hình thái để thích nghi"
  },
  {
    "con": "Các loài động vật có thể phân loại theo chế độ ăn",
    "re": "Động vật có thể là động vật ăn thịt, ăn cỏ hoặc ăn tạp"
  },
  {
    "con": "Vi khuẩn có thể sống trong nhiều môi trường khác nhau",
    "re": "Vi khuẩn có thể tồn tại trong điều kiện khắc nghiệt"
  },
  {
    "con": "Sự tiến hóa xảy ra qua nhiều thế hệ",
    "re": "Các đặc điểm có lợi sẽ được truyền lại cho thế hệ sau"
  },
  {
    "con": "Hệ sinh thái bao gồm các sinh vật và môi trường sống của chúng",
    "re": "Các sinh vật tương tác với nhau và với môi trường xung quanh"
  },
  {
    "con": "Sự trao đổi chất là quá trình chuyển hóa năng lượng trong cơ thể",
    "re": "Sự trao đổi chất cần thiết cho sự sống và phát triển của sinh vật"
  },
  {
    "con": "Nhóm cây nào sau đây đều thuộc nhóm cây ưa sáng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có tế bào nhân thực, thì nó thuộc nhóm nào?",
    "re": "Nó thuộc nhóm động vật hoặc thực vật"
  },
  {
    "con": "Nếu một loài động vật có xương sống, thì nó thuộc nhóm nào?",
    "re": "Nó thuộc nhóm động vật có xương sống"
  },
  {
    "con": "Nếu một tế bào có màng tế bào, thì nó có thể là tế bào của sinh vật nào?",
    "re": "Nó có thể là tế bào của cả thực vật và động vật"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó thuộc nhóm nào?",
    "re": "Nó thuộc nhóm thực vật có hoa"
  },
  {
    "con": "Nếu một sinh vật có khả năng quang hợp, thì nó thuộc nhóm nào?",
    "re": "Nó thuộc nhóm thực vật"
  },
  {
    "con": "Nếu một loài động vật có lông và sinh sản bằng cách đẻ con, thì nó thuộc nhóm nào?",
    "re": "Nó thuộc nhóm động vật có vú"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, thì nó có thể là loại nào?",
    "re": "Nó có thể là cá hoặc động vật thủy sinh"
  },
  {
    "con": "Nếu một loài vi khuẩn có khả năng sống trong môi trường khắc nghiệt, thì nó thuộc nhóm nào?",
    "re": "Nó thuộc nhóm vi khuẩn cực đoan"
  },
  {
    "con": "Nếu một sinh vật có khả năng di chuyển và tìm kiếm thức ăn, thì nó thuộc nhóm nào?",
    "re": "Nó thuộc nhóm động vật"
  },
  {
    "con": "Nhóm động vật nào sau đây đều thuộc nhóm động vật hằng nhiệt?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tế bào có nhân thì nó thuộc loại tế bào nào?",
    "re": "Tế bào eukaryote"
  },
  {
    "con": "Nếu một loài thực vật có hoa thì nó thuộc nhóm nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn thì nó được gọi là gì?",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài động vật có xương sống thì nó thuộc nhóm nào?",
    "re": "Động vật có xương sống"
  },
  {
    "con": "Nếu một tế bào không có nhân thì nó thuộc loại tế bào nào?",
    "re": "Tế bào prokaryote"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước thì nó được gọi là gì?",
    "re": "Sinh vật thủy sinh"
  },
  {
    "con": "Nếu một loài động vật có khả năng bay thì nó thuộc nhóm nào?",
    "re": "Động vật có cánh"
  },
  {
    "con": "Nếu một loài thực vật có lá xanh và quang hợp thì nó thuộc nhóm nào?",
    "re": "Thực vật xanh"
  },
  {
    "con": "Nếu một sinh vật có khả năng phân hủy chất hữu cơ thì nó được gọi là gì?",
    "re": "Sinh vật phân hủy"
  },
  {
    "con": "Quá trình quang hợp diễn ra trong lá cây khi có ánh sáng mặt trời và nước",
    "re": "Cây sản xuất glucose và oxy"
  },
  {
    "con": "Tế bào động vật có nhân và các bào quan",
    "re": "Chúng có khả năng thực hiện các chức năng sống"
  },
  {
    "con": "Khi một loài sinh vật bị mất môi trường sống do ô nhiễm",
    "re": "Sự đa dạng sinh học sẽ giảm sút"
  },
  {
    "con": "Khi nhiệt độ môi trường tăng lên",
    "re": "Nhiều loài động vật có thể di cư đến nơi mát mẻ hơn"
  },
  {
    "con": "Khi một loài sinh vật có đặc điểm di truyền có lợi",
    "re": "Chúng có khả năng sống sót và sinh sản tốt hơn trong môi trường"
  },
  {
    "con": "Sự phân chia tế bào xảy ra trong quá trình sinh sản vô tính",
    "re": "Tạo ra các cá thể mới giống hệt cá thể mẹ"
  },
  {
    "con": "Khi một loài thực vật không nhận đủ nước",
    "re": "Chúng có thể héo và chết"
  },
  {
    "con": "Khi có sự cạnh tranh giữa các loài trong cùng một môi trường",
    "re": "Một số loài có thể bị loại bỏ hoặc giảm số lượng"
  },
  {
    "con": "Khi một sinh vật ăn thực vật",
    "re": "Nó sẽ nhận được năng lượng từ thực vật đó"
  },
  {
    "con": "Khi một loài động vật bị săn bắt quá mức",
    "re": "Số lượng của loài đó sẽ giảm và có thể dẫn đến tuyệt chủng"
  },
  {
    "con": "Mức độ phong phú về số lượng loài trong quần xã thể hiện ở:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Năng lượng trong chuỗi thức ăn được truyền từ sinh vật này sang sinh vật khác:",
    "re": "Mỗi cấp độ sẽ mất đi một phần năng lượng do quá trình chuyển hóa"
  },
  {
    "con": "Sự phân chia tế bào xảy ra trong quá trình sinh sản vô tính:",
    "re": "Tạo ra các tế bào con giống hệt tế bào mẹ"
  },
  {
    "con": "Khi một loài bị tuyệt chủng:",
    "re": "Nó sẽ không còn tồn tại trong hệ sinh thái nữa"
  },
  {
    "con": "Quá trình quang hợp diễn ra ở thực vật:",
    "re": "Chuyển đổi ánh sáng mặt trời thành năng lượng hóa học"
  },
  {
    "con": "DNA chứa thông tin di truyền:",
    "re": "Quyết định đặc điểm và tính trạng của sinh vật"
  },
  {
    "con": "Sự tương tác giữa các loài trong một quần xã sinh vật:",
    "re": "Có thể là cạnh tranh, hợp tác hoặc ký sinh"
  },
  {
    "con": "Khi môi trường thay đổi nhanh chóng:",
    "re": "Nhiều loài có thể không thích nghi kịp thời và bị đe dọa"
  },
  {
    "con": "Hệ tuần hoàn của động vật có xương sống:",
    "re": "Chịu trách nhiệm vận chuyển oxy và chất dinh dưỡng đến các tế bào"
  },
  {
    "con": "Sự tiến hóa của các loài diễn ra qua thời gian dài:",
    "re": "Dẫn đến sự đa dạng sinh học mà chúng ta thấy ngày nay"
  },
  {
    "con": "Cây có lớp bần dày vào mùa đông là do ảnh hưởng của nhân tố:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tế bào không có nhân thì nó thuộc loại:",
    "re": "Tế bào prokaryote"
  },
  {
    "con": "Nếu động vật có xương sống thì chúng có:",
    "re": "Cột sống"
  },
  {
    "con": "Nếu một loài sinh vật có khả năng sinh sản và phát triển trong môi trường nước thì nó được gọi là:",
    "re": "Sinh vật thủy sinh"
  },
  {
    "con": "Nếu một loài thực vật có hoa và hạt thì nó thuộc nhóm:",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu quá trình quang hợp diễn ra thì cây xanh sẽ sản xuất ra:",
    "re": "Oxy và glucose"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự điều chỉnh nhiệt độ cơ thể thì nó được gọi là:",
    "re": "Động vật máu nóng"
  },
  {
    "con": "Nếu một loài vi khuẩn có khả năng sống trong môi trường khắc nghiệt thì nó được gọi là:",
    "re": "Vi khuẩn cực đoan"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc tế bào phức tạp và có nhân thì nó thuộc loại:",
    "re": "Tế bào eukaryote"
  },
  {
    "con": "Nếu một loài động vật có khả năng bay thì nó thường có:",
    "re": "Cánh"
  },
  {
    "con": "Trong các trường hợp dưới đây, trường hợp nào là quan hệ cộng sinh?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sinh vật có khả năng tự tổng hợp chất dinh dưỡng từ ánh sáng mặt trời và carbon dioxide",
    "re": "Đó là một thực vật"
  },
  {
    "con": "Khi một tế bào bị tổn thương và phát ra tín hiệu hóa học",
    "re": "Các tế bào miễn dịch sẽ được kích hoạt để phản ứng"
  },
  {
    "con": "Một loài động vật sống trong môi trường nước và có vây",
    "re": "Đó là một loài cá"
  },
  {
    "con": "Khi một loài thực vật không thể sống sót mà không có ánh sáng",
    "re": "Đó là một loài thực vật quang hợp"
  },
  {
    "con": "Khi một sinh vật có khả năng sinh sản và tạo ra thế hệ mới",
    "re": "Đó là một phần của chu trình sống"
  },
  {
    "con": "Một loài vi khuẩn có thể sống trong môi trường không có oxy",
    "re": "Đó là một loài vi khuẩn kỵ khí"
  },
  {
    "con": "Khi một sinh vật tiêu thụ thực vật hoặc động vật khác để lấy năng lượng",
    "re": "Đó là một sinh vật ăn thịt hoặc ăn cỏ"
  },
  {
    "con": "Khi một loài động vật di cư để tìm kiếm thức ăn hoặc môi trường sống tốt hơn",
    "re": "Đó là một hành vi thích nghi"
  },
  {
    "con": "Khi một loài thực vật phát triển trong điều kiện khô hạn",
    "re": "Đó là một loài thực vật chịu hạn"
  },
  {
    "con": "Dùng vi khuẩn E.coli để sản xuất hoocmon insulin là ứng dụng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Thực vật quang hợp trong ánh sáng mặt trời",
    "re": "Sản xuất oxy và glucose"
  },
  {
    "con": "Sự di truyền gen từ cha mẹ sang con cái là quá trình",
    "re": "Quyết định đặc điểm di truyền của sinh vật"
  },
  {
    "con": "Các tế bào sống đều có màng tế bào",
    "re": "Bảo vệ và kiểm soát sự trao đổi chất"
  },
  {
    "con": "Sự phân chia tế bào là quá trình",
    "re": "Giúp sinh sản và phát triển của sinh vật"
  },
  {
    "con": "Động vật có xương sống có hệ thần kinh phát triển",
    "re": "Cho phép phản ứng nhanh với môi trường"
  },
  {
    "con": "Vi khuẩn có thể sống trong môi trường khắc nghiệt",
    "re": "Chúng có khả năng thích nghi cao"
  },
  {
    "con": "Sự tiến hóa là quá trình",
    "re": "Thay đổi đặc điểm di truyền qua nhiều thế hệ"
  },
  {
    "con": "Nước là dung môi quan trọng trong tế bào",
    "re": "Giúp hòa tan và vận chuyển chất dinh dưỡng"
  },
  {
    "con": "Hệ sinh thái bao gồm các sinh vật và môi trường sống của chúng",
    "re": "Tạo ra sự cân bằng sinh thái"
  },
  {
    "con": "Ví dụ nào sau đây không phải là một quần thể sinh vật",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sinh vật có khả năng sinh sản và tạo ra con cái",
    "re": "Nó được coi là một loài"
  },
  {
    "con": "Tế bào không có nhân",
    "re": "Được gọi là tế bào prokaryote"
  },
  {
    "con": "Một sinh vật có khả năng quang hợp",
    "re": "Nó thuộc nhóm thực vật"
  },
  {
    "con": "Một loài có thể sống trong môi trường khắc nghiệt",
    "re": "Nó được gọi là sinh vật cực đoan"
  },
  {
    "con": "Một chuỗi thức ăn bắt đầu từ thực vật",
    "re": "Nó được gọi là chuỗi thức ăn tự nhiên"
  },
  {
    "con": "Một sinh vật có cấu trúc cơ thể phức tạp",
    "re": "Nó thuộc nhóm động vật đa bào"
  },
  {
    "con": "Một loài có khả năng thích nghi với môi trường",
    "re": "Nó có khả năng sống sót và phát triển"
  },
  {
    "con": "Một tế bào có nhân và các bào quan",
    "re": "Được gọi là tế bào eukaryote"
  },
  {
    "con": "Một loài động vật có vú",
    "re": "Nó có khả năng cho con bú"
  },
  {
    "con": "Trong các loại tài nguyên sau, thuộc loại tài nguyên tái sinh là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời, thì nó được gọi là:",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một tế bào có nhân và các bào quan, thì nó thuộc loại:",
    "re": "Tế bào eukaryote"
  },
  {
    "con": "Nếu một loài động vật có xương sống, thì nó thuộc nhóm:",
    "re": "Động vật có xương"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, thì nó có thể được gọi là:",
    "re": "Sinh vật thủy sinh"
  },
  {
    "con": "Nếu một loài thực vật có hoa và hạt, thì nó thuộc nhóm:",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có khả năng thích nghi với môi trường khắc nghiệt, thì nó được gọi là:",
    "re": "Sinh vật chịu đựng"
  },
  {
    "con": "Nếu một tế bào phân chia để tạo ra hai tế bào con giống hệt nhau, thì quá trình này được gọi là:",
    "re": "Phân bào nguyên phân"
  },
  {
    "con": "Nếu một loài động vật có khả năng bay, thì nó thường có:",
    "re": "Cánh"
  },
  {
    "con": "Nếu một sinh vật có hệ tiêu hóa phức tạp, thì nó có thể tiêu hóa:",
    "re": "Thức ăn đa dạng"
  },
  {
    "con": "Một trong các tác nhân gây ô nhiễm không khí là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là môi trường sống của nhiều loài sinh vật",
    "re": "Chúng cần nước để tồn tại và phát triển"
  },
  {
    "con": "Thực vật quang hợp vào ban ngày",
    "re": "Chúng sản xuất oxy và glucose"
  },
  {
    "con": "Động vật ăn thực vật gọi là",
    "re": "Động vật ăn cỏ"
  },
  {
    "con": "Sự phân hủy chất hữu cơ do vi sinh vật",
    "re": "Giúp tái tạo dinh dưỡng cho đất"
  },
  {
    "con": "DNA chứa thông tin di truyền",
    "re": "Nó quyết định đặc điểm của sinh vật"
  },
  {
    "con": "Hệ tuần hoàn của con người bao gồm",
    "re": "Tim, mạch máu và máu"
  },
  {
    "con": "Sự tiến hóa của các loài diễn ra qua",
    "re": "Quá trình chọn lọc tự nhiên"
  },
  {
    "con": "Năng lượng trong chuỗi thức ăn được truyền từ",
    "re": "Sinh vật sản xuất sang sinh vật tiêu thụ"
  },
  {
    "con": "Mỗi tế bào trong cơ thể đều có",
    "re": "Chức năng và nhiệm vụ riêng"
  },
  {
    "con": "Nhóm sinh vật nào là nhóm sinh vật hằng nhiệt:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tế bào có nhân thì nó thuộc loại tế bào:",
    "re": "Eukaryote"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn thì nó được gọi là:",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài động vật có xương sống thì nó thuộc nhóm:",
    "re": "Động vật có xương"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong môi trường khắc nghiệt thì nó được gọi là:",
    "re": "Sinh vật cực đoan"
  },
  {
    "con": "Nếu một tế bào phân chia bằng phương pháp nguyên phân thì kết quả là:",
    "re": "Hai tế bào con giống hệt tế bào mẹ"
  },
  {
    "con": "Nếu một loài thực vật có hoa thì nó thuộc nhóm:",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có khả năng di chuyển và tiêu thụ thức ăn thì nó được gọi là:",
    "re": "Động vật"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc tế bào đơn giản và không có nhân thì nó thuộc loại tế bào:",
    "re": "Prokaryote"
  },
  {
    "con": "Nếu một loài động vật có vú thì nó có đặc điểm:",
    "re": "Cho con bú sữa"
  },
  {
    "con": "Quá trình quang hợp xảy ra ở thực vật xanh là:",
    "re": "Thực vật chuyển đổi ánh sáng mặt trời thành năng lượng hóa học"
  },
  {
    "con": "Nếu một sinh vật có ADN khác với sinh vật khác, thì:",
    "re": "Chúng có thể có các đặc điểm di truyền khác nhau"
  },
  {
    "con": "Sự phân chia tế bào diễn ra trong quá trình sinh sản là:",
    "re": "Tế bào mẹ tạo ra tế bào con với số lượng ADN giống nhau"
  },
  {
    "con": "Nếu môi trường sống thay đổi, thì:",
    "re": "Các loài có thể phải thích nghi hoặc có nguy cơ tuyệt chủng"
  },
  {
    "con": "Hệ sinh thái bao gồm:",
    "re": "Tất cả các sinh vật và môi trường sống của chúng tương tác với nhau"
  },
  {
    "con": "Nếu một loài động vật có đặc điểm thích nghi tốt, thì:",
    "re": "Nó có khả năng sống sót và sinh sản cao hơn trong môi trường của nó"
  },
  {
    "con": "Nếu một tế bào không có nhân, thì:",
    "re": "Đó là tế bào prokaryote, như vi khuẩn"
  },
  {
    "con": "Quá trình tiêu hóa thức ăn trong cơ thể diễn ra ở:",
    "re": "Hệ tiêu hóa, bao gồm miệng, dạ dày và ruột"
  },
  {
    "con": "Nếu một loài thực vật không nhận đủ nước, thì:",
    "re": "Nó có thể héo và không phát triển tốt"
  },
  {
    "con": "Nếu một sinh vật có hệ miễn dịch mạnh, thì:",
    "re": "Nó có khả năng chống lại bệnh tật tốt hơn"
  },
  {
    "con": "Xác định một quần xã ổn định, ta căn cứ vào:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu thực vật quang hợp, thì chúng sẽ sản xuất ra:",
    "re": "oxy và glucose"
  },
  {
    "con": "Nếu một sinh vật có ADN, thì nó sẽ:",
    "re": "có khả năng di truyền thông tin di truyền"
  },
  {
    "con": "Nếu môi trường sống thay đổi, thì quần thể sinh vật có thể:",
    "re": "thích nghi hoặc bị tuyệt chủng"
  },
  {
    "con": "Nếu một loài động vật có vú, thì nó sẽ:",
    "re": "có tuyến sữa để nuôi con"
  },
  {
    "con": "Nếu tế bào không có nhân, thì nó được gọi là:",
    "re": "tế bào prokaryote"
  },
  {
    "con": "Nếu một loài sinh vật có cấu trúc cơ thể đối xứng, thì nó có thể thuộc về:",
    "re": "nhóm động vật có xương sống hoặc không xương sống"
  },
  {
    "con": "Nếu một sinh vật là động vật ăn thịt, thì nó sẽ:",
    "re": "săn bắt và tiêu thụ các sinh vật khác"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó có khả năng:",
    "re": "sinh sản hữu tính thông qua hạt"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, thì nó có thể có:",
    "re": "các đặc điểm thích nghi như mang hoặc vây"
  },
  {
    "con": "Các tập hợp sau, tập hợp nào không là quần thể sinh vật:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sinh vật có khả năng sinh sản và tạo ra con cái giống hệt nó:",
    "re": "Đó là sinh sản vô tính"
  },
  {
    "con": "Nếu một sinh vật có ADN khác biệt với sinh vật khác trong cùng một loài:",
    "re": "Thì nó có thể có những đặc điểm khác nhau"
  },
  {
    "con": "Nếu một loài sinh vật không thể thích nghi với môi trường sống của nó:",
    "re": "Thì nó có nguy cơ tuyệt chủng"
  },
  {
    "con": "Nếu một tế bào nhân thực có nhân và các bào quan:",
    "re": "Thì nó thuộc về nhóm tế bào phức tạp"
  },
  {
    "con": "Nếu một loài thực vật có hoa và hạt:",
    "re": "Thì nó thuộc về nhóm thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có hệ tiêu hóa phức tạp:",
    "re": "Thì nó có thể tiêu hóa nhiều loại thức ăn khác nhau"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước:",
    "re": "Thì nó có thể có các đặc điểm thích nghi như mang hoặc vây"
  },
  {
    "con": "Nếu một loài động vật có xương sống:",
    "re": "Thì nó thuộc về nhóm động vật có xương sống"
  },
  {
    "con": "Nếu một sinh vật có khả năng quang hợp:",
    "re": "Thì nó có thể tự sản xuất thức ăn từ ánh sáng mặt trời"
  },
  {
    "con": "Mối quan hệ giữa các sợi nấm và tảo ở địa y là mối quan hệ khác loài nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tế bào được bao bọc bởi màng tế bào thì tế bào đó có thể điều chỉnh sự trao đổi chất với môi trường xung quanh.",
    "re": "Điều này giúp tế bào duy trì sự cân bằng nội môi."
  },
  {
    "con": "Nếu một loài động vật có khả năng sinh sản nhanh chóng thì loài đó có khả năng thích nghi với môi trường thay đổi tốt hơn.",
    "re": "Điều này giúp loài đó tồn tại lâu dài hơn."
  },
  {
    "con": "Nếu thực vật quang hợp thì chúng sẽ sản xuất ra oxy và glucose.",
    "re": "Đây là quá trình quan trọng cho sự sống trên Trái Đất."
  },
  {
    "con": "Nếu một sinh vật có ADN thì nó có khả năng di truyền thông tin di truyền cho thế hệ sau.",
    "re": "Điều này là cơ sở cho sự tiến hóa của các loài."
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước thì nó có thể có các đặc điểm thích nghi như mang hoặc vây.",
    "re": "Điều này giúp sinh vật tồn tại và phát triển trong môi trường đó."
  },
  {
    "con": "Nếu một loài động vật có bộ xương bên trong thì nó thuộc nhóm động vật có xương sống.",
    "re": "Điều này phân biệt chúng với động vật không xương sống."
  },
  {
    "con": "Nếu một sinh vật là động vật ăn thịt thì nó sẽ có các đặc điểm như răng sắc nhọn và móng vuốt.",
    "re": "Điều này giúp chúng săn mồi hiệu quả hơn."
  },
  {
    "con": "Nếu một loài thực vật có hoa thì nó có khả năng sinh sản hữu tính.",
    "re": "Điều này giúp tạo ra sự đa dạng di truyền trong quần thể."
  },
  {
    "con": "Nếu một sinh vật có khả năng tự vệ thì nó có thể sống sót tốt hơn trong môi trường có nhiều kẻ thù.",
    "re": "Điều này tăng cường khả năng tồn tại của loài đó."
  },
  {
    "con": "Tế bào thực vật có thành tế bào và chứa lục lạp để thực hiện quang hợp?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản, thì nó có thể truyền gen cho thế hệ sau?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu môi trường sống thay đổi, thì các loài sinh vật có thể thích nghi hoặc bị tuyệt chủng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một loài động vật có bộ gen khác biệt, thì nó có thể phát triển các đặc điểm khác biệt?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tế bào không có nhân, thì nó là tế bào prokaryote?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó thuộc nhóm thực vật hạt kín?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có hệ tuần hoàn mở, thì máu không lưu thông trong các mạch máu kín?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một loài động vật có xương sống, thì nó thuộc nhóm động vật có xương?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn, thì nó là sinh vật tự dưỡng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một tế bào phân chia bằng phương pháp nguyên phân, thì nó tạo ra hai tế bào con giống hệt nhau?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Quá trình quang hợp diễn ra trong lá cây:",
    "re": "Cây sản xuất glucose và oxy"
  },
  {
    "con": "Tế bào động vật có nhân:",
    "re": "Chúng có khả năng sinh sản và phát triển"
  },
  {
    "con": "Nước là thành phần chính của tế bào:",
    "re": "Nó đóng vai trò quan trọng trong các phản ứng sinh hóa"
  },
  {
    "con": "Sự di truyền được điều khiển bởi gen:",
    "re": "Các đặc điểm di truyền sẽ được truyền từ thế hệ này sang thế hệ khác"
  },
  {
    "con": "Hệ sinh thái bao gồm các sinh vật sống và môi trường của chúng:",
    "re": "Nó thể hiện mối quan hệ tương tác giữa các loài và môi trường"
  },
  {
    "con": "Động vật có xương sống có cấu trúc cơ thể phức tạp:",
    "re": "Chúng có hệ thống tuần hoàn và hệ thần kinh phát triển"
  },
  {
    "con": "Vi khuẩn có thể sống trong nhiều môi trường khác nhau:",
    "re": "Chúng có thể tồn tại trong điều kiện khắc nghiệt và đóng vai trò quan trọng trong chu trình dinh dưỡng"
  },
  {
    "con": "Sự tiến hóa xảy ra qua quá trình chọn lọc tự nhiên:",
    "re": "Các loài thích nghi tốt hơn sẽ sống sót và sinh sản nhiều hơn"
  },
  {
    "con": "Hệ miễn dịch giúp bảo vệ cơ thể khỏi bệnh tật:",
    "re": "Nó nhận diện và tiêu diệt các tác nhân gây bệnh"
  },
  {
    "con": "Sự phân bào là quá trình tế bào chia thành hai tế bào con:",
    "re": "Nó là cách mà tế bào sinh sản và phát triển"
  },
  {
    "con": "Ghép đoạn ADN của tế bào cho vào ADN làm thể truyền nhờ enzim nối tạo nên ADN?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào thực vật có thành tế bào và lục lạp?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật có ADN, thì nó có khả năng di truyền thông tin di truyền?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài động vật sống trong môi trường nước, thì nó có thể có các đặc điểm thích nghi như mang hoặc vây?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một tế bào phân chia qua quá trình nguyên phân, thì nó tạo ra hai tế bào con giống hệt nhau?",
    "re": "Đúng"
  },
  {
    "con": "Nếu thực vật quang hợp, thì chúng sử dụng ánh sáng mặt trời để tạo ra năng lượng?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật có hệ tuần hoàn mở, thì máu không hoàn toàn nằm trong mạch máu?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài động vật có xương sống, thì nó thuộc vào nhóm động vật có xương?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn, thì nó được gọi là sinh vật tự dưỡng?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một tế bào có nhân, thì nó được gọi là tế bào nhân thực?",
    "re": "Đúng"
  },
  {
    "con": "Sự giao phối giữa con cái sinh ra từ một cặp bố mẹ hoặc giữa bố mẹ với con cái là giao phối?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào thực vật có thành tế bào và tế bào động vật không có thành tế bào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản và phát triển thì nó có thể được coi là một sinh vật sống?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một loài động vật có khả năng thích nghi với môi trường thì nó có thể tồn tại lâu dài hơn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu quá trình quang hợp xảy ra thì cây xanh sẽ sản xuất ra oxy?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu DNA chứa thông tin di truyền thì nó quyết định đặc điểm của sinh vật?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật thuộc nhóm động vật có vú thì nó sẽ có tuyến sữa?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc tế bào đơn giản thì nó có thể là vi khuẩn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một loài thực vật có hoa thì nó có thể sinh sản bằng hạt?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có hệ tuần hoàn thì nó có thể vận chuyển chất dinh dưỡng trong cơ thể?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong giới hạn sinh thái về nhiệt độ của cá rô phi ở Việt Nam có giới hạn dưới và giới hạn trên là?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời thì đó là sinh vật gì?",
    "re": "Sinh vật quang hợp"
  },
  {
    "con": "Nếu một tế bào có nhân và các bào quan thì nó thuộc loại tế bào nào?",
    "re": "Tế bào eukaryote"
  },
  {
    "con": "Nếu một loài động vật có xương sống và có khả năng sống dưới nước thì nó thuộc nhóm nào?",
    "re": "Động vật thủy sinh"
  },
  {
    "con": "Nếu một cây có hoa và quả thì nó thuộc nhóm thực vật nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có khả năng thích nghi với môi trường khô cằn thì nó có thể là loại nào?",
    "re": "Sinh vật chịu hạn"
  },
  {
    "con": "Nếu một loài vi khuẩn có khả năng sống trong môi trường không có oxy thì nó thuộc loại nào?",
    "re": "Vi khuẩn kỵ khí"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc cơ thể phân chia thành nhiều phần giống nhau thì nó thuộc nhóm nào?",
    "re": "Động vật đối xứng tỏa tròn"
  },
  {
    "con": "Nếu một loài thực vật có lá hình kim và sống ở vùng lạnh thì nó có thể là loại nào?",
    "re": "Thực vật lá kim"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản vô tính thì nó có thể sử dụng phương pháp nào?",
    "re": "Phân chia tế bào"
  },
  {
    "con": "Giữa các cá thể sinh vật cùng loài có những mối quan hệ nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự tổng hợp chất dinh dưỡng từ ánh sáng mặt trời thì nó được gọi là gì?",
    "re": "Sinh vật quang hợp"
  },
  {
    "con": "Nếu một sinh vật không thể tự tổng hợp chất dinh dưỡng mà phải lấy từ môi trường xung quanh thì nó được gọi là gì?",
    "re": "Sinh vật dị dưỡng"
  },
  {
    "con": "Nếu một loài sinh vật có khả năng thích nghi với môi trường sống của nó thì nó sẽ có khả năng sống sót và phát triển tốt hơn.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một tế bào có nhân thì nó được gọi là gì?",
    "re": "Tế bào nhân thực"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc cơ thể phân chia thành các hệ thống khác nhau như hệ tuần hoàn, hệ tiêu hóa thì nó được gọi là gì?",
    "re": "Sinh vật đa bào"
  },
  {
    "con": "Nếu một loài động vật có khả năng sinh sản nhanh chóng và có nhiều thế hệ trong thời gian ngắn thì nó có khả năng thích nghi tốt hơn với môi trường.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài thực vật có hoa và hạt thì nó thuộc nhóm nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong môi trường khắc nghiệt như sa mạc hoặc vùng cực thì nó được gọi là gì?",
    "re": "Sinh vật chịu đựng"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc di truyền ổn định qua nhiều thế hệ thì nó có thể được coi là một loài.",
    "re": "Đúng"
  },
  {
    "con": "Đặc điểm nào sau đây không có ở quần thể sinh vật mà chỉ có ở quần thể người?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời?",
    "re": "Đó là một thực vật"
  },
  {
    "con": "Một tế bào có nhân và các bào quan được bao bọc bởi màng?",
    "re": "Đó là tế bào eukaryote"
  },
  {
    "con": "Một loài sinh vật có khả năng thích nghi với môi trường sống của nó?",
    "re": "Loài đó có khả năng sống sót và phát triển"
  },
  {
    "con": "Một quá trình mà tế bào sử dụng oxy để chuyển hóa glucose thành năng lượng?",
    "re": "Đó là hô hấp tế bào"
  },
  {
    "con": "Một đặc điểm di truyền được truyền từ cha mẹ sang con cái?",
    "re": "Đó là gen"
  },
  {
    "con": "Một nhóm sinh vật cùng loài sống trong cùng một khu vực?",
    "re": "Đó là quần thể"
  },
  {
    "con": "Một quá trình mà nước bay hơi từ bề mặt của cây vào không khí?",
    "re": "Đó là thoát hơi nước"
  },
  {
    "con": "Một loại tế bào có chức năng bảo vệ cơ thể khỏi vi khuẩn và virus?",
    "re": "Đó là tế bào bạch cầu"
  },
  {
    "con": "Một chuỗi thức ăn bắt đầu từ thực vật và kết thúc ở động vật ăn thịt?",
    "re": "Đó là hệ sinh thái"
  },
  {
    "con": "Trong chuỗi thức ăn sinh vật nào là sinh vật sản xuất?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng quang hợp thì nó là sinh vật sản xuất.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật ăn thực vật thì nó là sinh vật tiêu thụ cấp 1.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có bộ gen giống nhau ở cả hai bố mẹ thì nó là sinh vật đồng hợp tử.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản thì nó có thể truyền gen cho thế hệ sau.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước thì nó có thể có các đặc điểm thích nghi như mang hoặc vây.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có hệ tuần hoàn mở thì máu không chỉ lưu thông trong mạch.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có lớp da dày và có khả năng giữ nước thì nó có thể sống trong môi trường khô hạn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng phân hủy chất hữu cơ thì nó là sinh vật phân hủy.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc tế bào phức tạp thì nó thuộc về nhóm sinh vật eukaryote.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Quá trình quang hợp diễn ra ở đâu trong tế bào thực vật?",
    "re": "Chloroplast"
  },
  {
    "con": "Nếu một sinh vật có ADN, thì nó thuộc loại nào?",
    "re": "Sinh vật sống"
  },
  {
    "con": "Khi nhiệt độ môi trường tăng cao, thì hoạt động của enzyme trong cơ thể sẽ như thế nào?",
    "re": "Tăng lên cho đến một mức độ nhất định, sau đó sẽ giảm"
  },
  {
    "con": "Nếu một loài động vật có vú sinh sản bằng cách đẻ trứng, thì nó thuộc nhóm nào?",
    "re": "Động vật có vú đẻ trứng"
  },
  {
    "con": "Nếu một tế bào không có nhân, thì nó là loại tế bào gì?",
    "re": "Tế bào prokaryote"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn, thì nó được gọi là gì?",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó thuộc nhóm nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước, thì nó có thể có đặc điểm gì?",
    "re": "Có mang hoặc cấu trúc tương tự để hô hấp"
  },
  {
    "con": "Nếu một loài động vật có khả năng bay, thì nó thường có đặc điểm gì?",
    "re": "Cánh và xương nhẹ"
  },
  {
    "con": "Nếu một sinh vật có hệ thống tuần hoàn mở, thì nó thuộc nhóm nào?",
    "re": "Động vật không xương sống như động vật giáp xác"
  },
  {
    "con": "Dầu lửa, than đá, khí đốt tự nhiên và các khoáng sản thuộc dạng tài nguyên nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tế bào không có nhân thì nó thuộc loại tế bào nào?",
    "re": "Tế bào prokaryote"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời thì nó thuộc nhóm nào?",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài động vật có xương sống thì nó thuộc nhóm nào?",
    "re": "Động vật có xương sống"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc tế bào phức tạp và có nhân thì nó thuộc loại tế bào nào?",
    "re": "Tế bào eukaryote"
  },
  {
    "con": "Nếu một loài thực vật có hoa và hạt thì nó thuộc nhóm nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong môi trường khắc nghiệt như nước muối hoặc nhiệt độ cao thì nó thuộc nhóm nào?",
    "re": "Vi sinh vật cực đoan"
  },
  {
    "con": "Nếu một loài động vật có khả năng bay thì nó thường có đặc điểm gì?",
    "re": "Cánh và xương nhẹ"
  },
  {
    "con": "Nếu một sinh vật có khả năng phân hủy chất hữu cơ thì nó thuộc nhóm nào?",
    "re": "Vi sinh vật phân hủy"
  },
  {
    "con": "Nếu một loài động vật có vú nuôi con bằng sữa thì nó thuộc nhóm nào?",
    "re": "Động vật có vú"
  },
  {
    "con": "Ý nào sau đây là không đúng khi nói về hiệu quả của việc bón phân hợp lí và hợp vệ sinh cho cây trồng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào thực vật có thành tế bào và không có nhân?",
    "re": "Câu trả lời sai"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời thì nó được gọi là gì?",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài động vật có khả năng thích nghi với môi trường sống của nó thì nó sẽ có khả năng sống sót cao hơn?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài thực vật không nhận đủ ánh sáng mặt trời thì nó sẽ phát triển kém?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật có hệ tuần hoàn mở thì máu sẽ không lưu thông trong các mạch máu?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài động vật có bộ gen đa dạng thì khả năng thích nghi của nó sẽ cao hơn?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước thì nó không cần có các cơ quan hô hấp?",
    "re": "Câu trả lời sai"
  },
  {
    "con": "Nếu một loài vi khuẩn có khả năng kháng thuốc thì nó có thể sống sót trong môi trường có thuốc kháng sinh?",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc cơ thể phức tạp thì nó sẽ có khả năng sống sót tốt hơn trong môi trường khắc nghiệt?",
    "re": "Câu trả lời không chắc chắn"
  },
  {
    "con": "Thế nào là môi trường sống của sinh vật?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sinh vật có thể sống sót trong môi trường khắc nghiệt nếu nó có khả năng thích nghi.",
    "re": "Sinh vật sẽ tồn tại và phát triển."
  },
  {
    "con": "Nếu một sinh vật không có đủ thức ăn, nước và nơi trú ẩn,",
    "re": "sinh vật đó sẽ gặp khó khăn trong việc sinh tồn."
  },
  {
    "con": "Nếu tế bào không có màng tế bào,",
    "re": "tế bào sẽ không thể duy trì môi trường bên trong ổn định."
  },
  {
    "con": "Nếu quá trình quang hợp diễn ra hiệu quả,",
    "re": "cây sẽ sản xuất nhiều oxy và glucose."
  },
  {
    "con": "Nếu một loài sinh vật bị tuyệt chủng,",
    "re": "hệ sinh thái sẽ bị ảnh hưởng nghiêm trọng."
  },
  {
    "con": "Nếu DNA bị tổn thương và không được sửa chữa,",
    "re": "có thể dẫn đến các bệnh di truyền."
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản cao,",
    "re": "nó có khả năng duy trì và phát triển quần thể."
  },
  {
    "con": "Nếu các loài sinh vật sống trong cùng một môi trường,",
    "re": "chúng sẽ cạnh tranh với nhau về tài nguyên."
  },
  {
    "con": "Nếu một sinh vật có cấu trúc cơ thể phù hợp với môi trường sống,",
    "re": "nó sẽ có lợi thế trong việc sinh tồn và phát triển."
  },
  {
    "con": "Tế bào là đơn vị cơ bản của sự sống",
    "re": "Tất cả sinh vật đều được cấu tạo từ tế bào"
  },
  {
    "con": "Photosynthesis xảy ra trong lá cây",
    "re": "Cây xanh sản xuất oxy và glucose từ ánh sáng mặt trời"
  },
  {
    "con": "DNA chứa thông tin di truyền",
    "re": "Mọi đặc điểm di truyền của sinh vật đều được mã hóa trong DNA"
  },
  {
    "con": "Nước là thành phần chính của tế bào",
    "re": "Tế bào cần nước để duy trì chức năng và cấu trúc"
  },
  {
    "con": "Sinh sản vô tính không cần bạn tình",
    "re": "Sinh vật có thể tạo ra thế hệ mới mà không cần giao phối"
  },
  {
    "con": "Hệ sinh thái bao gồm các sinh vật và môi trường sống của chúng",
    "re": "Các yếu tố sinh thái tương tác với nhau để duy trì sự sống"
  },
  {
    "con": "Protein được tổng hợp từ axit amin",
    "re": "Chúng đóng vai trò quan trọng trong cấu trúc và chức năng của tế bào"
  },
  {
    "con": "Quá trình hô hấp xảy ra trong tế bào",
    "re": "Sinh vật chuyển hóa glucose thành năng lượng cần thiết cho hoạt động sống"
  },
  {
    "con": "Sự tiến hóa xảy ra qua nhiều thế hệ",
    "re": "Các đặc điểm có lợi được truyền lại cho thế hệ sau"
  },
  {
    "con": "Vi khuẩn có thể sống trong nhiều môi trường khác nhau",
    "re": "Chúng có khả năng thích nghi với điều kiện sống khắc nghiệt"
  },
  {
    "con": "Vì sao nhân tố con người được tách ra thành một nhóm nhân tố sinh thái riêng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cây ưa sáng thường sống nơi nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sự phân chia tế bào xảy ra trong giai đoạn nào của chu kỳ tế bào?",
    "re": "Giai đoạn nguyên phân"
  },
  {
    "con": "Nếu một sinh vật có bộ gen đồng hợp tử cho một đặc điểm, thì đặc điểm đó sẽ biểu hiện như thế nào?",
    "re": "Đặc điểm đó sẽ biểu hiện rõ ràng"
  },
  {
    "con": "Khi nhiệt độ môi trường tăng lên, thì tốc độ quang hợp của cây sẽ như thế nào?",
    "re": "Tốc độ quang hợp sẽ tăng lên cho đến một mức độ nhất định"
  },
  {
    "con": "Nếu một loài động vật có khả năng thích nghi tốt với môi trường, thì khả năng sống sót của nó sẽ ra sao?",
    "re": "Khả năng sống sót sẽ cao hơn"
  },
  {
    "con": "Khi một sinh vật bị thiếu oxy, thì quá trình hô hấp của nó sẽ diễn ra như thế nào?",
    "re": "Quá trình hô hấp sẽ bị giảm hiệu quả"
  },
  {
    "con": "Nếu một loài thực vật có hoa màu sắc rực rỡ, thì điều này thường có ý nghĩa gì?",
    "re": "Để thu hút côn trùng thụ phấn"
  },
  {
    "con": "Nếu một sinh vật có hệ miễn dịch mạnh, thì khả năng chống lại bệnh tật sẽ như thế nào?",
    "re": "Khả năng chống lại bệnh tật sẽ cao hơn"
  },
  {
    "con": "Nếu một loài động vật sống trong môi trường nước, thì đặc điểm nào thường thấy ở chúng?",
    "re": "Chúng có thể có vây và mang"
  },
  {
    "con": "Nếu một tế bào bị tổn thương DNA, thì điều gì có thể xảy ra?",
    "re": "Tế bào có thể phát triển thành tế bào ung thư"
  },
  {
    "con": "ánh sáng tác động vào cây xanh từ một phía nhất định, sau một thời gian cây mọc như thế nào?",
    "re": "Cây sẽ nghiêng về phía có ánh sáng."
  },
  {
    "con": "nhiệt độ môi trường tăng cao, ảnh hưởng đến quá trình hô hấp của động vật như thế nào?",
    "re": "Quá trình hô hấp sẽ tăng cường, dẫn đến tiêu thụ oxy nhiều hơn."
  },
  {
    "con": "các tế bào không nhận đủ nước, ảnh hưởng đến chức năng của chúng ra sao?",
    "re": "Tế bào sẽ bị co lại và có thể chết nếu tình trạng thiếu nước kéo dài."
  },
  {
    "con": "có sự hiện diện của ánh sáng và nước, cây sẽ thực hiện quá trình gì?",
    "re": "Cây sẽ thực hiện quá trình quang hợp để tạo ra thức ăn."
  },
  {
    "con": "một loài động vật bị mất môi trường sống tự nhiên, điều gì sẽ xảy ra?",
    "re": "Loài động vật đó có thể bị đe dọa hoặc tuyệt chủng."
  },
  {
    "con": "các vi sinh vật sống trong đất, ảnh hưởng đến sự phát triển của cây như thế nào?",
    "re": "Chúng giúp phân hủy chất hữu cơ và cung cấp dinh dưỡng cho cây."
  },
  {
    "con": "có sự cạnh tranh giữa các loài trong cùng một môi trường, điều gì sẽ xảy ra?",
    "re": "Một số loài có thể phát triển mạnh hơn và chiếm ưu thế, trong khi các loài khác có thể suy giảm."
  },
  {
    "con": "các gen di truyền từ cha mẹ sang con cái, ảnh hưởng đến đặc điểm của con cái ra sao?",
    "re": "Con cái sẽ mang các đặc điểm di truyền từ cha mẹ, tạo nên sự đa dạng trong quần thể."
  },
  {
    "con": "các loài động vật ăn thịt và con mồi tồn tại trong cùng một hệ sinh thái, điều gì sẽ xảy ra?",
    "re": "Sự cân bằng giữa số lượng động vật ăn thịt và con mồi sẽ ảnh hưởng đến sự ổn định của hệ sinh thái."
  },
  {
    "con": "các chất ô nhiễm được thải ra môi trường, ảnh hưởng đến sức khỏe của sinh vật như thế nào?",
    "re": "Chúng có thể gây ra bệnh tật và giảm khả năng sinh sản của sinh vật."
  },
  {
    "con": "Tầng Cutin dày trên bề mặt lá của các cây xanh sống ở vùng nhiệt đới có tác dụng gì?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc tế bào nhân thực thì nó sẽ có nhân tế bào rõ ràng.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài động vật có khả năng sinh sản nhanh chóng thì nó có thể thích nghi tốt hơn với môi trường thay đổi.",
    "re": "Đúng"
  },
  {
    "con": "Nếu cây xanh thực hiện quang hợp thì nó sẽ sản xuất ra oxy và glucose.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước thì nó có thể có các đặc điểm thích nghi như mang hoặc vây.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài thực vật có hoa thì nó có khả năng sinh sản hữu tính.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật có hệ thống tiêu hóa phức tạp thì nó có thể tiêu hóa nhiều loại thức ăn khác nhau.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài động vật có lớp lông dày thì nó có thể sống trong môi trường lạnh.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một tế bào bị tổn thương thì nó có thể kích hoạt quá trình tự phục hồi.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng di chuyển thì nó có thể tìm kiếm thức ăn và nơi ở tốt hơn.",
    "re": "Đúng"
  },
  {
    "con": "Nhịp điệu chiếu sáng ngày và đêm ảnh hưởng tới hoạt động của nhiều loài động vật như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Năng lượng từ mặt trời được chuyển hóa thành năng lượng hóa học trong quá trình quang hợp ra sao?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sự di truyền của các đặc điểm từ cha mẹ sang con cái diễn ra như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các tế bào trong cơ thể người có chức năng khác nhau như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sự tương tác giữa các loài trong một hệ sinh thái ảnh hưởng đến sự tồn tại của chúng ra sao?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Quá trình tiêu hóa thức ăn trong cơ thể diễn ra như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sự phát triển của thực vật phụ thuộc vào các yếu tố môi trường như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các loại vi sinh vật có vai trò gì trong chu trình dinh dưỡng của hệ sinh thái?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sự tiến hóa của các loài diễn ra qua các thế hệ như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hệ miễn dịch của cơ thể hoạt động để bảo vệ chống lại bệnh tật như thế nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Đặc điểm cấu tạo của động vật vùng lạnh có ý nghĩa giúp chúng giữ nhiệt cho cơ thể chống rét là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu thực vật quang hợp thì chúng sẽ sản xuất ra oxy và glucose.",
    "re": "Quá trình quang hợp là rất quan trọng cho sự sống trên Trái Đất."
  },
  {
    "con": "Nếu tế bào không có nhân thì chúng sẽ không thể thực hiện các chức năng sinh học phức tạp.",
    "re": "Tế bào nhân sơ thường đơn giản hơn tế bào nhân thực."
  },
  {
    "con": "Nếu động vật có xương sống thì chúng thuộc nhóm động vật có cấu trúc xương và hệ thần kinh phát triển.",
    "re": "Động vật có xương sống bao gồm cá, lưỡng cư, bò sát, chim và thú."
  },
  {
    "con": "Nếu môi trường sống thay đổi thì các loài sinh vật có thể phải thích nghi hoặc di cư.",
    "re": "Sự thích nghi là một yếu tố quan trọng trong tiến hóa."
  },
  {
    "con": "Nếu một loài động vật bị tuyệt chủng thì nó sẽ không còn tồn tại trên Trái Đất.",
    "re": "Sự tuyệt chủng có thể ảnh hưởng đến hệ sinh thái và sự đa dạng sinh học."
  },
  {
    "con": "Nếu các tế bào trong cơ thể không được cung cấp đủ dinh dưỡng thì chúng sẽ không hoạt động hiệu quả.",
    "re": "Dinh dưỡng là yếu tố thiết yếu cho sự sống và phát triển của tế bào."
  },
  {
    "con": "Nếu một loài thực vật có hoa thì nó sẽ có khả năng sinh sản hữu tính.",
    "re": "Hoa là cơ quan sinh sản của thực vật có hoa."
  },
  {
    "con": "Nếu vi khuẩn có khả năng kháng thuốc thì chúng có thể sống sót và phát triển ngay cả khi có sự hiện diện của kháng sinh.",
    "re": "Kháng thuốc là một vấn đề nghiêm trọng trong y tế hiện đại."
  },
  {
    "con": "Nếu chuỗi thức ăn bị phá vỡ thì sự cân bằng của hệ sinh thái sẽ bị ảnh hưởng.",
    "re": "Mỗi loài trong chuỗi thức ăn đều có vai trò quan trọng trong hệ sinh thái."
  },
  {
    "con": "Động vật ăn thịt con mồi, động vật ăn thực vật có quan hệ khác loài nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu thực vật quang hợp, thì chúng sẽ sản xuất ra gì?",
    "re": "Oxy và glucose"
  },
  {
    "con": "Nếu một sinh vật có tế bào nhân thực, thì nó thuộc nhóm nào?",
    "re": "Nhóm sinh vật eukaryote"
  },
  {
    "con": "Nếu một loài động vật sống trong môi trường nước, thì nó có thể có đặc điểm gì?",
    "re": "Vây và mang"
  },
  {
    "con": "Nếu một tế bào phân chia, thì nó sẽ tạo ra bao nhiêu tế bào con?",
    "re": "Hai tế bào con"
  },
  {
    "con": "Nếu một sinh vật có ADN, thì nó có khả năng làm gì?",
    "re": "Di truyền thông tin di truyền"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó có thể được phân loại vào nhóm nào?",
    "re": "Nhóm thực vật có hoa (Angiosperms)"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường khô hạn, thì nó có thể có đặc điểm gì?",
    "re": "Lá nhỏ hoặc có lớp sáp bảo vệ"
  },
  {
    "con": "Nếu một sinh vật có hệ tiêu hóa phức tạp, thì nó có thể thuộc nhóm nào?",
    "re": "Động vật có xương sống"
  },
  {
    "con": "Nếu một loài vi khuẩn có khả năng sống trong môi trường cực đoan, thì nó được gọi là gì?",
    "re": "Vi khuẩn cực đoan (extremophiles)"
  },
  {
    "con": "Khi có gió bão, thực vật sống thành nhóm có lợi gì so với sống riêng rẽ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi tế bào phân chia, chúng tạo ra hai tế bào con giống nhau về mặt di truyền.",
    "re": "Điều này đúng với quá trình phân bào nguyên phân."
  },
  {
    "con": "Khi thực vật quang hợp, chúng sử dụng ánh sáng mặt trời để chuyển đổi carbon dioxide và nước thành glucose.",
    "re": "Quá trình này sản sinh ra oxy như một sản phẩm phụ."
  },
  {
    "con": "Khi động vật ăn thực vật, chúng nhận được năng lượng từ thực vật thông qua chuỗi thức ăn.",
    "re": "Điều này giúp duy trì sự sống trong hệ sinh thái."
  },
  {
    "con": "Khi môi trường sống thay đổi, các loài có thể thích nghi hoặc bị tuyệt chủng.",
    "re": "Sự thích nghi là một yếu tố quan trọng trong tiến hóa."
  },
  {
    "con": "Khi DNA bị tổn thương, tế bào có thể không hoạt động đúng cách.",
    "re": "Điều này có thể dẫn đến các bệnh di truyền hoặc ung thư."
  },
  {
    "con": "Khi vi khuẩn phát triển trong môi trường ẩm ướt, chúng có thể sinh sản nhanh chóng.",
    "re": "Điều này có thể gây ra nhiễm trùng hoặc bệnh tật."
  },
  {
    "con": "Khi các loài khác nhau sống trong cùng một môi trường, chúng có thể cạnh tranh cho tài nguyên.",
    "re": "Sự cạnh tranh này có thể ảnh hưởng đến sự phát triển và sinh sản của chúng."
  },
  {
    "con": "Khi một loài bị xóa sổ, nó có thể ảnh hưởng đến toàn bộ hệ sinh thái.",
    "re": "Sự mất mát này có thể dẫn đến sự mất cân bằng sinh thái."
  },
  {
    "con": "Khi các tế bào miễn dịch nhận diện mầm bệnh, chúng sẽ phản ứng để bảo vệ cơ thể.",
    "re": "Quá trình này là một phần quan trọng của hệ thống miễn dịch."
  },
  {
    "con": "Tế bào là đơn vị cơ bản của sự sống",
    "re": "Tất cả sinh vật đều được cấu tạo từ tế bào"
  },
  {
    "con": "Năng lượng từ ánh sáng mặt trời được thực vật hấp thụ",
    "re": "Quá trình quang hợp xảy ra"
  },
  {
    "con": "Mỗi loài sinh vật đều có bộ gen riêng",
    "re": "Thông tin di truyền được truyền từ thế hệ này sang thế hệ khác"
  },
  {
    "con": "Sự phân chia tế bào xảy ra khi tế bào lớn lên",
    "re": "Tế bào mới được tạo ra để thay thế tế bào cũ"
  },
  {
    "con": "Sự sống trên Trái Đất phụ thuộc vào nước",
    "re": "Nước là môi trường cần thiết cho các phản ứng sinh hóa"
  },
  {
    "con": "Các loài động vật có xương sống có hệ thần kinh phát triển",
    "re": "Chúng có khả năng phản ứng nhanh với môi trường"
  },
  {
    "con": "Vi khuẩn có thể sống trong nhiều môi trường khác nhau",
    "re": "Chúng có vai trò quan trọng trong chu trình dinh dưỡng"
  },
  {
    "con": "Sự tiến hóa xảy ra qua quá trình chọn lọc tự nhiên",
    "re": "Các đặc điểm có lợi sẽ được truyền lại cho thế hệ sau"
  },
  {
    "con": "Thực vật và động vật đều có vai trò trong hệ sinh thái",
    "re": "Chúng tương tác và duy trì sự cân bằng sinh thái"
  },
  {
    "con": "Sự đa dạng sinh học là cần thiết cho sự tồn tại của hệ sinh thái",
    "re": "Nó giúp hệ sinh thái có khả năng phục hồi và thích nghi"
  },
  {
    "con": "Nguyên nhân gây cháy nhiều khu rừng thời nguyên thuỷ là do",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hậu quả gây nên cho môi trường tự nhiên do con người săn bắt động vật quá mức là",
    "re": "sự suy giảm đa dạng sinh học và mất cân bằng hệ sinh thái"
  },
  {
    "con": "Nếu thực vật không có ánh sáng mặt trời",
    "re": "chúng sẽ không thể thực hiện quá trình quang hợp"
  },
  {
    "con": "Nếu một loài động vật bị tuyệt chủng",
    "re": "nó có thể gây ra sự thay đổi trong chuỗi thức ăn và ảnh hưởng đến các loài khác"
  },
  {
    "con": "Nếu môi trường sống bị ô nhiễm",
    "re": "sức khỏe của các sinh vật sống trong đó sẽ bị ảnh hưởng tiêu cực"
  },
  {
    "con": "Nếu tế bào không có màng tế bào",
    "re": "chúng sẽ không thể duy trì môi trường nội bào ổn định"
  },
  {
    "con": "Nếu con người tiêu thụ quá nhiều thực phẩm chế biến sẵn",
    "re": "họ có nguy cơ cao mắc các bệnh liên quan đến dinh dưỡng"
  },
  {
    "con": "Nếu động vật di cư đến nơi ở mới",
    "re": "chúng có thể tìm kiếm nguồn thức ăn và môi trường sống tốt hơn"
  },
  {
    "con": "Nếu một loài thực vật phát triển trong điều kiện khô hạn",
    "re": "nó sẽ phát triển các đặc điểm thích nghi để sống sót"
  },
  {
    "con": "Nếu các loài sinh vật sống trong cùng một môi trường",
    "re": "chúng sẽ cạnh tranh với nhau về nguồn tài nguyên"
  },
  {
    "con": "Nếu một sinh vật có ADN khác biệt với loài khác",
    "re": "nó sẽ có những đặc điểm di truyền khác nhau"
  },
  {
    "con": "ở thế hệ xuất phát P có kiểu gen 100% Aa, phải trải qua 2 thế hệ tự thụ phấn",
    "re": "tỉ lệ thể dị hợp ở F2 là 1/4"
  },
  {
    "con": "các sinh vật sống trong môi trường khác nhau",
    "re": "sẽ có sự thích nghi khác nhau để tồn tại"
  },
  {
    "con": "một tế bào nhân thực có nhân và các bào quan",
    "re": "sẽ có khả năng thực hiện các chức năng sống phức tạp hơn tế bào nhân sơ"
  },
  {
    "con": "các loài sinh vật khác nhau sống trong cùng một môi trường",
    "re": "sẽ cạnh tranh với nhau về tài nguyên"
  },
  {
    "con": "nếu một gen bị đột biến",
    "re": "có thể dẫn đến sự thay đổi trong tính trạng của sinh vật"
  },
  {
    "con": "các chuỗi thức ăn trong một hệ sinh thái",
    "re": "sẽ thể hiện mối quan hệ giữa các sinh vật và nguồn năng lượng"
  },
  {
    "con": "nếu một loài bị tuyệt chủng",
    "re": "sẽ ảnh hưởng đến toàn bộ hệ sinh thái mà nó thuộc về"
  },
  {
    "con": "các tế bào thực vật có thành tế bào",
    "re": "sẽ giúp chúng duy trì hình dạng và bảo vệ khỏi tác động bên ngoài"
  },
  {
    "con": "nếu nhiệt độ môi trường tăng lên",
    "re": "có thể ảnh hưởng đến sự phát triển và sinh sản của các loài sinh vật"
  },
  {
    "con": "các loài động vật ăn thịt và động vật ăn cỏ",
    "re": "sẽ duy trì sự cân bằng trong chuỗi thức ăn"
  },
  {
    "con": "Giao phối cận huyết là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào thực vật có thành tế bào:",
    "re": "Tế bào động vật không có thành tế bào"
  },
  {
    "con": "Quá trình quang hợp xảy ra trong lá cây:",
    "re": "Cây sản xuất glucose và oxy"
  },
  {
    "con": "DNA chứa thông tin di truyền:",
    "re": "DNA quyết định đặc điểm của sinh vật"
  },
  {
    "con": "Sự phân bào nguyên phân xảy ra trong tế bào sinh dưỡng:",
    "re": "Tạo ra hai tế bào con giống hệt nhau"
  },
  {
    "con": "Hệ sinh thái bao gồm các sinh vật và môi trường sống của chúng:",
    "re": "Hệ sinh thái duy trì sự cân bằng sinh học"
  },
  {
    "con": "Vi khuẩn có thể sống trong môi trường khắc nghiệt:",
    "re": "Vi khuẩn có khả năng thích nghi cao"
  },
  {
    "con": "Sự tiến hóa xảy ra qua quá trình chọn lọc tự nhiên:",
    "re": "Các đặc điểm có lợi sẽ được truyền lại cho thế hệ sau"
  },
  {
    "con": "Protein được tổng hợp từ axit amin:",
    "re": "Protein thực hiện nhiều chức năng trong cơ thể"
  },
  {
    "con": "Hệ tuần hoàn vận chuyển máu trong cơ thể:",
    "re": "Cung cấp oxy và chất dinh dưỡng cho các tế bào"
  },
  {
    "con": "Những cây sống ở nơi khô hạn thường có những đặc điểm thích nghi nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào thực vật có thành tế bào, trong khi tế bào động vật không có.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản, thì nó có thể truyền gen cho thế hệ sau.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một loài động vật có bộ lông dày, thì nó thường sống ở những vùng lạnh giá.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng quang hợp, thì nó thường là thực vật.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu môi trường sống của một loài bị thay đổi, thì loài đó có thể bị đe dọa hoặc tuyệt chủng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có hệ tiêu hóa phức tạp, thì nó có thể tiêu hóa nhiều loại thức ăn khác nhau.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một loài có khả năng di cư, thì nó có thể tìm kiếm nguồn thức ăn và môi trường sống tốt hơn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có màu sắc sặc sỡ, thì nó có thể có vai trò trong việc thu hút bạn tình hoặc cảnh báo kẻ thù.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một loài động vật có khả năng sống dưới nước, thì nó thường có các đặc điểm như vây và mang.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cây xanh quang hợp trong ánh sáng mặt trời",
    "re": "sản xuất oxy và glucose"
  },
  {
    "con": "Sự phân chia tế bào xảy ra trong quá trình sinh sản",
    "re": "tạo ra các tế bào mới"
  },
  {
    "con": "Động vật ăn thực vật sẽ nhận được năng lượng từ thực vật",
    "re": "cung cấp năng lượng cho chuỗi thức ăn"
  },
  {
    "con": "Nước và khoáng chất được hấp thụ qua rễ cây",
    "re": "cung cấp dinh dưỡng cho cây"
  },
  {
    "con": "Sự tiến hóa xảy ra khi có sự thay đổi trong môi trường",
    "re": "các loài có thể thích nghi hoặc tuyệt chủng"
  },
  {
    "con": "Gen di truyền từ cha mẹ sang con cái",
    "re": "quyết định đặc điểm di truyền của con cái"
  },
  {
    "con": "Vi khuẩn có thể phát triển nhanh chóng trong điều kiện thuận lợi",
    "re": "gây ra bệnh tật hoặc phân hủy chất hữu cơ"
  },
  {
    "con": "Sự đa dạng sinh học trong một hệ sinh thái",
    "re": "tăng cường khả năng chống chịu với thay đổi môi trường"
  },
  {
    "con": "Sự tương tác giữa các loài trong một hệ sinh thái",
    "re": "tạo ra mối quan hệ phức tạp giữa các sinh vật"
  },
  {
    "con": "Sự tiêu thụ năng lượng trong chuỗi thức ăn",
    "re": "giảm dần từ cấp độ này sang cấp độ khác"
  },
  {
    "con": "Tập hợp nào sau đây là quần thể sinh vật tự nhiên?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sinh vật có tế bào nhân thực thì nó thuộc về nhóm nào?",
    "re": "Nó thuộc về nhóm sinh vật nhân thực"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn thì nó được gọi là gì?",
    "re": "Nó được gọi là sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài động vật có xương sống thì nó thuộc về nhóm nào?",
    "re": "Nó thuộc về nhóm động vật có xương sống"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường nước thì nó có thể là gì?",
    "re": "Nó có thể là sinh vật thủy sinh"
  },
  {
    "con": "Nếu một tế bào có nhiều ti thể thì nó có khả năng gì?",
    "re": "Nó có khả năng sản xuất năng lượng cao"
  },
  {
    "con": "Nếu một loài thực vật có hoa thì nó thuộc về nhóm nào?",
    "re": "Nó thuộc về nhóm thực vật có hoa"
  },
  {
    "con": "Nếu một sinh vật có khả năng thích nghi với môi trường sống thì nó có thể tồn tại lâu dài hơn.",
    "re": "Nó có thể tồn tại lâu dài hơn"
  },
  {
    "con": "Nếu một loài động vật ăn thịt thì nó có vai trò gì trong hệ sinh thái?",
    "re": "Nó có vai trò là kẻ săn mồi"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản nhanh chóng thì nó có thể làm gì?",
    "re": "Nó có thể gia tăng quần thể nhanh chóng"
  },
  {
    "con": "Khi nói về quan hệ dinh dưỡng, thứ tự nào sau đây là đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn, thì nó được gọi là gì?",
    "re": "Sinh vật tự dưỡng"
  },
  {
    "con": "Nếu tế bào không có nhân, thì nó thuộc loại tế bào nào?",
    "re": "Tế bào prokaryote"
  },
  {
    "con": "Nếu một loài động vật có xương sống, thì nó thuộc nhóm nào?",
    "re": "Động vật có xương sống"
  },
  {
    "con": "Nếu một loài thực vật có hoa, thì nó thuộc nhóm nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong môi trường khắc nghiệt, thì nó được gọi là gì?",
    "re": "Sinh vật cực đoan"
  },
  {
    "con": "Nếu một tế bào phân chia thành hai tế bào con, thì quá trình này được gọi là gì?",
    "re": "Phân bào"
  },
  {
    "con": "Nếu một loài động vật có khả năng bay, thì nó thường có đặc điểm gì?",
    "re": "Cánh"
  },
  {
    "con": "Nếu một sinh vật có khả năng thích nghi với môi trường sống của nó, thì nó có thể tồn tại lâu dài hơn.",
    "re": "Đúng"
  },
  {
    "con": "Nếu một loài thực vật không có khả năng quang hợp, thì nó phải lấy thức ăn từ đâu?",
    "re": "Từ môi trường xung quanh"
  },
  {
    "con": "Khi lai giữa các dòng thuần mang kiểu gen khác nhau",
    "re": "ưu thế lai biểu hiện rõ nhất ở thế hệ con lai"
  },
  {
    "con": "Khi tế bào phân chia qua quá trình nguyên phân",
    "re": "số lượng tế bào tăng gấp đôi mà vẫn giữ nguyên bộ gen"
  },
  {
    "con": "Khi thực vật quang hợp",
    "re": "chúng chuyển đổi ánh sáng mặt trời thành năng lượng hóa học"
  },
  {
    "con": "Khi một loài động vật sống trong môi trường khắc nghiệt",
    "re": "nó sẽ phát triển các đặc điểm thích nghi để sinh tồn"
  },
  {
    "con": "Khi DNA bị tổn thương",
    "re": "các cơ chế sửa chữa DNA sẽ được kích hoạt để khôi phục lại cấu trúc"
  },
  {
    "con": "Khi một sinh vật bị thiếu oxy",
    "re": "nó có thể chuyển sang quá trình lên men để tạo ra năng lượng"
  },
  {
    "con": "Khi các loài khác nhau sống trong cùng một môi trường",
    "re": "chúng có thể cạnh tranh tài nguyên để sinh tồn"
  },
  {
    "con": "Khi một tế bào thực hiện quá trình hô hấp tế bào",
    "re": "nó sẽ sản xuất ATP như là nguồn năng lượng chính"
  },
  {
    "con": "Khi một loài động vật di cư",
    "re": "nó thường tìm kiếm nguồn thức ăn hoặc môi trường sống tốt hơn"
  },
  {
    "con": "Khi các gen trên nhiễm sắc thể được di truyền",
    "re": "chúng sẽ xác định các đặc điểm di truyền của thế hệ sau"
  },
  {
    "con": "Môi trường là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào là đơn vị cơ bản của sự sống",
    "re": "Tất cả sinh vật đều được cấu tạo từ tế bào"
  },
  {
    "con": "Năng lượng mặt trời được hấp thụ bởi cây xanh",
    "re": "Cây xanh thực hiện quá trình quang hợp"
  },
  {
    "con": "Gen di truyền được truyền từ cha mẹ sang con cái",
    "re": "Đặc điểm di truyền của sinh vật được xác định"
  },
  {
    "con": "Sự phân hủy chất hữu cơ xảy ra trong môi trường",
    "re": "Vi khuẩn và nấm đóng vai trò quan trọng trong chu trình dinh dưỡng"
  },
  {
    "con": "Sự đa dạng sinh học trong một hệ sinh thái cao",
    "re": "Hệ sinh thái đó có khả năng chống chịu tốt hơn với biến đổi môi trường"
  },
  {
    "con": "Cơ thể con người có nhiều hệ thống khác nhau",
    "re": "Mỗi hệ thống đảm nhiệm một chức năng sống thiết yếu"
  },
  {
    "con": "Sự tiến hóa xảy ra qua hàng triệu năm",
    "re": "Các loài có thể thay đổi để thích nghi với môi trường"
  },
  {
    "con": "Nước là thành phần chính của tế bào",
    "re": "Nước đóng vai trò quan trọng trong các phản ứng sinh hóa"
  },
  {
    "con": "Thực vật và động vật có mối quan hệ tương tác",
    "re": "Chúng tạo thành chuỗi thức ăn trong hệ sinh thái"
  },
  {
    "con": "Trong môi trường, các cá thể sinh vật được xếp vào nhóm nhân tố sinh thái",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các tế bào sống đều có cấu trúc cơ bản giống nhau",
    "re": "Tất cả các sinh vật đều được tạo thành từ tế bào"
  },
  {
    "con": "Khi một sinh vật bị thiếu oxy trong thời gian dài",
    "re": "Nó có thể chết do thiếu hụt năng lượng"
  },
  {
    "con": "Nếu một loài sinh vật không thích nghi với môi trường sống của nó",
    "re": "Loài đó có nguy cơ tuyệt chủng cao"
  },
  {
    "con": "Khi thực vật quang hợp, chúng sử dụng ánh sáng mặt trời",
    "re": "Chúng sản xuất ra oxy và glucose"
  },
  {
    "con": "Nếu một sinh vật có ADN khác biệt với loài khác",
    "re": "Nó có thể biểu hiện các đặc điểm khác nhau"
  },
  {
    "con": "Khi nhiệt độ môi trường tăng lên",
    "re": "Nhiều loài động vật có thể di cư đến nơi mát mẻ hơn"
  },
  {
    "con": "Nếu một sinh vật ăn thực vật",
    "re": "Nó được gọi là động vật ăn cỏ"
  },
  {
    "con": "Khi một sinh vật bị nhiễm bệnh",
    "re": "Hệ miễn dịch sẽ phản ứng để chống lại mầm bệnh"
  },
  {
    "con": "Nếu một loài động vật có cấu trúc cơ thể đặc biệt",
    "re": "Nó có thể thích nghi tốt hơn với môi trường sống của mình"
  },
  {
    "con": "Ưu thế lai cao nhất biểu hiện ở kiểu gen",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào không có nhân",
    "re": "Được gọi là tế bào prokaryote"
  },
  {
    "con": "Năng lượng từ ánh sáng mặt trời được chuyển hóa thành năng lượng hóa học",
    "re": "Quá trình quang hợp xảy ra"
  },
  {
    "con": "Mỗi loài sinh vật đều có bộ gen riêng",
    "re": "Đặc điểm di truyền của loài đó được xác định"
  },
  {
    "con": "Sự phân chia tế bào xảy ra trong quá trình sinh sản",
    "re": "Tế bào mới được tạo ra"
  },
  {
    "con": "Nước là thành phần chính của tế bào",
    "re": "Nó đóng vai trò quan trọng trong các phản ứng sinh hóa"
  },
  {
    "con": "Các loài sinh vật sống trong cùng một môi trường",
    "re": "Tạo thành một hệ sinh thái"
  },
  {
    "con": "Sự tiến hóa xảy ra qua nhiều thế hệ",
    "re": "Loài có thể thích nghi với môi trường"
  },
  {
    "con": "Protein được tổng hợp từ axit amin",
    "re": "Chúng thực hiện nhiều chức năng trong cơ thể"
  },
  {
    "con": "Sự di truyền tính trạng từ cha mẹ sang con cái",
    "re": "Được quy định bởi các gen"
  },
  {
    "con": "Yếu tố ánh sáng thuộc nhóm nhân tố sinh thái",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào là đơn vị cơ bản của sự sống",
    "re": "Tất cả sinh vật đều được cấu tạo từ tế bào"
  },
  {
    "con": "Quá trình quang hợp xảy ra ở thực vật",
    "re": "Thực vật sản xuất ra oxy và glucose"
  },
  {
    "con": "DNA chứa thông tin di truyền",
    "re": "DNA quyết định đặc điểm của sinh vật"
  },
  {
    "con": "Hệ sinh thái bao gồm các sinh vật và môi trường sống của chúng",
    "re": "Hệ sinh thái có thể tự duy trì và phát triển"
  },
  {
    "con": "Sự tiến hóa xảy ra qua quá trình chọn lọc tự nhiên",
    "re": "Các đặc điểm có lợi sẽ được truyền lại cho thế hệ sau"
  },
  {
    "con": "Nước là thành phần thiết yếu cho sự sống",
    "re": "Nước tham gia vào nhiều phản ứng sinh hóa trong cơ thể"
  },
  {
    "con": "Protein được tổng hợp từ axit amin",
    "re": "Protein đóng vai trò quan trọng trong cấu trúc và chức năng tế bào"
  },
  {
    "con": "Vi khuẩn có thể sống trong nhiều môi trường khác nhau",
    "re": "Vi khuẩn có thể có lợi hoặc có hại cho con người"
  },
  {
    "con": "Các loài sinh vật có thể tương tác với nhau",
    "re": "Tương tác này có thể là cạnh tranh, hợp tác hoặc ký sinh"
  },
  {
    "con": "Trong một chuỗi thức ăn, cây xanh là",
    "re": "nguồn năng lượng chính"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn thì",
    "re": "nó được gọi là sinh vật tự dưỡng"
  },
  {
    "con": "Khi tế bào phân chia, nếu xảy ra lỗi trong quá trình sao chép DNA thì",
    "re": "có thể dẫn đến đột biến"
  },
  {
    "con": "Nếu một loài động vật sống trong môi trường nước thì",
    "re": "nó có thể có các đặc điểm thích nghi như vây và mang"
  },
  {
    "con": "Khi một sinh vật chết đi, nếu không có vi sinh vật phân hủy thì",
    "re": "các chất hữu cơ sẽ không được tái chế"
  },
  {
    "con": "Nếu một loài thực vật không nhận đủ ánh sáng mặt trời thì",
    "re": "nó sẽ không thể thực hiện quang hợp hiệu quả"
  },
  {
    "con": "Nếu một sinh vật có hệ miễn dịch mạnh mẽ thì",
    "re": "nó có khả năng chống lại bệnh tật tốt hơn"
  },
  {
    "con": "Khi một loài động vật di cư đến nơi khác để tìm kiếm thức ăn thì",
    "re": "đó được gọi là hành vi di cư"
  },
  {
    "con": "Nếu một sinh vật sống trong môi trường khô hạn thì",
    "re": "nó có thể phát triển các đặc điểm thích nghi như lá nhỏ hoặc thân mọng nước"
  },
  {
    "con": "Nếu một loài động vật có cấu trúc cơ thể đối xứng thì",
    "re": "nó có thể di chuyển hiệu quả hơn trong môi trường sống của mình"
  },
  {
    "con": "Loài chỉ có ở một quần xã hoặc có số lượng nhiều hơn hẳn các loài khác trong quần xã được gọi là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào thực vật có thành tế bào và chứa diệp lục thì",
    "re": "Có khả năng quang hợp"
  },
  {
    "con": "Nếu một loài động vật có khả năng sinh sản nhanh chóng và thích nghi tốt với môi trường thì",
    "re": "Loài đó có khả năng phát triển mạnh mẽ trong quần thể"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc tế bào đơn giản hơn thì",
    "re": "Nó được phân loại là prokaryote"
  },
  {
    "con": "Nếu một loài thực vật không có hoa thì",
    "re": "Nó thuộc nhóm thực vật hạt trần hoặc rêu"
  },
  {
    "con": "Nếu một sinh vật có hệ thống tuần hoàn mở thì",
    "re": "Nó thường là động vật không xương sống như động vật giáp xác"
  },
  {
    "con": "Nếu một loài động vật có bộ xương trong thì",
    "re": "Nó được phân loại là động vật có xương sống"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn thì",
    "re": "Nó được gọi là sinh vật tự dưỡng"
  },
  {
    "con": "Nếu một loài động vật có khả năng di cư theo mùa thì",
    "re": "Nó có thể tìm kiếm nguồn thức ăn và môi trường sống tốt hơn"
  },
  {
    "con": "Nếu một sinh vật có thể sống trong môi trường cực đoan thì",
    "re": "Nó được gọi là sinh vật cực đoan"
  },
  {
    "con": "Nhóm sinh vật nào dưới đây được xếp vào nhóm động vật hằng nhiệt?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời,",
    "re": "thì sinh vật đó được gọi là thực vật quang hợp."
  },
  {
    "con": "Nếu một tế bào có nhân và các bào quan,",
    "re": "thì tế bào đó được gọi là tế bào eukaryote."
  },
  {
    "con": "Nếu một loài động vật có xương sống,",
    "re": "thì nó thuộc vào nhóm động vật có xương."
  },
  {
    "con": "Nếu một sinh vật có khả năng thích nghi với môi trường sống của nó,",
    "re": "thì nó có khả năng sống sót và phát triển tốt hơn."
  },
  {
    "con": "Nếu một loài thực vật có hoa và quả,",
    "re": "thì nó được xếp vào nhóm thực vật hạt kín."
  },
  {
    "con": "Nếu một sinh vật có cấu trúc cơ thể phân chia thành các phần khác nhau,",
    "re": "thì nó có thể được phân loại là động vật đa bào."
  },
  {
    "con": "Nếu một sinh vật có khả năng di chuyển và tìm kiếm thức ăn,",
    "re": "thì nó được coi là động vật."
  },
  {
    "con": "Nếu một tế bào nhân thực phân chia bằng cách nguyên phân,",
    "re": "thì nó tạo ra hai tế bào con giống hệt nhau."
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản bằng cách phân chia,",
    "re": "thì nó có thể là một sinh vật đơn bào."
  },
  {
    "con": "Quan hệ giữa hai loài sinh vật trong đó cả hai bên cùng có lợi là mối quan hệ",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào thực vật có thành tế bào và lục lạp",
    "re": "Tế bào thực vật có khả năng quang hợp"
  },
  {
    "con": "Nước là một yếu tố cần thiết cho sự sống",
    "re": "Tất cả sinh vật đều cần nước để tồn tại"
  },
  {
    "con": "Quá trình phân bào tạo ra hai tế bào con giống hệt nhau",
    "re": "Đó là quá trình nguyên phân"
  },
  {
    "con": "Mỗi loài sinh vật đều có bộ gen riêng",
    "re": "Bộ gen quyết định đặc điểm di truyền của loài đó"
  },
  {
    "con": "Sự tiến hóa xảy ra qua quá trình chọn lọc tự nhiên",
    "re": "Loài thích nghi tốt hơn sẽ sống sót và sinh sản nhiều hơn"
  },
  {
    "con": "Thực vật sử dụng ánh sáng mặt trời để tạo ra năng lượng",
    "re": "Quá trình này gọi là quang hợp"
  },
  {
    "con": "Hệ sinh thái bao gồm các sinh vật và môi trường sống của chúng",
    "re": "Các yếu tố sinh thái tương tác với nhau để duy trì sự cân bằng"
  },
  {
    "con": "Protein được tạo ra từ axit amin",
    "re": "Chúng đóng vai trò quan trọng trong cấu trúc và chức năng tế bào"
  },
  {
    "con": "Vi khuẩn có thể sống trong nhiều môi trường khác nhau",
    "re": "Chúng có khả năng thích nghi cao với điều kiện sống"
  },
  {
    "con": "Địa y sống bám trên cành cây. Giữa địa y và cây có mối quan hệ",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Thực vật quang hợp trong ánh sáng mặt trời. Quá trình quang hợp tạo ra oxy",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Động vật có xương sống có hệ thống tuần hoàn. Hệ thống tuần hoàn giúp vận chuyển chất dinh dưỡng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Vi khuẩn có thể sống trong môi trường khắc nghiệt. Một số vi khuẩn có khả năng tạo ra năng lượng từ hóa chất",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nấm phân hủy chất hữu cơ. Quá trình phân hủy giúp tái chế chất dinh dưỡng trong môi trường",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các tế bào trong cơ thể có chức năng khác nhau. Sự chuyên biệt của tế bào giúp cơ thể hoạt động hiệu quả",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sự di truyền xảy ra qua gen. Gen quyết định đặc điểm di truyền của sinh vật",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hệ sinh thái bao gồm các sinh vật và môi trường sống của chúng. Sự tương tác giữa các sinh vật tạo ra sự cân bằng trong hệ sinh thái",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sự tiến hóa xảy ra qua quá trình chọn lọc tự nhiên. Chọn lọc tự nhiên giúp các loài thích nghi với môi trường",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là thành phần chính của tế bào. Nước đóng vai trò quan trọng trong các phản ứng sinh hóa",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Thí dụ nào dưới đây là quần thể sinh vật?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sinh vật có khả năng tự sản xuất thức ăn từ ánh sáng mặt trời?",
    "re": "Đó là một thực vật"
  },
  {
    "con": "Một tế bào có nhân và các bào quan được bao bọc bởi màng?",
    "re": "Đó là tế bào eukaryote"
  },
  {
    "con": "Một loài sinh vật có thể sống trong môi trường nước và trên cạn?",
    "re": "Đó là loài lưỡng cư"
  },
  {
    "con": "Một chuỗi thức ăn bắt đầu từ thực vật?",
    "re": "Thực vật là nguồn năng lượng đầu tiên"
  },
  {
    "con": "Một sinh vật có khả năng thích nghi với môi trường sống của nó?",
    "re": "Đó là một đặc điểm sinh tồn"
  },
  {
    "con": "Một loài động vật có vú nuôi con bằng sữa?",
    "re": "Đó là một đặc điểm của động vật có vú"
  },
  {
    "con": "Một tế bào phân chia thành hai tế bào con?",
    "re": "Đó là quá trình phân bào"
  },
  {
    "con": "Một loài sinh vật có thể gây hại cho sức khỏe con người?",
    "re": "Đó là một mầm bệnh"
  },
  {
    "con": "Một quá trình mà thực vật chuyển đổi ánh sáng mặt trời thành năng lượng hóa học?",
    "re": "Đó là quang hợp"
  },
  {
    "con": "Tế bào là đơn vị cơ bản của sự sống.",
    "re": "Mọi sinh vật đều được cấu tạo từ tế bào."
  },
  {
    "con": "Khi thực vật quang hợp, chúng sử dụng ánh sáng mặt trời.",
    "re": "Chúng tạo ra oxy và glucose."
  },
  {
    "con": "Nếu một sinh vật có ADN, thì nó có khả năng di truyền.",
    "re": "Thông tin di truyền sẽ được truyền từ thế hệ này sang thế hệ khác."
  },
  {
    "con": "Khi môi trường thay đổi, sinh vật có thể thích nghi.",
    "re": "Quá trình này giúp sinh vật tồn tại và phát triển."
  },
  {
    "con": "Nếu một loài động vật bị săn bắt quá mức, thì nó có nguy cơ tuyệt chủng.",
    "re": "Sự đa dạng sinh học sẽ bị giảm sút."
  },
  {
    "con": "Khi tế bào phân chia, chúng tạo ra tế bào con.",
    "re": "Quá trình này giúp cơ thể phát triển và sửa chữa."
  },
  {
    "con": "Nếu một sinh vật không có nước, thì nó sẽ không thể sống sót.",
    "re": "Nước là yếu tố thiết yếu cho mọi quá trình sinh học."
  },
  {
    "con": "Khi các loài khác nhau sống trong cùng một môi trường, chúng có thể cạnh tranh.",
    "re": "Sự cạnh tranh này ảnh hưởng đến sự sống còn của các loài."
  },
  {
    "con": "Nếu một sinh vật có hệ miễn dịch khỏe mạnh, thì nó có khả năng chống lại bệnh tật tốt hơn.",
    "re": "Hệ miễn dịch giúp bảo vệ cơ thể khỏi vi khuẩn và virus."
  },
  {
    "con": "Trong quá trình tiến hóa, nếu một loài phát triển đặc điểm mới, thì nó có thể thích nghi tốt hơn với môi trường.",
    "re": "Điều này có thể dẫn đến sự tồn tại lâu dài của loài đó."
  },
  {
    "con": "Trong các tác nhân sau đây, tác nhân chủ yếu nào gây ra ô nhiễm môi trường?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các sinh vật sống cần năng lượng để duy trì sự sống.",
    "re": "Năng lượng chủ yếu đến từ ánh sáng mặt trời qua quá trình quang hợp."
  },
  {
    "con": "Khi một sinh vật bị tổn thương, cơ thể sẽ kích hoạt phản ứng miễn dịch.",
    "re": "Phản ứng miễn dịch giúp bảo vệ cơ thể khỏi các tác nhân gây bệnh."
  },
  {
    "con": "Trong quá trình sinh sản, các gen từ cha mẹ được truyền cho con cái.",
    "re": "Gen quyết định nhiều đặc điểm di truyền của con cái."
  },
  {
    "con": "Khi môi trường thay đổi, các sinh vật có thể thích nghi hoặc bị tuyệt chủng.",
    "re": "Sự thích nghi giúp sinh vật tồn tại và phát triển trong môi trường mới."
  },
  {
    "con": "Các tế bào trong cơ thể sống đều có cấu trúc và chức năng riêng.",
    "re": "Cấu trúc tế bào quyết định chức năng của nó trong cơ thể."
  },
  {
    "con": "Khi một loài bị xâm lấn bởi loài khác, sự cạnh tranh sẽ xảy ra.",
    "re": "Sự cạnh tranh có thể dẫn đến sự suy giảm quần thể của loài bản địa."
  },
  {
    "con": "Khi một sinh vật chết, các chất dinh dưỡng trong cơ thể sẽ được tái chế.",
    "re": "Quá trình phân hủy giúp cung cấp chất dinh dưỡng cho đất và cây cối."
  },
  {
    "con": "Khi nhiệt độ môi trường tăng lên, một số loài có thể di cư đến nơi mát mẻ hơn.",
    "re": "Di cư giúp sinh vật tìm kiếm môi trường sống phù hợp hơn."
  },
  {
    "con": "Khi một loài có nhiều cá thể, sự đa dạng di truyền sẽ cao hơn.",
    "re": "Đa dạng di truyền giúp loài có khả năng thích nghi tốt hơn với thay đổi môi trường."
  },
  {
    "con": "Trong chuỗi thức ăn, sinh vật sản xuất là nguồn năng lượng chính.",
    "re": "Sinh vật tiêu thụ phụ thuộc vào sinh vật sản xuất để tồn tại."
  },
  {
    "con": "Dấu hiệu đặc trưng của quần xã là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào có nhân và các bào quan thì",
    "re": "Được gọi là tế bào eukaryote"
  },
  {
    "con": "Năng lượng trong chuỗi thức ăn được truyền từ sinh vật này sang sinh vật khác thì",
    "re": "Mỗi cấp độ sẽ giảm đi khoảng 90% năng lượng"
  },
  {
    "con": "Quá trình quang hợp xảy ra trong lá cây thì",
    "re": "Cây sản xuất ra glucose và oxy"
  },
  {
    "con": "DNA chứa thông tin di truyền thì",
    "re": "Nó quyết định đặc điểm của sinh vật"
  },
  {
    "con": "Sự phân chia tế bào diễn ra qua các giai đoạn thì",
    "re": "Tế bào mới được tạo ra từ tế bào mẹ"
  },
  {
    "con": "Các loài sinh vật sống trong cùng một môi trường thì",
    "re": "Tạo thành một quần xã sinh vật"
  },
  {
    "con": "Sự tiến hóa xảy ra qua quá trình chọn lọc tự nhiên thì",
    "re": "Các đặc điểm có lợi sẽ được truyền lại cho thế hệ sau"
  },
  {
    "con": "Hệ sinh thái bao gồm các yếu tố sinh vật và phi sinh vật thì",
    "re": "Tạo ra một môi trường sống cho các sinh vật"
  },
  {
    "con": "Protein được tổng hợp từ axit amin thì",
    "re": "Chúng đóng vai trò quan trọng trong cấu trúc và chức năng tế bào"
  },
  {
    "con": "Trong hệ sinh thái rừng nhiệt đới, sinh vật nào sau đây được gọi là sinh vật sản xuất?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự tổng hợp chất hữu cơ từ ánh sáng mặt trời, thì sinh vật đó được gọi là gì?",
    "re": "Sinh vật sản xuất"
  },
  {
    "con": "Nếu một loài động vật ăn thực vật, thì loài động vật đó được gọi là gì?",
    "re": "Sinh vật tiêu thụ cấp 1"
  },
  {
    "con": "Nếu một sinh vật có cấu trúc tế bào có nhân, thì sinh vật đó thuộc nhóm nào?",
    "re": "Eukaryota"
  },
  {
    "con": "Nếu một loài thực vật có hoa và hạt, thì loài thực vật đó thuộc nhóm nào?",
    "re": "Thực vật hạt kín"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong môi trường khắc nghiệt, thì sinh vật đó được gọi là gì?",
    "re": "Sinh vật cực đoan"
  },
  {
    "con": "Nếu một tế bào không có màng nhân, thì tế bào đó thuộc nhóm nào?",
    "re": "Prokaryota"
  },
  {
    "con": "Nếu một sinh vật có khả năng phân hủy chất hữu cơ, thì sinh vật đó được gọi là gì?",
    "re": "Sinh vật phân hủy"
  },
  {
    "con": "Nếu một loài động vật có xương sống, thì loài động vật đó thuộc nhóm nào?",
    "re": "Động vật có xương sống"
  },
  {
    "con": "Nếu một sinh vật có khả năng sinh sản vô tính, thì sinh vật đó có thể tạo ra con cái mà không cần gì?",
    "re": "Cần sự tham gia của sinh vật khác"
  },
  {
    "con": "Quá trình quang hợp diễn ra trong lá cây",
    "re": "Cây sản xuất glucose và oxy"
  },
  {
    "con": "Mỗi tế bào trong cơ thể con người chứa DNA",
    "re": "DNA mang thông tin di truyền"
  },
  {
    "con": "Sự phân chia tế bào xảy ra trong quá trình sinh sản",
    "re": "Tạo ra các tế bào con giống hệt tế bào mẹ"
  },
  {
    "con": "Các loài sinh vật sống trong cùng một môi trường",
    "re": "Tạo thành một hệ sinh thái"
  },
  {
    "con": "Sự tiến hóa xảy ra qua nhiều thế hệ",
    "re": "Các loài có thể thay đổi để thích nghi với môi trường"
  },
  {
    "con": "Protein được tổng hợp từ axit amin",
    "re": "Chúng đóng vai trò quan trọng trong cấu trúc và chức năng tế bào"
  },
  {
    "con": "Hệ tuần hoàn vận chuyển máu trong cơ thể",
    "re": "Cung cấp oxy và chất dinh dưỡng cho các tế bào"
  },
  {
    "con": "Sự trao đổi chất diễn ra trong tế bào",
    "re": "Cung cấp năng lượng cho các hoạt động sống"
  },
  {
    "con": "Các loài động vật có xương sống và không xương sống",
    "re": "Có những đặc điểm sinh học khác nhau"
  },
  {
    "con": "Sự tương tác giữa các loài trong một hệ sinh thái",
    "re": "Có thể dẫn đến sự cân bằng hoặc mất cân bằng sinh thái"
  },
  {
    "con": "Nguyên nhân của hiện tượng thoái hoá giống là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biểu hiện của thoái hoá giống là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tế bào thực vật có thành tế bào",
    "re": "Chúng khác với tế bào động vật"
  },
  {
    "con": "Năng lượng từ ánh sáng mặt trời được cây xanh hấp thụ",
    "re": "Quá trình quang hợp diễn ra"
  },
  {
    "con": "Gen di truyền được truyền từ cha mẹ sang con cái",
    "re": "Đặc điểm di truyền của sinh vật được xác định"
  },
  {
    "con": "Môi trường sống thay đổi",
    "re": "Các loài có thể thích nghi hoặc tuyệt chủng"
  },
  {
    "con": "Sự phân chia tế bào xảy ra",
    "re": "Tế bào mới được hình thành"
  },
  {
    "con": "Nước là thành phần chính của tế bào",
    "re": "Tế bào có thể duy trì chức năng sống"
  },
  {
    "con": "Các loài khác nhau sống trong cùng một môi trường",
    "re": "Sẽ xảy ra cạnh tranh cho tài nguyên"
  },
  {
    "con": "Protein được tổng hợp từ axit amin",
    "re": "Chúng đóng vai trò quan trọng trong cấu trúc và chức năng tế bào"
  },
  {
    "con": "Sự tiến hóa xảy ra qua nhiều thế hệ",
    "re": "Các loài có thể thay đổi để thích nghi với môi trường"
  },
  {
    "con": "Tế bào là đơn vị cơ bản của sự sống",
    "re": "Tất cả sinh vật đều được cấu tạo từ tế bào"
  },
  {
    "con": "Năng lượng mặt trời được cây xanh hấp thụ",
    "re": "Cây xanh thực hiện quá trình quang hợp để sản xuất thức ăn"
  },
  {
    "con": "Gen di truyền được truyền từ cha mẹ sang con cái",
    "re": "Con cái sẽ có những đặc điểm di truyền từ cả cha và mẹ"
  },
  {
    "con": "Môi trường sống ảnh hưởng đến sự phát triển của sinh vật",
    "re": "Sinh vật có thể thay đổi hành vi hoặc hình thái để thích nghi với môi trường"
  },
  {
    "con": "Sự phân chia tế bào xảy ra trong quá trình sinh sản",
    "re": "Tế bào mới được tạo ra từ tế bào mẹ thông qua quá trình phân bào"
  },
  {
    "con": "Sự đa dạng sinh học là kết quả của quá trình tiến hóa",
    "re": "Các loài sinh vật khác nhau phát triển để thích nghi với môi trường sống của chúng"
  },
  {
    "con": "Nước là thành phần thiết yếu cho sự sống",
    "re": "Tất cả sinh vật cần nước để duy trì các quá trình sinh hóa trong cơ thể"
  },
  {
    "con": "Vi khuẩn có thể sống trong nhiều môi trường khác nhau",
    "re": "Một số vi khuẩn có thể sống trong điều kiện cực kỳ khắc nghiệt"
  },
  {
    "con": "Hệ sinh thái bao gồm các sinh vật và môi trường sống của chúng",
    "re": "Các sinh vật trong hệ sinh thái tương tác với nhau và với môi trường xung quanh"
  },
  {
    "con": "Sự tiêu thụ năng lượng trong chuỗi thức ăn",
    "re": "Năng lượng được truyền từ sinh vật này sang sinh vật khác qua các cấp độ dinh dưỡng"
  },
  {
    "con": "Sinh vật: Trăn, Cỏ, Châu chấu, Gà rừng, Vi khuẩn có mối quan hệ dinh dưỡng theo sơ đồ nào sau?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu tế bào có nhân thì nó thuộc loại tế bào nào?",
    "re": "Tế bào nhân thực"
  },
  {
    "con": "Nếu một sinh vật có khả năng tự tổng hợp chất dinh dưỡng từ ánh sáng mặt trời thì nó được gọi là gì?",
    "re": "Sinh vật quang hợp"
  },
  {
    "con": "Nếu một loài động vật có xương sống thì nó thuộc nhóm nào?",
    "re": "Động vật có xương sống"
  },
  {
    "con": "Nếu một sinh vật có khả năng sống trong môi trường khắc nghiệt như nước muối thì nó được gọi là gì?",
    "re": "Sinh vật cực đoan"
  },
  {
    "con": "Nếu một loài thực vật có hoa thì nó thuộc nhóm nào?",
    "re": "Thực vật có hoa"
  },
  {
    "con": "Nếu một tế bào phân chia bằng cách nguyên phân thì nó tạo ra bao nhiêu tế bào con?",
    "re": "Hai tế bào con"
  },
  {
    "con": "Nếu một sinh vật có lớp vỏ cứng và sống dưới nước thì nó có thể là gì?",
    "re": "Động vật giáp xác"
  },
  {
    "con": "Nếu một sinh vật có khả năng tiêu thụ thực vật và động vật thì nó được gọi là gì?",
    "re": "Sinh vật ăn tạp"
  },
  {
    "con": "Nếu một loài vi khuẩn có khả năng gây bệnh thì nó được gọi là gì?",
    "re": "Vi khuẩn gây bệnh"
  }
]