[
  {
    "con": "Nhúng thanh Fe vào dung dịch CuSO_{4}, sau một thời gian khối lượng dung dịch giảm 1,6 gam so với khối lượng dung dịch ban đầu (giả sử toàn bộ kim loại sinh ra bám trên thanh Fe). Khối lượng Cu đã tạo thành là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan NaCl vào nước, dung dịch sẽ dẫn điện tốt hơn so với nước tinh khiết",
    "re": "do NaCl phân ly thành các ion Na+ và Cl-"
  },
  {
    "con": "Nếu đun nóng nước đến 100 độ C ở áp suất khí quyển, nước sẽ chuyển thành hơi nước",
    "re": "vì đây là điểm sôi của nước"
  },
  {
    "con": "Khi thêm axit vào dung dịch kiềm, pH của dung dịch sẽ giảm",
    "re": "do axit trung hòa kiềm"
  },
  {
    "con": "Nếu một chất có nhiệt độ nóng chảy thấp hơn nhiệt độ phòng, chất đó sẽ tồn tại ở trạng thái rắn",
    "re": "trong điều kiện bình thường"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng sẽ bằng tổng khối lượng của các sản phẩm",
    "re": "theo định luật bảo toàn khối lượng"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7, chất đó được coi là axit",
    "re": "và có khả năng cho proton (H+)"
  },
  {
    "con": "Khi trộn hai chất lỏng không hòa tan vào nhau, sẽ tạo ra một hỗn hợp hai pha",
    "re": "như dầu và nước"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit, sản phẩm tạo thành sẽ bao gồm khí hidro",
    "re": "và muối của kim loại đó"
  },
  {
    "con": "Khi một chất rắn hòa tan trong dung môi, nó sẽ tạo ra dung dịch đồng nhất",
    "re": "nếu chất đó tan tốt trong dung môi"
  },
  {
    "con": "Phát biểu nào sau đây là sai?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học H2O",
    "re": "Nước là một hợp chất"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số nguyên tử tăng dần",
    "re": "Bảng tuần hoàn giúp xác định tính chất của nguyên tố"
  },
  {
    "con": "Khi một chất bị đốt cháy trong không khí, nó sẽ tạo ra khí carbon dioxide và nước",
    "re": "Đó là phản ứng oxi hóa"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng",
    "re": "Nhiệt độ ảnh hưởng đến năng lượng của các phân tử"
  },
  {
    "con": "Hợp chất ion được hình thành từ sự kết hợp của các ion mang điện tích trái dấu",
    "re": "Hợp chất ion có tính chất dẫn điện khi hòa tan trong nước"
  },
  {
    "con": "Chất rắn, lỏng và khí là ba trạng thái của vật chất",
    "re": "Mỗi trạng thái có cấu trúc và tính chất khác nhau"
  },
  {
    "con": "Phản ứng hóa học có thể được biểu diễn bằng phương trình hóa học",
    "re": "Phương trình hóa học thể hiện mối quan hệ giữa các chất tham gia và sản phẩm"
  },
  {
    "con": "Chất xúc tác không tham gia vào phản ứng hóa học",
    "re": "Chất xúc tác giúp tăng tốc độ phản ứng mà không bị tiêu hao"
  },
  {
    "con": "Sự hòa tan của muối trong nước là một ví dụ về phản ứng vật lý",
    "re": "Phản ứng này không tạo ra chất mới"
  },
  {
    "con": "Amino axit X no, mạch hở, có công thức C_nH_mO_2N. Biểu thức liên hệ giữa m và n là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học H2O và là dung môi phổ biến nhất trong hóa học",
    "re": "Nước có khả năng hòa tan nhiều chất"
  },
  {
    "con": "Một hợp chất có chứa ion dương và ion âm",
    "re": "Hợp chất đó có thể là muối"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "Tốc độ phản ứng thường sẽ tăng lên"
  },
  {
    "con": "Một nguyên tố có số proton bằng 6",
    "re": "Nguyên tố đó là Carbon"
  },
  {
    "con": "Khi một chất bị đốt cháy trong không khí",
    "re": "Sẽ tạo ra khí CO2 và nước nếu chất đó là hữu cơ"
  },
  {
    "con": "Một dung dịch có pH dưới 7",
    "re": "Dung dịch đó được coi là axit"
  },
  {
    "con": "Khi hai nguyên tố kết hợp với nhau để tạo thành một hợp chất",
    "re": "Hợp chất đó có tính chất khác biệt so với các nguyên tố ban đầu"
  },
  {
    "con": "Một phản ứng hóa học xảy ra khi có sự trao đổi electron",
    "re": "Phản ứng đó được gọi là phản ứng oxi hóa khử"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước",
    "re": "Chất đó có thể tạo thành dung dịch"
  },
  {
    "con": "Câu 64. Cho dung dịch Ba(HCO_{3})_{2} lần lượt tác dụng với dung dịch sau: NaOH, NaHSO_{4}, HCl, KHCO_{3}, K_{2}CO_{3}, H_{2}SO_{4}. Số trường hợp xảy ra phản ứng và số trường hợp có kết tủa là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên",
    "re": "tốc độ phản ứng hóa học thường tăng lên"
  },
  {
    "con": "Một chất có pH < 7",
    "re": "chất đó được coi là axit"
  },
  {
    "con": "Một chất có pH > 7",
    "re": "chất đó được coi là bazơ"
  },
  {
    "con": "Khi một kim loại tác dụng với axit",
    "re": "sẽ sinh ra khí hidro và muối"
  },
  {
    "con": "Khi dung dịch NaCl được điện phân",
    "re": "sẽ tạo ra khí clo và natri hydroxide"
  },
  {
    "con": "Khi trộn hai dung dịch chứa ion khác nhau",
    "re": "có thể xảy ra phản ứng tạo kết tủa"
  },
  {
    "con": "Khi một chất bị đốt cháy trong không khí",
    "re": "sẽ tạo ra khí carbon dioxide và nước nếu chất đó là hydrocarbon"
  },
  {
    "con": "Khi nhiệt độ giảm xuống",
    "re": "khả năng hòa tan của nhiều khí trong nước sẽ tăng lên"
  },
  {
    "con": "Khi một dung dịch bão hòa được làm nguội",
    "re": "sẽ có thể xuất hiện kết tủa"
  },
  {
    "con": "Lập dụng cụ như hình vẽ thì có thể dùng để thu được sản phẩm của thí nghiệm nào trong số ba thí nghiệm sau:\n(1) Điều chế CH_{3}COOC_{2}H_{5} từ ancol etylic và axit axetic.\n(2) Điều chế CH_{3}COOH từ CH_{3}COONa và H_{2}SO_{4}.\n(3) Điều chế but-2-en từ butan-2-ol.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nung một hợp chất muối thì sẽ tạo ra khí nào trong số các khí sau:\n(1) CO_{2}\n(2) NH_{3}\n(3) H_{2}O.",
    "re": "Khí thoát ra có thể là H_{2}O"
  },
  {
    "con": "Thêm axit vào dung dịch kiềm thì sẽ xảy ra phản ứng trung hòa tạo ra sản phẩm nào?",
    "re": "Sản phẩm là muối và nước"
  },
  {
    "con": "Khi hòa tan đường vào nước thì sẽ tạo ra hiện tượng gì?",
    "re": "Tạo ra dung dịch đồng nhất"
  },
  {
    "con": "Khi đun nóng một chất rắn thì sẽ xảy ra hiện tượng gì?",
    "re": "Chất rắn có thể tan chảy hoặc bay hơi"
  },
  {
    "con": "Nếu cho kim loại vào dung dịch axit thì sẽ xảy ra phản ứng nào?",
    "re": "Sẽ tạo ra khí hidro và muối"
  },
  {
    "con": "Khi trộn hai chất lỏng không hòa tan vào nhau thì sẽ tạo ra hiện tượng gì?",
    "re": "Tạo thành hai lớp riêng biệt"
  },
  {
    "con": "Nếu cho một chất rắn vào nước và chất đó không tan thì sẽ xảy ra hiện tượng gì?",
    "re": "Chất rắn sẽ lắng xuống đáy"
  },
  {
    "con": "Khi một chất bị oxi hóa thì sẽ xảy ra hiện tượng gì?",
    "re": "Chất đó sẽ mất electron"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra ở nhiệt độ cao thì sẽ có ảnh hưởng gì đến tốc độ phản ứng?",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Cho các chất hữu cơ X, Y, Z, T, E thỏa mãn các phản ứng hóa học sau:\nX+NaOH\\buildrel\\emsp\\emsp\\frac\\rightarrow C_6H_5ONa+Y+CH_3CHO+H_2O (1)\nY+NaOH\\buildrel\\emsp\\emsp\\frac\\rightarrow T+Na_2CO_3 (2)\nCH_3CHO+AgNO_3+NH_3+H_2O\\buildrel\\emsp\\emsp\\frac\\rightarrow Z+... (3)\nZ+NaOH\\buildrel\\emsp\\emsp\\frac\\rightarrow E+... (4)\nE+NaOH\\buildrel\\emsp\\emsp\\frac\\rightarrow T+Na_2CO_3 (5)\nCho biết khí cân bằng tỉ lệ mol giữa Y và NaOH trong (2) là 1 : 2. Công thức phân tử của X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học H2O và là dung môi phổ biến nhất trong hóa học",
    "re": "Nước có khả năng hòa tan nhiều chất"
  },
  {
    "con": "Khi một chất rắn được hòa tan trong nước, nếu nhiệt độ của dung dịch tăng lên",
    "re": "Phản ứng hòa tan là phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một chất có độ pH nhỏ hơn 7",
    "re": "Chất đó là axit"
  },
  {
    "con": "Khi hai chất phản ứng với nhau và tạo ra khí",
    "re": "Phản ứng hóa học có thể tạo ra sản phẩm khí"
  },
  {
    "con": "Nếu một chất có độ pH lớn hơn 7",
    "re": "Chất đó là bazơ"
  },
  {
    "con": "Khi một dung dịch chứa ion kim loại phản ứng với dung dịch chứa ion hydroxide",
    "re": "Sẽ tạo ra kết tủa"
  },
  {
    "con": "Nếu nhiệt độ của một chất khí tăng lên trong khi thể tích không đổi",
    "re": "Áp suất của khí đó sẽ tăng lên"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và năng lượng được hấp thụ",
    "re": "Phản ứng đó là phản ứng thu nhiệt"
  },
  {
    "con": "Nếu một chất có công thức hóa học CnH2n+2",
    "re": "Chất đó là ankan"
  },
  {
    "con": "Đốt cháy hoàn toàn 0,1 mol hỗn hợp X (CH_{4}, C_{2}H_{4}, C_{3}H_{4}, C_{4}H_{4}) có tỉ khối hơi so với H_{2} bằng 17. Dẫn toàn bộ sản phẩm cháy thu được vào bình đựng dung dịch Ca(OH)_{2} dư",
    "re": "khối lượng bình Ca(OH)_{2} sau phản ứng tăng lên"
  },
  {
    "con": "Hòa tan 1 mol NaCl vào 1 lít nước",
    "re": "dung dịch thu được có tính dẫn điện tốt"
  },
  {
    "con": "Cho 1 mol HCl vào 1 mol NaOH",
    "re": "sẽ tạo ra 1 mol NaCl và 1 mol nước"
  },
  {
    "con": "Khi nhiệt độ tăng lên, áp suất của khí trong một bình kín không thay đổi",
    "re": "thể tích của khí sẽ tăng lên"
  },
  {
    "con": "Khi cho một chất rắn vào nước và chất đó không tan",
    "re": "thì dung dịch sẽ không thay đổi về nồng độ"
  },
  {
    "con": "Khi một kim loại phản ứng với axit",
    "re": "sẽ tạo ra muối và khí hidro"
  },
  {
    "con": "Khi cho một chất lỏng vào một bình chứa khí",
    "re": "áp suất của khí trong bình sẽ giảm"
  },
  {
    "con": "Khi một chất hóa học bị phân hủy nhiệt",
    "re": "sẽ tạo ra các sản phẩm khác nhau tùy thuộc vào chất ban đầu"
  },
  {
    "con": "Khi cho một chất rắn vào dung dịch có pH thấp",
    "re": "chất rắn có thể bị hòa tan nếu nó là một bazơ"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong một hệ kín",
    "re": "khối lượng tổng thể của hệ sẽ không thay đổi"
  },
  {
    "con": "Cho các polime sau: (1) poli(metyl matacrylat); (2) polistiren; (3) nilon-7; (4) poli (etylen-terephtalat); (5) nilon-6,6; (6) poli(vinyl axetat). Số polime có thể là sản phẩm của phản ứng trùng ngưng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "thường làm tăng tốc độ phản ứng"
  },
  {
    "con": "Khi một chất hòa tan trong nước",
    "re": "nó tạo thành dung dịch"
  },
  {
    "con": "Nếu một nguyên tố có số electron hóa trị là 1",
    "re": "nó sẽ dễ dàng tham gia vào phản ứng hóa học"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong môi trường kín",
    "re": "khối lượng tổng thể của các chất phản ứng và sản phẩm sẽ không thay đổi"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7",
    "re": "nó được coi là axit"
  },
  {
    "con": "Khi một chất bị oxi hóa",
    "re": "nó sẽ mất electron"
  },
  {
    "con": "Nếu một dung dịch có nồng độ cao",
    "re": "nó chứa nhiều chất tan hơn trong một thể tích nhất định"
  },
  {
    "con": "Khi một chất rắn được nung nóng đến nhiệt độ cao",
    "re": "nó có thể chuyển sang trạng thái lỏng"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch",
    "re": "các sản phẩm có thể chuyển đổi trở lại thành các chất phản ứng"
  },
  {
    "con": "Kết quả thí nghiệm của các dung dịch X, Y, Z, T với thuốc thử được ghi ở bảng sau:\nMẫu thử        Thuốc thử        Hiện tượng\nX        Dung dịch I_{2}        Có màu xanh tím\nY        Cu(OH)_{2} trong môi trường kiềm        Có màu tím\nZ        Dung dịch AgNO_{3} trong NH_{3} dư, đun nóng        Kết tủa Ag trắng sáng\nT        Nước Br_{2}        Kết tủa trắng\nDung dịch X, Y, Z, T lần lượt là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ của một chất tăng lên thì",
    "re": "năng lượng động học của các phân tử trong chất đó cũng tăng lên"
  },
  {
    "con": "Một chất có độ pH dưới 7 thì",
    "re": "chất đó được coi là axit"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, nếu có sự thay đổi màu sắc thì",
    "re": "phản ứng đó có thể tạo ra các sản phẩm mới"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện trong dung dịch thì",
    "re": "chất đó là một chất điện ly"
  },
  {
    "con": "Khi nhiệt độ tăng, nếu áp suất không đổi thì",
    "re": "thể tích của khí sẽ tăng lên theo định luật Charles"
  },
  {
    "con": "Nếu một dung dịch có nồng độ cao hơn dung dịch khác thì",
    "re": "dung dịch đó sẽ có khả năng hút nước từ dung dịch kia"
  },
  {
    "con": "Khi một kim loại phản ứng với axit thì",
    "re": "sẽ tạo ra khí hidro và muối"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước thì",
    "re": "chất đó sẽ bay hơi nhanh hơn nước ở cùng nhiệt độ"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước thì",
    "re": "chất đó có thể tạo ra dung dịch đồng nhất"
  },
  {
    "con": "Hòa tan hoàn toàn một lượng Ba vào dung dịch chứa a mol HCl thu được dung dịch X và a mol H_{2}. Trong các chất sau: Na_{2}SO_{4}, Na_{2}CO_{3}, Al, Al_{2}O_{3}, AlCl_{3}, Mg, NaOH, NaHCO_{3}; số chất tác dụng được với dung dịch X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi đun nóng một lượng NaHCO_{3}, nếu phản ứng xảy ra thì sẽ tạo ra khí CO_{2} và Na_{2}CO_{3}",
    "re": "Phản ứng xảy ra"
  },
  {
    "con": "Nếu một dung dịch chứa ion Ag^{+} được trộn với dung dịch NaCl, thì sẽ xuất hiện kết tủa AgCl trắng",
    "re": "Kết tủa AgCl hình thành"
  },
  {
    "con": "Khi cho một lượng axit HCl vào dung dịch NaOH, nếu phản ứng trung hòa xảy ra thì sẽ tạo ra nước và muối NaCl",
    "re": "Nước và muối NaCl được tạo ra"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit sulfuric loãng, thì sẽ sinh ra khí H_{2} và muối tương ứng",
    "re": "Khí H_{2} và muối được sinh ra"
  },
  {
    "con": "Khi hòa tan một lượng đường vào nước, nếu dung dịch trở nên trong suốt thì đường đã hòa tan hoàn toàn",
    "re": "Đường đã hòa tan hoàn toàn"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là axit",
    "re": "Dung dịch đó là axit"
  },
  {
    "con": "Khi cho một lượng bột sắt vào dung dịch đồng(II) sulfate, nếu phản ứng xảy ra thì sẽ tạo ra đồng và muối sắt(II) sulfate",
    "re": "Đồng và muối sắt(II) sulfate được tạo ra"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn 100 độ C, thì chất đó có thể tồn tại ở trạng thái lỏng ở nhiệt độ phòng",
    "re": "Chất đó có thể tồn tại ở trạng thái lỏng"
  },
  {
    "con": "Khi cho một lượng nước vào một chất rắn không tan, nếu chất đó không hòa tan thì sẽ không có phản ứng xảy ra",
    "re": "Không có phản ứng xảy ra"
  },
  {
    "con": "Amino axit thiên nhiên X trong phân tử có một nhóm –NH_{2} và một nhóm –COOH. Cho 26,7 gam X phản ứng với lượng dư dung dịch HCl, thu được dung dịch chứa 37,65 gam muối. Công thức của X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học H2O và được tạo thành từ hai nguyên tử hydro và một nguyên tử oxy.",
    "re": "Nước là một hợp chất"
  },
  {
    "con": "Khi một chất rắn được nung nóng và chuyển thành trạng thái khí mà không qua trạng thái lỏng, hiện tượng này được gọi là",
    "re": "sublimation"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, thì dung dịch đó được coi là",
    "re": "axit"
  },
  {
    "con": "Khi hai nguyên tố hóa học kết hợp với nhau để tạo thành một hợp chất, thì quá trình này được gọi là",
    "re": "phản ứng hóa học"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện trong dung dịch, thì chất đó có thể là",
    "re": "muối hoặc axit"
  },
  {
    "con": "Khi một chất bị phân hủy thành các chất đơn giản hơn dưới tác động của nhiệt, thì quá trình này được gọi là",
    "re": "phân hủy nhiệt"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn các phản ứng ban đầu, thì phản ứng đó là",
    "re": "phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi một chất hòa tan trong nước và tạo ra ion, thì chất đó được gọi là",
    "re": "chất điện ly"
  },
  {
    "con": "Nếu một nguyên tử có số proton bằng số electron, thì nguyên tử đó được coi là",
    "re": "trung hòa điện"
  },
  {
    "con": "Thủy phân 324 gam tinh bột với hiệu suất phản ứng 75%, khối lượng glucozơ thu được là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học, tốc độ phản ứng sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Khi một chất tan trong nước, nó sẽ tạo ra dung dịch",
    "re": "có khả năng dẫn điện"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, thì nguyên tố đó là",
    "re": "carbon"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7, dung dịch đó sẽ",
    "re": "có tính axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí, sản phẩm có thể là",
    "re": "cồn hoặc khí metan"
  },
  {
    "con": "Khi một chất rắn được nung nóng đến nhiệt độ cao, nó có thể",
    "re": "biến thành chất lỏng hoặc khí"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao, thì áp suất thẩm thấu sẽ",
    "re": "cao hơn"
  },
  {
    "con": "Khi hai nguyên tố kết hợp để tạo thành hợp chất, thì số lượng nguyên tử của chúng sẽ",
    "re": "được bảo toàn"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C, thì chất đó sẽ",
    "re": "bốc hơi ở nhiệt độ phòng"
  },
  {
    "con": "Hòa tan hoàn toàn m gam hỗn hợp gồm Na, Na_{2}O, NaOH và Na_{2}CO_{3} trong dung dịch axit H_{2}SO_{4} 40% (vừa đủ) thu được 8,96 lít (đktc) hỗn hợp khí có tỷ khối đối với H_{2} bằng 16,75 và dung dịch Y có nồng độ 51,449%. Cô cạn Y thu được 170,4 gam muối. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi đun nóng một hợp chất hữu cơ chứa cacbon, hydro và oxy, nếu sản phẩm thu được là CO_{2} và H_{2}O thì hợp chất đó có thể là",
    "re": "Hợp chất hữu cơ"
  },
  {
    "con": "Nếu một dung dịch có pH < 7 thì dung dịch đó là",
    "re": "Dung dịch axit"
  },
  {
    "con": "Khi cho Na vào nước, nếu phản ứng xảy ra mạnh mẽ và có bọt khí xuất hiện thì sản phẩm tạo thành là",
    "re": "NaOH và H_{2}"
  },
  {
    "con": "Nếu một chất có nhiệt độ nóng chảy thấp hơn nhiệt độ phòng thì chất đó sẽ tồn tại ở trạng thái",
    "re": "Chất lỏng hoặc khí"
  },
  {
    "con": "Khi hòa tan muối ăn (NaCl) vào nước, nếu dung dịch trở nên dẫn điện thì điều này chứng tỏ rằng",
    "re": "Muối đã phân ly thành ion"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra tỏa nhiệt thì phản ứng đó được gọi là",
    "re": "Phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi cho axit vào bazơ, nếu phản ứng xảy ra và tạo ra nước và muối thì đây là phản ứng",
    "re": "Phản ứng trung hòa"
  },
  {
    "con": "Nếu một chất có khối lượng mol lớn hơn 100 g/mol thì chất đó có thể là",
    "re": "Chất hữu cơ phức tạp"
  },
  {
    "con": "Khi một chất rắn tan trong dung môi mà không tạo ra bọt khí thì điều này cho thấy",
    "re": "Chất đó hòa tan trong dung môi"
  },
  {
    "con": "Hỗn hợp X gồm metyl fomat, đimetyl oxalat, glixerol triaxetat và phenyl axetat. Thủy phân hoàn toàn 47,3 gam X trong dung dịch NaOH dư, đun nóng, thu được m gam hỗn hợp muối và 15,6 gam hỗn hợp Y gồm các ancol. Cho Y tác dụng với Na dư, thu được 5,6 lít khí H_{2} (đktc). Mặt khác, đốt cháy hoàn toàn 47,3 gam X bằng oxi, thu được 92,4 gam CO_{2} và 26,1 gam H_{2}O. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng thì chất đó sẽ tồn tại ở trạng thái khí ở nhiệt độ phòng",
    "re": "Chất đó sẽ không ở trạng thái lỏng"
  },
  {
    "con": "Nếu một dung dịch có pH lớn hơn 7 thì dung dịch đó được coi là kiềm",
    "re": "Dung dịch đó có tính chất kiềm"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn các phản ứng ban đầu thì phản ứng đó là phản ứng tỏa nhiệt",
    "re": "Phản ứng đó sẽ giải phóng năng lượng"
  },
  {
    "con": "Nếu một chất có khối lượng mol lớn hơn 100 g/mol thì chất đó thường có điểm nóng chảy cao hơn các chất có khối lượng mol nhỏ hơn",
    "re": "Chất đó có thể là chất rắn ở nhiệt độ phòng"
  },
  {
    "con": "Nếu một chất có khả năng hòa tan trong nước thì chất đó được gọi là chất tan",
    "re": "Chất đó có thể tạo thành dung dịch"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí thì sản phẩm có thể là các hợp chất hữu cơ",
    "re": "Phản ứng đó có thể tạo ra rượu hoặc axit"
  },
  {
    "con": "Nếu một chất có tính acid mạnh thì nó sẽ có khả năng ion hóa hoàn toàn trong dung dịch nước",
    "re": "Chất đó sẽ tạo ra nhiều ion H+"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử phức tạp thì nó có thể có nhiều tính chất hóa học khác nhau",
    "re": "Chất đó có thể tham gia vào nhiều phản ứng khác nhau"
  },
  {
    "con": "Nếu một chất có độ dẫn điện tốt thì chất đó thường chứa các ion tự do",
    "re": "Chất đó có thể là dung dịch điện ly"
  },
  {
    "con": "Khi một chất rắn được hòa tan trong nước, nếu chất đó tan hoàn toàn thì dung dịch sẽ trở thành đồng nhất.",
    "re": "Dung dịch đồng nhất"
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên, thì động năng của các phân tử trong chất đó cũng sẽ tăng theo.",
    "re": "Động năng của phân tử tăng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín, thì tổng khối lượng của các chất phản ứng sẽ bằng tổng khối lượng của các sản phẩm tạo thành.",
    "re": "Bảo toàn khối lượng"
  },
  {
    "con": "Nếu một chất có độ pH nhỏ hơn 7, thì chất đó được coi là axit.",
    "re": "Chất axit"
  },
  {
    "con": "Nếu một chất có độ pH lớn hơn 7, thì chất đó được coi là bazơ.",
    "re": "Chất bazơ"
  },
  {
    "con": "Nếu hai chất phản ứng với nhau và tạo ra khí, thì có thể có sự thay đổi về thể tích trong hệ thống.",
    "re": "Thay đổi thể tích"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao hơn dung dịch khác, thì dung dịch đó sẽ có khả năng hòa tan nhiều chất hơn.",
    "re": "Khả năng hòa tan cao hơn"
  },
  {
    "con": "Nếu một chất rắn được nung nóng đến nhiệt độ cao, thì nó có thể chuyển sang trạng thái lỏng hoặc khí.",
    "re": "Chuyển trạng thái"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì nhiệt độ của môi trường xung quanh sẽ tăng lên.",
    "re": "Nhiệt độ môi trường tăng"
  },
  {
    "con": "Cho X, Y, Z là ba peptit đều mạch hở và MX > MY > MZ. Đốt cháy hoàn toàn a mol mỗi peptit X, Y hoặc Z đều thu được số mol CO_{2} nhiều hơn số mol H_{2}O là a mol. Mặt khác, nếu đun nóng 69,8 gam hỗn hợp E (chứa X, Y và 0,16 mol Z, số mol của X nhỏ hơn số mol của Y) với dung dịch NaOH vừa đủ, thu được dung dịch chỉ chứa 2 muối của alanin và valin có tổng khối lượng 101,04 gam. Phần trăm khối lượng của X có trong hỗn hợp E gần nhất với giá trị nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cho 80,0 gam muối CuSO_{4}.5H_{2}O vào dung dịch chứa NaCl thu được dung dịch X. Tiến hành điện phản ứng dung dịch X bằng điện cực trơ với cường độ dòng điện I = 9,65A tới khi khối lượng dung dịch giảm 22,8 gam thì dừng điện phân. Nhúng thanh Mg vào dung dịch sau điện phân đến khi các phản ứng xảy ra hoàn toàn. Lấy thanh Mg ra, làm khô thấy khối lượng thanh không đổi so với trước phản ứng. Thời gian điện phân là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 1 mol NaCl vào nước, nồng độ ion Na+ và Cl- trong dung dịch sẽ là",
    "re": "1 mol/lít"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C, thì chất đó sẽ bay hơi ở nhiệt độ phòng",
    "re": "dễ dàng"
  },
  {
    "con": "Khi thêm axit vào dung dịch kiềm, thì pH của dung dịch sẽ",
    "re": "giảm"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra tỏa nhiệt, thì nhiệt độ của môi trường xung quanh sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Khi đun nóng một hợp chất hữu cơ, nếu có khí thoát ra, thì có khả năng hợp chất đó",
    "re": "bị phân hủy"
  },
  {
    "con": "Nếu một dung dịch có pH = 7, thì dung dịch đó được coi là",
    "re": "trung tính"
  },
  {
    "con": "Khi cho kim loại vào dung dịch muối của nó, nếu không có phản ứng xảy ra, thì kim loại đó",
    "re": "nằm ở vị trí thấp hơn trong dãy hoạt động hóa học"
  },
  {
    "con": "Nếu một chất có khối lượng mol lớn hơn 100 g/mol, thì chất đó sẽ",
    "re": "có xu hướng có điểm nóng chảy cao hơn"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước tạo thành dung dịch, thì chất đó được gọi là",
    "re": "chất tan"
  },
  {
    "con": "X, Y, Z là ba axit cacboxylic đơn chức cùng dãy đồng đẳng (MX < MY < MZ), T là este tạo bởi X, Y, Z với một ancol no, ba chức, mạch hở. Đốt cháy hoàn toàn 26,6 gam hỗn hợp M gồm X, Y, Z, T (trong đó Y và Z có cùng số mol) bằng lượng khí O_{2} vừa đủ, thu được 2,24 lít CO_{2} (đktc) và 16,2 gam H_{2}O. Đun nóng 26,6 gam M với lượng dư dung dịch AgNO_{3}.NH_{3} đến khi xảy ra hoàn toàn, thu được 21,6 gam Ag. Mặt khác, cho 13,3 gam hỗn hợp M phản ứng hết với 400 ml dung dịch NaOH 1M và đun nóng, thu được dung dịch G. Cô cạn dung dịch G thu được m gam chất rắn khan. Giá trị của m gần nhất với giá trị nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn nhiệt độ sôi của nước, thì chất đó sẽ bay hơi khi được đun nóng.",
    "re": "Chất sẽ chuyển từ trạng thái lỏng sang trạng thái khí."
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là axit.",
    "re": "Dung dịch có khả năng làm quỳ tím chuyển sang màu đỏ."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra mà không có sự thay đổi về khối lượng, thì phản ứng đó là phản ứng hóa học kín.",
    "re": "Tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng, thì chất đó có thể có đồng phân quang học.",
    "re": "Chất có khả năng quay vòng ánh sáng phân cực."
  },
  {
    "con": "Nếu một kim loại phản ứng với axit, thì sản phẩm của phản ứng sẽ bao gồm muối và khí hidro.",
    "re": "Kim loại sẽ bị ăn mòn và giải phóng khí hidro."
  },
  {
    "con": "Nếu nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch, thì phản ứng sẽ dịch chuyển theo chiều tỏa nhiệt.",
    "re": "Sản phẩm của phản ứng sẽ tăng lên."
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước, thì chất đó thường là chất ion hoặc phân cực.",
    "re": "Chất sẽ dễ dàng hòa tan và tạo thành dung dịch."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kiềm, thì sản phẩm có thể là muối và nước.",
    "re": "Phản ứng có thể tạo ra các sản phẩm khác nhau tùy thuộc vào các chất tham gia."
  },
  {
    "con": "Nếu một chất có khối lượng mol lớn hơn 100 g/mol, thì chất đó thường có nhiệt độ sôi cao hơn.",
    "re": "Chất sẽ có xu hướng tồn tại ở trạng thái rắn hoặc lỏng ở nhiệt độ phòng."
  },
  {
    "con": "Có 3,94 gam hỗn hợp X gồm bột Al và Fe3O_{4} (trong đó Al chiếm 41,12% về khối lượng). Thực hiện phản ứng nhiệt nhôm hoàn toàn hỗn hợp X trong chân không thu được hỗn hợp Y. Hòa tan hoàn toàn Y trong dung dịch chứa 0,314 mol HNO_{3} thu được dung dịch Z chỉ có các muối và 0,02 mol một khí duy nhất NO. Cô cạn dung dịch Z, lấy chất rắn khan nung nóng chân không đến khối lượng không đổi thu được hỗn hợp khí và hơi T. Khối lượng của T gần nhất với giá trị nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Có một dung dịch chứa 0,1 mol NaCl. Khi thêm 0,1 mol AgNO3 vào dung dịch này, sẽ xảy ra phản ứng kết tủa.",
    "re": "Xuất hiện kết tủa AgCl"
  },
  {
    "con": "Khi đun nóng một hợp chất hữu cơ chứa carbon, hydro và oxy, nếu không có oxy thì sẽ xảy ra quá trình phân hủy nhiệt.",
    "re": "Sản phẩm chính là khí CO và H2O"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C, thì chất đó sẽ bay hơi ở nhiệt độ phòng.",
    "re": "Chất đó có thể tồn tại dưới dạng khí"
  },
  {
    "con": "Khi hòa tan NaOH vào nước, nếu nồng độ NaOH tăng lên, thì độ pH của dung dịch sẽ tăng.",
    "re": "Dung dịch trở nên kiềm hơn"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng sẽ tăng lên.",
    "re": "Phản ứng xảy ra nhanh hơn"
  },
  {
    "con": "Khi cho axit vào dung dịch kiềm, nếu tỷ lệ mol của axit và kiềm là 1:1, thì sẽ xảy ra phản ứng trung hòa.",
    "re": "Sản phẩm là muối và nước"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước, thì chất đó được gọi là chất tan.",
    "re": "Chất đó dễ dàng hòa tan trong nước"
  },
  {
    "con": "Khi một kim loại phản ứng với axit, nếu có khí thoát ra, thì khí đó thường là H2.",
    "re": "Phản ứng tạo ra khí hydro"
  },
  {
    "con": "Nếu một dung dịch có màu xanh lam, thì có thể có sự hiện diện của ion Cu^{2+}.",
    "re": "Dung dịch chứa ion đồng"
  },
  {
    "con": "Hòa tan hết 10,24 gam hỗn hợp X gồm Fe và Fe_{3}O_{4} bằng dung dịch chứa 0,1 mol H_{2}SO_{4} và 0,5 mol HNO_{3}, thu được dung dịch Y và hỗn hợp gồm 0,1 mol NO và a mol NO_{2} (không còn sản phẩm khử nào khác). Chia dung dịch Y thành hai phần bằng nhau. Phần một tác dụng với 500 ml dung dịch KOH 0,4M, thu được 5,35 gam một chất kết tủa. Phần hai tác dụng với dung dịch Ba(OH)_{2} dư, thu được m gam kết tủa. Biết các phản ứng xảy ra hoàn toàn. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì",
    "re": "tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước thì",
    "re": "nồng độ dung dịch sẽ tăng lên"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí thì",
    "re": "sản phẩm tạo ra có thể khác với phản ứng xảy ra trong điều kiện có oxy"
  },
  {
    "con": "Khi pH của dung dịch giảm thì",
    "re": "tính axit của dung dịch tăng lên"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước thì",
    "re": "chất đó có khả năng tạo thành dung dịch bão hòa"
  },
  {
    "con": "Khi thêm một chất xúc tác vào phản ứng thì",
    "re": "thời gian phản ứng sẽ giảm mà không làm thay đổi sản phẩm"
  },
  {
    "con": "Nếu hai chất phản ứng với nhau tạo ra khí thì",
    "re": "khí đó có thể được thu thập và đo thể tích"
  },
  {
    "con": "Khi nhiệt độ giảm xuống trong một phản ứng tỏa nhiệt thì",
    "re": "phản ứng có thể bị chậm lại hoặc ngừng lại"
  },
  {
    "con": "Nếu một dung dịch có nồng độ ion H^+ cao thì",
    "re": "dung dịch đó có tính axit mạnh"
  },
  {
    "con": "Cho m gam hỗn hợp gồm Mg, Fe và Cu vào 200 ml dung dịch chứa FeCl_{3} 0,8M và CuCl_{2} 0,1M. Sau khi kết thúc phản ứng thu được dung dịch X và 11,84 gam chất rắn Y gồm 2 kim loại. Cho dung dịch AgNO_{3} dư vào X, thu được 87,58 gam kết tủa. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 1 mol NaCl vào 1 lít nước, nồng độ dung dịch NaCl sẽ là",
    "re": "1M"
  },
  {
    "con": "Nếu đun nóng 1 mol nước đến 100 độ C, nước sẽ chuyển thành",
    "re": "hơi nước"
  },
  {
    "con": "Khi cho 1 mol H2 vào 1 mol O2 trong điều kiện thích hợp, sản phẩm tạo thành sẽ là",
    "re": "2 mol H2O"
  },
  {
    "con": "Nếu cho 2 mol Na vào 2 lít nước, phản ứng sẽ tạo ra",
    "re": "khí H2 và dung dịch NaOH"
  },
  {
    "con": "Khi hòa tan 1 mol CaCO3 vào dung dịch HCl, sản phẩm tạo thành sẽ bao gồm",
    "re": "CO2, H2O và CaCl2"
  },
  {
    "con": "Nếu cho 1 mol Fe vào dung dịch H2SO4 loãng, sản phẩm tạo thành sẽ là",
    "re": "FeSO4 và H2"
  },
  {
    "con": "Khi cho 1 mol NH3 vào 1 mol HCl, sản phẩm tạo thành sẽ là",
    "re": "NH4Cl"
  },
  {
    "con": "Nếu đun nóng 1 mol đường (C12H22O11) với H2SO4, sản phẩm cuối cùng sẽ là",
    "re": "carbon và nước"
  },
  {
    "con": "Khi cho 1 mol KOH vào dung dịch H2SO4, sản phẩm tạo thành sẽ là",
    "re": "K2SO4 và nước"
  },
  {
    "con": "Nguyên tố hóa học là những nguyên tử có cùng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các nguyên tử của cùng một nguyên tố có số proton giống nhau",
    "re": "Chúng có cùng số hiệu nguyên tử"
  },
  {
    "con": "Hợp chất được hình thành từ hai hoặc nhiều nguyên tố khác nhau",
    "re": "Chúng có tính chất khác biệt so với các nguyên tố cấu thành"
  },
  {
    "con": "Phản ứng hóa học xảy ra khi các liên kết hóa học bị phá vỡ và hình thành lại",
    "re": "Sản phẩm mới được tạo ra"
  },
  {
    "con": "Nhiệt độ tăng lên thường làm tăng tốc độ phản ứng hóa học",
    "re": "Phản ứng xảy ra nhanh hơn"
  },
  {
    "con": "Chất xúc tác là một chất làm tăng tốc độ phản ứng mà không bị tiêu thụ",
    "re": "Nó giúp phản ứng diễn ra hiệu quả hơn"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số hiệu nguyên tử",
    "re": "Chúng có tính chất hóa học tương tự theo từng nhóm"
  },
  {
    "con": "Hóa trị của một nguyên tố cho biết khả năng kết hợp của nó với các nguyên tố khác",
    "re": "Nó giúp xác định công thức hóa học của hợp chất"
  },
  {
    "con": "Khi một chất tan trong nước, nó phân tán thành các ion hoặc phân tử",
    "re": "Chất đó trở thành dung dịch"
  },
  {
    "con": "Sự bảo toàn khối lượng trong phản ứng hóa học có nghĩa là tổng khối lượng các chất phản ứng bằng tổng khối lượng các sản phẩm",
    "re": "Điều này luôn đúng trong mọi phản ứng hóa học"
  },
  {
    "con": "Hydroxide nào có tính base mạnh nhất trong các hydroxide sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có pH lớn hơn 7,",
    "re": "thì chất đó là một chất kiềm."
  },
  {
    "con": "Nếu hai nguyên tố hóa học có số proton khác nhau,",
    "re": "thì chúng là hai nguyên tố khác nhau."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra,",
    "re": "thì có sự thay đổi về năng lượng và cấu trúc của các chất tham gia."
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng,",
    "re": "thì chất đó có thể tồn tại ở dạng khí ở nhiệt độ phòng."
  },
  {
    "con": "Nếu một dung dịch có nồng độ cao,",
    "re": "thì nó có thể dẫn điện tốt hơn so với dung dịch loãng."
  },
  {
    "con": "Nếu một nguyên tử mất electron,",
    "re": "thì nó trở thành ion dương."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt,",
    "re": "thì nó giải phóng năng lượng dưới dạng nhiệt."
  },
  {
    "con": "Nếu một chất có khối lượng mol lớn,",
    "re": "thì nó thường có số lượng nguyên tử hoặc phân tử ít hơn trong cùng một thể tích."
  },
  {
    "con": "Nếu một chất có tính axit mạnh,",
    "re": "thì nó có khả năng cho proton (H+) dễ dàng."
  },
  {
    "con": "Trong các chất dưới đây, chất nào có tính acid yếu nhất?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nước được đun sôi, nhiệt độ của nó sẽ tăng lên đến 100 độ C ở áp suất khí quyển bình thường.",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái hơi."
  },
  {
    "con": "Nếu một chất có độ pH dưới 7,",
    "re": "chất đó được coi là acid."
  },
  {
    "con": "Khi hai chất phản ứng với nhau và tạo ra khí,",
    "re": "thì có thể có bọt khí xuất hiện."
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện,",
    "re": "thì chất đó có thể chứa ion tự do."
  },
  {
    "con": "Khi một chất rắn tan trong nước,",
    "re": "thì nó có thể tạo thành dung dịch."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và tạo ra nhiệt,",
    "re": "thì phản ứng đó được gọi là phản ứng tỏa nhiệt."
  },
  {
    "con": "Khi một chất bị oxi hóa,",
    "re": "thì nó mất electron."
  },
  {
    "con": "Nếu một dung dịch có nồng độ cao hơn dung dịch khác,",
    "re": "thì dung dịch đó được coi là đậm đặc hơn."
  },
  {
    "con": "Khi một chất thay đổi trạng thái từ rắn sang lỏng,",
    "re": "thì quá trình này gọi là nóng chảy."
  },
  {
    "con": "Mô hình cấu tạo ở hình 1.1 thuộc về nguyên tử nguyên tố nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C,",
    "re": "chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra,",
    "re": "thì có sự thay đổi về năng lượng và cấu trúc của các chất tham gia."
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7,",
    "re": "thì dung dịch đó được coi là axit."
  },
  {
    "con": "Nếu nguyên tử có số proton bằng số electron,",
    "re": "thì nguyên tử đó là trung hòa về điện."
  },
  {
    "con": "Nếu hai nguyên tố kết hợp với nhau để tạo thành hợp chất,",
    "re": "thì chúng sẽ có các tính chất khác biệt so với các nguyên tố riêng lẻ."
  },
  {
    "con": "Nếu một chất có khối lượng mol lớn hơn,",
    "re": "thì số lượng phân tử trong một khối lượng nhất định sẽ ít hơn."
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên,",
    "re": "thì động năng của các phân tử trong chất đó cũng tăng lên."
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện,",
    "re": "thì chất đó có thể chứa các ion tự do hoặc electron di chuyển."
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch,",
    "re": "thì sản phẩm có thể chuyển đổi trở lại thành các chất phản ứng."
  },
  {
    "con": "Nguyên tử của nguyên tố nào sau đây có độ âm điện lớn nhất? Cho biết nguyên tố này\nđược sử dụng trong công nghệ hàn, sản xuất thép và methanol.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C, thì chất đó có thể là chất lỏng ở nhiệt độ phòng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và tạo ra khí, thì có thể có sự thay đổi về thể tích trong hệ thống.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, thì nguyên tố đó là Carbon.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, thì dung dịch đó được coi là axit.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tử có 8 electron ở lớp vỏ ngoài cùng, thì nguyên tử đó là nguyên tử của một khí quý.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện, thì chất đó có thể chứa các ion tự do.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì năng lượng được giải phóng trong quá trình phản ứng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O, thì hợp chất đó là nước.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có độ âm điện cao, thì nguyên tố đó có xu hướng thu hút electron trong phản ứng hóa học.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "X là nguyên tố nhóm IIIA, công thức oxide ứng với hóa trị cao nhất của X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên, tốc độ phản ứng hóa học sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Một chất có pH < 7, chất đó được gọi là",
    "re": "axit"
  },
  {
    "con": "Khi một nguyên tố mất electron, nó trở thành",
    "re": "ion dương"
  },
  {
    "con": "Khi một nguyên tố nhận electron, nó trở thành",
    "re": "ion âm"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kín, khối lượng tổng thể sẽ",
    "re": "không thay đổi"
  },
  {
    "con": "Khi hai chất phản ứng với nhau, sản phẩm của phản ứng sẽ",
    "re": "có tính chất khác với các chất ban đầu"
  },
  {
    "con": "Nếu một dung dịch có nồng độ cao, thì khả năng hòa tan của chất trong dung dịch đó sẽ",
    "re": "giảm"
  },
  {
    "con": "Khi nhiệt độ giảm, độ hòa tan của khí trong chất lỏng sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một hợp chất có liên kết ion, nó sẽ có điểm nóng chảy",
    "re": "cao"
  },
  {
    "con": "Nguyên tố nào có 5 electron lớp vỏ ngoài cùng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất nào có điểm sôi thấp hơn 100 độ C?",
    "re": "Chất lỏng đó có thể là nước hoặc rượu"
  },
  {
    "con": "Khi một nguyên tố mất electron, nó sẽ trở thành gì?",
    "re": "Nó sẽ trở thành một ion dương"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra, thì có thể có sự thay đổi nào?",
    "re": "Có thể có sự thay đổi về năng lượng, màu sắc hoặc trạng thái"
  },
  {
    "con": "Khi nhiệt độ tăng, thì tốc độ phản ứng hóa học sẽ như thế nào?",
    "re": "Tốc độ phản ứng hóa học sẽ tăng lên"
  },
  {
    "con": "Nếu một chất có pH dưới 7, thì chất đó được gọi là gì?",
    "re": "Chất đó được gọi là axit"
  },
  {
    "con": "Khi hai nguyên tố kết hợp với nhau, thì chúng tạo ra gì?",
    "re": "Chúng tạo ra một hợp chất"
  },
  {
    "con": "Nếu một chất có tính dẫn điện tốt, thì chất đó thường là gì?",
    "re": "Chất đó thường là kim loại"
  },
  {
    "con": "Khi một chất bay hơi, thì nó chuyển từ trạng thái nào sang trạng thái nào?",
    "re": "Chất đó chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử là 6, thì nguyên tố đó là gì?",
    "re": "Nguyên tố đó là carbon"
  },
  {
    "con": "Quan sát hình ảnh ô nguyên tố của sulfur, số electron lớp ngoài cùng của Sulfur là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ của một chất tăng lên, thì năng lượng động học của các phân tử trong chất đó sẽ",
    "re": "Tăng lên"
  },
  {
    "con": "Một chất có điểm sôi thấp hơn điểm sôi của nước, thì chất đó sẽ bay hơi",
    "re": "Dễ dàng hơn ở nhiệt độ phòng"
  },
  {
    "con": "Khi trộn axit với bazơ, thì phản ứng xảy ra sẽ tạo ra",
    "re": "Nước và muối"
  },
  {
    "con": "Số proton trong hạt nhân của một nguyên tử xác định",
    "re": "Loại nguyên tố đó"
  },
  {
    "con": "Khi một chất thay đổi từ trạng thái rắn sang trạng thái lỏng, thì quá trình này gọi là",
    "re": "Nóng chảy"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong một hệ kín, thì tổng khối lượng của các chất phản ứng sẽ",
    "re": "Bằng tổng khối lượng của các sản phẩm"
  },
  {
    "con": "Khi một nguyên tử mất electron, thì nguyên tử đó sẽ trở thành",
    "re": "Ion dương"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7, thì chất đó được coi là",
    "re": "Axit"
  },
  {
    "con": "Khi nhiệt độ giảm, thì áp suất của khí trong một bình kín sẽ",
    "re": "Giảm xuống"
  },
  {
    "con": "Nguyên tử của nguyên tố phosphorus (Z = 15) có số electron độc thân là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một hợp chất được hình thành từ hai nguyên tố khác nhau thì",
    "re": "Nó có tính chất khác biệt so với các nguyên tố cấu thành"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên thì",
    "re": "Động năng của các phân tử trong chất đó cũng tăng lên"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra thì",
    "re": "Khối lượng của các chất phản ứng bằng khối lượng của các sản phẩm tạo thành"
  },
  {
    "con": "Nếu một dung dịch có pH < 7 thì",
    "re": "Dung dịch đó được coi là axit"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước thì",
    "re": "Nó tạo thành dung dịch đồng nhất"
  },
  {
    "con": "Nếu hai nguyên tố có cùng số electron ở lớp ngoài cùng thì",
    "re": "Chúng có tính chất hóa học tương tự nhau"
  },
  {
    "con": "Khi một chất bị oxi hóa thì",
    "re": "Nó mất electron"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch thì",
    "re": "Các sản phẩm có thể chuyển đổi trở lại thành các chất phản ứng"
  },
  {
    "con": "Khi một chất khí bị nén lại thì",
    "re": "Áp suất của chất khí đó sẽ tăng lên"
  },
  {
    "con": "Lớp M có số electron tối đa bằng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một nguyên tố có số proton bằng số electron",
    "re": "Nguyên tố đó là trung hòa về điện"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm có cùng số electron ở lớp ngoài cùng",
    "re": "Chúng có tính chất hóa học tương tự nhau"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng",
    "re": "Phản ứng xảy ra nhanh hơn"
  },
  {
    "con": "Khi một chất tan trong nước, nó tạo ra dung dịch",
    "re": "Dung dịch đó có thể dẫn điện nếu chất tan là muối hoặc axit"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, khối lượng của các chất phản ứng bằng khối lượng của các sản phẩm",
    "re": "Đây là định luật bảo toàn khối lượng"
  },
  {
    "con": "Khi một nguyên tố mất electron, nó trở thành ion dương",
    "re": "Nguyên tố đó có điện tích dương"
  },
  {
    "con": "Khi một nguyên tố nhận electron, nó trở thành ion âm",
    "re": "Nguyên tố đó có điện tích âm"
  },
  {
    "con": "Các hợp chất ion thường có điểm nóng chảy cao",
    "re": "Chúng thường ở trạng thái rắn ở nhiệt độ phòng"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7",
    "re": "Dung dịch đó trở nên axit"
  },
  {
    "con": "Nguyên tử của nguyên tố nào có bán kính lớn nhất trong các nguyên tử sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất nào có điểm sôi thấp hơn 100 độ C?",
    "re": "Chất lỏng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra, thì các chất tham gia sẽ biến đổi thành gì?",
    "re": "Sản phẩm hóa học"
  },
  {
    "con": "Khi nhiệt độ tăng, thì tốc độ phản ứng hóa học sẽ như thế nào?",
    "re": "Tăng lên"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, thì dung dịch đó được coi là gì?",
    "re": "Acid"
  },
  {
    "con": "Khi hai nguyên tố kết hợp với nhau để tạo thành một hợp chất, thì điều gì xảy ra?",
    "re": "Tạo ra liên kết hóa học"
  },
  {
    "con": "Nếu một chất có mật độ lớn hơn 1 g/cm³, thì chất đó sẽ nổi hay chìm trong nước?",
    "re": "Chìm"
  },
  {
    "con": "Khi một chất rắn tan trong nước, thì nó sẽ tạo ra gì?",
    "re": "Dung dịch"
  },
  {
    "con": "Nếu một nguyên tố có số proton là 6, thì nguyên tố đó là gì?",
    "re": "Carbon"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và năng lượng được giải phóng, thì phản ứng đó được gọi là gì?",
    "re": "Phản ứng tỏa nhiệt"
  },
  {
    "con": "Trong bảng hệ thống tuần hoàn các nguyên tố hóa học, số chu kì nhỏ và chu kì lớn là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất bị nung nóng, nếu nhiệt độ tăng lên thì",
    "re": "động năng của các phân tử trong chất đó tăng lên"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7 thì",
    "re": "dung dịch đó là axit"
  },
  {
    "con": "Khi hai nguyên tố hóa học kết hợp với nhau, nếu chúng tạo thành một hợp chất mới thì",
    "re": "các tính chất của hợp chất đó khác với tính chất của các nguyên tố ban đầu"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín thì",
    "re": "khối lượng tổng của các chất phản ứng bằng khối lượng tổng của các sản phẩm"
  },
  {
    "con": "Khi nước bay hơi, nếu nhiệt độ môi trường xung quanh thấp thì",
    "re": "quá trình bay hơi sẽ diễn ra chậm hơn"
  },
  {
    "con": "Nếu một nguyên tố có số electron bằng số proton thì",
    "re": "nguyên tố đó là trung hòa về điện"
  },
  {
    "con": "Khi một chất rắn tan trong nước, nếu chất đó là muối thì",
    "re": "nó sẽ phân ly thành các ion trong dung dịch"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt thì",
    "re": "nhiệt độ của môi trường xung quanh sẽ tăng lên"
  },
  {
    "con": "Khi một chất bị oxi hóa, nếu nó mất electron thì",
    "re": "chất đó trở thành ion dương"
  },
  {
    "con": "Orbital s có dạng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là hợp chất được tạo thành từ hai nguyên tố là hydro và oxy",
    "re": "Nước có công thức hóa học là H2O"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có cùng số electron ở lớp ngoài cùng",
    "re": "Chúng có tính chất hóa học tương tự nhau"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng",
    "re": "Phản ứng xảy ra nhanh hơn"
  },
  {
    "con": "Khi một chất hòa tan trong nước, nó tạo thành dung dịch",
    "re": "Dung dịch có thể dẫn điện nếu chất hòa tan là muối hoặc axit"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, khối lượng của các chất phản ứng bằng khối lượng của các sản phẩm",
    "re": "Đây là định luật bảo toàn khối lượng"
  },
  {
    "con": "Khi một nguyên tố mất electron, nó trở thành ion dương",
    "re": "Nguyên tố đó có điện tích dương"
  },
  {
    "con": "Khi một nguyên tố nhận electron, nó trở thành ion âm",
    "re": "Nguyên tố đó có điện tích âm"
  },
  {
    "con": "Các phản ứng hóa học có thể được phân loại thành phản ứng tổng hợp, phản ứng phân hủy và phản ứng trao đổi",
    "re": "Mỗi loại phản ứng có đặc điểm riêng"
  },
  {
    "con": "Khi pH của dung dịch giảm, nồng độ ion hydro trong dung dịch tăng",
    "re": "Dung dịch trở nên axit hơn"
  },
  {
    "con": "Các nguyên tố của một chu kỳ được sắp xếp như thế nào trong bảng tuần hoàn hiện đại,\ntừ trái sang phải?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một nguyên tố có số proton bằng 6,\nthì nguyên tố đó là gì?",
    "re": "Carbon"
  },
  {
    "con": "Khi một chất bị nung nóng,\nthì nó sẽ làm gì?",
    "re": "Mở rộng và có thể chuyển sang trạng thái khí"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7,\nthì dung dịch đó được coi là gì?",
    "re": "Acid"
  },
  {
    "con": "Khi hai nguyên tố kết hợp với nhau để tạo thành một hợp chất,\nthì quá trình này gọi là gì?",
    "re": "Phản ứng hóa học"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng,\nthì chất đó sẽ ở trạng thái nào?",
    "re": "Khí"
  },
  {
    "con": "Khi một nguyên tố có nhiều hơn một dạng đồng vị,\nthì điều này có nghĩa là gì?",
    "re": "Chúng có số neutron khác nhau"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn các phản ứng ban đầu,\nthì phản ứng đó là gì?",
    "re": "Phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi một chất hòa tan trong nước và tạo ra ion,\nthì chất đó được gọi là gì?",
    "re": "Chất điện ly"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử lớn hơn 92,\nthì nguyên tố đó được coi là gì?",
    "re": "Nguyên tố phóng xạ"
  },
  {
    "con": "Cho phổ khối của nguyên tố X được biểu diễn tại hình 1.2. Nguyên tử khối trung bình của X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ của một chất tăng lên khi nó hấp thụ nhiệt",
    "re": "Chất đó sẽ chuyển từ trạng thái rắn sang lỏng hoặc từ lỏng sang khí"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm",
    "re": "Đây là định luật bảo toàn khối lượng"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7",
    "re": "Dung dịch đó được coi là axit"
  },
  {
    "con": "Khi hai nguyên tố kết hợp với nhau để tạo thành một hợp chất",
    "re": "Hợp chất đó sẽ có tính chất khác biệt so với các nguyên tố cấu thành"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước",
    "re": "Chất đó sẽ bay hơi nhanh hơn khi được đun nóng"
  },
  {
    "con": "Khi một nguyên tố có số electron bằng số proton",
    "re": "Nguyên tố đó sẽ trung hòa về điện"
  },
  {
    "con": "Nếu một phản ứng hóa học tỏa nhiệt",
    "re": "Phản ứng đó được gọi là phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi một chất bị phân hủy thành các chất đơn giản hơn",
    "re": "Quá trình này được gọi là phản ứng phân hủy"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước",
    "re": "Chất đó được gọi là chất tan"
  },
  {
    "con": "Nguyên tố Aluminium có Z = 13, vị trí của Aluminium trong bảng tuần hoàn là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học là H2O, thì nước là một hợp chất",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất bị đun nóng và chuyển từ trạng thái rắn sang lỏng, thì quá trình này gọi là nóng chảy",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một nguyên tố mất electron, thì nguyên tố đó trở thành ion dương",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi pH của dung dịch nhỏ hơn 7, thì dung dịch đó được coi là axit",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hai hay nhiều nguyên tố kết hợp với nhau để tạo thành một hợp chất, thì đó là phản ứng hóa học",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng, thì chất đó sẽ tồn tại ở dạng khí ở nhiệt độ phòng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và tạo ra khí, thì có thể có bọt khí xuất hiện",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ cao hơn dung dịch khác, thì dung dịch đó sẽ có khả năng hòa tan nhiều chất hơn",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một nguyên tố có số electron bằng số proton, thì nguyên tố đó là trung hòa về điện",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tổng số các loại hạt cơ bản trong nguyên tử nguyên tố X là 52 hạt, trong đó số hạt mang điện nhiều hơn số hạt không mang điện là 16 hạt. Nguyên tố X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, dung dịch đó là",
    "re": "axit"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, thì nguyên tố đó là",
    "re": "carbon"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra mà không có sự thay đổi về khối lượng, thì nguyên tắc này được gọi là",
    "re": "bảo toàn khối lượng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O, thì hợp chất đó là",
    "re": "nước"
  },
  {
    "con": "Nếu một nguyên tử có 8 electron ở lớp vỏ ngoài cùng, thì nguyên tử đó là",
    "re": "nguyên tố khí quý"
  },
  {
    "con": "Nếu một phản ứng hóa học tạo ra khí carbon dioxide (CO2) và nước (H2O), thì phản ứng đó là",
    "re": "phản ứng đốt cháy"
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên, thì động năng của các phân tử trong chất đó sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước, thì chất đó sẽ",
    "re": "bốc hơi ở nhiệt độ thường"
  },
  {
    "con": "Nếu một dung dịch có nồng độ cao hơn dung dịch khác, thì dung dịch đó được gọi là",
    "re": "đậm đặc hơn"
  },
  {
    "con": "Cấu hình electron nào sau đây là của fluorine (Z = 9)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "Tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Một chất có pH dưới 7",
    "re": "Chất đó được coi là axit"
  },
  {
    "con": "Một nguyên tố có số proton bằng số electron",
    "re": "Nguyên tố đó là trung hòa về điện"
  },
  {
    "con": "Khi hai chất phản ứng với nhau và tạo ra khí",
    "re": "Có thể có bọt khí hoặc mùi đặc trưng"
  },
  {
    "con": "Một dung dịch có nồng độ cao",
    "re": "Có thể dẫn điện tốt hơn so với dung dịch loãng"
  },
  {
    "con": "Khi một chất rắn tan trong nước",
    "re": "Chất đó có thể tạo thành dung dịch"
  },
  {
    "con": "Một phản ứng hóa học xảy ra trong môi trường kín",
    "re": "Khối lượng tổng thể của hệ thống sẽ không thay đổi"
  },
  {
    "con": "Khi nhiệt độ giảm trong một phản ứng hóa học tỏa nhiệt",
    "re": "Phản ứng có thể bị chậm lại"
  },
  {
    "con": "Một nguyên tố trong nhóm 1 của bảng tuần hoàn",
    "re": "Có xu hướng mất một electron để tạo thành ion dương"
  },
  {
    "con": "Nguyên tố nào sau đây là kim loại?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất nào có công thức hóa học H2O?",
    "re": "Đó là nước"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C,",
    "re": "thì chất đó có thể là một chất lỏng ở nhiệt độ phòng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và tạo ra khí,",
    "re": "thì có thể có bọt khí xuất hiện"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử 6,",
    "re": "thì nguyên tố đó là carbon"
  },
  {
    "con": "Nếu một dung dịch có pH dưới 7,",
    "re": "thì dung dịch đó là axit"
  },
  {
    "con": "Nếu hai nguyên tố kết hợp với nhau để tạo thành hợp chất,",
    "re": "thì chúng sẽ có tính chất khác với các nguyên tố ban đầu"
  },
  {
    "con": "Nếu một chất có mật độ lớn hơn 1 g/cm³,",
    "re": "thì chất đó sẽ chìm trong nước"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt,",
    "re": "thì nhiệt độ của môi trường xung quanh sẽ tăng lên"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện,",
    "re": "thì chất đó có thể là kim loại hoặc dung dịch điện ly"
  },
  {
    "con": "Khối lượng của nguyên tử magnesium là 39,8271.10_{-27} kg. Khối lượng của magnesium theo amu là (Cho biết 1amu = 1,661.10_{-27}kg).",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học là H2O.",
    "re": "Nước là một hợp chất được tạo thành từ hai nguyên tử hydro và một nguyên tử oxy."
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng.",
    "re": "Điều này xảy ra do các phân tử có nhiều năng lượng hơn và va chạm nhiều hơn."
  },
  {
    "con": "Khi một chất tan trong nước, nó tạo thành dung dịch.",
    "re": "Dung dịch là hỗn hợp đồng nhất giữa chất tan và dung môi."
  },
  {
    "con": "Khi một nguyên tố mất electron, nó trở thành ion dương.",
    "re": "Ion dương có điện tích dương do sự thiếu hụt electron."
  },
  {
    "con": "Khi một nguyên tố nhận electron, nó trở thành ion âm.",
    "re": "Ion âm có điện tích âm do sự thừa electron."
  },
  {
    "con": "Phản ứng hóa học có thể được biểu diễn bằng phương trình hóa học.",
    "re": "Phương trình hóa học cho thấy các chất phản ứng và sản phẩm tạo ra."
  },
  {
    "con": "Khi một chất thay đổi trạng thái từ rắn sang lỏng, nó xảy ra quá trình nóng chảy.",
    "re": "Quá trình này thường xảy ra khi nhiệt độ của chất đạt đến điểm nóng chảy."
  },
  {
    "con": "Khi một chất thay đổi trạng thái từ lỏng sang khí, nó xảy ra quá trình bay hơi.",
    "re": "Quá trình này có thể xảy ra ở bất kỳ nhiệt độ nào, nhưng nhanh hơn ở nhiệt độ cao."
  },
  {
    "con": "Các nguyên tử trong một phân tử được liên kết với nhau bằng liên kết hóa học.",
    "re": "Liên kết hóa học có thể là liên kết ion hoặc liên kết cộng hóa trị."
  },
  {
    "con": "Điện tích hạt nhân của nguyên tử chlorine có 17 electron là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là một hợp chất được tạo thành từ hai nguyên tố là hydro và oxy",
    "re": "Nước có công thức hóa học là H2O"
  },
  {
    "con": "Khi một chất rắn tan trong nước, nó tạo thành dung dịch",
    "re": "Dung dịch có thể dẫn điện nếu chất tan là muối hoặc axit"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng",
    "re": "Điều này xảy ra do các phân tử có năng lượng cao hơn và va chạm nhiều hơn"
  },
  {
    "con": "Khi một nguyên tử mất electron, nó trở thành ion dương",
    "re": "Ion dương có điện tích dương do thiếu electron"
  },
  {
    "con": "Khi một nguyên tử nhận electron, nó trở thành ion âm",
    "re": "Ion âm có điện tích âm do thừa electron"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có tính chất hóa học tương tự",
    "re": "Điều này là do chúng có cùng số electron ở lớp ngoài cùng"
  },
  {
    "con": "Khi axit phản ứng với bazơ, chúng tạo ra muối và nước",
    "re": "Phản ứng này được gọi là phản ứng trung hòa"
  },
  {
    "con": "Khi một chất bị oxi hóa, nó mất electron",
    "re": "Quá trình này thường đi kèm với sự tăng cường điện tích dương"
  },
  {
    "con": "Khi một chất bị khử, nó nhận electron",
    "re": "Quá trình này thường đi kèm với sự giảm điện tích dương"
  },
  {
    "con": "Trong một chu kì, từ trái sang phải thì điện tích hạt nhân",
    "re": "tăng lên"
  },
  {
    "con": "Khi nhiệt độ tăng lên thì tốc độ phản ứng hóa học",
    "re": "tăng lên"
  },
  {
    "con": "Khi một nguyên tố có số electron hóa trị cao thì tính kim loại",
    "re": "giảm đi"
  },
  {
    "con": "Khi pH của dung dịch giảm thì tính axit của dung dịch",
    "re": "tăng lên"
  },
  {
    "con": "Khi một hợp chất ion được hòa tan trong nước thì nó",
    "re": "tạo ra các ion tự do"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra thì tổng khối lượng của các chất phản ứng",
    "re": "bằng tổng khối lượng của các sản phẩm"
  },
  {
    "con": "Khi một nguyên tố có số lượng proton lớn hơn số lượng electron thì nó",
    "re": "có điện tích dương"
  },
  {
    "con": "Khi nhiệt độ giảm thì độ hòa tan của khí trong chất lỏng",
    "re": "tăng lên"
  },
  {
    "con": "Khi một nguyên tố thuộc nhóm 1 trong bảng tuần hoàn thì nó",
    "re": "có tính kim loại mạnh"
  },
  {
    "con": "Khi một phản ứng hóa học là thuận nghịch thì nó",
    "re": "có thể diễn ra theo cả hai chiều"
  },
  {
    "con": "Từ hai đồng vị chlorine ( 35 17 Cl và 37 17 Cl ) và đồng vị 11H , số loại phân tử HCl có thể được tạo thành là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học, tốc độ phản ứng sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion, chất đó được gọi là",
    "re": "chất điện ly"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kín, khối lượng tổng thể của hệ thống sẽ",
    "re": "không thay đổi"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7, dung dịch đó được coi là",
    "re": "axit"
  },
  {
    "con": "Nếu một nguyên tố có số proton là 6, nguyên tố đó là",
    "re": "carbon"
  },
  {
    "con": "Khi hai nguyên tố kết hợp để tạo thành một hợp chất, quá trình này được gọi là",
    "re": "phản ứng hóa học"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước, chất đó sẽ",
    "re": "bốc hơi nhanh hơn trong nước"
  },
  {
    "con": "Khi một chất rắn hòa tan trong dung môi, quá trình này được gọi là",
    "re": "hòa tan"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn các phản ứng ban đầu, phản ứng đó là",
    "re": "phản ứng tỏa nhiệt"
  },
  {
    "con": "Trong một nhóm A (trừ nhóm VIIIA), theo chiều tăng của điện tích hạt nhân nguyên tử",
    "re": "các nguyên tố có độ âm điện tăng lên"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên",
    "re": "độ hòa tan của nhiều chất rắn trong chất lỏng thường tăng"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, năng lượng có thể được giải phóng hoặc hấp thụ",
    "re": "phản ứng đó có thể là tỏa nhiệt hoặc thu nhiệt"
  },
  {
    "con": "Trong một phản ứng hóa học, tổng số nguyên tử trước và sau phản ứng phải bằng nhau",
    "re": "điều này đảm bảo rằng khối lượng được bảo toàn"
  },
  {
    "con": "Khi một chất bị phân hủy thành các chất đơn giản hơn",
    "re": "quá trình này được gọi là phản ứng phân hủy"
  },
  {
    "con": "Khi pH của một dung dịch giảm xuống dưới 7",
    "re": "dung dịch đó trở nên axit"
  },
  {
    "con": "Trong một phản ứng trao đổi ion, các ion dương và ion âm sẽ kết hợp với nhau",
    "re": "tạo thành các hợp chất mới"
  },
  {
    "con": "Khi một chất khí được làm lạnh, thể tích của nó sẽ giảm",
    "re": "theo định luật Charles"
  },
  {
    "con": "Khi một nguyên tố có điện tích dương, nó sẽ thu hút các electron",
    "re": "tạo thành ion dương"
  },
  {
    "con": "Khi một dung dịch có nồng độ cao hơn được pha loãng",
    "re": "nồng độ của dung dịch sẽ giảm"
  },
  {
    "con": "Lớp L có số phân lớp electron bằng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một nguyên tố có số proton bằng số electron",
    "re": "Nguyên tố đó trung hòa về điện"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "Tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Một hợp chất ion được tạo thành từ kim loại và phi kim",
    "re": "Hợp chất đó có tính chất dẫn điện trong dung dịch"
  },
  {
    "con": "Khi pH của dung dịch giảm",
    "re": "Dung dịch trở nên axit hơn"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra",
    "re": "Các liên kết hóa học trong các chất phản ứng bị phá vỡ"
  },
  {
    "con": "Một nguyên tố có số nguyên tử lớn hơn 92",
    "re": "Nguyên tố đó là nguyên tố phóng xạ"
  },
  {
    "con": "Khi nhiệt độ giảm trong một phản ứng hóa học tỏa nhiệt",
    "re": "Phản ứng có thể bị chậm lại"
  },
  {
    "con": "Khi một dung dịch có nồng độ cao hơn",
    "re": "Dung dịch đó có khả năng hòa tan nhiều chất hơn"
  },
  {
    "con": "Khi một nguyên tố có cấu hình electron đầy đủ",
    "re": "Nguyên tố đó thường ít phản ứng hơn"
  },
  {
    "con": "Các nguyên tố trong cùng chu kỳ",
    "re": "Có cùng số lớp electron"
  },
  {
    "con": "Các nguyên tố trong cùng nhóm",
    "re": "Có cùng số electron ở lớp ngoài cùng"
  },
  {
    "con": "Nhiệt độ tăng",
    "re": "Thường làm tăng tốc độ phản ứng hóa học"
  },
  {
    "con": "Chất điện phân",
    "re": "Có khả năng dẫn điện khi hòa tan trong nước"
  },
  {
    "con": "Phản ứng hóa học",
    "re": "Luôn đi kèm với sự thay đổi năng lượng"
  },
  {
    "con": "Chất rắn ion",
    "re": "Có điểm nóng chảy cao và không dẫn điện ở trạng thái rắn"
  },
  {
    "con": "Phản ứng oxi hóa-khử",
    "re": "Liên quan đến sự chuyển giao electron giữa các chất"
  },
  {
    "con": "Chất khí",
    "re": "Có thể nén lại và chiếm toàn bộ thể tích của bình chứa"
  },
  {
    "con": "Dung dịch axit",
    "re": "Có pH nhỏ hơn 7"
  },
  {
    "con": "Dung dịch bazơ",
    "re": "Có pH lớn hơn 7"
  },
  {
    "con": "Dãy nào sau đây gồm các đồng vị của cùng một nguyên tố hoá học?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất có thể thay đổi trạng thái từ rắn sang lỏng khi nhiệt độ tăng?",
    "re": "Chất đó đang nóng chảy"
  },
  {
    "con": "Một phản ứng hoá học xảy ra khi hai chất phản ứng với nhau?",
    "re": "Sẽ tạo ra sản phẩm mới"
  },
  {
    "con": "Một nguyên tố có số proton bằng 6?",
    "re": "Nguyên tố đó là Carbon"
  },
  {
    "con": "Khi một chất bị oxi hoá, nó sẽ mất electron?",
    "re": "Chất đó trở thành ion dương"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7?",
    "re": "Dung dịch đó trở nên axit"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng?",
    "re": "Chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng"
  },
  {
    "con": "Khi một dung dịch có nồng độ ion H+ cao?",
    "re": "Dung dịch đó có tính axit mạnh"
  },
  {
    "con": "Nếu một phản ứng hoá học là thuận nghịch?",
    "re": "Phản ứng có thể diễn ra theo cả hai chiều"
  },
  {
    "con": "Khi một chất bị phân huỷ nhiệt, nó sẽ tạo ra các sản phẩm khác?",
    "re": "Quá trình này thường giải phóng năng lượng"
  },
  {
    "con": "Nguyên tử nguyên tố X có phân lớp electron ngoài cùng là 3p4. Công thức oxide ứng với hoá trị cao nhất của X, hydroxide tương ứng và tính acid – base của chúng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất A có pH < 7. Chất A được phân loại là",
    "re": "chất acid"
  },
  {
    "con": "Chất B có pH > 7. Chất B được phân loại là",
    "re": "chất base"
  },
  {
    "con": "Nguyên tử có số proton bằng số electron. Nguyên tử đó được gọi là",
    "re": "nguyên tử trung hòa"
  },
  {
    "con": "Khi hai nguyên tố kết hợp với nhau để tạo thành một hợp chất, chúng sẽ",
    "re": "tạo ra liên kết hóa học"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra mà không có sự thay đổi về khối lượng, thì",
    "re": "nguyên lý bảo toàn khối lượng được áp dụng"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện trong dung dịch, thì chất đó có thể",
    "re": "là một chất điện ly"
  },
  {
    "con": "Khi một hợp chất ion được hòa tan trong nước, các ion sẽ",
    "re": "tách rời nhau"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử lớn hơn 92, thì nguyên tố đó được gọi là",
    "re": "nguyên tố siêu bền"
  },
  {
    "con": "Vỏ nguyên tử của Nitrogen có 7 electron. Số proton trong nguyên tử Nitrogen là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được tạo thành từ hai nguyên tử hydrogen và một nguyên tử oxygen. Công thức hóa học của nước là",
    "re": "H2O"
  },
  {
    "con": "Khi một chất bị nung nóng, nó thường sẽ mở rộng. Nếu chất đó là chất rắn, thì",
    "re": "nó sẽ trở thành chất lỏng ở nhiệt độ cao hơn"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm. Điều này thể hiện nguyên tắc",
    "re": "bảo toàn khối lượng"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số nguyên tử tăng dần. Nếu một nguyên tố có số nguyên tử là 12, thì",
    "re": "nó là Magie (Mg)"
  },
  {
    "con": "Khi một chất hòa tan trong nước, nó tạo ra dung dịch. Nếu chất đó là muối, thì",
    "re": "nó sẽ tạo ra dung dịch điện ly"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên, động năng của các phân tử trong chất đó cũng tăng lên. Nếu chất đó là khí, thì",
    "re": "nó sẽ mở rộng và áp suất có thể tăng lên"
  },
  {
    "con": "Các ion dương được gọi là cation. Nếu một nguyên tử mất electron, thì",
    "re": "nó trở thành cation"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, năng lượng có thể được hấp thụ hoặc giải phóng. Nếu phản ứng đó là phản ứng tỏa nhiệt, thì",
    "re": "năng lượng được giải phóng ra môi trường"
  },
  {
    "con": "Các hợp chất ion được hình thành từ sự kết hợp của cation và anion. Nếu cation là Na+ và anion là Cl-, thì",
    "re": "hợp chất ion đó là NaCl"
  },
  {
    "con": "Cho các nguyên tố: Nitrogen, silicon, oxygen, phosphorus; tính phi kim của các nguyên tố trên tăng dần theo thứ tự nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C, thì chất đó có thể là chất lỏng ở nhiệt độ phòng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và tạo ra khí, thì có thể có sự thay đổi về thể tích trong hệ thống.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, thì dung dịch đó được coi là axit.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu hai nguyên tố hóa học kết hợp với nhau để tạo thành một hợp chất, thì chúng sẽ có tính chất khác biệt so với các nguyên tố riêng lẻ.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có mật độ lớn hơn 1 g/cm³, thì chất đó sẽ chìm trong nước.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì nhiệt độ của môi trường xung quanh sẽ tăng lên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử cao hơn, thì nó thường có nhiều lớp electron hơn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện, thì chất đó có thể chứa các ion tự do.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H₂O, thì hợp chất đó là nước.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Giả thiết trong tinh thể, các nguyên tử iron là những hình cầu chiếm 75% thể tích tinh thể, phần còn lại là các khe rỗng giữa các quả cầu, cho khối lượng nguyên tử của iron là 55,85 ở 20_{o}C. Khối lượng riêng của iron là 7,78 g/cm3. Cho V_{hc} = \\frac{4\\ pir_{3}}{3}. Bán kính nguyên tử gần đúng của iron là :",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các nguyên tử trong một phân tử nước được liên kết bằng liên kết cộng hóa trị, trong đó mỗi nguyên tử oxy chia sẻ một cặp electron với hai nguyên tử hydro.",
    "re": "Phân tử nước có cấu trúc hình chữ V"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên, năng lượng động học của các phân tử trong chất đó cũng tăng lên.",
    "re": "Chất sẽ có xu hướng chuyển từ trạng thái rắn sang lỏng hoặc khí"
  },
  {
    "con": "Khi một chất tan trong nước, các phân tử của chất đó sẽ phân tán và tương tác với các phân tử nước.",
    "re": "Chất đó sẽ tạo thành dung dịch"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng sẽ bằng tổng khối lượng của các sản phẩm.",
    "re": "Định luật bảo toàn khối lượng được áp dụng"
  },
  {
    "con": "Nếu một nguyên tố có số proton là 6, thì nguyên tố đó là carbon.",
    "re": "Carbon là nguyên tố có ký hiệu C"
  },
  {
    "con": "Khi một chất bị đốt cháy trong không khí, nó sẽ phản ứng với oxy để tạo ra khí carbon dioxide và nước.",
    "re": "Phản ứng này được gọi là phản ứng oxi hóa"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, thì dung dịch đó được coi là axit.",
    "re": "Axit có khả năng cho proton (H+) vào dung dịch"
  },
  {
    "con": "Khi hai nguyên tố kết hợp để tạo thành một hợp chất, chúng sẽ tạo ra một liên kết hóa học.",
    "re": "Liên kết hóa học có thể là liên kết ion hoặc liên kết cộng hóa trị"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng, thì chất đó sẽ tồn tại ở trạng thái khí ở nhiệt độ phòng.",
    "re": "Chất đó được gọi là khí"
  },
  {
    "con": "Nguyên tố Y là nguyên tố thuộc chu kì 3, có công thức oxide cao nhất là YO_{3}. Nguyên tố Y tạo với kim loại M hợp chất có công thức MY, hợp chất MY làm bề mặt lòng đỏ trứng có thể chuyển sang màu xanh lá cây khi được nấu chín trong một thời gian dài ở những quả trứng cũ, trong đó M chiếm 63,64% về khối lượng. Kim loại M là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C, thì chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng.",
    "re": "Chất đó có thể tồn tại ở trạng thái khí"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O, thì hợp chất đó là nước.",
    "re": "Hợp chất đó là nước"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử là 6, thì nguyên tố đó là carbon.",
    "re": "Nguyên tố đó là carbon"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và tạo ra khí, thì có thể có bọt khí xuất hiện trong quá trình phản ứng.",
    "re": "Có thể có bọt khí xuất hiện"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, thì dung dịch đó là axit.",
    "re": "Dung dịch đó là axit"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit và tạo ra khí hydro, thì kim loại đó là một kim loại hoạt động.",
    "re": "Kim loại đó là một kim loại hoạt động"
  },
  {
    "con": "Nếu một chất có khối lượng riêng lớn hơn 1 g/cm³, thì chất đó sẽ chìm trong nước.",
    "re": "Chất đó sẽ chìm trong nước"
  },
  {
    "con": "Nếu một hợp chất có chứa ion OH⁻, thì hợp chất đó là một bazơ.",
    "re": "Hợp chất đó là một bazơ"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì nhiệt độ của môi trường xung quanh sẽ tăng lên.",
    "re": "Nhiệt độ của môi trường xung quanh sẽ tăng lên"
  },
  {
    "con": "X được xem là nguyên tố của sự sống, là chất vi lượng không thể thiếu trong cơ thể người, là khoáng chất có hàm lượng cao thứ hai trong cơ thể con người. Tổng số hạt cơ bản trong ion X_{-3} là 49, trong đó số hạt mang điện nhiều hơn số hạt không mang điện là 17. Tên của nguyên tố X là (cho biết số hiệu nguyên tử của N = 7, P = 15, Sb = 51, As = 33).",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học là H2O, trong đó có hai nguyên tử hydro và một nguyên tử oxy.",
    "re": "Nước là một hợp chất"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn 100 độ C, thì chất đó có thể tồn tại ở trạng thái lỏng ở nhiệt độ phòng.",
    "re": "Chất đó có thể là một chất lỏng"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, thì nguyên tố đó là carbon.",
    "re": "Nguyên tố đó là carbon"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và tạo ra khí, thì có thể có sự thay đổi về thể tích trong hệ thống.",
    "re": "Có thể có sự thay đổi về thể tích"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7, thì chất đó được xem là axit.",
    "re": "Chất đó là axit"
  },
  {
    "con": "Nếu một nguyên tố có khả năng dẫn điện tốt và có độ bóng cao, thì nguyên tố đó có thể là kim loại.",
    "re": "Nguyên tố đó có thể là kim loại"
  },
  {
    "con": "Nếu một dung dịch có nồng độ cao hơn 1 mol/lít, thì dung dịch đó được xem là đậm đặc.",
    "re": "Dung dịch đó là đậm đặc"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra mà không có sự thay đổi về khối lượng, thì phản ứng đó tuân theo định luật bảo toàn khối lượng.",
    "re": "Phản ứng đó tuân theo định luật bảo toàn khối lượng"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử phức tạp và có nhiều nguyên tử khác nhau, thì chất đó có thể là một hợp chất hữu cơ.",
    "re": "Chất đó có thể là hợp chất hữu cơ"
  },
  {
    "con": "Tổng số proton, electron, neutron trong hai nguyên tử A và B là 142, trong số đó tổng số hạt mang điện nhiều hơn số hạt không mang điện là 42. Số hạt mang điện của B nhiều hơn của A là 12. Số hiệu nguyên tử của A và B là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ của một chất tăng lên khi năng lượng nhiệt được cung cấp cho nó",
    "re": "Chất đó sẽ có thể chuyển từ trạng thái rắn sang trạng thái lỏng hoặc từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Một nguyên tố có số hiệu nguyên tử là 6 và số neutron là 6",
    "re": "Nguyên tố đó là Carbon và có khối lượng nguyên tử khoảng 12"
  },
  {
    "con": "Khi một hợp chất ion được hòa tan trong nước",
    "re": "Nó sẽ phân ly thành các ion tự do và dẫn điện tốt hơn"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và năng lượng được giải phóng",
    "re": "Phản ứng đó được gọi là phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi pH của một dung dịch giảm xuống dưới 7",
    "re": "Dung dịch đó trở nên axit hơn"
  },
  {
    "con": "Nếu một nguyên tử có số electron bằng số proton",
    "re": "Nguyên tử đó sẽ trung hòa về điện"
  },
  {
    "con": "Khi hai nguyên tố kết hợp với nhau để tạo thành một hợp chất",
    "re": "Hợp chất đó sẽ có các tính chất khác biệt so với các nguyên tố cấu thành"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước",
    "re": "Chất đó sẽ bay hơi nhanh hơn khi được đặt trong môi trường có nhiệt độ cao"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong một hệ kín",
    "re": "Tổng khối lượng của các chất phản ứng sẽ bằng tổng khối lượng của các sản phẩm tạo thành"
  },
  {
    "con": "Hợp kim cobalt được sử dụng rộng rãi trong các động cơ máy bay vì độ bền nhiệt độ cao là một yếu tố quan trọng. Nguyên tử cobalt có cấu hình electron ngoài cùng là 3d74s2. Số hiệu nguyên tử của cobalt là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là một hợp chất hóa học có công thức H2O, trong đó mỗi phân tử nước bao gồm hai nguyên tử hydro và một nguyên tử oxy.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng lên do các phân tử có nhiều năng lượng hơn và va chạm nhiều hơn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm trên bảng tuần hoàn có tính chất hóa học tương tự nhau do có cùng số electron ở lớp ngoài cùng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi axit phản ứng với bazơ, sản phẩm tạo ra thường là muối và nước.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Phản ứng oxi hóa khử xảy ra khi có sự chuyển giao electron giữa các chất tham gia phản ứng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khối lượng của một nguyên tử được đo bằng đơn vị amu (atomic mass unit), trong đó 1 amu tương đương với 1/12 khối lượng của nguyên tử carbon-12.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất tan trong nước, nó tạo thành dung dịch, và khả năng hòa tan của chất phụ thuộc vào nhiệt độ và áp suất.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các phản ứng hóa học có thể được biểu diễn bằng phương trình hóa học, trong đó các chất phản ứng được viết ở bên trái và sản phẩm được viết ở bên phải.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sự chuyển đổi giữa các trạng thái của chất (rắn, lỏng, khí) xảy ra khi nhiệt độ và áp suất thay đổi.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là một hợp chất được tạo thành từ hai nguyên tố là hydro và oxy. Nếu nước bị đun sôi, nó sẽ chuyển từ trạng thái lỏng sang trạng thái khí.",
    "re": "Hơi nước được sinh ra"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số nguyên tử tăng dần. Nếu một nguyên tố có số nguyên tử lớn hơn một nguyên tố khác, thì nó nằm ở bên phải nguyên tố đó.",
    "re": "Nguyên tố đó có tính chất hóa học khác biệt hơn"
  },
  {
    "con": "Khi axit phản ứng với bazơ, chúng tạo ra muối và nước. Nếu axit clohidric (HCl) phản ứng với natri hydroxide (NaOH), thì sản phẩm tạo ra là natri clorua (NaCl) và nước.",
    "re": "Phản ứng trung hòa xảy ra"
  },
  {
    "con": "Nguyên tử được cấu tạo từ proton, neutron và electron. Nếu một nguyên tử mất một electron, thì nó trở thành một ion dương.",
    "re": "Ion dương có điện tích dương"
  },
  {
    "con": "Các phản ứng hóa học có thể được phân loại thành phản ứng tổng hợp, phân hủy, và trao đổi. Nếu một phản ứng hóa học tạo ra một sản phẩm mới từ hai hoặc nhiều chất phản ứng, thì đó là phản ứng tổng hợp.",
    "re": "Sản phẩm mới được hình thành"
  },
  {
    "con": "Nhiệt độ ảnh hưởng đến tốc độ phản ứng hóa học. Nếu nhiệt độ tăng, thì tốc độ phản ứng thường tăng lên.",
    "re": "Phản ứng xảy ra nhanh hơn"
  },
  {
    "con": "Chất xúc tác là một chất làm tăng tốc độ phản ứng mà không bị tiêu thụ. Nếu một chất xúc tác được thêm vào phản ứng, thì năng lượng kích hoạt cần thiết cho phản ứng sẽ giảm.",
    "re": "Phản ứng diễn ra dễ dàng hơn"
  },
  {
    "con": "Hợp chất ion được hình thành từ các ion dương và ion âm. Nếu ion natri (Na+) kết hợp với ion clorua (Cl-), thì chúng tạo thành hợp chất natri clorua (NaCl).",
    "re": "Muối ăn được hình thành"
  },
  {
    "con": "Khối lượng của các chất phản ứng bằng khối lượng của các sản phẩm trong một phản ứng hóa học. Nếu khối lượng của các chất phản ứng được đo chính xác, thì tổng khối lượng sản phẩm cũng sẽ bằng tổng khối lượng chất phản ứng.",
    "re": "Định luật bảo toàn khối lượng được áp dụng"
  },
  {
    "con": "Các nguyên tố kim loại thường dẫn điện tốt. Nếu một nguyên tố có khả năng dẫn điện, thì nó có thể được phân loại là kim loại.",
    "re": "Nguyên tố đó có tính chất kim loại"
  },
  {
    "con": "Cấu hình electron của fluorine là 1s^2 2s^2 2p^5, của chlorine là 1s^2 2s^2 2p^6 3s^2 3p^5.\nCho các phát biểu sau:\n(a) F và Cl nằm ở cùng một nhóm.\n(b) F và Cl có số electron lớp ngoài cùng bằng nhau.\n(c) F và Cl có số electron lớp ngoài cùng khác nhau.\n(d) F và Cl nằm ở cùng một chu kỳ.\n(e) Số thứ tự của Cl lớn hơn F.\n(g) Cl là nguyên tố nhóm B; F là nguyên tố nhóm A\nSố phát biểu đúng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng thì chất đó sẽ tồn tại ở trạng thái khí ở nhiệt độ phòng.",
    "re": "chất đó sẽ tồn tại ở trạng thái khí"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và có sự thay đổi màu sắc, thì có thể có sự hình thành sản phẩm mới.",
    "re": "có thể có sự hình thành sản phẩm mới"
  },
  {
    "con": "Nếu một nguyên tố có số electron lớp ngoài cùng là 8, thì nguyên tố đó sẽ có tính ổn định cao.",
    "re": "nguyên tố đó sẽ có tính ổn định cao"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, thì dung dịch đó được coi là axit.",
    "re": "dung dịch đó được coi là axit"
  },
  {
    "con": "Nếu một chất có khối lượng mol lớn hơn 100 g/mol, thì chất đó có thể là một hợp chất hữu cơ phức tạp.",
    "re": "chất đó có thể là một hợp chất hữu cơ phức tạp"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì năng lượng được giải phóng trong quá trình phản ứng.",
    "re": "năng lượng được giải phóng trong quá trình phản ứng"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước, thì chất đó thường là một muối hoặc đường.",
    "re": "chất đó thường là một muối hoặc đường"
  },
  {
    "con": "Nếu một nguyên tố nằm ở bên trái bảng tuần hoàn, thì nguyên tố đó thường có tính kim loại.",
    "re": "nguyên tố đó thường có tính kim loại"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao, thì tốc độ phản ứng có thể tăng lên.",
    "re": "tốc độ phản ứng có thể tăng lên"
  },
  {
    "con": "Cấu hình electron của ion X_{2+} là 1s^2 2s^2 2p^6 3s^2 3p^6 3d^6. Trong bảng tuần hoàn các nguyên\ntố hoá học, nguyên tố X thuộc",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn 100 độ C ở áp suất 1 atm,",
    "re": "chất đó có thể tồn tại dưới dạng khí ở nhiệt độ phòng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và tạo ra khí,",
    "re": "thì có thể có bọt khí xuất hiện trong dung dịch"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử là 6,",
    "re": "thì nguyên tố đó là Carbon"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7,",
    "re": "thì dung dịch đó được coi là axit"
  },
  {
    "con": "Nếu một chất có khối lượng mol lớn hơn 100 g/mol,",
    "re": "thì chất đó thường có tính chất vật lý khác biệt so với các chất có khối lượng mol nhỏ hơn"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt,",
    "re": "thì năng lượng được giải phóng ra môi trường xung quanh"
  },
  {
    "con": "Nếu một nguyên tố có cấu hình electron là 1s^2 2s^2 2p^6 3s^2,",
    "re": "thì nguyên tố đó thuộc nhóm kim loại kiềm"
  },
  {
    "con": "Nếu một chất có khả năng hòa tan tốt trong nước,",
    "re": "thì chất đó được gọi là chất tan"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí,",
    "re": "thì sản phẩm có thể khác so với phản ứng xảy ra trong điều kiện có oxy"
  },
  {
    "con": "Cho X, Y, Z, T là các nguyên tố khác nhau trong số bốn nguyên tố: _{11}Na, _{12}Mg, _{13}Al, _{19}K và các tính chất được ghi trong bảng sau:\nNhận xét nào sau đây đúng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "thường làm tăng tốc độ phản ứng"
  },
  {
    "con": "Một hợp chất có công thức hóa học là H2O",
    "re": "là nước"
  },
  {
    "con": "Khi một nguyên tố kim loại phản ứng với oxy",
    "re": "sẽ tạo ra oxit kim loại"
  },
  {
    "con": "Nếu một dung dịch có pH < 7",
    "re": "thì dung dịch đó là axit"
  },
  {
    "con": "Khi hai chất phản ứng với nhau và tạo ra khí",
    "re": "thì có thể có bọt khí xuất hiện"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng",
    "re": "thì chất đó có thể tồn tại ở dạng khí ở nhiệt độ phòng"
  },
  {
    "con": "Khi một dung dịch muối được bay hơi",
    "re": "thì muối sẽ kết tinh lại"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử là 6",
    "re": "thì nguyên tố đó là carbon"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra mà không có sự thay đổi về khối lượng",
    "re": "thì nguyên liệu và sản phẩm có khối lượng bằng nhau"
  },
  {
    "con": "Khi một chất rắn được nung nóng, nó sẽ thường giãn nở và có thể thay đổi trạng thái từ rắn sang lỏng.",
    "re": "Chất rắn có thể chuyển sang trạng thái lỏng."
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, thì dung dịch đó được coi là axit.",
    "re": "Dung dịch có tính axit."
  },
  {
    "con": "Khi hai nguyên tố phản ứng với nhau để tạo thành một hợp chất, thì số lượng nguyên tử của mỗi nguyên tố trong hợp chất sẽ phụ thuộc vào hóa trị của chúng.",
    "re": "Hợp chất được hình thành theo tỷ lệ hóa trị."
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng, thì chất đó sẽ tồn tại ở dạng khí ở nhiệt độ phòng.",
    "re": "Chất tồn tại ở dạng khí."
  },
  {
    "con": "Khi một chất hòa tan trong nước, nếu nó tạo ra ion, thì chất đó được gọi là chất điện ly.",
    "re": "Chất điện ly tạo ra ion trong dung dịch."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn các phản ứng ban đầu, thì phản ứng đó là phản ứng tỏa nhiệt.",
    "re": "Phản ứng tỏa nhiệt xảy ra."
  },
  {
    "con": "Khi một chất bị oxi hóa, thì nó sẽ mất electron.",
    "re": "Chất bị oxi hóa mất electron."
  },
  {
    "con": "Nếu một dung dịch có nồng độ cao hơn nồng độ bão hòa, thì chất rắn sẽ lắng đọng xuống đáy.",
    "re": "Chất rắn lắng đọng xuống đáy."
  },
  {
    "con": "Khi một nguyên tố có số proton lớn hơn 92, thì nó được coi là nguyên tố phóng xạ.",
    "re": "Nguyên tố phóng xạ."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện không có không khí, thì phản ứng đó được gọi là phản ứng yếm khí.",
    "re": "Phản ứng yếm khí xảy ra."
  },
  {
    "con": "Nguyên tử của nguyên tố X có cấu hình electron lớp ngoài cùng là 3s^2 3p^3. Vị trí của X trong bảng tuần hoàn là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ của một chất tăng lên. Năng lượng động học của các phân tử trong chất đó",
    "re": "tăng lên"
  },
  {
    "con": "Một phản ứng hóa học xảy ra và tạo ra sản phẩm mới. Các liên kết hóa học trong các chất phản ứng",
    "re": "bị phá vỡ và hình thành lại"
  },
  {
    "con": "Một dung dịch có pH < 7. Dung dịch đó",
    "re": "là axit"
  },
  {
    "con": "Một nguyên tố có số proton là 6. Nguyên tố đó",
    "re": "là carbon"
  },
  {
    "con": "Khi nước được đun nóng đến 100 độ C ở áp suất khí quyển. Nước",
    "re": "sẽ chuyển sang trạng thái hơi"
  },
  {
    "con": "Một hợp chất có công thức hóa học là NaCl. Hợp chất đó",
    "re": "là muối ăn"
  },
  {
    "con": "Khi một kim loại phản ứng với axit. Kim loại đó",
    "re": "sẽ tạo ra khí hydro"
  },
  {
    "con": "Một chất có khả năng dẫn điện tốt. Chất đó",
    "re": "là kim loại"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước. Chất đó",
    "re": "sẽ tạo ra dung dịch"
  },
  {
    "con": "Trong phản ứng oxi hóa khử, chất oxi hóa là chất",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất tan trong nước tạo thành dung dịch",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi pH của dung dịch giảm, dung dịch trở nên axit hơn",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong một phản ứng hóa học, khối lượng của các chất phản ứng bằng khối lượng của các sản phẩm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số nguyên tử tăng dần",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất bị phân hủy, nó sẽ tạo ra hai hoặc nhiều chất khác",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất điện phân là chất có khả năng dẫn điện khi hòa tan trong nước",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hai chất phản ứng với nhau, chúng có thể tạo ra một chất mới",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong phản ứng hóa học, năng lượng có thể được giải phóng hoặc hấp thụ",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Liên kết trong phân tử HCl là liên kết",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là một hợp chất được tạo thành từ hai nguyên tố là hydro và oxy",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số nguyên tử tăng dần",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Phản ứng hóa học có thể tạo ra hoặc tiêu thụ năng lượng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Ion dương được hình thành khi nguyên tử mất electron",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hợp chất ion thường có điểm nóng chảy cao và dẫn điện khi hòa tan trong nước",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Phản ứng oxi hóa khử liên quan đến sự chuyển giao electron giữa các chất",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khối lượng của các phản ứng hóa học được bảo toàn",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Dung dịch axit có pH nhỏ hơn 7",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong nguyên tử một nguyên tố A có tổng số các hạt cơ bản (p,n,e) là 58. Biết số hạt p ít hơn số hạt n là 1 hạt. Kí hiệu của nguyên tử của nguyên tố A là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7 thì",
    "re": "dung dịch đó là axit"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 12 thì",
    "re": "nguyên tố đó là Magie (Mg)"
  },
  {
    "con": "Nếu hai nguyên tố A và B có cùng số electron ở lớp ngoài cùng thì",
    "re": "chúng có tính chất hóa học tương tự nhau"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra mà không có sự thay đổi về khối lượng thì",
    "re": "khối lượng các chất phản ứng bằng khối lượng các sản phẩm"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O thì",
    "re": "hợp chất đó là nước"
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên thì",
    "re": "động năng của các phân tử trong chất đó cũng tăng lên"
  },
  {
    "con": "Nếu một nguyên tố có khả năng dẫn điện tốt thì",
    "re": "nguyên tố đó thường là kim loại"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt thì",
    "re": "nhiệt độ của môi trường xung quanh sẽ tăng lên"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C thì",
    "re": "chất đó có thể là một chất lỏng dễ bay hơi"
  },
  {
    "con": "Trong phân tử NH_{4}NO_{3} thì số oxi hóa của 2 nguyên tử nitơ lần lượt là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nước được đun sôi thì các phân tử nước sẽ chuyển từ trạng thái lỏng sang trạng thái",
    "re": "hơi"
  },
  {
    "con": "Khi một chất được hòa tan trong nước thì nó sẽ tạo thành dung dịch",
    "re": "đồng nhất"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên thì động năng của các phân tử trong chất đó sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Trong phản ứng hóa học, nếu số nguyên tử của các nguyên tố ở bên trái bằng số nguyên tử ở bên phải thì phản ứng đó là",
    "re": "cân bằng"
  },
  {
    "con": "Khi một nguyên tố có số electron bằng số proton thì nguyên tố đó sẽ có",
    "re": "tích điện trung hòa"
  },
  {
    "con": "Khi một chất rắn được nung nóng đến nhiệt độ cao thì nó có thể chuyển sang trạng thái",
    "re": "lỏng"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7 thì dung dịch đó được coi là",
    "re": "axit"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, nếu năng lượng được giải phóng thì phản ứng đó được gọi là",
    "re": "tỏa nhiệt"
  },
  {
    "con": "Nếu một nguyên tử mất electron thì nó sẽ trở thành",
    "re": "ion dương"
  },
  {
    "con": "Cho các phương trình phản ứng sau:\n(a) 4HCl (đặc) + MnO_{2} \\xrightarrow MnCl_{2} + Cl_{2} + 2H_{2}O \n(b) 2HCl + Zn \\xrightarrow ZnCl_{2} + H_{2}\n(c) 16HCl (đặc) + 2KMnO_{4} \\xrightarrow 2KCl + 2MnCl_{2} + 5Cl_{2} + 8H_{2}O \n(d) 2HCl + Fe \\xrightarrow FeCl_{2} + H_{2}\nTrong các phản ứng trên, số phản ứng trong đó HCl đóng vai trò chất oxi hóa là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "tăng tốc độ phản ứng"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion",
    "re": "chất đó được gọi là chất điện ly"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn các phản ứng ban đầu",
    "re": "phản ứng đó là phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi một chất phản ứng với oxy",
    "re": "sẽ tạo ra sản phẩm là khí carbon dioxide và nước nếu chất đó là hydrocarbon"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7",
    "re": "dung dịch đó trở nên axit"
  },
  {
    "con": "Khi một chất có khả năng dẫn điện trong dung dịch",
    "re": "chất đó là chất điện ly"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra mà không có sự thay đổi về khối lượng",
    "re": "đó là một ví dụ của định luật bảo toàn khối lượng"
  },
  {
    "con": "Khi một nguyên tố có số electron bằng số proton",
    "re": "nguyên tố đó là trung hòa về điện"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và sản phẩm có năng lượng cao hơn các phản ứng ban đầu",
    "re": "phản ứng đó là phản ứng thu nhiệt"
  },
  {
    "con": "Hóa trị trong hợp chất ion được gọi là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là một hợp chất được tạo thành từ hai nguyên tố là hydro và oxy",
    "re": "Nước có công thức hóa học là H2O"
  },
  {
    "con": "Khi một chất bị nung nóng, nó thường sẽ mở rộng",
    "re": "Khối lượng riêng của chất đó sẽ giảm"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số nguyên tử tăng dần",
    "re": "Tính chất hóa học của chúng có xu hướng thay đổi theo nhóm"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm",
    "re": "Đây là định luật bảo toàn khối lượng"
  },
  {
    "con": "Khi một chất hòa tan trong nước, nó có thể tạo ra dung dịch",
    "re": "Dung dịch này có thể dẫn điện nếu chất hòa tan là muối hoặc axit"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên, tốc độ phản ứng hóa học thường sẽ tăng",
    "re": "Điều này là do các phân tử có nhiều năng lượng hơn và va chạm nhiều hơn"
  },
  {
    "con": "Khi một nguyên tố mất electron, nó trở thành ion dương",
    "re": "Nguyên tố đó có điện tích dương"
  },
  {
    "con": "Khi một nguyên tố nhận electron, nó trở thành ion âm",
    "re": "Nguyên tố đó có điện tích âm"
  },
  {
    "con": "Khi hai chất phản ứng với nhau, chúng có thể tạo ra một chất mới",
    "re": "Chất mới này có thể có tính chất khác biệt so với các chất ban đầu"
  },
  {
    "con": "Cho 3 gam hỗn hợp 2 kim loại thuộc nhóm IIA, ở 2 chu kì liên tiếp trong bảng tuần hoàn tác dụng hết với dung dịch HCl dư thu được 3,36 lit khí hidro (đktc). Hai kim loại đó là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan muối natri clorua (NaCl) vào nước, dung dịch thu được sẽ dẫn điện",
    "re": "Dung dịch là chất điện ly"
  },
  {
    "con": "Khi đun nóng một chất rắn, nếu chất đó chuyển thành chất lỏng, thì",
    "re": "Chất đó đã đạt đến điểm nóng chảy"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn các phản ứng ban đầu, thì",
    "re": "Phản ứng đó là phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một chất có chỉ số pH nhỏ hơn 7, thì",
    "re": "Chất đó là axit"
  },
  {
    "con": "Khi cho một lượng axit vào dung dịch bazơ, nếu phản ứng xảy ra hoàn toàn, thì",
    "re": "Sẽ thu được muối và nước"
  },
  {
    "con": "Nếu một chất có khả năng hòa tan trong nước và tạo ra ion dương và ion âm, thì",
    "re": "Chất đó là chất điện ly"
  },
  {
    "con": "Khi một kim loại tác dụng với oxi, nếu sản phẩm tạo thành là oxit kim loại, thì",
    "re": "Kim loại đó đã bị oxi hóa"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và sản phẩm có năng lượng cao hơn các phản ứng ban đầu, thì",
    "re": "Phản ứng đó là phản ứng thu nhiệt"
  },
  {
    "con": "Khi cho một lượng nước vào dung dịch muối, nếu dung dịch trở nên trong suốt, thì",
    "re": "Muối đã hòa tan hoàn toàn"
  },
  {
    "con": "Tổng số hạt cơ bản trong X^3+ là 73, trong đó tổng số hạt mang điện nhiều hơn số hạt không mạng điện là 17. Số electron của X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ của một chất tăng lên, thì năng lượng động học của các phân tử trong chất đó sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Khi một chất tan trong nước, thì nó sẽ tạo ra dung dịch",
    "re": "có khả năng dẫn điện nếu chất đó là chất điện ly"
  },
  {
    "con": "Số nguyên tử trong một phân tử nước (H2O) là 3, thì số nguyên tử oxy trong phân tử nước là",
    "re": "1"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, thì tổng khối lượng của các chất phản ứng sẽ",
    "re": "bằng tổng khối lượng của các sản phẩm"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 12, thì số proton trong nguyên tử của nguyên tố đó là",
    "re": "12"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7, thì dung dịch đó trở thành",
    "re": "axit"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là NaCl, thì hợp chất này được hình thành từ",
    "re": "natri và clo"
  },
  {
    "con": "Khi nhiệt độ của một khí tăng lên trong một bình kín, thì áp suất của khí đó sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một nguyên tố có 6 electron ở lớp vỏ ngoài, thì nguyên tố đó có thể",
    "re": "dễ dàng tham gia vào phản ứng hóa học để đạt được cấu hình electron ổn định"
  },
  {
    "con": "Cho các nguyên tố _{9}F, _{16}S, _{17}Cl, _{14}Si. Chiều giảm dần tính phi kim của chúng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Khi một chất tan trong nước thì nó sẽ tạo ra dung dịch",
    "re": "có khả năng dẫn điện"
  },
  {
    "con": "Nếu một nguyên tố có số electron hóa trị là 1 thì nó sẽ",
    "re": "dễ dàng mất electron để tạo thành ion dương"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7 thì dung dịch đó sẽ",
    "re": "có tính axit"
  },
  {
    "con": "Nếu hai nguyên tố kết hợp với nhau để tạo thành hợp chất thì chúng sẽ",
    "re": "có tính chất khác biệt so với nguyên tố ban đầu"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và có sự giải phóng năng lượng thì đó là",
    "re": "phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn nước thì nó sẽ",
    "re": "bốc hơi nhanh hơn khi ở nhiệt độ phòng"
  },
  {
    "con": "Khi một chất rắn hòa tan trong dung môi thì nó sẽ",
    "re": "tạo ra dung dịch đồng nhất"
  },
  {
    "con": "Nếu một nguyên tố có cấu trúc electron giống với khí hiếm thì nó sẽ",
    "re": "có tính chất hóa học ổn định"
  },
  {
    "con": "Các ion 9F- ; 11Na+ ; 12Mg2+ ; 13Al3+ có",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học H2O",
    "re": "Là một hợp chất quan trọng cho sự sống"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có",
    "re": "Tính chất hóa học tương tự nhau"
  },
  {
    "con": "Một phản ứng hóa học xảy ra",
    "re": "Các chất phản ứng sẽ biến đổi thành các sản phẩm mới"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "Thường làm tăng tốc độ phản ứng"
  },
  {
    "con": "Các nguyên tử có số proton khác nhau",
    "re": "Là các nguyên tố khác nhau"
  },
  {
    "con": "Một dung dịch có pH dưới 7",
    "re": "Là dung dịch axit"
  },
  {
    "con": "Một hợp chất ion được hình thành từ kim loại và phi kim",
    "re": "Có tính chất dẫn điện khi hòa tan trong nước"
  },
  {
    "con": "Các phản ứng hóa học có thể được phân loại thành",
    "re": "Phản ứng tổng hợp, phản ứng phân hủy, và phản ứng trao đổi"
  },
  {
    "con": "Khối lượng của một nguyên tử được đo bằng",
    "re": "Đơn vị Dalton (u) hoặc amu"
  },
  {
    "con": "Kiểu liên kết tạo nên giữa hai nguyên tử bằng một hay nhiều cặp electron chung được gọi là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất có khả năng dẫn điện khi hòa tan trong nước hoặc ở dạng lỏng được gọi là",
    "re": "Chất điện ly"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên, động năng của các phân tử trong chất đó",
    "re": "Tăng lên"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng",
    "re": "Bằng tổng khối lượng của các sản phẩm"
  },
  {
    "con": "Các nguyên tử cùng loại có số proton bằng nhau được gọi là",
    "re": "Một nguyên tố"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước, nó tạo thành một dung dịch đồng nhất, điều này có nghĩa là",
    "re": "Chất rắn đã bị phân tán thành các phân tử hoặc ion"
  },
  {
    "con": "Khi một chất chuyển từ trạng thái rắn sang trạng thái lỏng, quá trình này được gọi là",
    "re": "Nóng chảy"
  },
  {
    "con": "Khi một nguyên tử mất electron, nó trở thành",
    "re": "Ion dương"
  },
  {
    "con": "Khi một nguyên tử nhận electron, nó trở thành",
    "re": "Ion âm"
  },
  {
    "con": "Các phản ứng hóa học có thể được biểu diễn bằng phương trình hóa học, trong đó các chất phản ứng nằm ở bên trái và các sản phẩm nằm ở bên phải, điều này có nghĩa là",
    "re": "Phương trình hóa học thể hiện sự chuyển đổi giữa các chất"
  },
  {
    "con": "Trong một nhóm A (trừ nhóm VIIIA) theo chiều tăng của điện tích hạt nhân nguyên tử",
    "re": "các nguyên tố có độ âm điện tăng lên"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên",
    "re": "độ hòa tan của nhiều chất rắn trong chất lỏng thường tăng"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra",
    "re": "các liên kết hóa học trong các chất phản ứng bị phá vỡ và các liên kết mới được hình thành"
  },
  {
    "con": "Trong một phản ứng axit-bazơ",
    "re": "axit sẽ cho proton (H+) và bazơ sẽ nhận proton"
  },
  {
    "con": "Khi một chất bị oxi hóa",
    "re": "nó sẽ mất electron"
  },
  {
    "con": "Khi một chất bị khử",
    "re": "nó sẽ nhận electron"
  },
  {
    "con": "Trong một dung dịch, nếu pH < 7",
    "re": "dung dịch đó được coi là axit"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước",
    "re": "nó có thể tạo ra một dung dịch đồng nhất"
  },
  {
    "con": "Khi nhiệt độ giảm xuống",
    "re": "tốc độ phản ứng hóa học thường giảm"
  },
  {
    "con": "Trong một phản ứng hóa học, nếu có chất xúc tác",
    "re": "tốc độ phản ứng sẽ tăng mà không làm thay đổi sản phẩm cuối cùng"
  },
  {
    "con": "Oxi có 3 đồng vị 16O, 17 O, 18 O số kiểu phân tử O_{2} có thể tạo thành là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được tạo thành từ 2 nguyên tử Hydro và 1 nguyên tử Oxi",
    "re": "Công thức hóa học của nước là H2O"
  },
  {
    "con": "Một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng",
    "re": "Chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng"
  },
  {
    "con": "Một phản ứng hóa học xảy ra giữa axit và bazơ",
    "re": "Sẽ tạo ra muối và nước"
  },
  {
    "con": "Các nguyên tử trong một phân tử nước được liên kết bằng liên kết cộng hóa trị",
    "re": "Điều này có nghĩa là các nguyên tử chia sẻ electron"
  },
  {
    "con": "Một nguyên tố có số proton là 6",
    "re": "Nguyên tố đó là Carbon"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng",
    "re": "Điều này xảy ra do các phân tử có nhiều năng lượng hơn và va chạm nhiều hơn"
  },
  {
    "con": "Một dung dịch có pH dưới 7",
    "re": "Dung dịch đó được coi là axit"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước",
    "re": "Chất đó tạo thành dung dịch"
  },
  {
    "con": "Khi một nguyên tử mất electron",
    "re": "Nguyên tử đó trở thành ion dương"
  },
  {
    "con": "Trong phản ứng S + 2H_{2}SO_{4} → 3SO_{2} + 2H_{2}O. Vai trò của S trong phản ứng trên là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là dung môi phổ biến nhất trong hóa học, khi hòa tan chất rắn thì",
    "re": "chất rắn sẽ phân tán thành các phân tử nhỏ hơn"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường",
    "re": "tăng lên do các phân tử có năng lượng cao hơn va chạm nhiều hơn"
  },
  {
    "con": "Trong một phản ứng hóa học, nếu số nguyên tử của các nguyên tố ở bên trái không bằng số nguyên tử ở bên phải thì",
    "re": "phản ứng chưa được cân bằng"
  },
  {
    "con": "Khi một chất bị oxi hóa, thì",
    "re": "chất đó mất electron"
  },
  {
    "con": "Nếu một dung dịch có pH < 7 thì",
    "re": "dung dịch đó được coi là axit"
  },
  {
    "con": "Khi hai chất phản ứng với nhau và tạo ra khí, thì",
    "re": "khí đó có thể được thu thập và đo lường để xác định sản phẩm phản ứng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn nước, thì",
    "re": "chất đó sẽ bay hơi nhanh hơn khi đun nóng"
  },
  {
    "con": "Trong bảng tuần hoàn, nếu một nguyên tố nằm ở bên trái của nguyên tố khác, thì",
    "re": "nguyên tố bên trái có độ điện tích dương cao hơn"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và năng lượng được giải phóng, thì",
    "re": "phản ứng đó được gọi là phản ứng tỏa nhiệt"
  },
  {
    "con": "Nitơ trong tự nhiên là hỗn hợp gồm hai đồng vị là 14 N(99,63%) và 15 N(0,37%). Nguyên tử khối trung bình của nitơ là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được tạo thành từ hai nguyên tử hydro và một nguyên tử oxy",
    "re": "Công thức hóa học của nước là H2O"
  },
  {
    "con": "Khi axit và bazơ phản ứng với nhau, sản phẩm tạo thành là muối và nước",
    "re": "Phản ứng trung hòa xảy ra"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên, động năng của các phân tử trong chất đó cũng tăng lên",
    "re": "Chất đó sẽ có xu hướng mở rộng"
  },
  {
    "con": "Khi một chất rắn được nung nóng đến nhiệt độ cao, nó có thể chuyển sang trạng thái lỏng",
    "re": "Quá trình này gọi là nóng chảy"
  },
  {
    "con": "Khi một chất lỏng bay hơi, các phân tử của nó chuyển từ trạng thái lỏng sang trạng thái khí",
    "re": "Quá trình này gọi là bay hơi"
  },
  {
    "con": "Khi một nguyên tử mất một hoặc nhiều electron, nó trở thành ion dương",
    "re": "Quá trình này gọi là ion hóa"
  },
  {
    "con": "Khi các nguyên tử hoặc phân tử kết hợp với nhau để tạo thành một hợp chất mới, phản ứng hóa học xảy ra",
    "re": "Sản phẩm của phản ứng có thể khác biệt với các chất ban đầu"
  },
  {
    "con": "Khi một chất hòa tan trong nước, nó tạo thành dung dịch",
    "re": "Dung dịch có thể dẫn điện nếu chất hòa tan là muối hoặc axit"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm",
    "re": "Đây là định luật bảo toàn khối lượng"
  },
  {
    "con": "Các nguyên tố thuộc nhóm A trong bảng tuần hoàn là những nguyên tố nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học là gì?",
    "re": "Công thức hóa học của nước là H2O"
  },
  {
    "con": "Các nguyên tố kim loại thường có tính chất gì?",
    "re": "Các nguyên tố kim loại thường dẫn điện và dẫn nhiệt tốt"
  },
  {
    "con": "Khi axit phản ứng với bazơ thì sản phẩm tạo ra là gì?",
    "re": "Sản phẩm tạo ra là muối và nước"
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên thì thể tích của chất khí sẽ như thế nào?",
    "re": "Thể tích của chất khí sẽ tăng lên"
  },
  {
    "con": "Khi một chất bị đốt cháy trong không khí thì sản phẩm tạo ra thường là gì?",
    "re": "Sản phẩm tạo ra thường là khí CO2 và nước"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7 thì dung dịch đó có tính chất gì?",
    "re": "Dung dịch đó có tính axit"
  },
  {
    "con": "Khi hai nguyên tố kết hợp với nhau để tạo thành hợp chất thì điều gì xảy ra?",
    "re": "Điều đó dẫn đến sự hình thành liên kết hóa học"
  },
  {
    "con": "Nếu một chất không tan trong nước thì nó có thể tan trong chất nào?",
    "re": "Nó có thể tan trong dung môi hữu cơ như ethanol hoặc acetone"
  },
  {
    "con": "Khi nhiệt độ giảm thì áp suất của khí trong một bình kín sẽ như thế nào?",
    "re": "Áp suất của khí sẽ giảm"
  },
  {
    "con": "Hãy cho biết phản ứng nào là phản ứng trao đổi",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học là H2O",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C thì chất đó có thể là chất lỏng ở nhiệt độ phòng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra thì có thể có sự thay đổi về năng lượng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có pH dưới 7 thì chất đó được coi là axit",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử là 6 thì nguyên tố đó là carbon",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ cao thì nó chứa nhiều chất tan hơn",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng oxi hóa thì có sự mất electron",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có tính chất dẫn điện thì chất đó có thể chứa ion",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường nước thì nó được gọi là phản ứng thủy phân",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nguyên tử của nguyên tố R có cấu hình electron [He]2s^22p^3. Công thức của hợp chất khí với hiđro và công thức oxit cao nhất là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được tạo thành từ hai nguyên tử hiđro và một nguyên tử oxy.",
    "re": "Công thức hóa học của nước là H2O"
  },
  {
    "con": "Một hợp chất có điểm sôi cao hơn điểm sôi của các nguyên tố cấu thành nó.",
    "re": "Hợp chất đó có liên kết hóa học mạnh hơn"
  },
  {
    "con": "Khi một nguyên tố kim loại phản ứng với phi kim, nó thường mất electron.",
    "re": "Nguyên tố kim loại trở thành ion dương"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7,",
    "re": "thì dung dịch đó là axit"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng lên.",
    "re": "Điều này là do các phân tử có năng lượng cao hơn và va chạm nhiều hơn"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử 6,",
    "re": "thì nguyên tố đó là cacbon"
  },
  {
    "con": "Khi hai nguyên tố kết hợp để tạo thành một hợp chất,",
    "re": "thì chúng sẽ có các tính chất khác biệt so với các nguyên tố ban đầu"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và sản phẩm không giống như các chất phản ứng,",
    "re": "thì phản ứng đó là phản ứng hóa học"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước,",
    "re": "thì nó có thể tạo ra một dung dịch đồng nhất"
  },
  {
    "con": "Nước có công thức hóa học là",
    "re": "H2O"
  },
  {
    "con": "Khi một chất bị nung nóng, nó thường",
    "re": "mở rộng và có thể chuyển sang trạng thái khí"
  },
  {
    "con": "Trong một phản ứng hóa học, khối lượng của các chất phản ứng",
    "re": "bằng khối lượng của các sản phẩm"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo",
    "re": "số nguyên tử tăng dần"
  },
  {
    "con": "Khi một chất hòa tan trong nước, nó tạo ra",
    "re": "dung dịch"
  },
  {
    "con": "Các ion dương được gọi là",
    "re": "cation"
  },
  {
    "con": "Khi một chất thay đổi trạng thái từ rắn sang lỏng, quá trình này gọi là",
    "re": "chảy"
  },
  {
    "con": "Khi một chất phản ứng với oxy, nó thường",
    "re": "tỏa ra nhiệt và ánh sáng"
  },
  {
    "con": "Chất có khả năng dẫn điện trong dung dịch được gọi là",
    "re": "chất điện ly"
  },
  {
    "con": "Khi pH của dung dịch nhỏ hơn 7, dung dịch đó được coi là",
    "re": "axit"
  },
  {
    "con": "Trong nguyên tử, các electron quyết định tính chất kim loại, phi kim hay khí hiếm là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất bị nung nóng, các phân tử của nó sẽ di chuyển nhanh hơn:",
    "re": "Chất đó sẽ mở rộng thể tích"
  },
  {
    "con": "Khi một dung dịch axit được trộn với một dung dịch bazơ:",
    "re": "Phản ứng trung hòa sẽ xảy ra, tạo ra nước và muối"
  },
  {
    "con": "Khi một chất thay đổi trạng thái từ rắn sang lỏng:",
    "re": "Nhiệt độ của chất đó sẽ tăng lên cho đến khi nó tan chảy"
  },
  {
    "con": "Trong phản ứng hóa học, tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm:",
    "re": "Đây là định luật bảo toàn khối lượng"
  },
  {
    "con": "Khi một nguyên tố có số electron bằng số proton:",
    "re": "Nguyên tố đó sẽ có điện tích trung hòa"
  },
  {
    "con": "Khi nhiệt độ của một khí tăng lên trong một bình kín:",
    "re": "Áp suất của khí đó sẽ tăng lên"
  },
  {
    "con": "Khi một chất hòa tan trong nước, nếu nó tạo ra ion:",
    "re": "Chất đó được gọi là chất điện ly"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, năng lượng có thể được giải phóng hoặc hấp thụ:",
    "re": "Phản ứng đó có thể là tỏa nhiệt hoặc thu nhiệt"
  },
  {
    "con": "Khi các nguyên tử kết hợp với nhau để tạo thành phân tử:",
    "re": "Chúng sẽ tạo ra liên kết hóa học"
  },
  {
    "con": "Cấu hình electron nào sau đây là của nguyên tử kim loại?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất có điểm sôi thấp hơn 100 độ C ở áp suất 1 atm?",
    "re": "Chất đó có thể là chất lỏng hoặc khí"
  },
  {
    "con": "Khi một chất phản ứng với oxy, sản phẩm thường là gì?",
    "re": "Sản phẩm thường là oxit"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7?",
    "re": "Dung dịch đó là axit"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường như thế nào?",
    "re": "Tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Nếu một nguyên tử có số proton bằng số electron?",
    "re": "Nguyên tử đó là trung hòa về điện"
  },
  {
    "con": "Khi một chất bị hòa tan trong nước, nó tạo ra dung dịch?",
    "re": "Dung dịch đó có thể dẫn điện nếu chất đó là muối hoặc axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và tạo ra khí?",
    "re": "Có thể có bọt khí hoặc mùi đặc trưng"
  },
  {
    "con": "Khi một nguyên tử mất electron?",
    "re": "Nguyên tử đó trở thành ion dương"
  },
  {
    "con": "Nếu một chất có cấu trúc tinh thể?",
    "re": "Chất đó có thể là rắn và có tính chất vật lý đặc trưng"
  },
  {
    "con": "Câu 23: Hợp chất nào sau đây trong phân tử có chứa liên kết ion là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Một chất có pH nhỏ hơn 7",
    "re": "là một axit"
  },
  {
    "con": "Một chất có pH lớn hơn 7",
    "re": "là một bazơ"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion",
    "re": "chất đó được gọi là chất điện ly"
  },
  {
    "con": "Khi hai chất phản ứng với nhau và tạo ra khí",
    "re": "phản ứng đó có thể tạo ra bọt khí"
  },
  {
    "con": "Khi một nguyên tố mất electron",
    "re": "nguyên tố đó trở thành ion dương"
  },
  {
    "con": "Khi một nguyên tố nhận electron",
    "re": "nguyên tố đó trở thành ion âm"
  },
  {
    "con": "Khi nhiệt độ của một chất lỏng tăng lên",
    "re": "điểm sôi của chất lỏng đó cũng tăng lên"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và năng lượng được giải phóng",
    "re": "phản ứng đó được gọi là phản ứng tỏa nhiệt"
  },
  {
    "con": "Phát biểu nào dưới đây sai:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học H2O:",
    "re": "Nước là một hợp chất"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số nguyên tử tăng dần:",
    "re": "Bảng tuần hoàn phản ánh tính chất hóa học của các nguyên tố"
  },
  {
    "con": "Khi một chất bị đốt cháy trong không khí:",
    "re": "Nó sẽ tạo ra khí carbon dioxide và nước"
  },
  {
    "con": "Khi nhiệt độ tăng lên:",
    "re": "Tốc độ phản ứng hóa học thường tăng lên"
  },
  {
    "con": "Khi một dung dịch có pH < 7:",
    "re": "Dung dịch đó là axit"
  },
  {
    "con": "Khi một chất hòa tan trong nước:",
    "re": "Nó có thể tạo ra dung dịch"
  },
  {
    "con": "Khi hai nguyên tố kết hợp với nhau:",
    "re": "Chúng có thể tạo ra một hợp chất mới"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra:",
    "re": "Năng lượng có thể được giải phóng hoặc hấp thụ"
  },
  {
    "con": "Khi một chất rắn tan trong nước:",
    "re": "Nó có thể tạo ra một dung dịch đồng nhất"
  },
  {
    "con": "Ở trạng thái cơ bản, cấu hình electron lớp ngoài cùng của nguyên tử X là 3s2. Số hiệu nguyên tử của nguyên tố X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất được hòa tan trong nước và tạo ra ion, chất đó được gọi là",
    "re": "chất điện ly"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn các phản ứng ban đầu, thì phản ứng đó là",
    "re": "phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên, động năng của các phân tử trong chất đó sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, thì nguyên tố đó là",
    "re": "carbon"
  },
  {
    "con": "Khi một chất rắn chuyển thành hơi mà không qua trạng thái lỏng, quá trình này được gọi là",
    "re": "sublimation (sublim hóa)"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, thì dung dịch đó được coi là",
    "re": "axit"
  },
  {
    "con": "Khi hai nguyên tố kết hợp với nhau để tạo thành một hợp chất, thì quá trình này được gọi là",
    "re": "phản ứng tổng hợp"
  },
  {
    "con": "Nếu một nguyên tử mất một electron, thì nguyên tử đó trở thành",
    "re": "ion dương"
  },
  {
    "con": "Khi một chất bị phân hủy thành các thành phần đơn giản hơn, thì quá trình này được gọi là",
    "re": "phản ứng phân hủy"
  },
  {
    "con": "Ở trạng thái cơ bản, cấu hình electron của nguyên tử Al (Z = 13) là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là một hợp chất được hình thành từ hai nguyên tố là hydro và oxy",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng lên",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có tính chất hóa học tương tự nhau",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất tan trong nước, nó tạo ra dung dịch",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Phản ứng hóa học có thể được biểu diễn bằng phương trình hóa học",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một nguyên tử mất electron, nó trở thành ion dương",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khối lượng của một nguyên tử được đo bằng đơn vị amu (atomic mass unit)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các phản ứng hóa học có thể được phân loại thành phản ứng tổng hợp, phản ứng phân hủy và phản ứng trao đổi",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất bị oxi hóa, nó mất electron",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nguyên tố X là phi kim có hoá trị cao nhất với oxi là a; hoá trị trong hợp chất khí với hiđro là b. Quan hệ giữa a và b là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất A là một hợp chất ion; nếu chất A được hòa tan trong nước, thì nó sẽ phân ly thành các ion.",
    "re": "Chất A dẫn điện trong dung dịch"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và năng lượng được giải phóng, thì phản ứng đó là phản ứng tỏa nhiệt.",
    "re": "Nhiệt độ môi trường xung quanh sẽ tăng lên"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C, thì chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng.",
    "re": "Chất đó có thể là một khí hoặc chất lỏng dễ bay hơi"
  },
  {
    "con": "Nếu một nguyên tố có số electron ở lớp ngoài cùng là 7, thì nguyên tố đó có xu hướng nhận thêm 1 electron để đạt cấu hình bền.",
    "re": "Nguyên tố đó là một halogen"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, thì dung dịch đó là axit.",
    "re": "Dung dịch đó có khả năng làm đổi màu quỳ tím thành đỏ"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra giữa axit và bazơ, thì sản phẩm của phản ứng đó thường là muối và nước.",
    "re": "Phản ứng đó được gọi là phản ứng trung hòa"
  },
  {
    "con": "Nếu một chất có khối lượng mol lớn hơn 100 g/mol, thì chất đó thường có tính chất vật lý khác biệt so với các chất có khối lượng mol nhỏ hơn.",
    "re": "Chất đó có thể có điểm nóng chảy và điểm sôi cao hơn"
  },
  {
    "con": "Nếu một nguyên tố có số proton là 6, thì nguyên tố đó là carbon.",
    "re": "Carbon là nguyên tố cơ bản trong hóa học hữu cơ"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện không có oxy, thì đó là phản ứng yếm khí.",
    "re": "Phản ứng này thường xảy ra trong môi trường thiếu oxy"
  },
  {
    "con": "Hợp chất khí với hiđro của nguyên tố R là RH4. Oxit cao nhất của nó chứa 53,33% oxi về khối lượng . R là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C, thì chất đó có thể là một chất lỏng ở nhiệt độ phòng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và tạo ra khí, thì có thể có sự thay đổi về thể tích trong hệ thống.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, thì dung dịch đó được coi là axit.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử là 6, thì nguyên tố đó là cacbon.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất chứa ion Na+ và Cl-, thì hợp chất đó là natri clorua (muối ăn).",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất rắn không tan trong nước, thì chất đó có thể là một muối không tan.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học tỏa nhiệt, thì phản ứng đó được gọi là phản ứng tỏa nhiệt.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có khả năng dẫn điện tốt, thì nguyên tố đó có thể là kim loại.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O, thì hợp chất đó là nước.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tỉ lệ số phân tử HNO_{3} đóng vai trò là chất oxi hóa và môi trường trong phản ứng:\nFeO + HNO_{3} \\xrightarrow Fe(NO_{3})_{3} + NO + H_{2}O là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì",
    "re": "tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Số nguyên tử trong một phân tử nước H_{2}O là",
    "re": "3 (2 nguyên tử H và 1 nguyên tử O)"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion thì",
    "re": "chất đó được gọi là chất điện ly"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kiềm thì",
    "re": "pH của dung dịch sẽ lớn hơn 7"
  },
  {
    "con": "Khi một chất bị oxi hóa thì",
    "re": "nó sẽ mất electron"
  },
  {
    "con": "Nếu hai chất phản ứng với nhau tạo ra khí thì",
    "re": "khí đó có thể được thu thập và đo lường"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên thì",
    "re": "tốc độ phản ứng có thể tăng lên"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7 thì",
    "re": "chất đó được coi là axit"
  },
  {
    "con": "Khi một phản ứng hóa học đạt đến trạng thái cân bằng thì",
    "re": "tốc độ phản ứng thuận và phản ứng nghịch bằng nhau"
  },
  {
    "con": "Điện hóa trị của Na, Mg, Al trong NaCl, MgO, Al_{2}O_{3} lần lượt là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ sôi của nước là 100 độ C ở áp suất 1 atm",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Khi một axit phản ứng với một bazơ",
    "re": "Sẽ tạo ra muối và nước"
  },
  {
    "con": "Nếu một chất có khối lượng riêng lớn hơn 1 g/cm³",
    "re": "Chất đó sẽ chìm trong nước"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng",
    "re": "Do các phân tử có nhiều năng lượng hơn và va chạm nhiều hơn"
  },
  {
    "con": "Nếu một chất có pH nhỏ hơn 7",
    "re": "Chất đó được coi là axit"
  },
  {
    "con": "Khi một kim loại phản ứng với axit",
    "re": "Sẽ tạo ra khí hydro"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong một hệ kín",
    "re": "Thì tổng khối lượng của các chất phản ứng sẽ bằng tổng khối lượng của các sản phẩm"
  },
  {
    "con": "Khi một chất bị oxi hóa",
    "re": "Chất đó sẽ mất electron"
  },
  {
    "con": "Nếu một dung dịch có nồng độ cao hơn dung dịch khác",
    "re": "Dung dịch đó sẽ có khả năng hút nước từ dung dịch kia"
  },
  {
    "con": "Nguyên tử khí hiếm (trừ He) có số e lớp ngoài cùng là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất có điểm nóng chảy thấp thường là:",
    "re": "Chất rắn ở nhiệt độ phòng"
  },
  {
    "con": "Khi một chất bị đun nóng và chuyển từ trạng thái rắn sang lỏng thì:",
    "re": "Chất đó đang nóng chảy"
  },
  {
    "con": "Khi một dung dịch có nồng độ cao hơn dung dịch khác thì:",
    "re": "Dung dịch đó được gọi là dung dịch bão hòa"
  },
  {
    "con": "Nếu một nguyên tử có số proton bằng số electron thì:",
    "re": "Nguyên tử đó là trung hòa về điện"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và tạo ra khí thì:",
    "re": "Có thể có bọt khí hoặc mùi đặc trưng"
  },
  {
    "con": "Nếu một chất có tính axit thì:",
    "re": "Chất đó có thể làm đổi màu giấy quỳ tím thành đỏ"
  },
  {
    "con": "Khi hai chất phản ứng với nhau và tạo ra nhiệt thì:",
    "re": "Phản ứng đó được gọi là phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử lớn hơn 92 thì:",
    "re": "Nguyên tố đó là phóng xạ"
  },
  {
    "con": "Khi nước bay hơi thì:",
    "re": "Nước chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Hạt mang điện trong nguyên tử là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nguyên tử được cấu tạo từ proton, neutron và electron:",
    "re": "Nguyên tử có khối lượng và điện tích"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số nguyên tử tăng dần:",
    "re": "Tính chất hóa học của chúng có xu hướng thay đổi theo chu kỳ"
  },
  {
    "con": "Khi một chất hóa học phản ứng với một chất khác:",
    "re": "Sẽ tạo ra các sản phẩm mới với tính chất khác biệt"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học:",
    "re": "Thường làm tăng tốc độ phản ứng"
  },
  {
    "con": "Khi một dung dịch bão hòa được làm nguội:",
    "re": "Có thể tạo ra tinh thể khi chất tan kết tinh"
  },
  {
    "con": "Khi một nguyên tố mất electron:",
    "re": "Nó trở thành ion dương"
  },
  {
    "con": "Khi một nguyên tố nhận electron:",
    "re": "Nó trở thành ion âm"
  },
  {
    "con": "Phản ứng hóa học có thể được biểu diễn bằng phương trình hóa học:",
    "re": "Phương trình này cho thấy mối quan hệ giữa các chất phản ứng và sản phẩm"
  },
  {
    "con": "Chất lỏng có thể chuyển thành hơi khi nhiệt độ tăng:",
    "re": "Quá trình này gọi là bay hơi"
  },
  {
    "con": "Cho 0,685 gam hỗn hợp Zn và Mg phản ứng vừa đủ với dung dịch H_{2}SO_{4} loãng, thu được m gam muối và 0,448 lít khí H_{2} (đktc). Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một nguyên tố kim loại phản ứng với axit, sản phẩm tạo thành sẽ bao gồm muối và khí hydro",
    "re": "Đúng"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, thì dung dịch đó được coi là axit",
    "re": "Đúng"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng lên",
    "re": "Đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C, thì chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng",
    "re": "Đúng"
  },
  {
    "con": "Khi hai chất phản ứng với nhau và tạo ra khí, thì có thể có sự thay đổi về khối lượng của hệ thống",
    "re": "Đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O, thì đó là nước",
    "re": "Đúng"
  },
  {
    "con": "Khi một chất rắn tan trong nước, thì nó có thể tạo thành dung dịch đồng nhất",
    "re": "Đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín, thì tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm",
    "re": "Đúng"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, thì nguyên tố đó là carbon",
    "re": "Đúng"
  },
  {
    "con": "Hòa tan hoàn toàn 12,9 gam hỗn hợp Cu, Zn vào dung dịch H_{2}SO_{4} đặc, nóng dư thu được 0,14 mol SO_{2}; 0,64 gam S và dung dịch muối sunfat. Phần trăm khối lượng của Cu trong hỗn hợp ban đầu là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên thì tốc độ phản ứng hóa học thường tăng lên",
    "re": "do các phân tử có năng lượng cao hơn và va chạm nhiều hơn"
  },
  {
    "con": "Khi thêm axit vào dung dịch kiềm thì sẽ xảy ra phản ứng trung hòa",
    "re": "tạo ra muối và nước"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7 thì chất đó được coi là axit",
    "re": "và có khả năng cho proton (H+) vào dung dịch"
  },
  {
    "con": "Khi một chất rắn tan trong nước thì nó sẽ tạo thành dung dịch",
    "re": "và các ion của chất đó sẽ phân tán trong dung dịch"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín thì khối lượng tổng thể sẽ không thay đổi",
    "re": "theo định luật bảo toàn khối lượng"
  },
  {
    "con": "Khi nhiệt độ giảm thì độ hòa tan của nhiều chất rắn trong nước thường giảm",
    "re": "và ngược lại, độ hòa tan của khí thường tăng lên"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử phức tạp thì nó có thể có nhiều tính chất hóa học khác nhau",
    "re": "và có thể tham gia vào nhiều phản ứng khác nhau"
  },
  {
    "con": "Khi một chất bị oxi hóa thì nó sẽ mất electron",
    "re": "và có thể làm tăng số oxi hóa của nó"
  },
  {
    "con": "Nếu một dung dịch có nồng độ cao thì khả năng dẫn điện của dung dịch đó sẽ cao",
    "re": "do có nhiều ion tự do trong dung dịch"
  },
  {
    "con": "Cho 13,9 gam hỗn hợp X gồm Al và Fe phản ứng hết với dung dịch HCl dư, thu được 7,84 lit khí H_{2} (đktc). Khối lượng Fe trong hỗn hợp X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 1 mol NaCl vào 1 lít nước, nồng độ dung dịch NaCl sẽ là",
    "re": "1 M"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C, thì chất đó sẽ bay hơi ở nhiệt độ phòng",
    "re": "đúng"
  },
  {
    "con": "Khi cho axit vào dung dịch kiềm, nếu phản ứng xảy ra hoàn toàn, thì sản phẩm tạo thành sẽ là",
    "re": "muối và nước"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, thì nguyên tố đó là",
    "re": "Cacbon (C)"
  },
  {
    "con": "Khi đun nóng nước đến 100 độ C, nếu áp suất không đổi, thì nước sẽ chuyển sang trạng thái",
    "re": "hơi"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra tỏa nhiệt, thì năng lượng sẽ",
    "re": "được giải phóng ra môi trường"
  },
  {
    "con": "Khi cho một kim loại tác dụng với axit, nếu có khí thoát ra, thì kim loại đó có khả năng",
    "re": "thay thế ion H+ trong axit"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là",
    "re": "axit"
  },
  {
    "con": "Khi trộn hai chất lỏng không hòa tan vào nhau, nếu có hiện tượng tách lớp xảy ra, thì hai chất đó là",
    "re": "không tương hợp"
  },
  {
    "con": "Cho V lít hỗn hợp khí Cl_{2} và O_{2} (đktc) tác dụng vừa đủ với hỗn hợp gồm 2,7 gam nhôm và 3,6 gam magie. Kết thúc thí nghiệm thu được 22,1 gam hỗn hợp sản phẩm. Giá trị của V là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 10 gam muối NaCl vào 100 ml nước, nồng độ mol của dung dịch NaCl là",
    "re": "0,17 M"
  },
  {
    "con": "Nếu một chất có nhiệt độ nóng chảy thấp hơn nhiệt độ phòng, thì chất đó sẽ tồn tại ở trạng thái",
    "re": "lỏng hoặc khí"
  },
  {
    "con": "Khi cho 2 mol khí CO vào 1 mol khí O2 trong điều kiện thích hợp, thì sản phẩm phản ứng sẽ là",
    "re": "2 mol khí CO2"
  },
  {
    "con": "Nếu một dung dịch có pH = 7, thì dung dịch đó được coi là",
    "re": "trung tính"
  },
  {
    "con": "Khi đun nóng 1 mol nước, nếu nhiệt độ đạt 100 độ C, thì nước sẽ chuyển sang trạng thái",
    "re": "hơi"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 12, thì nguyên tố đó là",
    "re": "Magie (Mg)"
  },
  {
    "con": "Khi cho 5 gam bột sắt vào 20 ml dung dịch HCl 1M, thì lượng khí H2 sinh ra là",
    "re": "0,1 mol"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra mà không có sự thay đổi về khối lượng, thì phản ứng đó là",
    "re": "phản ứng hóa học bảo toàn khối lượng"
  },
  {
    "con": "Khi cho 1 mol axit HCl tác dụng với 1 mol NaOH, thì sản phẩm thu được là",
    "re": "1 mol NaCl và 1 mol nước"
  },
  {
    "con": "Khi cho 0,6g một kim loại X nhóm IIA tác dụng với dung dịch HCl dư thu được 0,336 lít khí H_{2} (đktc). X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 10g muối NaCl vào 100ml nước, nồng độ dung dịch NaCl là",
    "re": "0,1 mol/l"
  },
  {
    "con": "Khi đun nóng một hợp chất hữu cơ có công thức C_{3}H_{6}O, sản phẩm thu được có thể là",
    "re": "C_{3}H_{8}O hoặc C_{2}H_{4} + CO_{2}"
  },
  {
    "con": "Khi cho 2 mol khí CO vào 1 mol O_{2} trong điều kiện đủ, sản phẩm phản ứng sẽ là",
    "re": "2 mol CO_{2}"
  },
  {
    "con": "Khi cho 1 mol H_{2} tác dụng với 1 mol O_{2}, sản phẩm thu được là",
    "re": "2 mol H_{2}O"
  },
  {
    "con": "Khi dung dịch NaOH phản ứng với dung dịch HCl, sản phẩm tạo thành là",
    "re": "NaCl và H_{2}O"
  },
  {
    "con": "Khi cho 1g bột sắt vào 10ml dung dịch HCl, khí H_{2} sinh ra là",
    "re": "0,045 lít (đktc)"
  },
  {
    "con": "Khi cho 5g bột đồng vào dung dịch AgNO_{3}, sản phẩm thu được là",
    "re": "Ag và Cu(NO_{3})_{2}"
  },
  {
    "con": "Khi hòa tan 20g đường vào 200ml nước, dung dịch thu được là",
    "re": "dung dịch đường"
  },
  {
    "con": "Khi cho 1 mol NH_{3} vào 1 mol HCl, sản phẩm tạo thành là",
    "re": "NH_{4}Cl"
  },
  {
    "con": "Đốt cháy a gam hỗn hợp 3 kim loại Mg, Zn, Cu thu được 34,5 gam hỗn hợp rắn X gồm các oxit của kim loại. Để hòa tan hết hỗn hợp X cần dùng vừa đủ dung dịch chứa 0,8 mol HCl. Giá trị của a là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 10 gam NaCl vào 100 ml nước, nồng độ mol của dung dịch NaCl là",
    "re": "0,17 mol/L"
  },
  {
    "con": "Khi cho 2 mol H2 vào 1 mol O2 trong điều kiện thích hợp, sản phẩm phản ứng sẽ là",
    "re": "2 mol H2O"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C, thì chất đó có thể là",
    "re": "chất lỏng ở nhiệt độ phòng"
  },
  {
    "con": "Khi thêm 1 mol HCl vào 1 mol NaOH, phản ứng trung hòa sẽ tạo ra",
    "re": "1 mol NaCl và 1 mol H2O"
  },
  {
    "con": "Nếu một dung dịch có pH = 3, thì dung dịch đó được coi là",
    "re": "axit mạnh"
  },
  {
    "con": "Khi đun nóng 1 mol CaCO3, sản phẩm thu được sẽ là",
    "re": "1 mol CaO và 1 mol CO2"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 12, thì nguyên tố đó là",
    "re": "Magie (Mg)"
  },
  {
    "con": "Khi cho 1 mol Fe vào 3 mol HCl, sản phẩm thu được sẽ là",
    "re": "1 mol FeCl3 và 1,5 mol H2"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là C2H6, thì hợp chất đó là",
    "re": "etan"
  },
  {
    "con": "Hòa tan hết 7,8 gam hỗn hợp Mg và Al trong dung dịch HCl dư. Sau phản ứng thấy khối lượng dung dịch tăng 7,0 gam so với ban đầu. Số mol axít đã phản ứng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi đun nóng nước đến 100 độ C, nước sẽ chuyển từ trạng thái lỏng sang trạng thái khí",
    "re": "Hơi nước sẽ hình thành"
  },
  {
    "con": "Khi trộn axit với bazơ, phản ứng trung hòa sẽ xảy ra",
    "re": "Sẽ tạo ra muối và nước"
  },
  {
    "con": "Nếu một chất có nhiệt độ nóng hơn chất khác, thì năng lượng nhiệt sẽ chuyển từ chất nóng sang chất lạnh",
    "re": "Chất lạnh sẽ nóng lên"
  },
  {
    "con": "Khi một chất rắn tan trong nước, nếu chất đó là muối, thì dung dịch sẽ dẫn điện",
    "re": "Dung dịch sẽ có khả năng dẫn điện"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn các phản ứng ban đầu, thì phản ứng đó là phản ứng tỏa nhiệt",
    "re": "Nhiệt độ môi trường xung quanh sẽ tăng lên"
  },
  {
    "con": "Khi một chất khí bị nén, nếu nhiệt độ không thay đổi, thì áp suất của chất khí sẽ tăng",
    "re": "Theo định luật Boyle"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, thì dung dịch đó là axit",
    "re": "Dung dịch sẽ có tính axit"
  },
  {
    "con": "Khi một chất bị oxi hóa, thì nó sẽ mất electron",
    "re": "Chất đó sẽ tăng số oxi hóa"
  },
  {
    "con": "Nếu một chất có khối lượng mol lớn hơn chất khác, thì chất đó sẽ có mật độ lớn hơn nếu cùng thể tích",
    "re": "Chất đó sẽ nặng hơn"
  },
  {
    "con": "Để trung hòa 50ml dung dịch H_{2}SO_{4} 1M cần V ml dung dịch NaOH 1M. Giá trị của V là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7, chất đó được coi là",
    "re": "axit"
  },
  {
    "con": "Khi một chất bị hòa tan trong nước, nó sẽ tạo ra",
    "re": "dung dịch"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra mà không có sự thay đổi về khối lượng, thì phản ứng đó là",
    "re": "phản ứng hóa học bảo toàn khối lượng"
  },
  {
    "con": "Nếu một nguyên tố có số proton là 6, thì nguyên tố đó là",
    "re": "carbon"
  },
  {
    "con": "Khi một chất rắn được nung nóng và chuyển thành khí mà không qua trạng thái lỏng, quá trình này gọi là",
    "re": "sublimation"
  },
  {
    "con": "Nếu một dung dịch có nồng độ molarity là 2M, thì trong 1 lít dung dịch có",
    "re": "2 mol chất tan"
  },
  {
    "con": "Nếu một nguyên tử mất một electron, nó trở thành",
    "re": "ion dương"
  },
  {
    "con": "Khi hai chất phản ứng với nhau và tạo ra một chất mới, quá trình này gọi là",
    "re": "phản ứng hóa học"
  },
  {
    "con": "Trong hoá học vô cơ, phản ứng hoá học nào luôn là phản ứng oxi hoá – khử ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất bị đun nóng và tạo ra khí, thì chất đó có thể là một hợp chất hữu cơ hoặc vô cơ.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, thì dung dịch đó được coi là axit.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hai chất phản ứng với nhau và tạo ra một sản phẩm mới, thì đó là một phản ứng hoá học.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số electron bằng số proton, thì nguyên tố đó là trung tính về điện.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất rắn tan trong nước và tạo ra dung dịch, thì chất đó được gọi là chất tan.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên, thì động năng của các phân tử trong chất đó cũng tăng lên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một phản ứng hoá học xảy ra và năng lượng được giải phóng, thì đó là phản ứng tỏa nhiệt.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện, thì chất đó có thể chứa các ion tự do.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất bị oxi hóa, thì nó mất electron.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Kí hiệu nào trong số các kí hiệu của các phân lớp sau là sai?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất có thể thay đổi trạng thái từ rắn sang lỏng khi nhiệt độ tăng lên?",
    "re": "Chất đó đang nóng chảy"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng sẽ bằng tổng khối lượng của các sản phẩm?",
    "re": "Đây là định luật bảo toàn khối lượng"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7 thì dung dịch đó là?",
    "re": "Dung dịch axit"
  },
  {
    "con": "Khi nhiệt độ của một khí tăng lên trong một bình kín, áp suất của khí sẽ?",
    "re": "Tăng lên"
  },
  {
    "con": "Nếu hai chất phản ứng với nhau và tạo ra khí, thì có thể xác định được?",
    "re": "Sự hình thành khí là một dấu hiệu của phản ứng hóa học"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước, nó sẽ tạo ra?",
    "re": "Dung dịch"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, thì nguyên tố đó là?",
    "re": "Cacbon"
  },
  {
    "con": "Khi một chất bị oxi hóa, nó sẽ mất đi?",
    "re": "Electron"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra mà không có sự thay đổi về năng lượng, thì phản ứng đó là?",
    "re": "Phản ứng cân bằng"
  },
  {
    "con": "Hoàn thành nội dung sau : “Số oxi hoá của một nguyên tố trong phân tử là ...(1)... của nguyên tử nguyên tố đó trong phân tử, nếu giả định rằng liên kết giữa các nguyên tử trong phân tử là ...(2)....”.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng sẽ tăng.",
    "re": "Phản ứng xảy ra nhanh hơn"
  },
  {
    "con": "Khi một chất hòa tan trong nước thì nó sẽ tạo ra dung dịch.",
    "re": "Dung dịch có thể dẫn điện nếu chất hòa tan là muối hoặc axit"
  },
  {
    "con": "Nếu một nguyên tố có số electron ở lớp ngoài cùng là 8 thì nó sẽ ổn định và ít phản ứng với các nguyên tố khác.",
    "re": "Nguyên tố đó là khí hiếm"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và có sự thay đổi màu sắc thì có thể có sự hình thành chất mới.",
    "re": "Phản ứng hóa học đã xảy ra"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C thì nó sẽ bay hơi ở nhiệt độ phòng.",
    "re": "Chất đó có thể tồn tại dưới dạng khí"
  },
  {
    "con": "Khi một chất rắn tan trong nước thì nó có thể tạo ra dung dịch đồng nhất.",
    "re": "Dung dịch đó có thể có tính chất khác với chất rắn ban đầu"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt thì nó sẽ giải phóng năng lượng.",
    "re": "Nhiệt độ môi trường xung quanh sẽ tăng lên"
  },
  {
    "con": "Khi một nguyên tố có số oxi hóa dương thì nó có khả năng mất electron.",
    "re": "Nguyên tố đó có thể tham gia vào phản ứng oxi hóa"
  },
  {
    "con": "Nếu một chất có pH dưới 7 thì nó được coi là axit.",
    "re": "Chất đó có khả năng gây ăn mòn"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được đun sôi ở 100 độ C ở áp suất 1 atm",
    "re": "Nước chuyển thành hơi nước"
  },
  {
    "con": "Một hợp chất được tạo thành từ hai nguyên tố khác nhau",
    "re": "Hợp chất đó có tính chất khác biệt so với các nguyên tố cấu thành"
  },
  {
    "con": "Các nguyên tử có cùng số proton",
    "re": "Chúng thuộc cùng một nguyên tố hóa học"
  },
  {
    "con": "Một phản ứng hóa học xảy ra",
    "re": "Các liên kết hóa học trong các chất phản ứng bị phá vỡ và tạo ra các chất sản phẩm mới"
  },
  {
    "con": "Nồng độ axit trong dung dịch tăng",
    "re": "pH của dung dịch giảm"
  },
  {
    "con": "Một chất rắn được hòa tan trong nước",
    "re": "Dung dịch sẽ trở nên trong suốt nếu chất đó tan hoàn toàn"
  },
  {
    "con": "Nhiệt độ của một chất tăng lên",
    "re": "Động năng của các phân tử trong chất đó cũng tăng lên"
  },
  {
    "con": "Một nguyên tố có nhiều đồng vị",
    "re": "Chúng có cùng số proton nhưng khác số neutron"
  },
  {
    "con": "Một phản ứng oxi hóa xảy ra",
    "re": "Một chất mất electron và tăng số oxi hóa"
  },
  {
    "con": "Để đánh giá loại liên kết trong phân tử hợp chất, người ta có thể dựa vào hiệu độ âm điện. Khi hiệu độ âm điện của hai nguyên tử tham gia liên kết ≥ 1,7",
    "re": "đó là liên kết ion"
  },
  {
    "con": "Khi một chất bị nung nóng, nếu nhiệt độ tăng lên thì",
    "re": "năng lượng của các phân tử trong chất đó cũng tăng lên"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C ở áp suất 1 atm",
    "re": "thì chất đó có thể là một chất lỏng dễ bay hơi"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, nếu có sự thay đổi màu sắc hoặc tỏa nhiệt",
    "re": "thì đó có thể là dấu hiệu của một phản ứng hóa học"
  },
  {
    "con": "Nếu một dung dịch có pH < 7",
    "re": "thì dung dịch đó được coi là axit"
  },
  {
    "con": "Khi một nguyên tử mất electron, nếu nó trở thành ion dương",
    "re": "thì nguyên tử đó đã trải qua quá trình oxy hóa"
  },
  {
    "con": "Nếu hai chất phản ứng với nhau và tạo ra khí",
    "re": "thì có thể có sự hình thành sản phẩm khí trong phản ứng"
  },
  {
    "con": "Khi một chất rắn tan trong nước, nếu nó tạo thành dung dịch trong suốt",
    "re": "thì chất đó được gọi là chất tan"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử cao hơn 92",
    "re": "thì nguyên tố đó được coi là nguyên tố phóng xạ"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong môi trường kín, nếu khối lượng của các chất phản ứng bằng khối lượng của các sản phẩm",
    "re": "thì nguyên tắc bảo toàn khối lượng được tuân thủ"
  },
  {
    "con": "Nguyên tố nào sau đây trong hợp chất chỉ có số oxi hóa duy nhất là -1?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất nào có điểm sôi thấp hơn 100 độ C ở áp suất khí quyển?",
    "re": "Chất đó là nước"
  },
  {
    "con": "Nếu một hợp chất chứa nguyên tố carbon và hydro, thì hợp chất đó có thể là gì?",
    "re": "Hợp chất hữu cơ"
  },
  {
    "con": "Khi axit phản ứng với bazơ, thì sản phẩm tạo ra là gì?",
    "re": "Muối và nước"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, thì nguyên tố đó là gì?",
    "re": "Carbon"
  },
  {
    "con": "Khi nhiệt độ tăng, thì áp suất của khí trong một bình kín sẽ như thế nào?",
    "re": "Áp suất sẽ tăng"
  },
  {
    "con": "Nếu một chất có mật độ lớn hơn 1 g/cm³, thì chất đó sẽ nổi hay chìm trong nước?",
    "re": "Chất đó sẽ chìm trong nước"
  },
  {
    "con": "Khi một chất rắn tan trong nước, thì trạng thái của chất đó sẽ thay đổi như thế nào?",
    "re": "Chất đó sẽ chuyển sang trạng thái lỏng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và tạo ra khí, thì điều gì có thể xảy ra?",
    "re": "Có thể có bọt khí hoặc mùi"
  },
  {
    "con": "Nếu một nguyên tố có 8 electron ở lớp vỏ ngoài, thì nguyên tố đó có tính chất gì?",
    "re": "Nguyên tố đó sẽ ổn định và ít phản ứng"
  },
  {
    "con": "Các đồng vị của cùng một nguyên tố được phân biệt bởi yếu tố nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất bị đun nóng, nó thường sẽ làm gì?",
    "re": "Nó sẽ mở rộng và có thể chuyển sang trạng thái khí"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra, thì các nguyên tử sẽ làm gì?",
    "re": "Chúng sẽ tái sắp xếp để tạo ra các sản phẩm mới"
  },
  {
    "con": "Khi pH của một dung dịch giảm xuống dưới 7, thì dung dịch đó được coi là gì?",
    "re": "Dung dịch axit"
  },
  {
    "con": "Nếu một nguyên tố có số proton là 6, thì nguyên tố đó là gì?",
    "re": "Carbon"
  },
  {
    "con": "Khi hai chất phản ứng với nhau và tạo ra khí, thì điều gì có thể xảy ra?",
    "re": "Có thể có bọt khí hoặc sự sủi bọt"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng, thì chất đó sẽ ở trạng thái nào?",
    "re": "Chất khí"
  },
  {
    "con": "Khi một dung dịch có nồng độ cao hơn nồng độ bão hòa, thì điều gì xảy ra?",
    "re": "Chất rắn sẽ lắng đọng xuống đáy"
  },
  {
    "con": "Nếu một nguyên tố có số electron bằng số proton, thì nguyên tố đó có điện tích gì?",
    "re": "Điện tích trung hòa"
  },
  {
    "con": "Khi một chất bị oxi hóa, thì điều gì xảy ra với electron của nó?",
    "re": "Nó sẽ mất electron"
  },
  {
    "con": "Nguyên tố X thuộc chu kì 4. Nguyên tử của nguyên tố X có cấu tạo là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất A là một hợp chất ion. Chất A sẽ có điểm nóng chảy cao",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nguyên tố Y có số electron là 8. Nguyên tố Y là một khí hiếm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất B là một axit. Chất B sẽ có pH nhỏ hơn 7",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nguyên tố Z có số proton là 6. Nguyên tố Z là carbon",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra, thì năng lượng có thể được giải phóng hoặc hấp thụ",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất C là một kim loại. Chất C sẽ dẫn điện tốt",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ cao, thì nó sẽ có khả năng hòa tan nhiều chất hơn",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu nhiệt độ tăng lên, thì tốc độ phản ứng hóa học thường sẽ tăng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử phức tạp, thì nó có thể có nhiều tính chất hóa học khác nhau",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chỉ ra nội dung sai khi nói về ion?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất có thể thay đổi trạng thái từ rắn sang lỏng khi nhiệt độ tăng?",
    "re": "Chất đó đang nóng chảy"
  },
  {
    "con": "Khi một chất hòa tan trong nước, nó sẽ tạo ra dung dịch?",
    "re": "Dung dịch đó có thể dẫn điện nếu chất hòa tan là ion"
  },
  {
    "con": "Các nguyên tử trong một phân tử nước được liên kết bằng liên kết hóa học?",
    "re": "Liên kết đó là liên kết cộng hóa trị"
  },
  {
    "con": "Khi nhiệt độ của một chất khí tăng, thể tích của nó cũng tăng?",
    "re": "Điều này đúng theo định luật Charles"
  },
  {
    "con": "Một phản ứng hóa học xảy ra khi các chất phản ứng tạo ra sản phẩm mới?",
    "re": "Sản phẩm có thể có tính chất khác với các chất phản ứng"
  },
  {
    "con": "Khi một chất bị oxi hóa, nó sẽ mất electron?",
    "re": "Quá trình này gọi là oxi hóa"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số nguyên tử tăng dần?",
    "re": "Điều này giúp xác định tính chất hóa học của chúng"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước, nó sẽ không còn tồn tại dưới dạng rắn?",
    "re": "Điều này đúng nếu chất đó hoàn toàn hòa tan"
  },
  {
    "con": "Một phản ứng hóa học có thể xảy ra mà không cần năng lượng?",
    "re": "Điều này có thể xảy ra trong các phản ứng tự phát"
  },
  {
    "con": "Tính chất hóa học đặc trưng của các nguyên tố nhóm halogen là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là một hợp chất được hình thành từ hai nguyên tố là hydro và oxy",
    "re": "Nước có công thức hóa học là H2O"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng lên",
    "re": "Phản ứng xảy ra nhanh hơn"
  },
  {
    "con": "Các nguyên tố kim loại thường có xu hướng cho đi electron",
    "re": "Chúng trở thành ion dương"
  },
  {
    "con": "Khi một axit phản ứng với một bazơ, sản phẩm tạo ra thường là muối và nước",
    "re": "Đây là phản ứng trung hòa"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có tính chất hóa học tương tự",
    "re": "Chúng có cùng số electron ở lớp ngoài cùng"
  },
  {
    "con": "Khi một chất bị nung nóng, nó có thể chuyển từ trạng thái rắn sang trạng thái lỏng",
    "re": "Quá trình này gọi là nóng chảy"
  },
  {
    "con": "Khi một chất hòa tan trong nước, nó có thể tạo ra dung dịch",
    "re": "Dung dịch này có thể dẫn điện nếu chất hòa tan là muối hoặc axit"
  },
  {
    "con": "Sự bay hơi là quá trình chuyển đổi từ trạng thái lỏng sang trạng thái khí",
    "re": "Quá trình này xảy ra ở bất kỳ nhiệt độ nào"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm",
    "re": "Đây là định luật bảo toàn khối lượng"
  },
  {
    "con": "Ở điều kiện thường, Clo là chất khí, nặng hơn không khí, có màu",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được tạo thành từ hai nguyên tố là hydro và oxy",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi đun nóng, muối ăn (NaCl) không bị phân hủy",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi trộn axit với bazơ, phản ứng trung hòa xảy ra",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Kim loại thường dẫn điện tốt hơn phi kim",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nước đóng băng, thể tích của nó tăng lên",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có tính chất hóa học tương tự",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi đốt cháy hydro trong oxy, nước được tạo ra",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Sự bay hơi của chất lỏng xảy ra ở mọi nhiệt độ",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Phản ứng hóa học thường đi kèm với sự thay đổi năng lượng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Liên kết ion là liên kết được hình thành bởi",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có cùng số electron ở lớp ngoài cùng",
    "re": "Chúng có tính chất hóa học tương tự nhau"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thường dẫn đến",
    "re": "Tốc độ phản ứng tăng lên"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion, chất đó được gọi là",
    "re": "Chất điện ly"
  },
  {
    "con": "Phản ứng hóa học xảy ra khi các liên kết hóa học giữa các nguyên tử bị phá vỡ và",
    "re": "Các liên kết mới được hình thành"
  },
  {
    "con": "Khối lượng của một chất không thay đổi trong một phản ứng hóa học, điều này được gọi là",
    "re": "Định luật bảo toàn khối lượng"
  },
  {
    "con": "Khi pH của dung dịch giảm, dung dịch đó trở nên",
    "re": "Axit hơn"
  },
  {
    "con": "Khi một nguyên tố mất electron, nó trở thành",
    "re": "Ion dương"
  },
  {
    "con": "Các hợp chất hữu cơ thường chứa nguyên tố carbon và",
    "re": "Có thể chứa hydrogen, oxygen, nitrogen và các nguyên tố khác"
  },
  {
    "con": "Khi nhiệt độ giảm, độ hòa tan của nhiều chất rắn trong nước thường",
    "re": "Giảm"
  },
  {
    "con": "Phát biểu nào sau đây về nguyên tử là đúng nhất?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất được tạo thành từ các nguyên tử khác nhau thì",
    "re": "đó là hợp chất"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên thì",
    "re": "độ năng lượng của các phân tử trong chất đó cũng tăng lên"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra thì",
    "re": "các liên kết hóa học giữa các nguyên tử bị phá vỡ và hình thành liên kết mới"
  },
  {
    "con": "Nếu một chất có pH nhỏ hơn 7 thì",
    "re": "chất đó là axit"
  },
  {
    "con": "Nếu một chất có pH lớn hơn 7 thì",
    "re": "chất đó là bazơ"
  },
  {
    "con": "Khi hai chất phản ứng với nhau và tạo ra khí thì",
    "re": "phản ứng đó có thể tạo ra bọt khí hoặc mùi đặc trưng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ cao thì",
    "re": "sẽ có nhiều phân tử hòa tan trong dung môi"
  },
  {
    "con": "Khi một chất rắn tan trong nước thì",
    "re": "các phân tử của chất rắn sẽ phân tán trong dung dịch"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch thì",
    "re": "phản ứng có thể diễn ra theo cả hai chiều"
  },
  {
    "con": "Trong các phản ứng hoá học sau, phản ứng nào không phải là phản ứng oxi hoá – khử?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất được hòa tan trong nước, nếu chất đó là muối thì",
    "re": "nó sẽ tạo ra dung dịch điện ly"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao thì",
    "re": "tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Khi một chất rắn được nung nóng và chuyển thành khí mà không qua trạng thái lỏng thì",
    "re": "quá trình này gọi là thăng hoa"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7 thì",
    "re": "dung dịch đó được coi là axit"
  },
  {
    "con": "Nếu hai chất phản ứng với nhau và tạo ra khí thì",
    "re": "phản ứng đó có thể là phản ứng axit-bazơ hoặc phản ứng trao đổi"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6 thì",
    "re": "nguyên tố đó là cacbon"
  },
  {
    "con": "Khi một chất bị oxi hóa thì",
    "re": "nó sẽ mất electron"
  },
  {
    "con": "Nếu một dung dịch có nồng độ cao hơn dung dịch khác thì",
    "re": "dung dịch đó sẽ có áp suất thẩm thấu cao hơn"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn các phản ứng ban đầu thì",
    "re": "phản ứng đó là phản ứng tỏa nhiệt"
  },
  {
    "con": "Cho các phân tử sau : C_{2}H_{4}, C_{2}H_{2}, Cl_{2}, N_{2}, CO_{2}, CH_{4}, NH_{3}. Số phân tử có liên kết đôi và số phân tử có liên kết ba lần lượt là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất được đun nóng và chuyển từ trạng thái rắn sang trạng thái lỏng",
    "re": "chất đó đang trải qua quá trình nóng chảy"
  },
  {
    "con": "Khi một dung dịch axit được trộn với một dung dịch bazơ",
    "re": "phản ứng trung hòa xảy ra và tạo ra muối và nước"
  },
  {
    "con": "Khi một nguyên tử mất một hoặc nhiều electron",
    "re": "nguyên tử đó trở thành ion dương"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên",
    "re": "động năng của các phân tử trong chất đó cũng tăng lên"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và năng lượng được giải phóng",
    "re": "phản ứng đó được gọi là phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi một chất có khả năng hòa tan trong nước",
    "re": "chất đó được gọi là chất tan"
  },
  {
    "con": "Khi một nguyên tố có số proton khác nhau nhưng số neutron giống nhau",
    "re": "các nguyên tử đó được gọi là đồng vị của nguyên tố đó"
  },
  {
    "con": "Khi một chất khí được nén lại và thể tích của nó giảm",
    "re": "áp suất của chất khí đó sẽ tăng lên theo định luật Boyle"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và năng lượng được hấp thụ",
    "re": "phản ứng đó được gọi là phản ứng thu nhiệt"
  },
  {
    "con": "Hoàn thành nội dung sau : “Trong hợp chất cộng hoá trị, hoá trị của một nguyên tố được xác định bằng ............ của nguyên tử nguyên tố đó trong phân tử”.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hoá học thì tốc độ phản ứng sẽ ............",
    "re": "tăng lên"
  },
  {
    "con": "Khi một chất tan trong nước thì nó sẽ tạo ra một dung dịch ............",
    "re": "đồng nhất"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6 thì nó có ............ electron trong lớp vỏ nguyên tử.",
    "re": "6"
  },
  {
    "con": "Khi hai nguyên tố kết hợp với nhau để tạo thành một hợp chất thì chúng sẽ ............",
    "re": "tạo ra các tính chất mới"
  },
  {
    "con": "Nếu một phản ứng hoá học xảy ra trong điều kiện yếm khí thì sản phẩm sẽ ............",
    "re": "khác với phản ứng xảy ra có oxy"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7 thì dung dịch đó sẽ ............",
    "re": "có tính axit"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp thì nó sẽ ............ dễ bay hơi hơn.",
    "re": "có khả năng"
  },
  {
    "con": "Khi một nguyên tử mất electron thì nó sẽ trở thành một ............",
    "re": "ion dương"
  },
  {
    "con": "Nếu một phản ứng hoá học là phản ứng tỏa nhiệt thì nó sẽ ............ năng lượng ra môi trường.",
    "re": "giải phóng"
  },
  {
    "con": "Trong phòng thí nghiệm, hiđrohalogenua (HX) được điều chế từ phản ứng sau:\nNaX_{rắn} + H_{2}SO_{4} \\xrightarrow[đặc, nóng] NaHSO_{4} (hoặc Na_{2}SO_{4}) + HX_{khí}\nHãy cho biết phương pháp trên có thể dùng để điều chế được hiđrohalogenua nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất rắn được hòa tan trong nước và tạo ra dung dịch, thì dung dịch đó có thể dẫn điện.",
    "re": "Dung dịch đó là dung dịch điện ly."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn các phản ứng, thì phản ứng đó là phản ứng tỏa nhiệt.",
    "re": "Năng lượng được giải phóng trong quá trình phản ứng."
  },
  {
    "con": "Khi nhiệt độ của một chất khí tăng lên trong một bình kín, thì áp suất của chất khí đó cũng sẽ tăng.",
    "re": "Đây là quy luật Gay-Lussac."
  },
  {
    "con": "Nếu một chất có độ pH dưới 7, thì chất đó được coi là axit.",
    "re": "Chất đó có tính axit."
  },
  {
    "con": "Khi một kim loại phản ứng với axit, thì sản phẩm tạo ra sẽ là muối và khí hidro.",
    "re": "Đây là phản ứng giữa kim loại và axit."
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao, thì khả năng dẫn điện của dung dịch đó cũng cao.",
    "re": "Dung dịch đó chứa nhiều ion."
  },
  {
    "con": "Khi một chất rắn được nung nóng và chuyển thành chất khí mà không qua trạng thái lỏng, thì quá trình này gọi là thăng hoa.",
    "re": "Chất đó có thể là nhựa đường hoặc băng khô."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí, thì sản phẩm có thể khác với phản ứng xảy ra trong điều kiện có oxy.",
    "re": "Sản phẩm có thể là rượu hoặc axit lactic."
  },
  {
    "con": "Khi một chất hóa học bị phân hủy bởi nhiệt, thì sản phẩm có thể là các chất đơn giản hơn.",
    "re": "Đây là quá trình phân hủy nhiệt."
  },
  {
    "con": "Nguyên tử X có số hạt mang điện là 12. Trong hạt nhân nguyên tử X có điện tích là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất A có điểm sôi thấp hơn chất B. Khi đun nóng chất A và B cùng lúc, chất nào sẽ bay hơi trước",
    "re": "Chất A sẽ bay hơi trước"
  },
  {
    "con": "Một dung dịch có pH = 7. Dung dịch này được coi là",
    "re": "trung tính"
  },
  {
    "con": "Nguyên tử có số proton bằng số electron. Nguyên tử này sẽ có",
    "re": "không có điện tích"
  },
  {
    "con": "Khi một chất bị đốt cháy trong không khí, sản phẩm tạo ra thường là",
    "re": "khí CO2 và nước"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và năng lượng được giải phóng, phản ứng này được gọi là",
    "re": "phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước, chất đó được gọi là",
    "re": "chất tan"
  },
  {
    "con": "Khi một nguyên tố có khả năng mất electron, nguyên tố đó được gọi là",
    "re": "kim loại"
  },
  {
    "con": "Nếu một dung dịch có nồng độ ion H+ cao, dung dịch đó sẽ có",
    "re": "pH thấp"
  },
  {
    "con": "Các ion _{11}Na^+, _{12}Mg^2+, _{8}O_{2-}, _{9}F^- đều có cấu hình electron là 1s^2 2s^2 2p^6. Thứ tự giảm dần bán kính các ion trên là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học là H2O. Khi nước bị phân hủy, sản phẩm tạo ra là",
    "re": "H2 và O2"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có cùng số electron hóa trị. Do đó, tính chất hóa học của chúng sẽ",
    "re": "tương tự nhau"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng sẽ bằng tổng khối lượng của các sản phẩm. Điều này thể hiện định luật",
    "re": "bảo toàn khối lượng"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường",
    "re": "tăng lên"
  },
  {
    "con": "Khi một chất tan trong nước, nó sẽ tạo ra dung dịch. Nếu chất đó là muối, dung dịch sẽ",
    "re": "dẫn điện"
  },
  {
    "con": "Khi một nguyên tố mất electron, nó sẽ trở thành ion dương. Do đó, ion dương sẽ có",
    "re": "khối lượng nhỏ hơn nguyên tử ban đầu"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra giữa axit và bazơ, sản phẩm tạo ra sẽ là",
    "re": "muối và nước"
  },
  {
    "con": "Khi một chất rắn được nung nóng, nó có thể chuyển sang trạng thái lỏng. Quá trình này gọi là",
    "re": "chảy"
  },
  {
    "con": "Khi một chất khí bị nén, thể tích của nó sẽ",
    "re": "giảm"
  },
  {
    "con": "Chỉ ra nội dung sai?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "Phản ứng có thể là tỏa nhiệt"
  },
  {
    "con": "Một chất có thể hòa tan trong nước",
    "re": "Chất đó có thể là chất tan"
  },
  {
    "con": "Số nguyên tử trong một phân tử nước (H2O)",
    "re": "Có 3 nguyên tử (2 H và 1 O)"
  },
  {
    "con": "Một phản ứng hóa học xảy ra",
    "re": "Có thể tạo ra sản phẩm mới"
  },
  {
    "con": "Chất rắn, lỏng và khí là ba trạng thái của vật chất",
    "re": "Chúng có thể chuyển đổi lẫn nhau"
  },
  {
    "con": "Một nguyên tố có thể tồn tại dưới dạng đồng vị",
    "re": "Chúng có số neutron khác nhau"
  },
  {
    "con": "Khi axit và bazơ phản ứng với nhau",
    "re": "Chúng tạo ra muối và nước"
  },
  {
    "con": "Khối lượng của một chất không thay đổi khi chuyển trạng thái",
    "re": "Khối lượng được bảo toàn trong phản ứng hóa học"
  },
  {
    "con": "Nước là dung môi phổ biến nhất",
    "re": "Nó có khả năng hòa tan nhiều chất"
  },
  {
    "con": "Trong phản ứng: 2NO_{2} + 2NaOH → NaNO_{3} + NaNO_{2} + H_{2}O. Nhận xét đúng về NO_{2} là A. vừa là chất oxi hoá, vừa là chất khử.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất được đun nóng và tạo ra khí, thì chất đó có thể là một hợp chất hữu cơ hoặc vô cơ.",
    "re": "Chất đó có thể là một hợp chất hữu cơ hoặc vô cơ."
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là axit.",
    "re": "Dung dịch đó được coi là axit."
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng, thì chất đó thường tồn tại ở trạng thái khí ở nhiệt độ phòng.",
    "re": "Chất đó thường tồn tại ở trạng thái khí ở nhiệt độ phòng."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và tạo ra sản phẩm mới, thì năng lượng có thể được giải phóng hoặc hấp thụ.",
    "re": "Năng lượng có thể được giải phóng hoặc hấp thụ."
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử lớn hơn 92, thì nguyên tố đó được coi là nguyên tố phóng xạ.",
    "re": "Nguyên tố đó được coi là nguyên tố phóng xạ."
  },
  {
    "con": "Nếu hai chất phản ứng với nhau và tạo ra khí, thì có thể có bọt khí xuất hiện trong dung dịch.",
    "re": "Có thể có bọt khí xuất hiện trong dung dịch."
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước, thì chất đó có thể là một muối hoặc đường.",
    "re": "Chất đó có thể là một muối hoặc đường."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì nhiệt độ của môi trường xung quanh có thể tăng lên.",
    "re": "Nhiệt độ của môi trường xung quanh có thể tăng lên."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử phức tạp, thì chất đó có thể có nhiều tính chất hóa học khác nhau.",
    "re": "Chất đó có thể có nhiều tính chất hóa học khác nhau."
  },
  {
    "con": "Nguyên tử của nguyên tố M có cấu hình electron lớp ngoài cùng là 3s^2 3p^4. Vị trí của nguyên tố M trong bảng tuần hoàn các NTHH là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước (H2O) có cấu trúc phân tử gồm hai nguyên tử hydro và một nguyên tử oxy. Tính chất của nước là",
    "re": "Chất lỏng ở nhiệt độ phòng và có khả năng hòa tan nhiều chất"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng bằng",
    "re": "tổng khối lượng của các sản phẩm tạo thành"
  },
  {
    "con": "Nếu một nguyên tố có số proton là 6, thì nguyên tố đó là",
    "re": "Carbon"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên, động năng của các phân tử trong chất đó",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là",
    "re": "axit"
  },
  {
    "con": "Khi một chất rắn tan trong nước, quá trình này gọi là",
    "re": "hòa tan"
  },
  {
    "con": "Nếu một nguyên tố có số electron bằng số proton, thì nguyên tố đó là",
    "re": "một nguyên tố trung hòa về điện"
  },
  {
    "con": "Khi một chất bị oxi hóa, nó sẽ",
    "re": "mất electron"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng",
    "re": "thường tăng lên"
  },
  {
    "con": "Cho các phát biểu sau:\n(1) Cấu hình electron lớp ngoài cùng của các nguyên tử nguyên tố nhóm halogen là ns^2 np^5\n(2) Liên kết hóa học trong phân tử HCl là liên kết ion.\n(3) Khi điều chế khí clo trong phòng thí nghiệm, để không cho khí clo thoát ra ngoài, có thể thực hiện\nbằng cách đặt bông tẩm xút trên miệng bình thu khí.\n(4) Ứng dụng của clorua vôi là tẩy trắng vải, sợi, giấy, tẩy uế cống rãnh, chuồng trại....\n(5) Tính chất hóa học của axit HCl: có tính axit mạnh và tính khử.\n(6) Có thể dùng lọ thủy tinh đựng dung dịch axit HF.\nSố phát biểu đúng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các nguyên tử của cùng một nguyên tố có số proton bằng nhau",
    "re": "Chúng là đồng vị của nhau"
  },
  {
    "con": "Khi một chất bị nung nóng và chuyển từ trạng thái rắn sang trạng thái lỏng",
    "re": "Chất đó đang trải qua quá trình nóng chảy"
  },
  {
    "con": "Khi pH của dung dịch nhỏ hơn 7",
    "re": "Dung dịch đó có tính axit"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và tạo ra khí",
    "re": "Có thể có bọt khí xuất hiện trong dung dịch"
  },
  {
    "con": "Khi một nguyên tố có số electron lớp ngoài cùng là 1",
    "re": "Nguyên tố đó thuộc nhóm kim loại kiềm"
  },
  {
    "con": "Khi trộn axit với bazơ",
    "re": "Sẽ xảy ra phản ứng trung hòa và tạo ra muối cùng với nước"
  },
  {
    "con": "Khi một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng",
    "re": "Chất đó có thể tồn tại dưới dạng khí ở nhiệt độ phòng"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và năng lượng được giải phóng",
    "re": "Phản ứng đó được gọi là phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi một chất có tính chất dẫn điện tốt",
    "re": "Chất đó thường là một chất điện ly trong dung dịch"
  },
  {
    "con": "Trong phản ứng oxi hóa – khử :",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất bị đun nóng đến nhiệt độ cao :",
    "re": "Chất đó có thể biến đổi thành các chất khác"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7 :",
    "re": "Dung dịch đó trở nên axit"
  },
  {
    "con": "Khi hai chất phản ứng với nhau và tạo ra khí :",
    "re": "Có thể có bọt khí xuất hiện trong dung dịch"
  },
  {
    "con": "Khi một chất hòa tan trong nước :",
    "re": "Chất đó tạo thành dung dịch"
  },
  {
    "con": "Khi nhiệt độ tăng lên trong một phản ứng hóa học :",
    "re": "Tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Khi một chất có tính axit mạnh :",
    "re": "Chất đó có khả năng dẫn điện tốt hơn trong dung dịch"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong môi trường kín :",
    "re": "Khối lượng tổng thể của hệ thống không thay đổi"
  },
  {
    "con": "Khi một chất bị oxi hóa :",
    "re": "Chất đó mất electron"
  },
  {
    "con": "Khi một chất có độ hòa tan cao trong nước :",
    "re": "Chất đó thường là muối hoặc đường"
  },
  {
    "con": "X và Y là hai nguyên tố thuộc cùng một chu kỳ, hai nhóm A liên tiếp. Số proton của nguyên tử Y nhiều hơn số proton của nguyên tử X. Tổng số hạt proton trong nguyên tử X và Y là 33. Nhận xét nào sau đây về X, Y là đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C, thì chất đó có thể tồn tại ở trạng thái lỏng ở nhiệt độ phòng.",
    "re": "Chất đó có thể tồn tại ở trạng thái lỏng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và tạo ra khí, thì có thể có sự thay đổi về khối lượng trong hệ thống.",
    "re": "Có thể có sự thay đổi về khối lượng"
  },
  {
    "con": "Nếu hai nguyên tố kết hợp với nhau để tạo thành một hợp chất, thì tổng số nguyên tử trong hợp chất đó sẽ bằng tổng số nguyên tử của hai nguyên tố ban đầu.",
    "re": "Tổng số nguyên tử trong hợp chất sẽ bằng tổng số nguyên tử của hai nguyên tố"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, thì dung dịch đó được coi là axit.",
    "re": "Dung dịch đó được coi là axit"
  },
  {
    "con": "Nếu một nguyên tố có số electron bằng số proton, thì nguyên tố đó là trung hòa về điện.",
    "re": "Nguyên tố đó là trung hòa về điện"
  },
  {
    "con": "Nếu một chất có tính chất dẫn điện tốt, thì chất đó thường chứa các ion tự do.",
    "re": "Chất đó thường chứa các ion tự do"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì năng lượng được giải phóng trong quá trình phản ứng.",
    "re": "Năng lượng được giải phóng trong quá trình phản ứng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là C6H12O6, thì hợp chất đó là glucose.",
    "re": "Hợp chất đó là glucose"
  },
  {
    "con": "Nếu một nguyên tố có số lượng electron ở lớp ngoài cùng là 8, thì nguyên tố đó có xu hướng ổn định và không dễ phản ứng.",
    "re": "Nguyên tố đó có xu hướng ổn định"
  },
  {
    "con": "Cho hợp chất XY có tổng số hạt là 42, trong đó số hạt mang điện nhiều hơn số hạt không mang điện là 14. Số khối của hợp chất XY là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử là 6, thì nguyên tố đó là carbon",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O, thì hợp chất đó là nước",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên, thì động năng của các phân tử trong chất đó cũng tăng lên",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và tạo ra khí, thì có thể có sự thay đổi về khối lượng trong hệ thống",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, thì dung dịch đó là axit",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số electron bằng số proton, thì nguyên tố đó là trung hòa về điện",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất ion được tạo ra từ một kim loại và một phi kim, thì hợp chất đó thường có tính chất dẫn điện trong dung dịch",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì năng lượng được giải phóng ra môi trường",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước, thì chất đó sẽ bay hơi nhanh hơn nước ở cùng nhiệt độ",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cho 2,4 gam kim loại Mg vào dung dịch HCl dư giải phóng V lít khí H_{2} (ở đktc). Giá trị của V là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 58,5 gam NaCl vào 1 lít nước, nồng độ mol của dung dịch NaCl là",
    "re": "1 mol/lít"
  },
  {
    "con": "Khi đun nóng 100 ml dung dịch HCl 1M, nồng độ HCl sẽ",
    "re": "không thay đổi nếu không bay hơi"
  },
  {
    "con": "Khi trộn 50 ml dung dịch NaOH 0,5M với 50 ml dung dịch HCl 0,5M, sản phẩm tạo thành là",
    "re": "nước và muối NaCl"
  },
  {
    "con": "Khi cho 10 gam bột Fe vào dung dịch CuSO4, phản ứng xảy ra và tạo ra",
    "re": "bột Cu và dung dịch FeSO4"
  },
  {
    "con": "Khi đun nóng 1 lít nước đến 100 độ C, nước sẽ",
    "re": "biến thành hơi nước"
  },
  {
    "con": "Khi cho 5 gam bột Ca vào nước, sản phẩm tạo thành là",
    "re": "khí H2 và dung dịch Ca(OH)2"
  },
  {
    "con": "Khi hòa tan 10 gam đường vào 100 ml nước, dung dịch sẽ",
    "re": "trong suốt và không có màu"
  },
  {
    "con": "Khi cho 2 gam bột Mg vào dung dịch H2SO4, sản phẩm tạo thành là",
    "re": "khí H2 và dung dịch MgSO4"
  },
  {
    "con": "Khi cho 1 lít dung dịch H2SO4 1M vào 1 lít dung dịch NaOH 1M, sản phẩm cuối cùng sẽ là",
    "re": "nước và muối Na2SO4"
  },
  {
    "con": "Cho 0,2 mol Zn tác dụng hoàn toàn với HNO_{3} tạo ra Zn(NO_{3})_{2}, H_{2}O và V lít khí NO_{2} (ở đktc). Giá trị của V là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất rắn được hòa tan trong nước, nếu chất đó là muối thì",
    "re": "nó sẽ tạo ra dung dịch điện ly"
  },
  {
    "con": "Nếu nhiệt độ của một chất khí tăng lên trong khi thể tích giữ nguyên thì",
    "re": "áp suất của chất khí sẽ tăng"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, nếu năng lượng được giải phóng thì",
    "re": "phản ứng đó được gọi là phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một dung dịch có pH < 7 thì",
    "re": "dung dịch đó được coi là axit"
  },
  {
    "con": "Khi cho một lượng axit vào dung dịch kiềm, nếu phản ứng xảy ra hoàn toàn thì",
    "re": "sẽ tạo ra muối và nước"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6 thì",
    "re": "nguyên tố đó là carbon"
  },
  {
    "con": "Khi một chất rắn bị nung nóng và chuyển thành chất khí mà không qua trạng thái lỏng thì",
    "re": "quá trình đó gọi là thăng hoa"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí thì",
    "re": "sản phẩm của phản ứng có thể khác so với điều kiện có oxy"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao hơn dung dịch khác thì",
    "re": "dung dịch đó sẽ có khả năng hòa tan nhiều chất hơn"
  },
  {
    "con": "Có 4 lọ mất nhãn X,Y,Z,T mỗi lọ chứa một trong các dung dịch sau: KI, HI, AgNO_{3}, Na_{2}CO_{3} Biết: - X tác dụng với chất còn lại thì thu được kết tủa;\n- Y tạo được kết tủa với 3 chất còn lại;\n- Z tạo được kết tủa trắng và một chất khí với các chất còn lại; - T tạo được một chất khí và kết tủa vàng với chất còn lại\nVậy X,Y, Z, T lần lượt là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng sẽ tăng lên",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Nếu một chất có độ pH nhỏ hơn 7 thì chất đó là axit",
    "re": "Chất đó có tính axit"
  },
  {
    "con": "Nếu một chất có độ pH lớn hơn 7 thì chất đó là bazơ",
    "re": "Chất đó có tính bazơ"
  },
  {
    "con": "Khi một kim loại tác dụng với axit thì sẽ sinh ra khí hidro",
    "re": "Khí hidro được sinh ra"
  },
  {
    "con": "Nếu hai chất phản ứng với nhau tạo ra kết tủa thì phản ứng đó là phản ứng trao đổi",
    "re": "Phản ứng là phản ứng trao đổi"
  },
  {
    "con": "Khi hòa tan muối trong nước thì sẽ tạo ra dung dịch điện ly",
    "re": "Dung dịch điện ly được tạo ra"
  },
  {
    "con": "Nếu một chất có công thức hóa học là NaCl thì chất đó là muối ăn",
    "re": "Chất đó là muối ăn"
  },
  {
    "con": "Khi đun nóng nước thì nước sẽ chuyển từ thể lỏng sang thể hơi",
    "re": "Nước chuyển sang thể hơi"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí thì sản phẩm có thể khác so với điều kiện có oxy",
    "re": "Sản phẩm phản ứng có thể khác"
  },
  {
    "con": "Cho 16,15 gam dung dịch hỗn hợp hai muối NaX, NaY ( X, Y là hai halogen liên tiếp) tác dụng với dung dịch AgNO_{3} dư thu được 33,15 gam kết tủa. Hai nguyên tố X, Y là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một hợp chất ion được hòa tan trong nước, các ion sẽ tách ra và phân tán đều trong dung dịch",
    "re": "Dung dịch sẽ dẫn điện"
  },
  {
    "con": "Nếu nhiệt độ của một chất lỏng tăng lên, thì động năng của các phân tử trong chất lỏng đó",
    "re": "sẽ tăng lên"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, nếu năng lượng được giải phóng, thì phản ứng đó",
    "re": "là phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một chất có độ pH nhỏ hơn 7, thì chất đó",
    "re": "là axit"
  },
  {
    "con": "Khi một chất rắn được nung nóng đến nhiệt độ cao, nếu nó chuyển thành khí mà không qua trạng thái lỏng, thì hiện tượng này gọi là",
    "re": "sublimation (sublim hóa)"
  },
  {
    "con": "Nếu một dung dịch có nồng độ cao hơn nồng độ bão hòa, thì chất tan sẽ",
    "re": "không hòa tan thêm"
  },
  {
    "con": "Khi hai chất phản ứng với nhau và tạo ra một sản phẩm mới, thì sản phẩm đó",
    "re": "có tính chất khác với các chất ban đầu"
  },
  {
    "con": "Nếu một nguyên tố có số electron bằng số proton, thì nguyên tố đó",
    "re": "là trung hòa về điện"
  },
  {
    "con": "Khi một chất bị oxi hóa, thì nó",
    "re": "mất electron"
  },
  {
    "con": "Cho các cặp chất sau:\n(1) dung dịch MgSO_{4} và dung dịch NaOH        \n(2) Khí Cl_{2} và dung dịch NaOH.\n(3) Dung dịch KBr và dung dịch AgNO_{3}.        \n(4) Dung dịch KMnO_{4} và dung dịch HCl đặc.                                 \n(5) FeS và dung dịch HCl.\n(6) Dung dịch AgNO_{3} và dung dịch Fe(NO_{3})_{2}.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Dung dịch NaCl và dung dịch AgNO_{3} được trộn lẫn.",
    "re": "Xuất hiện kết tủa AgCl trắng"
  },
  {
    "con": "Cho một mẫu khí CO_{2} vào dung dịch nước vôi trong.",
    "re": "Xuất hiện kết tủa CaCO_{3} trắng"
  },
  {
    "con": "Khi đun nóng dung dịch NaHCO_{3}.",
    "re": "Giải phóng khí CO_{2} và tạo ra Na_{2}CO_{3}"
  },
  {
    "con": "Trộn dung dịch HCl với dung dịch NaOH.",
    "re": "Phản ứng trung hòa xảy ra, tạo ra nước và muối NaCl"
  },
  {
    "con": "Cho kim loại Zn vào dung dịch HCl.",
    "re": "Giải phóng khí H_{2} và tạo ra dung dịch ZnCl_{2}"
  },
  {
    "con": "Trộn dung dịch KMnO_{4} với dung dịch H_{2}SO_{4} loãng.",
    "re": "Xuất hiện màu tím của KMnO_{4} trong môi trường axit"
  },
  {
    "con": "Cho dung dịch FeCl_{3} vào dung dịch NaOH.",
    "re": "Xuất hiện kết tủa Fe(OH)_{3} màu nâu"
  },
  {
    "con": "Khi đun nóng dung dịch H_{2}SO_{4} đặc với đường.",
    "re": "Tạo ra khí SO_{2} và carbon"
  },
  {
    "con": "Trộn dung dịch HNO_{3} với dung dịch NaOH.",
    "re": "Phản ứng trung hòa xảy ra, tạo ra nước và muối NaNO_{3}"
  },
  {
    "con": "Có ba lọ đựng ba khí riêng biệt là clo, hidroclorua và oxi. Có thể dùng một chất nào trong số các chất sau để đồng thời nhận ra được cả ba khí trên?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng sẽ tăng.",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Nếu một chất có độ pH nhỏ hơn 7 thì chất đó được coi là axit.",
    "re": "Chất đó là axit"
  },
  {
    "con": "Nếu một chất có độ pH lớn hơn 7 thì chất đó được coi là bazơ.",
    "re": "Chất đó là bazơ"
  },
  {
    "con": "Khi hai chất phản ứng với nhau và tạo ra sản phẩm mới thì phản ứng hóa học đã xảy ra.",
    "re": "Phản ứng hóa học đã xảy ra"
  },
  {
    "con": "Nếu một chất hòa tan trong nước tạo ra ion dương và ion âm thì chất đó là chất điện ly.",
    "re": "Chất đó là chất điện ly"
  },
  {
    "con": "Khi nhiệt độ của một chất rắn tăng lên thì thể tích của chất đó thường tăng.",
    "re": "Thể tích của chất đó tăng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín thì khối lượng tổng thể của hệ thống sẽ không thay đổi.",
    "re": "Khối lượng tổng thể không thay đổi"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện trong dung dịch thì chất đó có thể là muối hoặc axit.",
    "re": "Chất đó có thể là muối hoặc axit"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C thì chất đó có thể là một chất lỏng dễ bay hơi.",
    "re": "Chất đó là chất lỏng dễ bay hơi"
  },
  {
    "con": "Cho 0,15 mol S (lưu huỳnh) tác dụng vừa đủ với một lượng khí oxi thu được SO_{2}. Số mol electron của S bị mất đi là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 1 mol NaCl vào nước, nồng độ ion Na+ và Cl- trong dung dịch sẽ tăng lên",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học C6H12O6, thì nó là glucose",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi đun nóng nước đến 100 độ C, nước sẽ chuyển từ trạng thái lỏng sang trạng thái khí",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, thì nguyên tố đó là carbon",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi axit và bazơ phản ứng với nhau, sản phẩm tạo thành sẽ là muối và nước",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C, thì chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một nguyên tử mất electron, nó sẽ trở thành ion dương",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng sẽ tăng lên",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất rắn hòa tan trong dung môi, nó sẽ tạo ra dung dịch đồng nhất",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có nhiệt độ 0 độ C sẽ đóng băng thành băng",
    "re": "Nước chuyển từ trạng thái lỏng sang trạng thái rắn"
  },
  {
    "con": "Khi đun nóng một chất rắn, nếu nhiệt độ đạt đến điểm nóng chảy của nó",
    "re": "Chất rắn sẽ chuyển sang trạng thái lỏng"
  },
  {
    "con": "Khi một chất hóa học phản ứng với một chất khác và tạo ra khí",
    "re": "Có thể quan sát sự tạo thành bọt khí hoặc mùi đặc trưng"
  },
  {
    "con": "Nếu cho một lượng axit vào dung dịch kiềm",
    "re": "Sẽ xảy ra phản ứng trung hòa và tạo ra muối cùng nước"
  },
  {
    "con": "Khi một chất bị oxi hóa",
    "re": "Chất đó sẽ mất electron và tăng số oxi hóa"
  },
  {
    "con": "Nếu một dung dịch có pH < 7",
    "re": "Dung dịch đó được coi là axit"
  },
  {
    "con": "Khi cho một chất rắn vào nước và chất đó không tan",
    "re": "Chất rắn sẽ lắng xuống đáy"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và tạo ra sản phẩm mới",
    "re": "Sản phẩm đó sẽ có tính chất khác biệt so với các chất phản ứng ban đầu"
  },
  {
    "con": "Khi nhiệt độ của một chất khí tăng lên trong một bình kín",
    "re": "Áp suất của chất khí đó sẽ tăng lên"
  },
  {
    "con": "Cho 11,36 g hỗn hợp gồm Fe, FeO, Fe_{2}O_{3}, Fe3O_{4} phản ứng hết với dung dịch HNO_{3} loãng dư thu được 1,344 lít khí NO sản phẩm khử duy nhất ở (đktc) và dung dịch X. Dung dịch X có thể hoà tan tối đa được 12,88g Fe (vẫn chỉ thu thêm khí NO duy nhất). Số mol HNO_{3} có trong dung dịch ban đầu là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cho 9,2 gam hỗn hợp hai muối cacbonat của kim loại hóa trị II ( có tỷ lệ mol 1:1) tác dụng hết với dung dịch HCl dư thấy thoát ra x lít khí (ở đktc). Dung dịch thu được đem cô cạn thấy có 10,3 gam muối khan. Giá trị của x và công thức 2 muối là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có nhiệt độ nóng chảy thấp hơn nhiệt độ phòng thì chất đó sẽ tồn tại ở trạng thái lỏng.",
    "re": "Chất đó có thể là chất lỏng ở nhiệt độ phòng."
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7 thì dung dịch đó được coi là axit.",
    "re": "Dung dịch đó có tính axit."
  },
  {
    "con": "Nếu hai chất phản ứng với nhau và tạo ra khí thì phản ứng đó có thể là phản ứng trao đổi hoặc phản ứng phân hủy.",
    "re": "Có thể có khí thoát ra trong phản ứng."
  },
  {
    "con": "Nếu một kim loại phản ứng với axit và tạo ra khí hidro thì kim loại đó phải là kim loại hoạt động hơn hidro.",
    "re": "Kim loại đó có khả năng phản ứng với axit."
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là NaCl thì hợp chất đó là muối ăn.",
    "re": "Hợp chất đó là muối."
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao hơn 1M thì dung dịch đó được coi là đậm đặc.",
    "re": "Dung dịch đó có nồng độ cao."
  },
  {
    "con": "Nếu một chất có độ tan trong nước cao thì chất đó được coi là tan tốt.",
    "re": "Chất đó dễ hòa tan trong nước."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và có sự thay đổi màu sắc thì có thể có sự hình thành sản phẩm mới.",
    "re": "Có thể có phản ứng hóa học xảy ra."
  },
  {
    "con": "Nếu một chất có khối lượng riêng lớn hơn 1 g/cm³ thì chất đó sẽ chìm trong nước.",
    "re": "Chất đó có thể không nổi trên mặt nước."
  },
  {
    "con": "Cho 15,6 gam hỗn hợp gồm kim loại Al và oxit của nó (Al2O_{3}) có tỷ lệ mol 2:1 tác dụng hết với dd HCl 1M thì cần V lít để hòa tan hết. Giá trị của V là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C thì chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng",
    "re": "Chất đó có thể bay hơi dễ dàng"
  },
  {
    "con": "Nếu một dung dịch có pH lớn hơn 7 thì dung dịch đó là kiềm",
    "re": "Dung dịch đó có khả năng trung hòa axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra mà không có sự thay đổi về khối lượng thì phản ứng đó là phản ứng hóa học kín",
    "re": "Khối lượng của các chất phản ứng bằng khối lượng của các sản phẩm"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit tạo ra khí hidro thì kim loại đó là kim loại hoạt động",
    "re": "Kim loại đó có khả năng phản ứng với axit"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng thì chất đó có thể có tính quang hoạt",
    "re": "Chất đó có thể quay mặt phẳng của ánh sáng phân cực"
  },
  {
    "con": "Nếu nhiệt độ tăng thì tốc độ phản ứng hóa học thường tăng lên",
    "re": "Phản ứng xảy ra nhanh hơn"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao thì khả năng dẫn điện của dung dịch đó cũng cao",
    "re": "Dung dịch đó chứa nhiều ion tự do"
  },
  {
    "con": "Nếu một chất có nhiệt độ nóng chảy thấp hơn nhiệt độ phòng thì chất đó sẽ tồn tại ở trạng thái rắn",
    "re": "Chất đó có thể dễ dàng chuyển sang trạng thái lỏng khi làm nóng"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt thì năng lượng được giải phóng ra ngoài",
    "re": "Nhiệt độ của môi trường xung quanh có thể tăng lên"
  },
  {
    "con": "Cho sơ đồ phản ứng: aAl + bHNO_{3} (loãng) \\xrightarrow cAl(NO_{3})_{3} + dN_{2}O + eH_{2}O\nSau khi cân bằng phản ứng thì tổng hệ số là các số nguyên tối giản (a+b+c+d+e) bằng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất được hòa tan trong nước, nếu chất đó tạo ra ion dương và ion âm thì chất đó được gọi là",
    "re": "chất điện ly"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao thì tốc độ phản ứng",
    "re": "sẽ tăng lên"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7 thì dung dịch đó",
    "re": "là dung dịch axit"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử Z thì số proton trong hạt nhân của nguyên tố đó",
    "re": "bằng Z"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và năng lượng được giải phóng ra ngoài thì phản ứng đó được gọi là",
    "re": "phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C thì chất đó có thể",
    "re": "bị bay hơi ở nhiệt độ phòng"
  },
  {
    "con": "Khi một dung dịch có nồng độ mol cao hơn nồng độ mol của dung dịch khác thì dung dịch đó",
    "re": "được gọi là dung dịch đậm đặc"
  },
  {
    "con": "Nếu một nguyên tố có cấu hình electron 1s² 2s² 2p⁶ 3s² 3p⁴ thì nguyên tố đó là",
    "re": "lưu huỳnh"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và năng lượng được hấp thụ từ môi trường thì phản ứng đó được gọi là",
    "re": "phản ứng thu nhiệt"
  },
  {
    "con": "Cho 2,24 lít H_{2} tác dụng với 3,36 lít Cl_{2} thu được khí X. Cho X tác dụng với dung dịch AgNO_{3} dư thu được 11,48 gam kết tủa trắng (coi chỉ có HCl trong X phản ứng với AgNO_{3}). Biết thể tích các khí đo ở đktc. Hiệu suất của phản ứng tổng hợp HCl là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất được đun nóng đến nhiệt độ cao, nó có thể chuyển từ trạng thái rắn sang trạng thái lỏng.",
    "re": "Chất đó xảy ra quá trình nóng chảy"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là axit.",
    "re": "Dung dịch có tính axit"
  },
  {
    "con": "Khi cho một kim loại phản ứng với axit, nếu có khí thoát ra, thì khí đó thường là H_{2}.",
    "re": "Khí thoát ra là khí hidro"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn nước, thì chất đó sẽ bay hơi nhanh hơn khi được đun nóng.",
    "re": "Chất đó dễ bay hơi"
  },
  {
    "con": "Khi một chất hòa tan trong nước và tạo ra ion, thì chất đó được gọi là chất điện ly.",
    "re": "Chất đó có khả năng dẫn điện"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn các phản ứng ban đầu, thì phản ứng đó là phản ứng tỏa nhiệt.",
    "re": "Phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi một chất rắn được hòa tan trong nước và tạo ra dung dịch, nếu dung dịch đó có thể dẫn điện, thì chất rắn đó là chất điện ly.",
    "re": "Chất rắn đó là chất điện ly"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra mà không có sự thay đổi về khối lượng, thì khối lượng của các phản ứng ban đầu bằng khối lượng của sản phẩm.",
    "re": "Định luật bảo toàn khối lượng"
  },
  {
    "con": "Khi một chất bị oxi hóa, thì nó sẽ mất electron.",
    "re": "Chất đó bị oxi hóa"
  },
  {
    "con": "Cho dung dịch X chứa 0,1 mol FeCl_{2}; 0,25 mol FeSO_{4}. Thể tích dung dịch KMnO_{4} 0,1M trong H_{2}SO_{4} loãng vừa đủ để oxi hóa hết các chất trong X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có nhiệt độ nóng chảy thấp hơn nhiệt độ phòng",
    "re": "chất đó sẽ tồn tại ở trạng thái lỏng tại nhiệt độ phòng"
  },
  {
    "con": "Nếu một dung dịch có pH < 7",
    "re": "dung dịch đó được coi là axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra mà không có sự thay đổi về khối lượng",
    "re": "phản ứng đó tuân theo định luật bảo toàn khối lượng"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước",
    "re": "chất đó được gọi là chất tan"
  },
  {
    "con": "Nếu một nguyên tố có số electron bằng số proton",
    "re": "nguyên tố đó sẽ có điện tích bằng 0"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra với sự giải phóng năng lượng",
    "re": "phản ứng đó được gọi là phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử phức tạp",
    "re": "chất đó thường có tính chất hóa học đa dạng hơn"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao",
    "re": "dung dịch đó sẽ có khả năng dẫn điện tốt hơn"
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn điểm sôi của nước",
    "re": "chất đó sẽ tồn tại ở trạng thái lỏng dưới áp suất bình thường"
  },
  {
    "con": "Khí clo điều chế trong phòng thí nghiệm có lẫn khí HCl. Để làm sạch khí clo cần sục hỗn hợp khí này vào",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất rắn được hòa tan trong nước, nếu chất đó là muối thì dung dịch sẽ dẫn điện tốt",
    "re": "Điện phân sẽ xảy ra"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng sẽ tăng lên",
    "re": "Phản ứng sẽ diễn ra nhanh hơn"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7, thì chất đó được coi là axit",
    "re": "Chất đó có tính axit"
  },
  {
    "con": "Nếu một chất có độ pH trên 7, thì chất đó được coi là bazơ",
    "re": "Chất đó có tính kiềm"
  },
  {
    "con": "Khi hai chất phản ứng với nhau tạo thành một sản phẩm mới, nếu sản phẩm đó không tan trong dung môi, thì nó sẽ kết tủa",
    "re": "Kết tủa sẽ hình thành"
  },
  {
    "con": "Nếu một nguyên tố có số electron bằng số proton, thì nguyên tố đó là trung hòa về điện",
    "re": "Nguyên tố đó không mang điện"
  },
  {
    "con": "Nếu nhiệt độ của một chất khí tăng lên, thì thể tích của chất khí đó sẽ tăng nếu áp suất không đổi",
    "re": "Chất khí sẽ nở ra"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì năng lượng sẽ được giải phóng ra môi trường",
    "re": "Nhiệt độ môi trường sẽ tăng lên"
  },
  {
    "con": "Nếu một dung dịch có nồng độ cao hơn dung dịch khác, thì dung dịch đó sẽ có áp suất thẩm thấu cao hơn",
    "re": "Nước sẽ di chuyển từ dung dịch loãng sang dung dịch đặc"
  },
  {
    "con": "Dung dịch X chứa 0,4 mol HCl trong đó clo có 2 đồng vị là _{35}Cl và _{37}Cl với tỉ lệ tương ứng là 70:30. Nếu cho dung dịch X tác dụng với dung dịch chứa 0,1 mol AgNO_{3} thì thu được bao nhiêu gam kết tủa ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số proton là 6 thì nguyên tố đó là carbon.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra mà không có sự thay đổi về khối lượng thì phản ứng đó là phản ứng bảo toàn khối lượng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên thì động năng của các phân tử trong chất đó cũng tăng lên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7 thì dung dịch đó được coi là axit.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là NaCl thì hợp chất đó là muối ăn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C thì chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra với sự tham gia của oxy thì phản ứng đó được gọi là phản ứng oxi hóa.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số electron là 11 thì nguyên tố đó là natri.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch chứa ion OH- thì dung dịch đó có tính kiềm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Phản ứng giữa các loại chất nào sau đây luôn luôn là phản ứng oxi hóa – khử ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được tạo thành từ phản ứng giữa hydro và oxy ở nhiệt độ cao ?",
    "re": "Nước là sản phẩm của phản ứng"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có tính chất hóa học tương tự ?",
    "re": "Chúng có cấu trúc electron tương tự"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng ?",
    "re": "Phản ứng xảy ra nhanh hơn"
  },
  {
    "con": "Chất điện phân có khả năng dẫn điện khi hòa tan trong nước ?",
    "re": "Chất điện phân phân ly thành ion"
  },
  {
    "con": "Khi một chất bị oxi hóa, nó sẽ mất electron ?",
    "re": "Chất đó trở thành ion dương"
  },
  {
    "con": "Khi pH của dung dịch giảm, dung dịch trở nên axit hơn ?",
    "re": "Nồng độ ion H+ tăng lên"
  },
  {
    "con": "Các hợp chất ion thường có điểm nóng chảy cao ?",
    "re": "Chúng có liên kết ion mạnh"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, khối lượng tổng của các chất phản ứng bằng khối lượng tổng của các sản phẩm ?",
    "re": "Đây là định luật bảo toàn khối lượng"
  },
  {
    "con": "Khi một chất bị phân hủy, nó sẽ tạo ra hai hoặc nhiều chất khác ?",
    "re": "Đây là phản ứng phân hủy"
  },
  {
    "con": "Thể tích khí NO (duy nhất ở đktc) sinh ra khi cho 5,6 gam Fe phản ứng với axit HNO_{3} loãng (dư)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là một hợp chất được tạo thành từ hai nguyên tố là hydro và oxy",
    "re": "Nước có công thức hóa học là H2O"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng lên",
    "re": "Phản ứng xảy ra nhanh hơn"
  },
  {
    "con": "Khi cho một muối vào nước, nếu muối đó tan hoàn toàn",
    "re": "Dung dịch sẽ trở thành một dung dịch điện ly"
  },
  {
    "con": "Khi một nguyên tố có số electron ở lớp ngoài cùng là 8",
    "re": "Nguyên tố đó sẽ có tính ổn định cao và ít phản ứng hóa học"
  },
  {
    "con": "Khi cho axit phản ứng với bazơ",
    "re": "Sẽ tạo ra muối và nước"
  },
  {
    "con": "Khi một chất rắn được nung nóng và chuyển thành khí",
    "re": "Quá trình này gọi là sự thăng hoa"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7",
    "re": "Dung dịch đó trở thành axit"
  },
  {
    "con": "Khi một nguyên tử mất electron",
    "re": "Nguyên tử đó trở thành ion dương"
  },
  {
    "con": "Khi hai nguyên tố kết hợp với nhau để tạo thành một hợp chất",
    "re": "Hợp chất đó sẽ có tính chất khác biệt so với các nguyên tố thành phần"
  },
  {
    "con": "Số oxi hóa của nito trong NO_{2}-,NO_{3-},NH_{3} lần lượt là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là một hợp chất được tạo thành từ hai nguyên tố là hidro và oxi",
    "re": "Nước có công thức hóa học là H₂O"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có tính chất hóa học tương tự",
    "re": "Chúng có cùng số electron ở lớp ngoài cùng"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm",
    "re": "Đây là định luật bảo toàn khối lượng"
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên, thì động năng của các phân tử trong chất đó cũng tăng lên",
    "re": "Chất sẽ có xu hướng chuyển từ trạng thái rắn sang lỏng hoặc khí"
  },
  {
    "con": "Khi axit phản ứng với bazơ, sản phẩm tạo thành là muối và nước",
    "re": "Đây là phản ứng trung hòa"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7, thì chất đó được coi là axit",
    "re": "Chất đó có khả năng cho proton (H⁺) vào dung dịch"
  },
  {
    "con": "Khi một nguyên tố mất electron, thì nó trở thành ion dương",
    "re": "Ion dương được gọi là cation"
  },
  {
    "con": "Nếu một hợp chất có liên kết ion, thì nó thường có điểm nóng chảy cao",
    "re": "Hợp chất đó thường là muối"
  },
  {
    "con": "Khi một chất bị oxi hóa, thì nó mất electron",
    "re": "Chất đó tăng số oxi hóa"
  },
  {
    "con": "Cho các nguyên tố A, B, C, D, E, F tạo được các ion có cấu hình e như sau: A- : 1s^2 2s^2 2p^6; \nB^+: 1s^2 2s^2 2p^6 3s^2 3p^6; \nC^-: 1s^2 2s^2 2p^6 3s^2 3p^6. \nD^2+: 1s^2 2s^2 2p^6 3s^2 3p^6; \nE^3+: 1s^2 2s^2 2p^6, \nF^2+: 1s^2 2s^2 2p^6 3s^2 3p^6 3d^6, \nG^2-: 1s^2 2s^2 2p^6. \nCác nguyên tố p là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "thường làm tăng tốc độ phản ứng"
  },
  {
    "con": "Một chất có điểm sôi thấp hơn 100 độ C",
    "re": "có thể là một chất lỏng dễ bay hơi"
  },
  {
    "con": "Khi một nguyên tố mất electron",
    "re": "nó trở thành ion dương"
  },
  {
    "con": "Khi một nguyên tố nhận electron",
    "re": "nó trở thành ion âm"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn",
    "re": "có tính chất hóa học tương tự nhau"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7",
    "re": "dung dịch trở nên axit"
  },
  {
    "con": "Khi pH của dung dịch tăng lên trên 7",
    "re": "dung dịch trở nên kiềm"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và sản phẩm không thể quay lại thành phản ứng ban đầu",
    "re": "đó là phản ứng không thuận nghịch"
  },
  {
    "con": "Khi một chất hòa tan trong nước tạo ra ion",
    "re": "chất đó được gọi là chất điện ly"
  },
  {
    "con": "Nước có công thức hóa học là H2O",
    "re": "Nước là một hợp chất được tạo thành từ hai nguyên tử hydro và một nguyên tử oxy"
  },
  {
    "con": "Kim loại thường dẫn điện tốt",
    "re": "Kim loại có cấu trúc tinh thể cho phép các electron di chuyển tự do"
  },
  {
    "con": "Hợp chất ion được hình thành từ sự kết hợp giữa ion dương và ion âm",
    "re": "Hợp chất ion có tính chất khác biệt so với các hợp chất covalent"
  },
  {
    "con": "Nhiệt độ sôi của nước là 100 độ C ở áp suất khí quyển tiêu chuẩn",
    "re": "Nhiệt độ sôi có thể thay đổi khi áp suất thay đổi"
  },
  {
    "con": "Phản ứng hóa học có thể thay đổi trạng thái của chất",
    "re": "Phản ứng hóa học tạo ra các sản phẩm mới với tính chất khác biệt"
  },
  {
    "con": "Khối lượng của một chất không thay đổi khi nó chuyển từ trạng thái này sang trạng thái khác",
    "re": "Khối lượng được bảo toàn trong các phản ứng hóa học"
  },
  {
    "con": "Acid có khả năng cho proton (H+) trong phản ứng",
    "re": "Acid và bazơ tương tác với nhau để tạo ra muối và nước"
  },
  {
    "con": "Mỗi nguyên tố hóa học có một số nguyên tử xác định",
    "re": "Số nguyên tử xác định của một nguyên tố được gọi là số nguyên tử"
  },
  {
    "con": "Hóa học hữu cơ chủ yếu nghiên cứu các hợp chất chứa carbon",
    "re": "Hóa học hữu cơ có vai trò quan trọng trong đời sống hàng ngày"
  },
  {
    "con": "Hãy chỉ ra mệnh đề không chính xác:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hòa tan hết hỗn hợp X gồm Fe và Mg bằng một lượng vừa đủ dung dịch HCl 20%, thu được dung dịch Y. Nồng độ của FeCl_{2} trong dung dịch Y là 15,757%. Nồng độ của MgCl_{2} trong dung dịch Y là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi đun nóng nước đến 100 độ C, nước sẽ chuyển thành hơi nước.",
    "re": "Quá trình này gọi là sự bay hơi."
  },
  {
    "con": "Khi trộn dung dịch NaCl với dung dịch AgNO3, sẽ xảy ra phản ứng kết tủa.",
    "re": "Kết tủa AgCl sẽ hình thành."
  },
  {
    "con": "Nếu một chất có điểm nóng chảy thấp hơn nhiệt độ phòng, chất đó sẽ tồn tại ở trạng thái rắn.",
    "re": "Chất đó sẽ ở trạng thái rắn ở nhiệt độ phòng."
  },
  {
    "con": "Khi thêm axit vào dung dịch kiềm, pH của dung dịch sẽ giảm.",
    "re": "Dung dịch sẽ trở nên axit hơn."
  },
  {
    "con": "Nếu một nguyên tố có số electron bằng số proton, nguyên tố đó sẽ trung hòa điện.",
    "re": "Nguyên tố đó sẽ không mang điện tích."
  },
  {
    "con": "Khi một chất bị oxi hóa, nó sẽ mất electron.",
    "re": "Chất đó sẽ tăng số oxi hóa."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, tốc độ phản ứng sẽ tăng.",
    "re": "Điều này do năng lượng va chạm giữa các phân tử tăng lên."
  },
  {
    "con": "Khi một chất hòa tan trong nước, nó sẽ tạo thành dung dịch.",
    "re": "Dung dịch này có thể dẫn điện nếu chất hòa tan là muối."
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước, nó sẽ dễ dàng hòa tan.",
    "re": "Chất đó sẽ tạo thành dung dịch bão hòa nhanh chóng."
  },
  {
    "con": "Tổng số hạt p, n, e trong nguyên tử của nguyên tố X bằng 10. Nguyên tố X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ của một chất tăng lên khi nó hấp thụ nhiệt. Chất đó sẽ",
    "re": "Có thể chuyển từ trạng thái rắn sang lỏng"
  },
  {
    "con": "Một dung dịch có pH nhỏ hơn 7. Dung dịch đó là",
    "re": "Chất axit"
  },
  {
    "con": "Khi hai nguyên tố kết hợp với nhau để tạo thành một hợp chất mới, quá trình này gọi là",
    "re": "Phản ứng hóa học"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, thì nguyên tố đó là",
    "re": "Cacbon"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước và tạo ra dung dịch, chất đó được gọi là",
    "re": "Chất tan"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn các phản ứng ban đầu, thì phản ứng đó là",
    "re": "Phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi một chất bị phân hủy thành các thành phần đơn giản hơn, quá trình này gọi là",
    "re": "Phản ứng phân hủy"
  },
  {
    "con": "Nếu một nguyên tử có 8 electron ở lớp vỏ ngoài, thì nguyên tử đó là",
    "re": "Nguyên tử ổn định"
  },
  {
    "con": "Khi một chất chuyển từ trạng thái lỏng sang khí, quá trình này gọi là",
    "re": "Bốc hơi"
  },
  {
    "con": "Trong phương trình phản ứng:\na FeSO_{4} + bKMnO_{4} + cKHSO_{4}  \\xrightarrow nFe_{2}(SO_{4})_{3} + dK_{2}SO_{4} + eMnSO_{4} + gH_{2}O (các hệ số a, b, c.. là những số nguyên, tối giản). Tổng hệ số các chất tham gia phản ứng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Khi một chất hòa tan trong nước",
    "re": "nó sẽ tạo ra dung dịch"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kín",
    "re": "khối lượng tổng thể sẽ được bảo toàn"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7",
    "re": "dung dịch đó sẽ trở thành axit"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước",
    "re": "nó sẽ dễ dàng tạo thành dung dịch"
  },
  {
    "con": "Khi một phản ứng xảy ra giữa axit và bazơ",
    "re": "sẽ tạo ra muối và nước"
  },
  {
    "con": "Nếu một chất có điện tích dương",
    "re": "nó sẽ thu hút các ion âm"
  },
  {
    "con": "Khi nhiệt độ của một chất rắn tăng lên",
    "re": "nó sẽ chuyển sang trạng thái lỏng tại điểm nóng chảy"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch",
    "re": "các sản phẩm có thể chuyển đổi trở lại thành các chất phản ứng"
  },
  {
    "con": "Sắp xếp tính Bazơ của các hiđroxit sau NaOH, Mg(OH) _{2}, Si(OH) _{4}, Al(OH) _{3} theo chiều giảm dần",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Thêm axit vào dung dịch kiềm",
    "re": "Sẽ xảy ra phản ứng trung hòa tạo ra muối và nước"
  },
  {
    "con": "Nung nóng một hợp chất chứa nước",
    "re": "Sẽ xảy ra sự bay hơi và tạo ra hơi nước"
  },
  {
    "con": "Pha trộn hai chất lỏng không hòa tan vào nhau",
    "re": "Sẽ tạo ra một hỗn hợp hai lớp"
  },
  {
    "con": "Sử dụng quỳ tím để thử nghiệm pH của dung dịch",
    "re": "Sẽ xác định được tính axit hoặc bazơ của dung dịch"
  },
  {
    "con": "Cho kim loại vào dung dịch axit",
    "re": "Sẽ xảy ra phản ứng tạo ra khí hydro và muối"
  },
  {
    "con": "Sử dụng nhiệt độ cao để phân hủy một hợp chất",
    "re": "Sẽ tạo ra các sản phẩm khác nhau tùy thuộc vào hợp chất ban đầu"
  },
  {
    "con": "Sử dụng điện phân để tách các ion trong dung dịch",
    "re": "Sẽ tạo ra các chất khác nhau tại các điện cực"
  },
  {
    "con": "Trộn các chất có tính chất hóa học khác nhau",
    "re": "Có thể tạo ra phản ứng hóa học và sản phẩm mới"
  },
  {
    "con": "Sử dụng công thức hóa học để tính toán khối lượng mol",
    "re": "Sẽ giúp xác định số mol của chất trong phản ứng"
  },
  {
    "con": "Cho sơ đồ phản ứng        A + B \\xrightarrow  FeCl_{3}        HCl + B \\xrightarrow C + H_{2} A, B , C lần lượt là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Có sự hiện diện của chất xúc tác trong phản ứng",
    "re": "Tốc độ phản ứng sẽ tăng mà không làm thay đổi sản phẩm"
  },
  {
    "con": "Một chất có pH < 7",
    "re": "Chất đó được coi là axit"
  },
  {
    "con": "Một chất có pH > 7",
    "re": "Chất đó được coi là bazơ"
  },
  {
    "con": "Khi hai chất phản ứng với nhau và tạo ra khí",
    "re": "Có thể có bọt khí xuất hiện trong dung dịch"
  },
  {
    "con": "Khi một kim loại phản ứng với axit",
    "re": "Sẽ tạo ra muối và khí hydro"
  },
  {
    "con": "Khi một chất hòa tan trong nước",
    "re": "Sẽ tạo ra dung dịch"
  },
  {
    "con": "Khi nhiệt độ giảm trong một phản ứng tỏa nhiệt",
    "re": "Phản ứng sẽ chậm lại"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra",
    "re": "Liên kết hóa học giữa các nguyên tử sẽ bị phá vỡ và hình thành liên kết mới"
  },
  {
    "con": "Chia 22,0 gam hỗn hợp X gồm Mg, Na, Ca thành 2 phần bằng nhau :\nPhần 1 cho tác dụng hết với O_{2} thu được 15,8 gam hỗn hợp 3 oxit.\nPhần 2 cho tác dụng với dung dịch HCl dư thu được V(l) H_{2} (đktc)\nGiá trị của V là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu hòa tan 10 gam NaCl vào 100 ml nước,\nthì dung dịch thu được có nồng độ mol là",
    "re": "0,17 M"
  },
  {
    "con": "Nếu cho 5 gam bột Fe vào 50 ml dung dịch HCl 1M,\nthì lượng khí H2 sinh ra là",
    "re": "0,25 mol"
  },
  {
    "con": "Nếu đun nóng 10 gam CaCO3,\nthì sản phẩm thu được là 4,4 gam CO2 và 5,6 gam CaO",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu cho 20 ml dung dịch H2SO4 1M vào 50 ml dung dịch NaOH 1M,\nthì pH của dung dịch sau phản ứng là",
    "re": "pH = 7"
  },
  {
    "con": "Nếu hòa tan 12 gam KOH vào 200 ml nước,\nthì dung dịch thu được có nồng độ mol là",
    "re": "0,75 M"
  },
  {
    "con": "Nếu cho 10 gam Mg vào 100 ml dung dịch HCl 1M,\nthì lượng khí H2 sinh ra là",
    "re": "0,5 mol"
  },
  {
    "con": "Nếu cho 15 gam Na vào 200 ml nước,\nthì lượng khí H2 sinh ra là",
    "re": "0,67 mol"
  },
  {
    "con": "Nếu trộn 50 ml dung dịch NaOH 0,5M với 50 ml dung dịch HCl 0,5M,\nthì dung dịch thu được sẽ có pH là",
    "re": "pH = 7"
  },
  {
    "con": "Nếu cho 10 gam bột Cu vào 100 ml dung dịch AgNO3 0,1M,\nthì lượng Ag thu được là",
    "re": "0,01 mol"
  },
  {
    "con": "Sắp xếp theo chiều giảm dần bán kính nguyên tử của các nguyên tố sau _{12}Mg, _{17}Cl, _{16}S, _{11}Na",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Thêm axit vào dung dịch kiềm",
    "re": "Sẽ tạo ra muối và nước"
  },
  {
    "con": "Đun nóng nước đến 100 độ C",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Trộn hai chất phản ứng với nhau như axit và bazơ",
    "re": "Sẽ xảy ra phản ứng trung hòa"
  },
  {
    "con": "Sử dụng quỳ tím để thử nghiệm pH",
    "re": "Quỳ tím sẽ chuyển sang màu đỏ trong môi trường axit"
  },
  {
    "con": "Sắp xếp các nguyên tố theo thứ tự tăng dần độ điện tích hạt nhân",
    "re": "Sẽ thấy rằng bán kính nguyên tử giảm dần"
  },
  {
    "con": "Cho một viên đá vôi vào dung dịch axit",
    "re": "Sẽ có khí carbon dioxide thoát ra"
  },
  {
    "con": "Thêm muối vào nước",
    "re": "Muối sẽ hòa tan tạo thành dung dịch"
  },
  {
    "con": "Sử dụng nhiệt độ cao để nung chảy kim loại",
    "re": "Kim loại sẽ chuyển từ trạng thái rắn sang trạng thái lỏng"
  },
  {
    "con": "Thực hiện phản ứng oxi hóa khử",
    "re": "Sẽ có sự chuyển giao electron giữa các chất"
  },
  {
    "con": "Mệnh đề nào sau đây không đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất nào có thể thay đổi trạng thái từ rắn sang lỏng?",
    "re": "Nhiệt độ tăng lên"
  },
  {
    "con": "Khi hai chất phản ứng với nhau tạo ra sản phẩm mới?",
    "re": "Có sự thay đổi hóa học xảy ra"
  },
  {
    "con": "Nếu một chất có pH dưới 7?",
    "re": "Chất đó là axit"
  },
  {
    "con": "Khi nhiệt độ của một khí tăng lên trong một bình kín?",
    "re": "Áp suất của khí đó sẽ tăng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ cao hơn dung dịch khác?",
    "re": "Dung dịch đó sẽ có khả năng hút nước từ dung dịch kia"
  },
  {
    "con": "Khi một kim loại phản ứng với axit?",
    "re": "Sẽ tạo ra khí hydro"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện?",
    "re": "Chất đó có thể chứa ion tự do"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và năng lượng được giải phóng?",
    "re": "Phản ứng đó được gọi là phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng?",
    "re": "Chất đó có thể có tính chất quang hoạt"
  },
  {
    "con": "Ion X^2+ có cấu hình electron 1s^² 2s^² 2p^6. Vị trí của X trong bảng tuần",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước (H2O) có cấu trúc phân tử gồm hai nguyên tử hydro và một nguyên tử oxy.",
    "re": "Nước là một hợp chất"
  },
  {
    "con": "Một nguyên tố có số proton là 6. Nguyên tố đó là carbon.",
    "re": "Carbon có số hiệu nguyên tử 6"
  },
  {
    "con": "Khi một chất bị nung nóng và chuyển từ trạng thái rắn sang trạng thái lỏng.",
    "re": "Chất đó đang trải qua quá trình nóng chảy"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và tạo ra khí carbon dioxide (CO2).",
    "re": "Phản ứng đó có thể là sự cháy của một hợp chất hữu cơ"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7.",
    "re": "Dung dịch đó là axit"
  },
  {
    "con": "Khi hai nguyên tố kết hợp với nhau để tạo thành một hợp chất mới.",
    "re": "Quá trình này gọi là phản ứng hóa học"
  },
  {
    "con": "Nếu một nguyên tử có số electron bằng số proton.",
    "re": "Nguyên tử đó là trung hòa về điện"
  },
  {
    "con": "Khi một chất hòa tan trong nước và tạo ra ion.",
    "re": "Chất đó là chất điện ly"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra mà không có sự thay đổi về khối lượng tổng thể.",
    "re": "Đó là một ví dụ về định luật bảo toàn khối lượng"
  },
  {
    "con": "Phản ứng Fe^3+ + 1e \\xrightarrow Fe_{2+} biểu thị quá trình nào sau",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học H2O",
    "re": "Nước là một hợp chất"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng",
    "re": "Phản ứng xảy ra nhanh hơn"
  },
  {
    "con": "Nếu một chất có pH < 7",
    "re": "Chất đó là axit"
  },
  {
    "con": "Khi một nguyên tố mất electron",
    "re": "Nguyên tố đó trở thành ion dương"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kín",
    "re": "Khối lượng tổng thể của hệ thống không thay đổi"
  },
  {
    "con": "Khi hai chất phản ứng với nhau tạo ra sản phẩm mới",
    "re": "Phản ứng hóa học đã xảy ra"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện",
    "re": "Chất đó có thể chứa ion tự do"
  },
  {
    "con": "Khi một chất bay hơi, nó chuyển từ trạng thái lỏng sang trạng thái khí",
    "re": "Quá trình này gọi là sự bay hơi"
  },
  {
    "con": "Nếu một hợp chất có liên kết ion",
    "re": "Hợp chất đó thường có điểm nóng chảy cao"
  },
  {
    "con": "Nước có công thức hóa học H2O",
    "re": "Nước là một hợp chất"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số nguyên tử tăng dần",
    "re": "Bảng tuần hoàn giúp xác định tính chất của nguyên tố"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng",
    "re": "Nhiệt độ ảnh hưởng đến năng lượng của các phân tử"
  },
  {
    "con": "Hợp chất ion được hình thành từ sự kết hợp giữa ion dương và ion âm",
    "re": "Hợp chất ion có tính chất điện dẫn tốt"
  },
  {
    "con": "Khi một chất bị đốt cháy, nó phản ứng với oxy",
    "re": "Phản ứng này thường tạo ra nhiệt và ánh sáng"
  },
  {
    "con": "Chất lỏng có thể chuyển đổi thành hơi khi nhiệt độ tăng",
    "re": "Quá trình này gọi là bay hơi"
  },
  {
    "con": "Khi pH của dung dịch giảm, tính axit của dung dịch tăng",
    "re": "Dung dịch trở nên mạnh hơn về mặt axit"
  },
  {
    "con": "Các phản ứng hóa học có thể được biểu diễn bằng phương trình hóa học",
    "re": "Phương trình hóa học cho biết các chất tham gia và sản phẩm"
  },
  {
    "con": "Khi một chất hòa tan trong nước, nó tạo thành dung dịch",
    "re": "Dung dịch có thể dẫn điện nếu chất hòa tan là ion"
  },
  {
    "con": "Sự thay đổi trạng thái của chất không làm thay đổi bản chất của chất đó",
    "re": "Chất vẫn giữ nguyên tính chất hóa học của nó"
  },
  {
    "con": "Đồng có 2 đồng vị _{63}Cu và _{65}Cu. Khối lượng nguyên tử trung bình của Đồng là 63,54. Xác định thành phần phần trăm của đồng vị _{65}Cu trong hợp chất CuSO_{4} ( NTKTB của S=32, O=16)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học H2O. Nếu bạn tách nước thành hydro và oxy, bạn sẽ thu được 2 mol hydro và 1 mol oxy.",
    "re": "Tỉ lệ mol của hydro và oxy là 2:1"
  },
  {
    "con": "Khi axit hydrochloric (HCl) phản ứng với natri hydroxide (NaOH), sản phẩm tạo thành là nước và natri clorua (NaCl).",
    "re": "Phản ứng này là một phản ứng trung hòa"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C, thì chất đó có thể là một chất lỏng dễ bay hơi ở nhiệt độ phòng.",
    "re": "Chất đó có thể bay hơi nhanh chóng"
  },
  {
    "con": "Khi nhiệt độ tăng, nếu áp suất không đổi, thể tích của khí sẽ tăng theo định luật Charles.",
    "re": "Thể tích khí tỉ lệ thuận với nhiệt độ"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học C6H12O6, thì hợp chất đó là glucose.",
    "re": "Glucose là một monosaccharide"
  },
  {
    "con": "Khi một kim loại phản ứng với axit, nếu có khí thoát ra, thì khí đó có thể là hydro.",
    "re": "Phản ứng giữa kim loại và axit tạo ra khí hydro"
  },
  {
    "con": "Nếu một dung dịch có pH dưới 7, thì dung dịch đó được coi là axit.",
    "re": "Dung dịch axit có tính ăn mòn"
  },
  {
    "con": "Nếu bạn hòa tan muối trong nước, thì dung dịch sẽ dẫn điện tốt hơn nước tinh khiết.",
    "re": "Muối tạo ra ion trong dung dịch"
  },
  {
    "con": "Nếu một chất có khối lượng riêng lớn hơn 1 g/cm³, thì chất đó sẽ chìm trong nước.",
    "re": "Chất đó có khả năng không nổi trên mặt nước"
  },
  {
    "con": "Trong số các phần tử sau (nguyên tử hoặc ion) thì chất khử là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất bị đun nóng và tạo ra khí, thì chất đó có thể là",
    "re": "chất bay hơi hoặc chất phản ứng"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, thì dung dịch đó là",
    "re": "axit"
  },
  {
    "con": "Khi hai nguyên tố kết hợp để tạo thành một hợp chất, thì chúng sẽ",
    "re": "tạo ra liên kết hóa học"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và năng lượng được giải phóng, thì phản ứng đó là",
    "re": "phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi một chất hòa tan trong nước và dẫn điện, thì chất đó là",
    "re": "chất điện ly"
  },
  {
    "con": "Nếu một nguyên tử có số electron bằng số proton, thì nguyên tử đó là",
    "re": "nguyên tử trung hòa"
  },
  {
    "con": "Khi nhiệt độ tăng lên, thì tốc độ phản ứng hóa học thường",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước, thì chất đó sẽ",
    "re": "bay hơi ở nhiệt độ thường"
  },
  {
    "con": "Khi một hợp chất ion được hòa tan trong nước, thì nó sẽ",
    "re": "tạo ra các ion tự do trong dung dịch"
  },
  {
    "con": "Liên kết trong phân tử NaCl là liên kết ion",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là một hợp chất có công thức hóa học H2O",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi axit phản ứng với bazơ thì sản phẩm tạo ra là muối và nước",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số nguyên tử tăng dần",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhiệt độ tăng thì tốc độ phản ứng hóa học thường tăng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Phản ứng hóa học có thể được biểu diễn bằng phương trình hóa học",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất rắn, lỏng và khí là ba trạng thái của vật chất",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nguyên tử là đơn vị cơ bản của mọi chất",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất bị oxi hóa thì nó mất electron",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hợp chất hữu cơ thường chứa carbon",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cho các phản ứng sau:\n(1) H_{2}SO_{4} + Fe \\xrightarrow FeSO_{4} + H_{2}\n(2) 3H_{2}SO_{4} + 6NaNO_{2} \\xrightarrow 3Na2SO_{4} + 4NO + 2HNO_{3} + 2H_{2}O \n(3) Cu + 2H_{2}SO_{4} \\xrightarrow[đ, nóng]  CuSO_{4} + SO_{2} + 2H_{2}O\n(4) H_{2}SO_{4} + FeSO_{3} \\xrightarrow FeSO_{4} + SO_{2} + H_{2}O\nPhản ứng H_{2}SO_{4} đóng vai trò là chất oxi hóa là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "thường làm tăng tốc độ phản ứng"
  },
  {
    "con": "Khi một chất hòa tan trong nước",
    "re": "nó tạo thành dung dịch"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kín",
    "re": "khối lượng tổng thể của hệ thống sẽ không thay đổi"
  },
  {
    "con": "Khi một chất bị oxi hóa",
    "re": "nó mất electron"
  },
  {
    "con": "Nếu pH của dung dịch giảm xuống dưới 7",
    "re": "dung dịch đó trở nên axit"
  },
  {
    "con": "Khi một chất phản ứng với một chất khác để tạo ra khí",
    "re": "khí đó có thể được thu thập và đo lường"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch",
    "re": "các sản phẩm có thể chuyển đổi trở lại thành các phản ứng ban đầu"
  },
  {
    "con": "Khi một chất rắn được hòa tan trong dung môi",
    "re": "nó tạo thành dung dịch đồng nhất"
  },
  {
    "con": "Nếu nồng độ của một chất trong dung dịch tăng lên",
    "re": "tốc độ phản ứng có thể tăng lên"
  },
  {
    "con": "M là nguyên tố thuộc nhóm IIA, X là nguyên tố thuộc nhóm VIIA. Trong oxit cao nhất M chiếm 71,43% khối lượng, X chiếm 38,8% khối lượng. Liên kết giữa M và X thuộc loại liên kết nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học, tốc độ phản ứng sẽ như thế nào?",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Một dung dịch có pH < 7, thì dung dịch đó được gọi là gì?",
    "re": "Dung dịch axit"
  },
  {
    "con": "Khi một nguyên tố có số electron bằng số proton, thì nguyên tố đó có trạng thái điện tích như thế nào?",
    "re": "Nguyên tố đó trung hòa về điện"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là NaCl, thì hợp chất này được hình thành từ những nguyên tố nào?",
    "re": "Hợp chất này được hình thành từ natri và clo"
  },
  {
    "con": "Khi một chất rắn tan trong nước và tạo thành dung dịch, thì chất đó được gọi là gì?",
    "re": "Chất tan"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kín, thì khối lượng tổng của các chất phản ứng và sản phẩm sẽ như thế nào?",
    "re": "Khối lượng tổng sẽ không thay đổi"
  },
  {
    "con": "Khi một nguyên tố có khả năng mất electron dễ dàng, thì nguyên tố đó thuộc loại gì?",
    "re": "Nguyên tố kim loại"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao, thì khả năng dẫn điện của dung dịch đó sẽ như thế nào?",
    "re": "Khả năng dẫn điện sẽ cao"
  },
  {
    "con": "Khi một chất bị oxi hóa, thì chất đó sẽ như thế nào về mặt electron?",
    "re": "Chất đó sẽ mất electron"
  },
  {
    "con": "Sắp xếp theo chiều tăng dần tính kim loại của các nguyên tố: _{14}Si, _{13}Al, _{12}Mg, _{11}",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Thêm axit vào dung dịch kiềm",
    "re": "Sẽ tạo ra muối và nước"
  },
  {
    "con": "Đun nóng nước đến 100 độ C",
    "re": "Nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Trộn hai chất lỏng không hòa tan vào nhau",
    "re": "Sẽ tạo ra một hỗn hợp nhũ tương"
  },
  {
    "con": "Sử dụng quỳ tím để thử nghiệm pH",
    "re": "Quỳ tím sẽ chuyển sang màu đỏ nếu dung dịch có tính axit"
  },
  {
    "con": "Cho một viên đá khô vào nước",
    "re": "Sẽ tạo ra khí CO2 và bọt khí"
  },
  {
    "con": "Sử dụng nhiệt để phân hủy một hợp chất",
    "re": "Sẽ tạo ra các sản phẩm khác nhau tùy thuộc vào hợp chất ban đầu"
  },
  {
    "con": "Sắp xếp các nguyên tố theo số hiệu nguyên tử",
    "re": "Sẽ tạo ra bảng tuần hoàn các nguyên tố"
  },
  {
    "con": "Cho muối vào nước",
    "re": "Muối sẽ hòa tan và tạo ra dung dịch"
  },
  {
    "con": "Thực hiện phản ứng giữa kim loại và axit",
    "re": "Sẽ tạo ra khí hydro và muối"
  },
  {
    "con": "Trong nguyên tử, hạt mang điện là",
    "re": "electron"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn nước thì",
    "re": "chất đó sẽ bay hơi ở nhiệt độ phòng"
  },
  {
    "con": "Nếu hai nguyên tố kết hợp với nhau để tạo thành một hợp chất thì",
    "re": "chúng sẽ có tính chất khác biệt so với các nguyên tố riêng lẻ"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra thì",
    "re": "các liên kết hóa học sẽ bị phá vỡ và hình thành liên kết mới"
  },
  {
    "con": "Nếu pH của dung dịch nhỏ hơn 7 thì",
    "re": "dung dịch đó được coi là axit"
  },
  {
    "con": "Nếu một chất có mật độ lớn hơn 1 g/cm³ thì",
    "re": "chất đó sẽ chìm trong nước"
  },
  {
    "con": "Nếu nhiệt độ tăng lên trong một phản ứng hóa học thì",
    "re": "tốc độ phản ứng thường sẽ tăng lên"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện thì",
    "re": "chất đó thường chứa các ion tự do"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là NaCl thì",
    "re": "hợp chất đó là muối ăn"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử là 6 thì",
    "re": "nguyên tố đó là carbon"
  },
  {
    "con": "Nguyên tử được cấu tạo bởi bao nhiêu loại hạt cơ bản?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất rắn có cấu trúc phân tử như thế nào?",
    "re": "Chất rắn có cấu trúc phân tử chặt chẽ và cố định"
  },
  {
    "con": "Khi nhiệt độ tăng, thể tích của khí sẽ như thế nào?",
    "re": "Thể tích của khí sẽ tăng lên"
  },
  {
    "con": "Khi một chất hòa tan trong nước, nó sẽ tạo ra dung dịch như thế nào?",
    "re": "Dung dịch sẽ đồng nhất và trong suốt"
  },
  {
    "con": "Phản ứng hóa học xảy ra khi nào?",
    "re": "Khi các liên kết hóa học giữa các nguyên tử bị phá vỡ và hình thành liên kết mới"
  },
  {
    "con": "Khi một chất bị oxi hóa, điều gì xảy ra với electron?",
    "re": "Chất đó sẽ mất electron"
  },
  {
    "con": "Khi một chất bị khử, điều gì xảy ra với electron?",
    "re": "Chất đó sẽ nhận electron"
  },
  {
    "con": "Nước là một hợp chất được tạo thành từ những nguyên tố nào?",
    "re": "Nước được tạo thành từ hydro và oxy"
  },
  {
    "con": "Khi một chất chuyển từ thể rắn sang thể lỏng, điều gì xảy ra?",
    "re": "Chất đó sẽ hấp thụ nhiệt và tăng năng lượng"
  },
  {
    "con": "Khi pH của dung dịch giảm, điều gì xảy ra với tính axit?",
    "re": "Tính axit của dung dịch sẽ tăng lên"
  },
  {
    "con": "Số phân lớp e của lớp M (n = 3) là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một nguyên tố có số proton bằng 6 thì",
    "re": "Nó là nguyên tố carbon"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học",
    "re": "Tăng lên"
  },
  {
    "con": "Một dung dịch có pH < 7 thì",
    "re": "Nó là dung dịch axit"
  },
  {
    "con": "Khi hai nguyên tố kết hợp để tạo thành hợp chất,",
    "re": "Chúng sẽ tạo ra một liên kết hóa học"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn nước,",
    "re": "Chất đó sẽ bay hơi ở nhiệt độ thường"
  },
  {
    "con": "Khi một nguyên tố mất electron,",
    "re": "Nó trở thành ion dương"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kín,",
    "re": "Khối lượng tổng thể sẽ được bảo toàn"
  },
  {
    "con": "Một hợp chất có công thức H2O thì",
    "re": "Nó là nước"
  },
  {
    "con": "Khi một chất bị oxi hóa,",
    "re": "Nó sẽ mất electron"
  },
  {
    "con": "Các nguyên tử nhóm halogen đều có",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là một hợp chất được tạo thành từ hai nguyên tố là hydro và oxy",
    "re": "Nước có công thức hóa học là H2O"
  },
  {
    "con": "Các nguyên tử kim loại thường có xu hướng mất electron",
    "re": "Chúng trở thành ion dương"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng",
    "re": "Phản ứng xảy ra nhanh hơn"
  },
  {
    "con": "Các chất có cùng công thức hóa học nhưng khác cấu trúc gọi là đồng phân",
    "re": "Chúng có thể có tính chất khác nhau"
  },
  {
    "con": "Khi một axit phản ứng với một bazơ, sản phẩm tạo ra là muối và nước",
    "re": "Đây là phản ứng trung hòa"
  },
  {
    "con": "Các nguyên tử trong một phân tử nước được liên kết bằng liên kết cộng hóa trị",
    "re": "Chúng chia sẻ electron"
  },
  {
    "con": "Khi một chất bị nung nóng, nó có thể chuyển từ trạng thái rắn sang lỏng",
    "re": "Quá trình này gọi là nóng chảy"
  },
  {
    "con": "Khi một chất hòa tan trong nước, nó tạo thành dung dịch",
    "re": "Dung dịch có thể dẫn điện nếu chất hòa tan là muối"
  },
  {
    "con": "Các phản ứng hóa học có thể được biểu diễn bằng phương trình hóa học",
    "re": "Phương trình này thể hiện sự bảo toàn khối lượng"
  },
  {
    "con": "Số khối của nguyên tử bằng tổng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nguyên tử có cùng số proton nhưng khác số neutron",
    "re": "Chúng là đồng vị của nhau"
  },
  {
    "con": "Chất có cấu trúc phân tử khác nhau",
    "re": "Chúng có tính chất hóa học khác nhau"
  },
  {
    "con": "Nhiệt độ tăng lên",
    "re": "Tốc độ phản ứng hóa học thường tăng lên"
  },
  {
    "con": "Chất điện phân trong dung dịch",
    "re": "Chúng sẽ dẫn điện"
  },
  {
    "con": "Số electron trong lớp vỏ ngoài cùng bằng 8",
    "re": "Nguyên tử đó ổn định hơn"
  },
  {
    "con": "Phản ứng hóa học xảy ra",
    "re": "Liên kết hóa học giữa các nguyên tử sẽ bị phá vỡ và hình thành liên kết mới"
  },
  {
    "con": "Chất rắn có cấu trúc tinh thể",
    "re": "Chúng có điểm nóng chảy xác định"
  },
  {
    "con": "Chất khí bị nén lại",
    "re": "Thể tích của nó sẽ giảm"
  },
  {
    "con": "Chất lỏng có độ nhớt cao",
    "re": "Chúng chảy chậm hơn chất lỏng có độ nhớt thấp"
  },
  {
    "con": "Trong số các phần tử sau (nguyên tử hoặc ion), phần tử vừa đóng vai trò chất khử, vừa đóng vai trò chất oxi hóa là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất phản ứng với oxy, sản phẩm tạo thành thường là",
    "re": "khí carbon dioxide hoặc nước"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, thì dung dịch đó được coi là",
    "re": "axit"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên, thì động năng của các phân tử trong chất đó",
    "re": "tăng lên"
  },
  {
    "con": "Nếu hai nguyên tố có số electron hóa trị khác nhau, thì chúng có khả năng",
    "re": "tạo thành liên kết hóa học"
  },
  {
    "con": "Khi một chất rắn tan trong nước, thì quá trình này được gọi là",
    "re": "hòa tan"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn các phản ứng ban đầu, thì phản ứng đó là",
    "re": "phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi một chất bị phân hủy thành các chất đơn giản hơn, thì quá trình này được gọi là",
    "re": "phân hủy hóa học"
  },
  {
    "con": "Nếu một dung dịch có nồng độ cao hơn dung dịch khác, thì dung dịch đó được gọi là",
    "re": "dung dịch đậm đặc"
  },
  {
    "con": "Khi một chất chuyển từ trạng thái rắn sang trạng thái lỏng, thì quá trình này được gọi là",
    "re": "chảy"
  },
  {
    "con": "Cho 3,024 gam một kim loại M tan hết trong dung dịch HNO_{3} loãng, thu được 940,8 ml khí N_{x}O_{y} (sản phẩm khử duy nhất, ở đktc) có tỉ khối đối với H_{2} bằng 22. Khí N_{x}O_{y} và kim loại M là?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 1 mol NaCl vào nước, thì dung dịch thu được có tính chất dẫn điện tốt.",
    "re": "Dung dịch NaCl là dung dịch điện ly mạnh."
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C ở áp suất 1 atm, thì chất đó có thể tồn tại dưới dạng khí ở nhiệt độ phòng.",
    "re": "Chất đó có thể là một chất khí."
  },
  {
    "con": "Khi đun nóng một hợp chất hữu cơ, nếu nó phân hủy thành các sản phẩm khí, thì hợp chất đó có thể chứa liên kết C-H.",
    "re": "Hợp chất đó có thể là một hợp chất hữu cơ."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và có sự thay đổi màu sắc, thì có thể có sự hình thành sản phẩm mới.",
    "re": "Phản ứng hóa học đã xảy ra."
  },
  {
    "con": "Khi cho axit vào dung dịch kiềm, nếu có bọt khí thoát ra, thì có thể có sự hình thành muối và nước.",
    "re": "Phản ứng trung hòa đã xảy ra."
  },
  {
    "con": "Nếu một chất rắn không tan trong nước, thì chất đó có thể là một muối không tan.",
    "re": "Chất đó có thể là một muối không tan trong nước."
  },
  {
    "con": "Khi một kim loại phản ứng với axit, nếu có khí thoát ra, thì kim loại đó có thể là một kim loại hoạt động.",
    "re": "Kim loại đó có khả năng phản ứng với axit."
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó là dung dịch axit.",
    "re": "Dung dịch đó có tính axit."
  },
  {
    "con": "Khi một chất bị oxi hóa, nếu nó mất electron, thì chất đó là chất khử.",
    "re": "Chất đó đã bị oxi hóa."
  },
  {
    "con": "Nguyên tử của nguyên tố R có tổng số e, p, n là 177 trong đó có 56 proton. Số notron của R là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước được tạo thành từ hai nguyên tử hydro và một nguyên tử oxy",
    "re": "Công thức hóa học của nước là H2O"
  },
  {
    "con": "Một chất có nhiệt độ sôi thấp hơn 100 độ C ở áp suất 1 atm",
    "re": "Chất đó có thể là một chất lỏng dễ bay hơi"
  },
  {
    "con": "Khi axit phản ứng với bazơ",
    "re": "Sẽ tạo ra muối và nước"
  },
  {
    "con": "Một nguyên tố có số proton là 12",
    "re": "Nguyên tố đó là Magie (Mg)"
  },
  {
    "con": "Khi một chất bị nung nóng và chuyển từ trạng thái rắn sang trạng thái lỏng",
    "re": "Quá trình đó gọi là nóng chảy"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và năng lượng được giải phóng",
    "re": "Phản ứng đó được gọi là phản ứng tỏa nhiệt"
  },
  {
    "con": "Một dung dịch có pH nhỏ hơn 7",
    "re": "Dung dịch đó được coi là axit"
  },
  {
    "con": "Khi một nguyên tử mất một hoặc nhiều electron",
    "re": "Nguyên tử đó trở thành ion dương"
  },
  {
    "con": "Khi hai nguyên tố kết hợp với nhau để tạo thành một hợp chất",
    "re": "Hợp chất đó có tính chất khác biệt so với các nguyên tố thành phần"
  },
  {
    "con": "Hoà tan 20,8 gam hỗn hợp bột gồm FeS, FeS_{2}, S bằng dung dịch HNO_{3} đặc nóng dư thu được 53,76 lít NO_{2} (sản phẩm khử duy nhất, ở đkc và dung dịch A. Cho dung dịch A tác dụng với dung dịch NaOH dư, lọc lấy toàn bộ kết tủa nung trong không khí đến khối lượng không đổi",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nung 1 mol CaCO3 ở nhiệt độ cao sẽ tạo ra 1 mol CaO và 1 mol CO2",
    "re": "Phản ứng phân hủy xảy ra"
  },
  {
    "con": "Khi cho Na vào nước, sẽ xảy ra phản ứng tạo ra NaOH và khí H2",
    "re": "Có khí H2 thoát ra"
  },
  {
    "con": "Khi hòa tan 58,5 gam NaCl vào 1 lít nước, sẽ tạo ra dung dịch NaCl bão hòa",
    "re": "Dung dịch có nồng độ tối đa của NaCl"
  },
  {
    "con": "Khi cho axit HCl tác dụng với NaOH, sẽ tạo ra NaCl và nước",
    "re": "Phản ứng trung hòa xảy ra"
  },
  {
    "con": "Khi đun nóng dung dịch chứa CuSO4, sẽ xảy ra sự phân hủy tạo ra CuO và SO3",
    "re": "Sản phẩm là CuO và SO3"
  },
  {
    "con": "Khi cho khí CO2 vào dung dịch nước vôi trong, sẽ tạo ra kết tủa CaCO3",
    "re": "Có kết tủa trắng xuất hiện"
  },
  {
    "con": "Khi hòa tan 1 mol H2SO4 vào nước, nhiệt độ của dung dịch sẽ tăng lên",
    "re": "Phản ứng tỏa nhiệt xảy ra"
  },
  {
    "con": "Khi cho dung dịch AgNO3 vào dung dịch NaCl, sẽ có kết tủa AgCl xuất hiện",
    "re": "Có kết tủa trắng AgCl"
  },
  {
    "con": "Khi cho dung dịch H2SO4 tác dụng với bột Zn, sẽ tạo ra khí H2 và dung dịch ZnSO4",
    "re": "Có khí H2 thoát ra"
  },
  {
    "con": "Nước có công thức hóa học H2O",
    "re": "Nước là một hợp chất"
  },
  {
    "con": "Chất rắn, lỏng và khí là ba trạng thái của vật chất",
    "re": "Vật chất có thể tồn tại ở nhiều dạng khác nhau"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số nguyên tử tăng dần",
    "re": "Bảng tuần hoàn cung cấp thông tin về tính chất của các nguyên tố"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng",
    "re": "Nhiệt độ ảnh hưởng đến tốc độ phản ứng"
  },
  {
    "con": "Chất điện phân có khả năng dẫn điện khi hòa tan trong nước",
    "re": "Chất điện phân tạo ra ion trong dung dịch"
  },
  {
    "con": "Phản ứng hóa học có thể tạo ra sản phẩm mới",
    "re": "Phản ứng hóa học làm thay đổi cấu trúc của các chất ban đầu"
  },
  {
    "con": "Khối lượng của một hệ thống được bảo toàn trong phản ứng hóa học",
    "re": "Khối lượng phản ứng bằng khối lượng sản phẩm"
  },
  {
    "con": "Các nguyên tử có thể kết hợp với nhau để tạo thành phân tử",
    "re": "Phân tử là đơn vị cấu trúc của hợp chất"
  },
  {
    "con": "Chất xúc tác làm tăng tốc độ phản ứng mà không bị tiêu hao",
    "re": "Chất xúc tác giúp tối ưu hóa quá trình phản ứng"
  },
  {
    "con": "Khi axit và bazơ phản ứng với nhau, chúng tạo ra muối và nước",
    "re": "Phản ứng trung hòa xảy ra giữa axit và bazơ"
  },
  {
    "con": "Đặc điểm nào dưới đây là đặc điểm chung của các nguyên tố halogen (F, Cl, Br, I)",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất có nhiệt độ sôi thấp hơn 100 độ C ở áp suất 1 atm",
    "re": "Chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng"
  },
  {
    "con": "Khi một nguyên tố mất electron",
    "re": "Nguyên tố đó trở thành ion dương"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra",
    "re": "Các liên kết hóa học trong các chất phản ứng bị phá vỡ và các liên kết mới được hình thành"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7",
    "re": "Dung dịch đó được coi là axit"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên",
    "re": "Động năng của các phân tử trong chất đó cũng tăng lên"
  },
  {
    "con": "Nếu một hợp chất chứa nguyên tố carbon và hydro",
    "re": "Hợp chất đó có thể được coi là hợp chất hữu cơ"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion",
    "re": "Chất đó được gọi là chất điện ly"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện không có không khí",
    "re": "Phản ứng đó được gọi là phản ứng yếm khí"
  },
  {
    "con": "Khi một nguyên tố có số electron bằng số proton",
    "re": "Nguyên tố đó là trung hòa về điện"
  },
  {
    "con": "Các phân tử nào sau đây đều có liên kết cộng hoá trị không phân cực:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học H2O:",
    "re": "Nước là một hợp chất"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số nguyên tử tăng dần:",
    "re": "Bảng tuần hoàn có cấu trúc hợp lý"
  },
  {
    "con": "Khi axit phản ứng với bazơ:",
    "re": "Sẽ tạo ra muối và nước"
  },
  {
    "con": "Các nguyên tử có cùng số proton nhưng khác số neutron:",
    "re": "Là đồng vị của nhau"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng:",
    "re": "Do các phân tử có năng lượng cao hơn"
  },
  {
    "con": "Khi một chất bị hòa tan trong nước:",
    "re": "Nó trở thành dung dịch"
  },
  {
    "con": "Các phản ứng hóa học có thể được biểu diễn bằng phương trình hóa học:",
    "re": "Phương trình này cho thấy các chất phản ứng và sản phẩm"
  },
  {
    "con": "Khi một chất cháy trong không khí:",
    "re": "Nó thường tạo ra khí carbon dioxide và nước"
  },
  {
    "con": "Các ion dương có nhiều proton hơn electron:",
    "re": "Chúng mang điện tích dương"
  },
  {
    "con": "Nguyên tử của nguyên tố R có 4 lớp e, lớp ngoài cùng có 1e. Vậy số hiệu nguyên tử của R là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất A có điểm sôi thấp hơn chất B. Vậy chất A có thể bay hơi dễ hơn chất B",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm. Vậy định luật bảo toàn khối lượng được áp dụng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó là axit",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 8, thì nguyên tố đó là oxy",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng. Vậy nhiệt độ có ảnh hưởng đến tốc độ phản ứng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là NaCl, thì hợp chất đó là muối ăn",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tử có 6 proton và 6 neutron, thì nguyên tử đó là cacbon",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện trong dung dịch, thì chất đó có thể là muối hoặc axit",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học tạo ra khí, thì có thể có bọt khí xuất hiện trong quá trình phản ứng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cho 23,7g KMnO_{4} phản ứng hết với dung dịch HCl đặc dư thu được V lít khí Cl_{2} (đktc). Giá trị của V là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Khi một chất tan trong nước tạo thành dung dịch thì nồng độ của dung dịch đó sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí thì sản phẩm thu được sẽ",
    "re": "khác với phản ứng xảy ra trong điều kiện có oxy"
  },
  {
    "con": "Khi pH của dung dịch giảm thì tính axit của dung dịch sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit thì sản phẩm thu được sẽ bao gồm",
    "re": "muối và khí hidro"
  },
  {
    "con": "Khi nhiệt độ của một chất rắn tăng lên thì thể tích của chất đó sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một dung dịch có nồng độ cao được pha loãng thì nồng độ của dung dịch sau khi pha loãng sẽ",
    "re": "giảm xuống"
  },
  {
    "con": "Khi một chất bị oxi hóa thì nó sẽ",
    "re": "mất electron"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch thì sản phẩm có thể",
    "re": "tạo thành chất phản ứng ban đầu"
  },
  {
    "con": "Hòa tan hoàn toàn 0,3g hỗn hợp hai kim lọai X và Y ở hai chu kì liên tiếp của nhóm IA vào nước",
    "re": "thu 0,224 lít khí hidro ở đktc. Hai kim lọai X và Y lần lượt là:"
  },
  {
    "con": "Khi đun nóng nước đến 100 độ C",
    "re": "nước sẽ chuyển thành hơi nước"
  },
  {
    "con": "Khi trộn axit clohidric với natri hidroxit",
    "re": "sẽ xảy ra phản ứng trung hòa tạo ra muối natri clorua và nước"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước",
    "re": "nó sẽ tạo thành dung dịch"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên",
    "re": "độ hòa tan của nhiều chất rắn trong chất lỏng thường tăng"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra",
    "re": "các liên kết hóa học trong các chất phản ứng sẽ bị phá vỡ và tạo ra các sản phẩm mới"
  },
  {
    "con": "Khi một chất khí được làm lạnh",
    "re": "nó có thể chuyển thành chất lỏng"
  },
  {
    "con": "Khi một dung dịch có nồng độ cao được pha loãng",
    "re": "nồng độ của dung dịch sẽ giảm"
  },
  {
    "con": "Khi một kim loại phản ứng với axit",
    "re": "sẽ tạo ra khí hidro và muối"
  },
  {
    "con": "Khi một chất bị oxi hóa",
    "re": "nó sẽ mất electron"
  },
  {
    "con": "Trong phân tử chất A có công thức M_{2}X, có tổng số hạt p, n, e là 140, trong đó số hạt mang điện nhiều hơn số hạt không mang điện là 44 hạt. Số khối của M lớn hơn số khối của X là 23. Tổng số hạt trong nguyên tử M nhiều hơn trong nguyên tử X là 34 hạt. Công thức của A là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn 100 độ C và có thể hòa tan trong nước, thì chất đó có thể là một chất lỏng ở nhiệt độ phòng.",
    "re": "Chất đó có thể là một chất lỏng"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử là 6 và số khối là 12, thì nguyên tố đó là carbon.",
    "re": "Nguyên tố đó là carbon"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và có sự thay đổi màu sắc, thì có thể có sự hình thành sản phẩm mới.",
    "re": "Có thể có sự hình thành sản phẩm mới"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, thì dung dịch đó được coi là axit.",
    "re": "Dung dịch đó được coi là axit"
  },
  {
    "con": "Nếu một nguyên tử có 8 electron ở lớp vỏ ngoài cùng, thì nguyên tử đó là nguyên tử của một khí hiếm.",
    "re": "Nguyên tử đó là nguyên tử của một khí hiếm"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện tốt, thì chất đó có thể chứa các ion tự do.",
    "re": "Chất đó có thể chứa các ion tự do"
  },
  {
    "con": "Nếu một phản ứng hóa học tỏa nhiệt, thì phản ứng đó được gọi là phản ứng tỏa nhiệt.",
    "re": "Phản ứng đó được gọi là phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là NaCl, thì hợp chất đó là muối ăn.",
    "re": "Hợp chất đó là muối ăn"
  },
  {
    "con": "Nếu một chất có điểm nóng chảy cao hơn 100 độ C, thì chất đó có thể là một chất rắn ở nhiệt độ phòng.",
    "re": "Chất đó có thể là một chất rắn"
  },
  {
    "con": "Oxit cao nhất của R là R_{2}O_{5}, trong hợp chất khí của R với hiđro thì hiđro chiếm 17,65% về khối lượng. Nguyên tố R là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học H_{2}O, trong đó tỷ lệ khối lượng của oxy so với hydro là 8:1.",
    "re": "Nước là hợp chất của hydro và oxy"
  },
  {
    "con": "Nếu một nguyên tố có số electron ở lớp ngoài cùng là 7, thì nguyên tố đó thuộc nhóm halogen.",
    "re": "Nguyên tố đó có khả năng tạo thành hợp chất với kim loại"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra mà có sự giải phóng nhiệt, thì phản ứng đó được gọi là phản ứng tỏa nhiệt.",
    "re": "Phản ứng này thường xảy ra trong quá trình đốt cháy"
  },
  {
    "con": "Nếu pH của dung dịch là 7, thì dung dịch đó được coi là trung tính.",
    "re": "Dung dịch này không có tính axit hay kiềm"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là NaCl, thì hợp chất này là muối ăn.",
    "re": "Muối ăn được hình thành từ phản ứng giữa natri và clo"
  },
  {
    "con": "Nếu một nguyên tố có số nguyên tử là 6, thì nguyên tố đó là carbon.",
    "re": "Carbon là nguyên tố cơ bản của sự sống"
  },
  {
    "con": "Nếu một dung dịch có nồng độ axit cao, thì dung dịch đó có khả năng dẫn điện tốt.",
    "re": "Dẫn điện tốt do sự hiện diện của ion"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện không có không khí, thì phản ứng đó được gọi là phản ứng yếm khí.",
    "re": "Phản ứng này thường xảy ra trong môi trường thiếu oxy"
  },
  {
    "con": "Nếu một nguyên tố có tính kim loại mạnh, thì nó có khả năng nhường electron dễ dàng.",
    "re": "Nguyên tố này thường có điểm nóng chảy và điểm sôi cao"
  }
]