[
  {
    "con": "Trong các đặc điểm sau đây, đặc điểm nào không phải là đặc điểm của lực và phản lực",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật chuyển động với vận tốc không đổi, lực tác dụng lên vật đó là",
    "re": "Bằng 0"
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cùng phương và cùng chiều, thì lực tổng hợp sẽ",
    "re": "Bằng tổng của hai lực"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên, thể tích của chất đó sẽ",
    "re": "Tăng lên"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao nhất định, thì vận tốc của vật sẽ",
    "re": "Tăng theo thời gian"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, thì ánh sáng sẽ",
    "re": "Bị khúc xạ"
  },
  {
    "con": "Nếu một điện trở có điện áp không đổi, thì cường độ dòng điện qua điện trở sẽ",
    "re": "Tăng khi điện trở giảm"
  },
  {
    "con": "Khi một vật quay quanh một trục, thì lực hướng tâm tác dụng lên vật đó sẽ",
    "re": "Giữ cho vật không bay ra ngoài"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác, thì trọng lực tác dụng lên vật đó sẽ",
    "re": "Lớn hơn"
  },
  {
    "con": "Khi một sóng âm đi qua không khí và vào nước, thì tần số của sóng sẽ",
    "re": "Không thay đổi"
  },
  {
    "con": "Gọi gia tốc trọng lực trên mặt đất là g0, tại một nơi ở có độ cao 3R (R là bán kính Trái đất) gia tốc trọng trường là g. Tỉ số g/g0 là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chuyển động thẳng đều, thì quãng đường đi được tỉ lệ thuận với thời gian.",
    "re": "Vận tốc của vật là không đổi"
  },
  {
    "con": "Nếu lực tác dụng lên một vật có khối lượng m là F, thì gia tốc a của vật được tính bằng công thức a = F/m.",
    "re": "Gia tốc tỉ lệ thuận với lực và nghịch đảo với khối lượng"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, thì thời gian rơi tỉ lệ với căn bậc hai của độ cao.",
    "re": "Thời gian rơi được tính bằng công thức t = √(2h/g)"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động năng của vật được tính bằng công thức Ek = 1/2 mv².",
    "re": "Động năng tỉ lệ với bình phương vận tốc"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực kéo về F và có độ cản không khí, thì vật sẽ đạt đến vận tốc tối đa khi lực kéo về bằng lực cản.",
    "re": "Vật sẽ chuyển động với vận tốc không đổi"
  },
  {
    "con": "Nếu một lò xo bị nén hoặc kéo dài, thì lực đàn hồi F của lò xo tỉ lệ thuận với độ biến dạng x theo định luật Hooke: F = kx.",
    "re": "k là hằng số đàn hồi của lò xo"
  },
  {
    "con": "Nếu một vật quay quanh một trục với bán kính r và vận tốc góc ω, thì gia tốc hướng tâm a của vật được tính bằng công thức a = ω²r.",
    "re": "Gia tốc hướng tâm tỉ lệ với bình phương vận tốc góc"
  },
  {
    "con": "Nếu một sóng âm có tần số f, thì bước sóng λ của sóng được tính bằng công thức λ = v/f, với v là tốc độ âm thanh.",
    "re": "Bước sóng tỉ lệ nghịch với tần số"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một điện trường E, thì lực tác dụng lên điện tích được tính bằng công thức F = qE.",
    "re": "Lực tỉ lệ với điện tích và cường độ điện trường"
  },
  {
    "con": "Ở những đoạn đường vòng, mặt đường được nâng lên một bên. Việc làm này nhằm mục đích nào kể sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi. Vật đó sẽ có gia tốc như thế nào?",
    "re": "Gia tốc bằng 0"
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng lớn hơn, lực đó sẽ tạo ra gia tốc như thế nào?",
    "re": "Gia tốc sẽ nhỏ hơn"
  },
  {
    "con": "Khi một vật rơi tự do, lực tác dụng lên vật đó là gì?",
    "re": "Lực hấp dẫn"
  },
  {
    "con": "Nếu một vật có khối lượng 2 kg và chịu tác dụng của lực 10 N, thì gia tốc của vật đó sẽ là bao nhiêu?",
    "re": "5 m/s²"
  },
  {
    "con": "Khi một vật di chuyển theo đường thẳng và tốc độ tăng dần, vật đó đang trải qua điều gì?",
    "re": "Gia tốc dương"
  },
  {
    "con": "Nếu một vật có năng lượng tiềm năng lớn, thì vật đó đang ở vị trí nào?",
    "re": "Ở độ cao lớn"
  },
  {
    "con": "Khi một lò xo bị nén hoặc kéo dài, nó sẽ tạo ra lực phục hồi. Lực này có hướng như thế nào?",
    "re": "Hướng về vị trí cân bằng"
  },
  {
    "con": "Nếu một vật quay quanh một điểm cố định, thì lực nào giữ cho vật đó không bay ra ngoài?",
    "re": "Lực hướng tâm"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên, thì năng lượng động học của các phân tử trong vật đó sẽ như thế nào?",
    "re": "Tăng lên"
  },
  {
    "con": "Trong hệ SI, đơn vị của mômen lực là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì",
    "re": "vận tốc của nó không thay đổi theo thời gian"
  },
  {
    "con": "Khi lực tác dụng lên một vật tăng lên thì",
    "re": "gia tốc của vật cũng tăng lên theo định luật II Newton"
  },
  {
    "con": "Nếu một vật rơi tự do thì",
    "re": "vật đó sẽ chịu tác động của trọng lực và gia tốc rơi tự do là 9.81 m/s²"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác thì",
    "re": "tổng động năng của hệ trước và sau va chạm được bảo toàn"
  },
  {
    "con": "Nếu nhiệt độ của một vật tăng lên thì",
    "re": "năng lượng nội tại của vật cũng tăng lên"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước thì",
    "re": "tốc độ ánh sáng giảm và ánh sáng bị khúc xạ"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn thì",
    "re": "lực hấp dẫn tác dụng lên vật đó cũng lớn hơn"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn thì",
    "re": "xung quanh dây dẫn sẽ xuất hiện một từ trường"
  },
  {
    "con": "Nếu một vật có vận tốc lớn hơn thì",
    "re": "động năng của vật đó cũng lớn hơn"
  },
  {
    "con": "Một lò xo có chiều dài tự nhiên là 10cm, độ cứng của lò xo là k = 100 \\frac{N}{m}. Treo thẳng đứng lò xo và móc vào đầu của lò xo một khối lượng m = 100g. Chiều dài của lò xo khi vật cân bằng là bao nhiêu? (Lấy g = 10 \\frac{m}{s^2})",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2kg di chuyển với vận tốc 3m/s. Nếu không có lực tác dụng nào lên vật, thì vận tốc của vật sau 5 giây sẽ là bao nhiêu?",
    "re": "Vận tốc vẫn là 3m/s"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20m. Nếu không có lực cản không khí, thì thời gian vật rơi đến mặt đất là bao nhiêu? (Lấy g = 10 \\frac{m}{s^2})",
    "re": "Thời gian rơi là 2s"
  },
  {
    "con": "Một khối cầu có bán kính 0.5m. Nếu khối cầu này quay với vận tốc góc 2 rad/s, thì vận tốc tuyến tính của điểm trên bề mặt khối cầu là bao nhiêu?",
    "re": "Vận tốc tuyến tính là 1m/s"
  },
  {
    "con": "Một vật có khối lượng 5kg được kéo lên với lực 60N. Nếu lực kéo lớn hơn trọng lực của vật, thì vật sẽ di chuyển theo hướng nào?",
    "re": "Vật sẽ di chuyển lên trên"
  },
  {
    "con": "Một chiếc xe có khối lượng 1000kg đang chạy với vận tốc 20m/s. Nếu lực phanh tác dụng lên xe là 4000N, thì thời gian để xe dừng lại là bao nhiêu? (Lấy g = 10 \\frac{m}{s^2})",
    "re": "Thời gian dừng lại là 5s"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 \\frac{N}{m} bị nén lại 0.1m. Nếu lò xo được thả ra, thì năng lượng tiềm năng đàn hồi của lò xo là bao nhiêu?",
    "re": "Năng lượng tiềm năng đàn hồi là 1J"
  },
  {
    "con": "Một vật có khối lượng 10kg được đặt trên mặt phẳng nghiêng với góc 30 độ. Nếu không có ma sát, thì lực tác dụng lên vật theo phương vuông góc với mặt phẳng nghiêng là bao nhiêu?",
    "re": "Lực tác dụng là 50N"
  },
  {
    "con": "Một dòng điện có cường độ 2A chạy qua một điện trở 5Ω. Nếu điện áp trên điện trở là bao nhiêu?",
    "re": "Điện áp là 10V"
  },
  {
    "con": "Một vật có khối lượng 3kg được ném thẳng đứng lên với vận tốc ban đầu 15m/s. Nếu không có lực cản không khí, thì chiều cao tối đa mà vật đạt được là bao nhiêu? (Lấy g = 10 \\frac{m}{s^2})",
    "re": "Chiều cao tối đa là 11.25m"
  },
  {
    "con": "Một khúc gỗ khối lượng m = 20 kg đặt trên sàn nhà. Người ta kéo khúc gỗ bằng một lực có độ lớn F có hướng chếch lên trên và hợp với phương nằm ngang một góc α = 270 như hình vẽ. Hệ số ma sát  trượt giữa khúc gỗ và sàn nhà là 0,3. Lấy g = 9,8 \\frac{m}{s^2}. Nếu khúc gỗ chuyển động thẳng đều trên sàn nhà thì F gần giá trị nào nhất sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m = 10 kg rơi tự do từ độ cao h = 20 m. Nếu không có lực cản không khí thì vật sẽ chạm đất sau khoảng thời gian nào?",
    "re": "Vật sẽ chạm đất sau khoảng 2,02 giây."
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén một đoạn x = 0,1 m. Nếu lò xo được thả ra thì năng lượng đàn hồi của lò xo là bao nhiêu?",
    "re": "Năng lượng đàn hồi của lò xo là 1 J."
  },
  {
    "con": "Một chiếc xe có khối lượng 800 kg đang chuyển động với vận tốc 20 m/s. Nếu xe phanh lại và dừng lại trong 5 giây thì lực phanh trung bình tác dụng lên xe là bao nhiêu?",
    "re": "Lực phanh trung bình là 3200 N."
  },
  {
    "con": "Một vật có khối lượng 5 kg được treo vào một sợi dây. Nếu vật đứng yên thì lực căng trong dây bằng bao nhiêu?",
    "re": "Lực căng trong dây bằng 49 N."
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu 15 m/s. Nếu lấy g = 9,8 m/s² thì chiều cao tối đa mà quả bóng đạt được là bao nhiêu?",
    "re": "Chiều cao tối đa là 11,5 m."
  },
  {
    "con": "Một dòng điện có cường độ I = 2 A chạy qua một điện trở R = 5 Ω. Nếu điện trở này được nối với nguồn điện thì công suất tiêu thụ của điện trở là bao nhiêu?",
    "re": "Công suất tiêu thụ là 8 W."
  },
  {
    "con": "Một vật có khối lượng 3 kg di chuyển với vận tốc 4 m/s. Nếu vật va chạm hoàn toàn đàn hồi với một vật khác có khối lượng 3 kg đứng yên thì vận tốc của hai vật sau va chạm sẽ là bao nhiêu?",
    "re": "Vận tốc của vật thứ nhất là 0 m/s và vật thứ hai là 4 m/s."
  },
  {
    "con": "Một chiếc xe đạp có khối lượng 15 kg đang chuyển động với vận tốc 10 m/s. Nếu xe dừng lại trong 2 giây thì lực tác dụng lên xe là bao nhiêu?",
    "re": "Lực tác dụng lên xe là 75 N."
  },
  {
    "con": "Một vật có khối lượng 2 kg được đặt trên mặt phẳng nghiêng với góc α = 30°. Nếu hệ số ma sát trượt giữa vật và mặt phẳng là 0,2 thì vật sẽ trượt xuống hay không?",
    "re": "Vật sẽ trượt xuống."
  },
  {
    "con": "Ở thời điểm t = 0, người ta ném một vật từ mặt đất lên trên cao theo phương thẳng đứng với tốc độ v_{0}. Quãng đường vật đi được trong giây đầu tiên là s_{1} và quãng đường vật đi được trong giây cuối cùng trước khi đến độ cao cực đại là s_{2}. Lấy g = 10 \\frac{m}{s^2}. Nếu s_{1} = 6s_{2} thì v0 gần giá trị nào nhất sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật rơi tự do từ độ cao h, nếu không có lực cản của không khí thì vận tốc của vật tăng lên đều theo thời gian. Nếu thời gian rơi là t thì vận tốc cuối cùng v = g * t, với g = 10 \\frac{m}{s^2}.",
    "re": "Vận tốc cuối cùng của vật sẽ là 10t"
  },
  {
    "con": "Khi một vật chuyển động thẳng đều, quãng đường đi được s trong thời gian t được tính bằng công thức s = v * t. Nếu v là vận tốc không đổi thì s sẽ tỷ lệ thuận với t.",
    "re": "Quãng đường s sẽ tăng lên khi thời gian t tăng lên"
  },
  {
    "con": "Khi một vật chịu tác dụng của lực F, nếu khối lượng của vật là m thì theo định luật II Newton, gia tốc a của vật được tính bằng a = \\frac{F}{m}. Nếu F tăng lên gấp đôi thì a cũng sẽ tăng lên gấp đôi.",
    "re": "Gia tốc a sẽ tăng lên gấp đôi"
  },
  {
    "con": "Khi một vật quay quanh một trục với bán kính r và vận tốc góc ω, thì vận tốc tuyến tính v của vật được tính bằng v = r * ω. Nếu bán kính r tăng lên thì vận tốc tuyến tính v cũng sẽ tăng lên.",
    "re": "Vận tốc tuyến tính v sẽ tăng lên khi bán kính r tăng lên"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác, tổng động năng của hệ trước và sau va chạm được bảo toàn. Nếu động năng trước va chạm là E_{1} và sau va chạm là E_{2}, thì E_{1} = E_{2}.",
    "re": "Động năng của hệ sẽ được bảo toàn"
  },
  {
    "con": "Khi một vật được kéo lên cao với lực F, nếu lực này lớn hơn trọng lực của vật thì vật sẽ chuyển động lên. Nếu F > mg thì vật sẽ đi lên.",
    "re": "Vật sẽ chuyển động lên trên"
  },
  {
    "con": "Khi một vật lăn trên mặt phẳng nghiêng, nếu góc nghiêng là θ thì lực kéo xuống theo phương dọc mặt phẳng là F = mg * sin(θ). Nếu góc nghiêng tăng lên thì lực kéo F cũng sẽ tăng lên.",
    "re": "Lực kéo F sẽ tăng lên khi góc nghiêng θ tăng lên"
  },
  {
    "con": "Khi một sóng âm truyền trong không khí, tốc độ của sóng âm v được tính bằng v = f * λ, với f là tần số và λ là bước sóng. Nếu tần số f tăng lên thì bước sóng λ sẽ giảm xuống.",
    "re": "Bước sóng λ sẽ giảm xuống khi tần số f tăng lên"
  },
  {
    "con": "Khi một vật dao động điều hòa, biên độ A là khoảng cách tối đa từ vị trí cân bằng. Nếu biên độ A tăng lên thì năng lượng dao động E sẽ tăng lên theo công thức E = \\frac{1}{2}kA^2.",
    "re": "Năng lượng dao động E sẽ tăng lên khi biên độ A tăng lên"
  },
  {
    "con": "Phương trình chuyển động của một vật là x = 10 - 3t + 0,2t^2 (x tính bằng mét, t tính bằng giây). Tọa độ của vật tại thời điểm t = 2 s là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Thời gian rơi t thì vận tốc của vật tại thời điểm t là",
    "re": "v = gt (vận tốc tính bằng m/s, g = 9,8 m/s²)"
  },
  {
    "con": "Một vật có khối lượng m và chịu tác dụng của lực F. Gia tốc a của vật được tính bằng",
    "re": "a = F/m (gia tốc tính bằng m/s²)"
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính r và vận tốc v, thì lực hướng tâm F được tính bằng",
    "re": "F = mv²/r (lực tính bằng Newton)"
  },
  {
    "con": "Nếu một vật có năng lượng động học K, thì K được tính bằng",
    "re": "K = 1/2 mv² (năng lượng tính bằng Joule)"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác, tổng động lượng trước va chạm bằng",
    "re": "tổng động lượng sau va chạm"
  },
  {
    "con": "Nếu một vật có nhiệt độ T và được làm nóng lên một lượng nhiệt Q, thì sự thay đổi nhiệt độ ΔT được tính bằng",
    "re": "ΔT = Q/(mc) (c là nhiệt dung riêng, m là khối lượng)"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nếu góc tới i thì góc khúc xạ r được tính bằng",
    "re": "n1*sin(i) = n2*sin(r) (n1, n2 là chỉ số khúc xạ của không khí và nước)"
  },
  {
    "con": "Nếu một mạch điện có điện trở R và dòng điện I chạy qua, thì điện áp U được tính bằng",
    "re": "U = IR (điện áp tính bằng Volt)"
  },
  {
    "con": "Khi một sóng âm truyền trong không khí, tốc độ của sóng v phụ thuộc vào",
    "re": "nhiệt độ của không khí"
  },
  {
    "con": "Một thanh chắn đường dài 6 m có khối lượng 80 kg, có trọng tâm ở cách đầu bên trái 1,5m. Thanh có thể quay quanh một trục nằm ngang ở cách đầu bên trái 2 m. Hỏi phải tác dụng vào đầu bên phải một lực bao nhiêu để giữ cho thanh nằm ngang. Lấy g=10 \\frac{m}{s^2}.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 5 kg rơi tự do từ độ cao 20 m. Hỏi thời gian vật rơi xuống đất là bao lâu. Lấy g=10 \\frac{m}{s^2}.",
    "re": "Thời gian rơi là 2 s"
  },
  {
    "con": "Một chiếc xe ô tô di chuyển với vận tốc 20 m/s. Nếu xe tăng tốc với gia tốc 2 m/s² trong 5 giây, thì vận tốc cuối cùng của xe là bao nhiêu.",
    "re": "Vận tốc cuối cùng là 30 m/s"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0,1 m. Hỏi năng lượng tiềm năng trong lò xo là bao nhiêu.",
    "re": "Năng lượng tiềm năng là 1 J"
  },
  {
    "con": "Một vật có khối lượng 10 kg di chuyển với vận tốc 15 m/s. Hỏi động năng của vật là bao nhiêu.",
    "re": "Động năng là 1125 J"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu 20 m/s. Hỏi độ cao tối đa mà quả bóng đạt được là bao nhiêu. Lấy g=10 \\frac{m}{s^2}.",
    "re": "Độ cao tối đa là 20 m"
  },
  {
    "con": "Một vật có khối lượng 2 kg được treo vào một sợi dây. Nếu trọng lực tác dụng lên vật là 20 N, thì lực kéo của sợi dây là bao nhiêu.",
    "re": "Lực kéo của sợi dây là 20 N"
  },
  {
    "con": "Một chiếc xe tải có khối lượng 1000 kg đang di chuyển với vận tốc 10 m/s. Nếu xe dừng lại trong 5 giây, thì lực tác dụng cần thiết để dừng xe là bao nhiêu.",
    "re": "Lực tác dụng là 2000 N"
  },
  {
    "con": "Một vật có khối lượng 3 kg được đặt trên mặt phẳng nghiêng với góc 30 độ. Hỏi lực kéo xuống của vật là bao nhiêu. Lấy g=10 \\frac{m}{s^2}.",
    "re": "Lực kéo xuống là 14,7 N"
  },
  {
    "con": "Một quả cầu có khối lượng 0,5 kg lăn từ độ cao 10 m xuống mặt đất. Hỏi vận tốc của quả cầu khi chạm đất là bao nhiêu. Lấy g=10 \\frac{m}{s^2}.",
    "re": "Vận tốc khi chạm đất là 14 m/s"
  },
  {
    "con": "Để đẩy một con lăn nặng, bán kính R lên bậc thềm, người ta đặt vào nó một lực F theo phương ngang hướng đến trục như hình vẽ. Lực này có độ lớn bằng trọng lượng của con lăn. Độ cao cực đại của bậc thềm gần giá trị nào nhất sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật rơi tự do từ độ cao h, thì tốc độ của vật tại thời điểm chạm đất sẽ phụ thuộc vào độ cao h và gia tốc trọng trường g.",
    "re": "Tốc độ của vật sẽ là v = √(2gh)"
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m, thì gia tốc a của vật sẽ tỉ lệ thuận với lực F và tỉ lệ nghịch với khối lượng m.",
    "re": "Gia tốc a = F/m"
  },
  {
    "con": "Khi một vật chuyển động tròn với vận tốc không đổi, thì lực hướng tâm tác dụng lên vật sẽ tỉ lệ thuận với bình phương vận tốc và tỉ lệ nghịch với bán kính r của đường tròn.",
    "re": "Lực hướng tâm F = mv²/r"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí, thì tốc độ của sóng âm sẽ phụ thuộc vào nhiệt độ của không khí.",
    "re": "Tốc độ sóng âm tăng khi nhiệt độ tăng"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác, thì tổng động năng của hệ trước và sau va chạm sẽ được bảo toàn.",
    "re": "Động năng trước va chạm = Động năng sau va chạm"
  },
  {
    "con": "Khi một vật được nâng lên cao, thì năng lượng tiềm năng của vật sẽ tăng lên theo độ cao h và khối lượng m của vật.",
    "re": "Năng lượng tiềm năng U = mgh"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn, thì dây dẫn sẽ sinh ra một từ trường xung quanh nó.",
    "re": "Từ trường có hướng theo quy tắc bàn tay phải"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác, thì hiện tượng khúc xạ xảy ra và góc khúc xạ sẽ phụ thuộc vào chỉ số khúc xạ của hai môi trường.",
    "re": "Góc khúc xạ θ2 = (n1/n2) * sin(θ1)"
  },
  {
    "con": "Khi một vật dao động điều hòa, thì biên độ dao động sẽ không thay đổi nếu không có lực cản tác dụng lên vật.",
    "re": "Biên độ dao động là hằng số trong điều kiện lý tưởng"
  },
  {
    "con": "Một hòn bi bằng sắt khối lượng 0,2 kg được treo vào móc C của lực kế và lực kế buộc vào sợi dây mềm có khối lượng không đáng kể. Đưa một nam châm lại gần phía dưới hòn bi theo phương thẳng đứng thì số chỉ lực kế là 2,3 N. Lấy g = 9,8 \\frac{m}{s^2}. Độ lớn lực hút nam châm lên hòn bi là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 5 kg được thả rơi tự do từ độ cao 20 m. Nếu không có lực cản thì thời gian rơi của vật là",
    "re": "2,02 giây"
  },
  {
    "con": "Một chiếc xe hơi di chuyển với vận tốc 60 km/h. Nếu xe tăng tốc với gia tốc 2 m/s² thì sau 5 giây, vận tốc của xe sẽ là",
    "re": "70 m/s"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0,1 m. Nếu lò xo được thả ra thì năng lượng đàn hồi của lò xo là",
    "re": "1 J"
  },
  {
    "con": "Một quả bóng có khối lượng 0,5 kg rơi từ độ cao 10 m. Nếu lấy g = 9,8 \\frac{m}{s^2} thì năng lượng thế của quả bóng ở độ cao 10 m là",
    "re": "49 J"
  },
  {
    "con": "Một dòng điện có cường độ 3 A chạy qua một điện trở 4 Ω. Nếu điện trở này được nối với nguồn điện thì công suất tiêu thụ của điện trở là",
    "re": "36 W"
  },
  {
    "con": "Một vật có khối lượng 2 kg di chuyển với vận tốc 3 m/s. Nếu vật va chạm hoàn toàn đàn hồi với một vật khác có khối lượng 2 kg đứng yên thì vận tốc của hai vật sau va chạm sẽ là",
    "re": "1,5 m/s mỗi vật"
  },
  {
    "con": "Một chiếc thuyền có khối lượng 200 kg di chuyển với vận tốc 5 m/s. Nếu thuyền giảm tốc với gia tốc 1 m/s² thì sau 10 giây, vận tốc của thuyền sẽ là",
    "re": "0 m/s"
  },
  {
    "con": "Một vật có khối lượng 1 kg được kéo lên cao với lực 10 N. Nếu chiều cao nâng lên là 2 m thì công thực hiện là",
    "re": "20 J"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz di chuyển trong không khí với tốc độ 340 m/s. Nếu tốc độ sóng giảm xuống còn 300 m/s thì tần số sóng sẽ là",
    "re": "300 Hz"
  },
  {
    "con": "Hai mặt phẳng đỡ tạo với mặt phẳng nằm ngang các góc \\alpha = 350. Trên hai mặt phẳng đó người ta đặt một quả cầu đồng chất có khối lượng 2 kg như hình vẽ. Bỏ qua ma sát và lấy g= 10 \\frac{m}{s^2}. Độ lớn áp lực của quả cầu lên mỗi mặt phẳng đỡ gần giá trị nào nhất sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 5 kg được treo bằng một sợi dây. Nếu trọng lực tác động lên vật là 50 N thì lực kéo trong sợi dây là bao nhiêu?",
    "re": "50 N"
  },
  {
    "con": "Một chiếc xe đang di chuyển với vận tốc 20 m/s. Nếu xe tăng tốc với gia tốc 2 m/s² trong 5 giây thì vận tốc cuối cùng của xe là bao nhiêu?",
    "re": "30 m/s"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu 15 m/s. Nếu lấy g = 10 m/s², thì chiều cao tối đa mà quả bóng đạt được là bao nhiêu?",
    "re": "11.25 m"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20 m. Nếu lấy g = 10 m/s², thời gian vật rơi xuống đất là bao lâu?",
    "re": "2 s"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0.1 m. Nếu tính năng lượng tiềm năng trong lò xo thì giá trị là bao nhiêu?",
    "re": "1 J"
  },
  {
    "con": "Một vật có khối lượng 10 kg di chuyển với vận tốc 5 m/s. Nếu tính động năng của vật thì giá trị là bao nhiêu?",
    "re": "125 J"
  },
  {
    "con": "Một chiếc xe có khối lượng 1000 kg đang chạy với vận tốc 15 m/s. Nếu lực cản của không khí là 300 N, thì lực tổng hợp tác động lên xe khi phanh là bao nhiêu?",
    "re": "-300 N"
  },
  {
    "con": "Một vật có khối lượng 3 kg được đặt trên mặt phẳng nghiêng với góc 30 độ. Nếu bỏ qua ma sát, thì lực tác dụng lên vật theo phương vuông góc với mặt phẳng nghiêng là bao nhiêu?",
    "re": "14.7 N"
  },
  {
    "con": "Một quả cầu có khối lượng 2 kg lăn từ độ cao 5 m xuống mặt đất. Nếu lấy g = 10 m/s², thì vận tốc của quả cầu khi chạm đất là bao nhiêu?",
    "re": "10 m/s"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 \\frac{N}{m}, chiều dài tự nhiên l_{0} = 20 cm, một đầu giữ cố định ở đầu A, đầu kia gắn vào quả cầu khối lượng m = 10 g có thể trượt không ma sát trên thanh Ax nằm ngang (hình vẽ). Thanh Ax quay đều với tốc độ góc \\omega = 20\\pi \\frac{rad}{s} xung quanh trục (\\Delta) thẳng đứng. Tính độ dãn của lò xo.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m = 5 kg được treo vào một lò xo có độ cứng k = 100 \\frac{N}{m}. Nếu vật đứng yên thì lực kéo của lò xo bằng trọng lực của vật.",
    "re": "Lực kéo của lò xo bằng 50 N"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu v_0 = 20 m/s. Nếu không có lực cản thì quả bóng sẽ đạt độ cao tối đa h = \\frac{v_0^2}{2g}.",
    "re": "Độ cao tối đa h = 20.4 m"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v = 10 m/s. Nếu thời gian t = 5 s thì quãng đường s mà vật đi được là s = v \\cdot t.",
    "re": "Quãng đường s = 50 m"
  },
  {
    "con": "Một vật có khối lượng m = 2 kg di chuyển với vận tốc v = 15 m/s. Nếu vật va chạm hoàn toàn đàn hồi với vật khác thì động lượng được bảo toàn.",
    "re": "Động lượng trước va chạm bằng động lượng sau va chạm"
  },
  {
    "con": "Một lò xo bị nén có độ cứng k = 150 \\frac{N}{m} và nén một đoạn x = 0.1 m. Nếu lò xo được thả ra thì năng lượng đàn hồi của lò xo là E = \\frac{1}{2} k x^2.",
    "re": "Năng lượng đàn hồi E = 0.75 J"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h = 20 m. Nếu không có lực cản thì thời gian rơi t = \\sqrt{\\frac{2h}{g}}.",
    "re": "Thời gian rơi t = 2.02 s"
  },
  {
    "con": "Một vật có khối lượng m = 3 kg được đặt trên mặt phẳng nghiêng với góc nghiêng \\theta = 30^\\circ. Nếu không có ma sát thì lực kéo xuống mặt phẳng là F = m g \\sin(\\theta).",
    "re": "Lực kéo F = 14.7 N"
  },
  {
    "con": "Một dòng điện I = 2 A chạy qua một dây dẫn có điện trở R = 5 \\Omega. Nếu điện áp U = I \\cdot R thì điện áp trên dây dẫn là U.",
    "re": "Điện áp U = 10 V"
  },
  {
    "con": "Một vật có khối lượng m = 4 kg đang quay tròn với bán kính r = 2 m và vận tốc v = 8 m/s. Nếu lực hướng tâm F = \\frac{m v^2}{r} thì lực hướng tâm là F.",
    "re": "Lực hướng tâm F = 128 N"
  },
  {
    "con": "Dưới tác dụng của một lực 20 N, một vật chuyển động với gia tốc 0,4 \\frac{m}{s^2}. Hỏi vật đó chuyển động với gia tốc bằng bao nhiêu nếu lực tác dụng bằng 50 N?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 10 kg và chịu tác dụng của một lực 30 N, thì gia tốc của vật đó sẽ là bao nhiêu?",
    "re": "Gia tốc của vật là 3 \\frac{m}{s^2}"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao 20 m, thì thời gian để vật chạm đất sẽ là bao nhiêu?",
    "re": "Thời gian rơi là khoảng 2 \\sqrt{2} \\approx 6,32 s"
  },
  {
    "con": "Nếu một lò xo có độ cứng k = 200 N/m bị nén 0,1 m, thì năng lượng tiềm năng trong lò xo sẽ là bao nhiêu?",
    "re": "Năng lượng tiềm năng là 1 J"
  },
  {
    "con": "Nếu một vật có vận tốc 15 m/s va chạm với một vật khác đứng yên và dừng lại hoàn toàn, thì vật kia sẽ chuyển động với vận tốc bao nhiêu?",
    "re": "Vật kia sẽ chuyển động với vận tốc 15 m/s"
  },
  {
    "con": "Nếu một điện trở có giá trị 10 Ω và dòng điện chạy qua nó là 2 A, thì điện áp trên điện trở sẽ là bao nhiêu?",
    "re": "Điện áp là 20 V"
  },
  {
    "con": "Nếu một vật có khối lượng 5 kg di chuyển với vận tốc 10 m/s, thì động năng của vật đó sẽ là bao nhiêu?",
    "re": "Động năng là 250 J"
  },
  {
    "con": "Nếu một vật có khối lượng 2 kg được nâng lên cao 5 m, thì công thực hiện để nâng vật đó sẽ là bao nhiêu?",
    "re": "Công thực hiện là 100 J"
  },
  {
    "con": "Nếu một sóng âm có tần số 440 Hz và tốc độ truyền sóng là 340 m/s, thì bước sóng của sóng âm đó sẽ là bao nhiêu?",
    "re": "Bước sóng là 0,773 m"
  },
  {
    "con": "Nếu một vật có khối lượng 1 kg và chịu tác dụng của lực 9,8 N, thì gia tốc của vật đó sẽ là bao nhiêu?",
    "re": "Gia tốc của vật là 9,8 \\frac{m}{s^2}"
  },
  {
    "con": "Một vệ tinh nhân tạo khối lượng m bay quanh Trái Đất ở độ cao h = \\frac{R}{2} (R bán kính Trái Đất). T là chu kì quay của Trái Đất. Để vệ tinh luôn đứng yên với một điểm trên Trái Đất, thì lực hướng tâm của vệ tinh là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h, thì thời gian rơi t sẽ được tính bằng công thức t = \\sqrt{\\frac{2h}{g}} với g là gia tốc trọng trường",
    "re": "Thời gian rơi t sẽ tăng khi độ cao h tăng"
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m, thì gia tốc a của vật sẽ được tính bằng công thức a = \\frac{F}{m}",
    "re": "Gia tốc a sẽ tăng khi lực F tăng hoặc khối lượng m giảm"
  },
  {
    "con": "Khi một vật chuyển động tròn với vận tốc không đổi, thì lực hướng tâm tác dụng lên vật sẽ được tính bằng công thức F = \\frac{mv^2}{r}",
    "re": "Lực hướng tâm F sẽ tăng khi vận tốc v tăng hoặc bán kính r giảm"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, thì hiện tượng khúc xạ xảy ra với góc khúc xạ nhỏ hơn góc tới",
    "re": "Ánh sáng sẽ bị bẻ cong về phía pháp tuyến"
  },
  {
    "con": "Khi một vật dao động điều hòa với biên độ A và tần số f, thì năng lượng dao động E sẽ được tính bằng công thức E = \\frac{1}{2}kA^2 với k là độ cứng của lò xo",
    "re": "Năng lượng E sẽ tăng khi biên độ A tăng"
  },
  {
    "con": "Khi một điện trở R được nối với một nguồn điện có hiệu điện thế U, thì cường độ dòng điện I chạy qua điện trở sẽ được tính bằng công thức I = \\frac{U}{R}",
    "re": "Cường độ dòng điện I sẽ tăng khi hiệu điện thế U tăng hoặc điện trở R giảm"
  },
  {
    "con": "Khi một vật được ném lên với vận tốc ban đầu v0, thì độ cao cực đại h mà vật đạt được sẽ được tính bằng công thức h = \\frac{v_0^2}{2g}",
    "re": "Độ cao cực đại h sẽ tăng khi vận tốc ban đầu v0 tăng"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí, thì tốc độ của sóng âm sẽ phụ thuộc vào nhiệt độ của không khí",
    "re": "Tốc độ sóng âm sẽ tăng khi nhiệt độ không khí tăng"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác, thì tổng động năng của hệ sẽ được bảo toàn",
    "re": "Động năng của hệ sẽ không thay đổi trong va chạm đàn hồi"
  },
  {
    "con": "Bỏ qua lực cản không khí, lấy g = 10 \\frac{m}{s^2}. Tại cùng vị trí O, ném hai vật theo phương ngang với các tốc độ 16 \\frac{m}{s} và 25 \\frac{m}{s} cùng phương nhưng ngược chiều nhau. Cho đến khi vec-tơ vận tốc của hai vật vuông góc với nhau thì chúng chưa chạm đất và đang ở các vị trí A và B. Diện tích của tam giác OAB bằng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Nếu bỏ qua lực cản không khí, thời gian rơi của vật là t thì h = \\frac{1}{2} g t^2.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động năng của vật được tính bằng công thức E_k = \\frac{1}{2} m v^2.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một lực F tác dụng lên một vật có khối lượng m và gây ra gia tốc a, thì theo định luật II Newton, F = m a.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chuyển động tròn đều với bán kính r và vận tốc v, thì gia tốc hướng tâm a_t = \\frac{v^2}{r}.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cùng phương và cùng chiều, thì tổng hợp lực là tổng của hai lực đó.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật được ném lên với vận tốc ban đầu v_0 và góc ném θ, thì chiều cao cực đại mà vật đạt được là h = \\frac{v_0^2 \\sin^2(θ)}{2g}.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v và va chạm hoàn toàn đàn hồi với một vật khác có khối lượng m', thì tổng động năng trước và sau va chạm là như nhau.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sóng âm có tần số f và vận tốc truyền trong không khí là v, thì bước sóng λ được tính bằng công thức λ = \\frac{v}{f}.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật được treo vào một lò xo và lò xo bị kéo dài một khoảng x, thì lực đàn hồi của lò xo được tính bằng công thức F = -k x, với k là độ cứng của lò xo.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Quả cầu có khối lượng m = 500 g treo ở đầu A của dây OA dài 90 cm. Quay cho quả cầu chuyển động tròn trong mặt phẳng thẳng đứng quanh tâm O. Tìm lực căng dây khi A ở vị trí thấp hơn O, OA hợp với phương thẳng đứng góc 600 và tốc độ quả cầu là 3 \\frac{m}{s}. Lấy g = 10 \\frac{m}{s^2}.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2 kg được thả rơi tự do từ độ cao 20 m. Lấy g = 10 \\frac{m}{s^2}.",
    "re": "Thời gian rơi của vật là 2 s"
  },
  {
    "con": "Một chiếc xe có khối lượng 1000 kg di chuyển với vận tốc 20 m/s. Khi phanh, xe dừng lại trong 5 s.",
    "re": "Lực phanh tác động lên xe là 4000 N"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0.1 m.",
    "re": "Năng lượng tích trữ trong lò xo là 1 J"
  },
  {
    "con": "Một vật có khối lượng 3 kg được kéo lên cao với lực 30 N.",
    "re": "Vật đang chịu tác động của lực trọng trường 29.4 N"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu 15 m/s. Lấy g = 10 \\frac{m}{s^2}.",
    "re": "Quả bóng đạt độ cao tối đa 11.25 m"
  },
  {
    "con": "Một vật có khối lượng 5 kg di chuyển với vận tốc 10 m/s va chạm với một vật khác đứng yên có khối lượng 5 kg.",
    "re": "Sau va chạm, hai vật gắn lại với nhau và di chuyển với vận tốc 5 m/s"
  },
  {
    "con": "Một dòng điện có cường độ 2 A chạy qua một điện trở 10 Ω.",
    "re": "Điện áp trên điện trở là 20 V"
  },
  {
    "con": "Một vật có khối lượng 4 kg được đặt trên mặt phẳng nghiêng với góc 30 độ.",
    "re": "Lực tác dụng lên vật theo phương song song với mặt phẳng là 20 N"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz di chuyển trong không khí với tốc độ 340 m/s.",
    "re": "Chiều dài sóng là 0.773 m"
  },
  {
    "con": "Vào thời điểm t_{0} = 0, một viên bi lăn từ chân một máng nghiêng lên phía trên. Viên bi này đi qua vị trí cách chân mặt phẳng nghiêng 4 m vào 2 thời điểm t_{1} = 1 s và t_{2} = 2 s. Lấy g = 10 \\frac{m}{s^2}, bỏ qua mọi ma sát và lực cản. Góc nghiêng của máng so với mặt phẳng nằm ngang gần giá trị nào nhất sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật rơi tự do từ độ cao h, thì thời gian rơi t sẽ được tính bằng công thức t = \\sqrt{\\frac{2h}{g}}.",
    "re": "Thời gian rơi t sẽ tăng khi độ cao h tăng."
  },
  {
    "con": "Nếu một lực F tác dụng lên một vật có khối lượng m, thì gia tốc a của vật sẽ được tính bằng công thức a = \\frac{F}{m}.",
    "re": "Gia tốc a sẽ tăng khi lực F tăng hoặc khối lượng m giảm."
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính r và vận tốc v, thì lực hướng tâm F sẽ được tính bằng công thức F = \\frac{mv^2}{r}.",
    "re": "Lực hướng tâm F sẽ tăng khi vận tốc v tăng."
  },
  {
    "con": "Nếu một vật va chạm đàn hồi với một vật khác, thì tổng động năng trước và sau va chạm sẽ được bảo toàn.",
    "re": "Động năng sẽ không thay đổi trong va chạm đàn hồi."
  },
  {
    "con": "Khi một vật được kéo lên cao với một lực F, thì công W thực hiện bởi lực F sẽ được tính bằng công thức W = F \\cdot d \\cdot cos(\\theta), với d là khoảng cách và \\theta là góc giữa lực và hướng chuyển động.",
    "re": "Công W sẽ tăng khi khoảng cách d tăng hoặc lực F tăng."
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động lượng p của vật sẽ được tính bằng công thức p = mv.",
    "re": "Động lượng p sẽ tăng khi khối lượng m hoặc vận tốc v tăng."
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác, thì hiện tượng khúc xạ xảy ra theo định luật Snell: n_1 \\sin(\\theta_1) = n_2 \\sin(\\theta_2).",
    "re": "Góc khúc xạ \\theta_2 sẽ thay đổi khi chỉ số khúc xạ n_1 hoặc n_2 thay đổi."
  },
  {
    "con": "Nếu một vật dao động điều hòa với biên độ A và tần số f, thì phương trình dao động sẽ được mô tả bởi x(t) = A \\sin(2\\pi ft + \\phi).",
    "re": "Biên độ A sẽ ảnh hưởng đến độ lớn của dao động."
  },
  {
    "con": "Khi một dòng điện I chạy qua một dây dẫn có điện trở R, thì công suất P sẽ được tính bằng công thức P = I^2R.",
    "re": "Công suất P sẽ tăng khi dòng điện I tăng."
  },
  {
    "con": "Từ độ cao h = 80 m so với mặt đất, một vật nhỏ được ném ngang với tốc độ ban đầu v_{0} = 20 \\frac{m}{s}. Bỏ qua sức cản của không khí. Lấy gia tốc rơi tự do g = 10 \\frac{m}{s^2}. Chọn gốc thời gian là khi ném vật. Véctơ vận tốc của vật hợp với phương thẳng đứng một góc \\alpha = 60\\circ vào thời điểm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m = 5 kg được treo lơ lửng bằng một sợi dây. Lực kéo của dây là T. Nếu vật không chuyển động, thì T = mg",
    "re": "T = 50 N"
  },
  {
    "con": "Một chiếc xe ô tô di chuyển với vận tốc v = 30 \\frac{m}{s} trên một đoạn đường thẳng. Nếu xe phanh lại và dừng lại trong thời gian t = 5 s, thì gia tốc a của xe là",
    "re": "a = -6 \\frac{m}{s^2}"
  },
  {
    "con": "Một viên bi lăn trên mặt phẳng nghiêng với góc nghiêng \\theta = 30\\circ. Nếu không có ma sát, thì gia tốc của viên bi là",
    "re": "a = g \\sin(30\\circ) = 5 \\frac{m}{s^2}"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h = 20 m. Nếu bỏ qua sức cản của không khí, thì thời gian t để vật chạm đất là",
    "re": "t = \\sqrt{\\frac{2h}{g}} = 2 \\sqrt{2} \\approx 2.83 s"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén một đoạn x = 0.1 m. Nếu lò xo được thả ra, thì năng lượng đàn hồi E của lò xo là",
    "re": "E = \\frac{1}{2} k x^2 = 1 J"
  },
  {
    "con": "Một vật có khối lượng m = 10 kg di chuyển với vận tốc v = 15 \\frac{m}{s}. Nếu vật va chạm hoàn toàn đàn hồi với một vật khác có khối lượng m' = 10 kg đứng yên, thì vận tốc của vật sau va chạm là",
    "re": "v' = 7.5 \\frac{m}{s}"
  },
  {
    "con": "Một dòng điện có cường độ I = 2 A chạy qua một điện trở R = 5 \\Omega. Nếu điện áp U giữa hai đầu điện trở là",
    "re": "U = IR = 10 V"
  },
  {
    "con": "Một vật có khối lượng m = 3 kg được kéo lên cao với gia tốc a = 2 \\frac{m}{s^2}. Nếu bỏ qua sức cản của không khí, thì lực kéo F cần thiết là",
    "re": "F = m(g + a) = 30 N"
  },
  {
    "con": "Một sóng âm có tần số f = 440 Hz. Nếu tốc độ âm thanh trong không khí là v = 340 \\frac{m}{s}, thì bước sóng \\lambda của sóng âm là",
    "re": "\\lambda = \\frac{v}{f} \\approx 0.773 m"
  },
  {
    "con": "Một chiếc thước mảnh có trục quay nằm ngang đi qua trọng tâm O của thước. Tác dụng vào hai điểm A và B của thước cách nhau 4,5 cm một ngẫu lực theo phương ngang với độ lớn F_{1} = F_{1} = 5 N. Độ lớn mômen của ngẫu lực khi thước đang ở vị trí thẳng đứng là m_{1} và khi thước ở vị trí hợp với phương thẳng đứng góc \\alpha = 60\\circ là M_{2}. Giá trị của (M_{1} + M_{2} ) gần giá trị nào nhất sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m rơi tự do từ độ cao h. Nếu không có lực cản của không khí, thì vật sẽ đạt được vận tốc tối đa v = \\sqrt{2gh} khi chạm đất.",
    "re": "Vận tốc tối đa v = \\sqrt{2gh}"
  },
  {
    "con": "Nếu một lực F tác dụng lên một vật có khối lượng m, thì gia tốc a của vật sẽ được tính bằng công thức a = \\frac{F}{m}.",
    "re": "Gia tốc a = \\frac{F}{m}"
  },
  {
    "con": "Nếu một vật chuyển động tròn với bán kính r và vận tốc v, thì lực hướng tâm F_{c} tác dụng lên vật được tính bằng công thức F_{c} = \\frac{mv^2}{r}.",
    "re": "Lực hướng tâm F_{c} = \\frac{mv^2}{r}"
  },
  {
    "con": "Nếu một vật va chạm đàn hồi với một vật khác, thì tổng động năng của hệ trước và sau va chạm sẽ được bảo toàn.",
    "re": "Tổng động năng được bảo toàn"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v và dừng lại, thì công thực hiện để dừng vật là W = \\frac{1}{2}mv^2.",
    "re": "Công W = \\frac{1}{2}mv^2"
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cân bằng, thì vật sẽ không thay đổi trạng thái chuyển động.",
    "re": "Vật không thay đổi trạng thái chuyển động"
  },
  {
    "con": "Nếu một chiếc xe hơi đang chạy với vận tốc v và phanh lại, thì khoảng cách d cần thiết để dừng xe phụ thuộc vào vận tốc và lực phanh.",
    "re": "Khoảng cách d phụ thuộc vào vận tốc và lực phanh"
  },
  {
    "con": "Nếu một sóng âm truyền qua không khí, thì tốc độ của sóng âm phụ thuộc vào nhiệt độ của không khí.",
    "re": "Tốc độ sóng âm phụ thuộc vào nhiệt độ"
  },
  {
    "con": "Nếu một vật được nâng lên cao h trong trường trọng lực, thì công thực hiện để nâng vật là W = mgh.",
    "re": "Công W = mgh"
  },
  {
    "con": "Động năng của một vật khối lượng m, chuyển động với vận tốc v là:",
    "re": "1/2 * m * v^2"
  },
  {
    "con": "Lực hấp dẫn giữa hai vật có khối lượng m1 và m2 cách nhau khoảng cách r là:",
    "re": "G * (m1 * m2) / r^2"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực không đổi F trong thời gian t, thì:",
    "re": "vận tốc của vật sẽ thay đổi theo công thức v = v0 + (F/m) * t"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, thì:",
    "re": "thời gian rơi t được tính bằng công thức t = sqrt(2h/g)"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v và va chạm hoàn toàn đàn hồi với vật khác, thì:",
    "re": "tổng động năng trước và sau va chạm sẽ được bảo toàn"
  },
  {
    "con": "Nếu một vật được kéo lên cao với lực F và chiều cao h, thì:",
    "re": "công thực hiện là W = F * h"
  },
  {
    "con": "Nếu một sóng có tần số f và bước sóng λ, thì:",
    "re": "vận tốc sóng v được tính bằng công thức v = f * λ"
  },
  {
    "con": "Nếu một điện trở R có dòng điện I chạy qua, thì:",
    "re": "công suất P được tính bằng công thức P = I^2 * R"
  },
  {
    "con": "Nếu một vật có khối lượng m được đặt trên mặt phẳng nghiêng với góc θ, thì:",
    "re": "lực tác dụng lên vật theo phương vuông góc với mặt phẳng là F = m * g * cos(θ)"
  },
  {
    "con": "Nếu một vật dao động điều hòa với biên độ A và tần số f, thì:",
    "re": "phương trình dao động là x(t) = A * cos(2πft + φ)"
  },
  {
    "con": "Một quả bóng được ném theo phương ngang với vận tốc đầu có độ lớn là v_{o} = 20\\frac{m}{s} từ độ cao 45m và rơi xuống đất sau 3s. Lấy g = 10\\frac{m}{s^2} và bỏ qua sức cản của không khí. Tầm bay xa (theo phương ngang) của quả bóng bằng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m = 2kg được treo vào một lò xo có độ cứng k = 100\\frac{N}{m}. Khi vật ở trạng thái cân bằng, độ giãn của lò xo là",
    "re": "0.2m"
  },
  {
    "con": "Một chiếc xe ô tô di chuyển với vận tốc không đổi 60\\frac{km}{h} trong 2 giờ. Quãng đường mà xe ô tô đi được là",
    "re": "120km"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h = 80m. Thời gian để vật chạm đất là",
    "re": "4s"
  },
  {
    "con": "Một quả cầu có khối lượng 0.5kg va chạm hoàn toàn đàn hồi với một quả cầu khác có khối lượng 1kg đang đứng yên. Nếu quả cầu 0.5kg có vận tốc 10\\frac{m}{s} trước va chạm, thì vận tốc của quả cầu 1kg sau va chạm là",
    "re": "5\\frac{m}{s}"
  },
  {
    "con": "Một vật có khối lượng 3kg chịu tác dụng của lực 12N. Gia tốc của vật là",
    "re": "4\\frac{m}{s^2}"
  },
  {
    "con": "Một chiếc thuyền di chuyển với vận tốc 5\\frac{m}{s} trên mặt nước. Nếu thuyền gặp dòng nước chảy ngược với vận tốc 2\\frac{m}{s}, thì vận tốc thực tế của thuyền so với bờ là",
    "re": "3\\frac{m}{s}"
  },
  {
    "con": "Một vật có khối lượng 1kg được kéo lên cao với lực 10N. Công thực hiện để nâng vật lên cao 2m là",
    "re": "20J"
  },
  {
    "con": "Một lò xo có độ cứng k = 200\\frac{N}{m} bị nén lại 0.1m. Năng lượng tiềm năng đàn hồi trong lò xo là",
    "re": "1J"
  },
  {
    "con": "Một vật có khối lượng 2kg chuyển động với vận tốc 3\\frac{m}{s}. Động năng của vật là",
    "re": "9J"
  },
  {
    "con": "Một chiếc xe đang chạy với tốc độ dài 36 \\frac{km}{h} trên một đường tròn có bán kính 100 m. Độ lớn gia tốc hướng tâm của xe là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20 m. Thời gian để vật chạm đất là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một lò xo bị nén với độ biến dạng 0.5 m. Lực đàn hồi của lò xo là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2 kg di chuyển với vận tốc 3 m/s. Động lượng của vật là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chiếc xe tải và một chiếc xe đạp va chạm. Lực tác động lên hai xe là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 5 kg được treo trên một sợi dây. Lực kéo của dây là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu 15 m/s. Chiều cao tối đa mà quả bóng đạt được là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc 10 m/s. Quãng đường đi được sau 5 giây là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chiếc xe đang phanh với gia tốc -4 m/s². Thời gian để xe dừng lại từ vận tốc 20 m/s là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 10 kg và được tác động bởi lực 50 N. Gia tốc của vật là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Biểu thức nào sau đây là biểu thức momen lực đối với một trục quay?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì vận tốc của nó không thay đổi.",
    "re": "Vật sẽ di chuyển với tốc độ không đổi"
  },
  {
    "con": "Khi lực tác dụng lên một vật lớn hơn lực ma sát thì vật sẽ bắt đầu chuyển động.",
    "re": "Vật sẽ di chuyển theo hướng của lực tác dụng"
  },
  {
    "con": "Nếu một vật rơi tự do thì gia tốc của nó là gia tốc trọng trường.",
    "re": "Gia tốc này có giá trị khoảng 9.81 m/s²"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên thì thể tích của chất khí sẽ tăng.",
    "re": "Điều này xảy ra theo định luật Charles"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn thì nó sẽ có trọng lực lớn hơn.",
    "re": "Trọng lực tỉ lệ thuận với khối lượng"
  },
  {
    "con": "Khi một vật va chạm với một vật khác và không có lực bên ngoài tác động thì tổng động lượng được bảo toàn.",
    "re": "Điều này được gọi là định luật bảo toàn động lượng"
  },
  {
    "con": "Nếu một vật được nâng lên cao thì nó có năng lượng tiềm năng lớn hơn.",
    "re": "Năng lượng tiềm năng tỉ lệ thuận với độ cao"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước thì nó sẽ bị khúc xạ.",
    "re": "Góc khúc xạ sẽ nhỏ hơn góc tới"
  },
  {
    "con": "Nếu một dòng điện chạy qua một dây dẫn thì nó sẽ tạo ra một từ trường xung quanh dây dẫn đó.",
    "re": "Hiện tượng này được gọi là hiệu ứng từ trường"
  },
  {
    "con": "Hệ số ma sát trượt",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Lực tác dụng lên một vật",
    "re": "Vật sẽ thay đổi vận tốc của nó"
  },
  {
    "con": "Năng lượng được bảo toàn trong một hệ kín",
    "re": "Tổng năng lượng trước và sau sẽ bằng nhau"
  },
  {
    "con": "Khối lượng của một vật",
    "re": "Tỉ lệ với trọng lực tác dụng lên vật đó"
  },
  {
    "con": "Lực hấp dẫn giữa hai vật",
    "re": "Tăng khi khoảng cách giữa chúng giảm"
  },
  {
    "con": "Nhiệt độ tăng",
    "re": "Năng lượng động học của các phân tử trong vật tăng"
  },
  {
    "con": "Áp suất trong chất lỏng",
    "re": "Tăng khi độ sâu của chất lỏng tăng"
  },
  {
    "con": "Định luật bảo toàn động lượng",
    "re": "Tổng động lượng của một hệ kín không thay đổi"
  },
  {
    "con": "Tia sáng đi qua không khí vào nước",
    "re": "Sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Công thực hiện bởi lực",
    "re": "Bằng tích của lực và quãng đường đi theo hướng của lực"
  },
  {
    "con": "Vật m_{1}= 1 kg chuyển động với vận tốc v_{1} đến va chạm mềm vào vật m_{2} = 2kg đang nằm yên. Ngay sau va chạm vận tốc vật m_{2} là v_{2} = 2\\frac{m}{s}. Tính vận tốc vật m_{1}?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Nếu h = 20 m thì thời gian rơi t sẽ là khoảng 2\\sqrt{h/5} giây.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng m = 2 kg chịu tác dụng của lực F = 10 N, thì gia tốc a của vật sẽ là a = \\frac{F}{m} = 5\\frac{m}{s^2}.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có vận tốc ban đầu v_{0} = 0 và chịu tác dụng của lực kéo xuống g = 9.8\\frac{m}{s^2}, thì vận tốc sau t giây sẽ là v = g \\cdot t.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một lò xo có độ cứng k = 200 N/m bị nén một đoạn x = 0.1 m, thì lực đàn hồi F sẽ là F = k \\cdot x = 20 N.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng m = 3 kg di chuyển với vận tốc v = 4 m/s, thì động năng K của vật sẽ là K = \\frac{1}{2}mv^2 = 24 J.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng m = 5 kg được nâng lên cao h = 10 m, thì năng lượng thế G sẽ là G = mgh = 490 J.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật quay quanh một trục với bán kính r và vận tốc góc \\omega, thì vận tốc tuyến tính v sẽ là v = r \\cdot \\omega.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sóng âm có tần số f = 440 Hz và vận tốc âm thanh v = 340 m/s, thì bước sóng \\lambda sẽ là \\lambda = \\frac{v}{f} \\approx 0.773 m.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng m = 1 kg và vận tốc v = 10 m/s va chạm với một vật khác có khối lượng m' = 2 kg đang đứng yên, thì tổng động lượng trước va chạm sẽ bằng tổng động lượng sau va chạm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Phương trình chuyển động của một chất điểm dọc theo trục Ox có dạng: x = 4 – 10t (x đo bằng kilômét và t đo bằng giờ). Quãng đường đi được của chất điểm sau 2h chuyển động là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h, thì thời gian rơi t được tính bằng công thức t = √(2h/g) với g là gia tốc trọng trường",
    "re": "Thời gian rơi t sẽ tăng khi độ cao h tăng"
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m, thì gia tốc a của vật được tính bằng công thức F = ma",
    "re": "Gia tốc a sẽ tăng khi lực F tăng hoặc khối lượng m giảm"
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính r và tốc độ v, thì lực hướng tâm Fh được tính bằng công thức Fh = mv²/r",
    "re": "Lực hướng tâm Fh sẽ tăng khi tốc độ v tăng"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, thì hiện tượng khúc xạ xảy ra",
    "re": "Góc khúc xạ sẽ nhỏ hơn góc tới"
  },
  {
    "con": "Khi một điện trở R được nối với một nguồn điện có hiệu điện thế U, thì cường độ dòng điện I qua điện trở được tính bằng công thức I = U/R",
    "re": "Cường độ dòng điện I sẽ tăng khi hiệu điện thế U tăng"
  },
  {
    "con": "Khi một vật dao động điều hòa với biên độ A và tần số f, thì năng lượng dao động E được tính bằng công thức E = (1/2)kA² với k là độ cứng của lò xo",
    "re": "Năng lượng E sẽ tăng khi biên độ A tăng"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí, thì tốc độ của sóng âm v được tính bằng công thức v = fλ với f là tần số và λ là bước sóng",
    "re": "Tốc độ sóng âm v sẽ tăng khi tần số f tăng và bước sóng λ giảm"
  },
  {
    "con": "Khi một vật bị nén trong lò xo, thì năng lượng tiềm năng đàn hồi Epe được tính bằng công thức Epe = (1/2)kx² với k là độ cứng của lò xo và x là độ biến dạng",
    "re": "Năng lượng tiềm năng Epe sẽ tăng khi độ biến dạng x tăng"
  },
  {
    "con": "Khi một vật chuyển động thẳng đều, thì quãng đường s được tính bằng công thức s = vt với v là vận tốc và t là thời gian",
    "re": "Quãng đường s sẽ tăng khi vận tốc v hoặc thời gian t tăng"
  },
  {
    "con": "Hai chất điểm bất kì hút nhau với một lực",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Một vật rơi tự do trong môi trường không có sức cản",
    "re": "Vật sẽ tăng tốc đều với gia tốc g"
  },
  {
    "con": "Năng lượng không thể tự sinh ra hoặc mất đi",
    "re": "Năng lượng luôn được bảo toàn"
  },
  {
    "con": "Một vật có khối lượng lớn hơn sẽ có trọng lực lớn hơn",
    "re": "Lực hấp dẫn giữa hai vật tỉ lệ thuận với khối lượng của chúng"
  },
  {
    "con": "Một vật dao động điều hòa",
    "re": "Có biên độ và tần số xác định"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên",
    "re": "Thể tích của chất khí sẽ tăng nếu áp suất không đổi"
  },
  {
    "con": "Một dòng điện chạy qua một dây dẫn",
    "re": "Tạo ra một từ trường xung quanh dây dẫn"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác",
    "re": "Ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Một vật có động năng",
    "re": "Có khả năng thực hiện công do chuyển động của nó"
  },
  {
    "con": "Chọn công thức đúng của tọa độ chất điểm chuyển động thẳng đều?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi?",
    "re": "Quỹ đạo của nó là một đường thẳng"
  },
  {
    "con": "Lực tác dụng lên một vật không thay đổi?",
    "re": "Vật sẽ duy trì trạng thái chuyển động của nó"
  },
  {
    "con": "Năng lượng không được tạo ra hay tiêu hủy?",
    "re": "Năng lượng tổng trong một hệ kín là hằng số"
  },
  {
    "con": "Một vật rơi tự do trong môi trường không có sức cản?",
    "re": "Vật sẽ tăng tốc với gia tốc bằng gia tốc trọng trường"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên?",
    "re": "Thể tích của chất khí sẽ tăng nếu áp suất không đổi"
  },
  {
    "con": "Một dòng điện chạy qua một dây dẫn có điện trở?",
    "re": "Sẽ sinh ra nhiệt lượng theo định luật Joule"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước?",
    "re": "Tốc độ ánh sáng sẽ giảm và ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Một vật có khối lượng lớn hơn vật khác và rơi cùng lúc?",
    "re": "Cả hai vật sẽ chạm đất cùng một lúc nếu không có sức cản"
  },
  {
    "con": "Khi một vật dao động điều hòa?",
    "re": "Nó sẽ có một tần số và biên độ nhất định"
  },
  {
    "con": "Một chiếc xuồng chạy xuôi dòng nước với tốc độ 20\\frac{km}{h}, dòng nước chảy với tốc độ 10\\frac{km}{h}. Vận tốc của xuồng đối với dòng nước là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20m. Thời gian để vật chạm đất là",
    "re": "Câu trả lời đúng là khoảng 2.02 giây"
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng 5kg làm vật đó tăng tốc với gia tốc 2m/s², lực tác dụng là",
    "re": "Câu trả lời đúng là 10N"
  },
  {
    "con": "Nếu một chiếc xe chạy với vận tốc 60km/h trong 2 giờ, quãng đường xe đã đi được là",
    "re": "Câu trả lời đúng là 120km"
  },
  {
    "con": "Khi một vật có khối lượng 10kg di chuyển với vận tốc 3m/s, động năng của vật là",
    "re": "Câu trả lời đúng là 45J"
  },
  {
    "con": "Nếu một lò xo có độ cứng k = 200N/m bị nén 0.1m, năng lượng tiềm năng trong lò xo là",
    "re": "Câu trả lời đúng là 1J"
  },
  {
    "con": "Khi một vật có khối lượng 2kg được nâng lên cao 5m, công thực hiện để nâng vật là",
    "re": "Câu trả lời đúng là 98J"
  },
  {
    "con": "Nếu một dòng điện có cường độ 3A chạy qua một điện trở 4Ω, điện áp trên điện trở là",
    "re": "Câu trả lời đúng là 12V"
  },
  {
    "con": "Khi một vật quay với vận tốc góc 5 rad/s và bán kính quay là 2m, vận tốc tuyến tính của vật là",
    "re": "Câu trả lời đúng là 10m/s"
  },
  {
    "con": "Nếu một vật có khối lượng 1kg di chuyển với vận tốc 10m/s va chạm với một vật đứng yên có khối lượng 1kg, sau va chạm, cả hai vật cùng di chuyển với vận tốc là",
    "re": "Câu trả lời đúng là 5m/s"
  },
  {
    "con": "Trong chuyển động tròn đều, vectơ vận tốc có",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật rơi tự do, gia tốc của nó là",
    "re": "9.81 m/s² hướng xuống dưới"
  },
  {
    "con": "Nếu lực tác dụng lên một vật không đổi, thì",
    "re": "vận tốc của vật sẽ thay đổi theo thời gian"
  },
  {
    "con": "Khi một vật di chuyển trên mặt phẳng nghiêng, trọng lực có",
    "re": "thành phần song song và thành phần vuông góc với mặt phẳng"
  },
  {
    "con": "Nếu nhiệt độ của một vật tăng lên, thì",
    "re": "năng lượng nội tại của vật cũng tăng lên"
  },
  {
    "con": "Trong một hệ thống kín, tổng năng lượng được bảo toàn, vì vậy",
    "re": "năng lượng không thể tự sinh ra hoặc mất đi"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn, thì",
    "re": "nó sẽ có trọng lực lớn hơn khi ở cùng một vị trí"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nó sẽ",
    "re": "bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Nếu một vật dao động điều hòa, thì",
    "re": "vận tốc của nó thay đổi theo hàm sin hoặc cos"
  },
  {
    "con": "Khi điện áp tăng lên trong một mạch điện, thì",
    "re": "dòng điện cũng sẽ tăng lên nếu điện trở không đổi"
  },
  {
    "con": "Một lực không đổi tác dụng vào một vật có khối lượng 2kg làm vận tốc của nó tăng dần từ 2\\frac{m}{s} đến 8\\frac{m}{s} trong 3s.Hỏi lực tác dụng vào vật là bao nhiêu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 5kg rơi tự do từ độ cao 20m, thì thời gian để vật chạm đất là khoảng 2\\sqrt{2} giây.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một lò xo có độ cứng k = 200 N/m bị nén 0.1m, thì năng lượng tiềm năng trong lò xo là 1 J.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chuyển động thẳng đều với vận tốc 10 m/s trong 5 giây, thì quãng đường mà vật đi được là 50m.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một điện trở có giá trị 10 ohm và dòng điện chạy qua nó là 2 A, thì điện áp trên điện trở là 20 V.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 3kg di chuyển với vận tốc 4 m/s, thì động năng của vật là 24 J.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 1kg được nâng lên cao 5m, thì công thực hiện để nâng vật là 50 J.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sóng âm có tần số 440 Hz, thì bước sóng của nó trong không khí (với tốc độ âm thanh khoảng 340 m/s) là khoảng 0.773 m.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 10kg chịu tác dụng của lực 50N, thì gia tốc của vật là 5 m/s².",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật quay quanh một trục với bán kính 2m và có vận tốc góc 3 rad/s, thì vận tốc tuyến tính của vật là 6 m/s.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Gọi F_{1} , F_{2} là độ lớn của hai lực thành phần, F là độ lớn hợp lực của chúng. Câu nào sau đây là đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chịu tác dụng của một lực không đổi trong một khoảng thời gian nhất định, thì vật đó sẽ có gia tốc tỉ lệ thuận với lực và tỉ lệ nghịch với khối lượng của nó.",
    "re": "Định luật II Newton"
  },
  {
    "con": "Nếu một vật chuyển động theo quỹ đạo tròn với vận tốc không đổi, thì lực hướng tâm tác dụng lên vật đó luôn hướng vào tâm quỹ đạo.",
    "re": "Lực hướng tâm là cần thiết để duy trì chuyển động tròn"
  },
  {
    "con": "Nếu nhiệt độ của một vật tăng lên, thì năng lượng động học của các phân tử trong vật đó cũng tăng lên.",
    "re": "Nhiệt độ và năng lượng động học có mối liên hệ trực tiếp"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, thì thời gian rơi của vật đó tỉ lệ với căn bậc hai của độ cao h.",
    "re": "Thời gian rơi tỉ lệ với √h"
  },
  {
    "con": "Nếu một sóng âm đi qua một môi trường, thì tốc độ của sóng âm phụ thuộc vào tính chất của môi trường đó.",
    "re": "Tốc độ sóng âm thay đổi theo môi trường"
  },
  {
    "con": "Nếu một điện tích dương và một điện tích âm đặt gần nhau, thì chúng sẽ hút nhau.",
    "re": "Điện tích trái dấu luôn hút nhau"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v, thì động lượng của vật đó được tính bằng công thức p = m * v.",
    "re": "Động lượng là tích của khối lượng và vận tốc"
  },
  {
    "con": "Nếu một vật được ném lên với vận tốc ban đầu v_0, thì chiều cao tối đa mà vật đạt được tỉ lệ với bình phương vận tốc ban đầu.",
    "re": "Chiều cao tối đa tỉ lệ với v_0^2"
  },
  {
    "con": "Nếu một dòng điện chạy qua một dây dẫn, thì dây dẫn đó sẽ sinh ra một từ trường xung quanh.",
    "re": "Dòng điện tạo ra từ trường"
  },
  {
    "con": "Một lò xo có chiều dài tự nhiên là 20cm, độ cứng 125\\frac{N}{m}. Khi lực đàn hồi của lò xo bằng 10N thì chiều dài của nó là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2kg và chịu tác dụng của lực 10N thì gia tốc của vật là",
    "re": "5 m/s²"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20m thì thời gian rơi xuống đất là",
    "re": "2s"
  },
  {
    "con": "Khi một vật chuyển động thẳng đều với vận tốc 10m/s thì quãng đường đi được sau 5 giây là",
    "re": "50m"
  },
  {
    "con": "Nếu một điện trở có giá trị 10Ω và dòng điện chạy qua nó là 2A thì điện áp trên điện trở là",
    "re": "20V"
  },
  {
    "con": "Khi một vật có khối lượng 1kg di chuyển với vận tốc 3m/s thì động năng của vật là",
    "re": "4.5J"
  },
  {
    "con": "Nếu một lò xo bị nén với độ dài 15cm và có độ cứng 200\\frac{N}{m} thì lực đàn hồi của lò xo là",
    "re": "1N"
  },
  {
    "con": "Khi một vật có khối lượng 5kg được nâng lên cao 2m thì công thực hiện là",
    "re": "100J"
  },
  {
    "con": "Nếu một sóng âm có tần số 440Hz thì chu kỳ của sóng âm đó là",
    "re": "0.00227s"
  },
  {
    "con": "Khi một vật có khối lượng 3kg di chuyển với vận tốc 4m/s thì lực quán tính của vật là",
    "re": "12kg·m/s²"
  },
  {
    "con": "Trong công thức tính vận tốc của chuyển động thẳng chậm dần đều v = v_{0} + at thì",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Lực tác dụng lên một vật có khối lượng m sẽ tạo ra gia tốc a theo công thức F = ma thì",
    "re": "Lực F là đúng"
  },
  {
    "con": "Khi một vật rơi tự do, gia tốc của nó là g (khoảng 9.81 m/s²) thì",
    "re": "Vật sẽ tăng tốc đều"
  },
  {
    "con": "Trong một hệ thống kín, tổng năng lượng được bảo toàn thì",
    "re": "Năng lượng không bị mất đi"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau thì",
    "re": "Ánh sáng sẽ bị bẻ cong"
  },
  {
    "con": "Khi một vật chuyển động tròn đều, lực hướng tâm tác dụng lên vật là cần thiết thì",
    "re": "Vật sẽ duy trì chuyển động tròn"
  },
  {
    "con": "Trong một mạch điện, nếu điện trở R tăng thì",
    "re": "Dòng điện I sẽ giảm theo định luật Ohm"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên, thể tích của chất khí sẽ tăng theo định luật Charles thì",
    "re": "Chất khí sẽ nở ra"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác, tổng động năng trước và sau va chạm được bảo toàn thì",
    "re": "Va chạm là đàn hồi"
  },
  {
    "con": "Khi một sóng âm đi qua không khí, tốc độ của sóng âm phụ thuộc vào nhiệt độ không khí thì",
    "re": "Tốc độ sóng âm sẽ tăng khi nhiệt độ tăng"
  },
  {
    "con": "Một lực \\overrightarrow{F} không đổi liên tục kéo 1 vật chuyển động với vận tốc v theo hướng của lực \\overrightarrow{F} .Công suất của lực \\overrightarrow{F} là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m rơi tự do trong trường hấp dẫn của Trái Đất sẽ có gia tốc bằng g (khoảng 9.81 m/s²)",
    "re": "Vật sẽ tăng tốc với gia tốc g"
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính r và vận tốc v, thì lực hướng tâm tác dụng lên vật là",
    "re": "F = \\frac{mv^2}{r}"
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cân bằng, thì",
    "re": "Vật sẽ đứng yên hoặc chuyển động thẳng đều"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên, thể tích của chất khí sẽ tăng nếu áp suất không đổi, theo định luật Charles",
    "re": "Thể tích sẽ tỉ lệ thuận với nhiệt độ tuyệt đối"
  },
  {
    "con": "Nếu một vật va chạm đàn hồi với một vật khác, thì",
    "re": "Tổng động năng của hệ sẽ được bảo toàn"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, thì",
    "re": "Tia sáng sẽ bị khúc xạ và đổi hướng"
  },
  {
    "con": "Nếu một điện trở R được nối với một nguồn điện có hiệu điện thế U, thì",
    "re": "Dòng điện I chạy qua điện trở sẽ được tính bằng công thức I = \\frac{U}{R}"
  },
  {
    "con": "Khi một vật được nâng lên cao hơn mặt đất, thì",
    "re": "Năng lượng thế năng của vật sẽ tăng lên"
  },
  {
    "con": "Nếu một sóng âm truyền trong không khí, thì",
    "re": "Tốc độ của sóng âm sẽ phụ thuộc vào nhiệt độ của không khí"
  },
  {
    "con": "Công thức tính công của một lực là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt",
    "re": "Năng lượng tổng luôn được bảo toàn"
  },
  {
    "con": "Một vật rơi tự do trong môi trường không có sức cản",
    "re": "Vật đó sẽ tăng tốc với gia tốc 9.81 m/s²"
  },
  {
    "con": "Khi một lực tác dụng lên một vật",
    "re": "Vật sẽ thay đổi vận tốc của nó"
  },
  {
    "con": "Khi hai vật va chạm và không có lực bên ngoài tác động",
    "re": "Tổng động lượng của hệ thống sẽ được bảo toàn"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nội của vật cũng sẽ tăng"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước",
    "re": "Ánh sáng sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Khi một vật dao động điều hòa",
    "re": "Vật sẽ có vị trí và vận tốc thay đổi theo thời gian"
  },
  {
    "con": "Khi một điện tích di chuyển trong một điện trường",
    "re": "Điện tích sẽ chịu tác dụng của lực điện"
  },
  {
    "con": "Trường hợp nào dưới đây có thể coi vật là chất điểm?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Vật chuyển động thẳng đều thì quỹ đạo của nó là một đường thẳng.",
    "re": "Vận tốc của vật không thay đổi theo thời gian"
  },
  {
    "con": "Khi một vật chịu tác dụng của lực không đổi thì nó sẽ có gia tốc không đổi.",
    "re": "Vật sẽ chuyển động theo định luật Newton thứ hai"
  },
  {
    "con": "Khi một vật rơi tự do thì nó chịu tác dụng của trọng lực.",
    "re": "Vật sẽ tăng tốc với gia tốc khoảng 9.81 m/s²"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn thì lực hấp dẫn giữa nó và một vật khác sẽ lớn hơn.",
    "re": "Lực hấp dẫn tỷ lệ thuận với khối lượng của các vật"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác thì tổng động năng được bảo toàn.",
    "re": "Cả hai vật sẽ có vận tốc mới sau va chạm"
  },
  {
    "con": "Nếu một vật di chuyển trong một trường điện từ thì nó sẽ chịu tác dụng của lực Lorentz.",
    "re": "Vật sẽ bị lệch hướng khi di chuyển qua trường điện từ"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên thì thể tích của chất khí sẽ tăng.",
    "re": "Điều này thể hiện định luật Charles"
  },
  {
    "con": "Nếu một vật có năng lượng tiềm năng lớn thì nó có khả năng sinh ra công lớn khi rơi.",
    "re": "Năng lượng tiềm năng được chuyển hóa thành năng lượng động năng"
  },
  {
    "con": "Khi một sóng âm đi qua không khí thì nó sẽ truyền đi dưới dạng dao động của các phân tử không khí.",
    "re": "Sóng âm là sóng cơ học và cần môi trường để truyền"
  },
  {
    "con": "Đơn vị của động lượng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Lực tác dụng lên một vật có khối lượng m là",
    "re": "Vật sẽ có gia tốc a theo định luật Newton thứ hai"
  },
  {
    "con": "Năng lượng không thể được tạo ra hay tiêu diệt",
    "re": "Năng lượng tổng luôn được bảo toàn trong một hệ kín"
  },
  {
    "con": "Khi một vật chuyển động tròn đều",
    "re": "Vật luôn có gia tốc hướng vào tâm của vòng tròn"
  },
  {
    "con": "Nếu một vật rơi tự do",
    "re": "Vật sẽ chịu tác động của trọng lực và gia tốc của nó là 9.81 m/s²"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nội tại của vật cũng tăng theo"
  },
  {
    "con": "Nếu một sóng âm đi qua không khí",
    "re": "Nó sẽ truyền đi với tốc độ khoảng 343 m/s ở nhiệt độ phòng"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác",
    "re": "Tổng động năng của hai vật sẽ được bảo toàn"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v",
    "re": "Động lượng của vật sẽ được tính bằng công thức p = mv"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước",
    "re": "Ánh sáng sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Một người gánh hai thùng hàng, thùng A nặng 200N và thùng B nặng 300N được mắc vào hai đầu của một chiếc đòn gánh dài 1m. Để đòn gánh nằm thăng bằng thì vai người đó phải đặt",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi, thì quãng đường đi được tỉ lệ thuận với thời gian",
    "re": "Quãng đường = Vận tốc x Thời gian"
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng m, thì vật đó sẽ có gia tốc a tỉ lệ thuận với lực và tỉ lệ nghịch với khối lượng",
    "re": "F = m x a"
  },
  {
    "con": "Khi một vật rơi tự do trong môi trường không có sức cản, thì vận tốc của vật sẽ tăng dần theo thời gian",
    "re": "Vận tốc = Gia tốc x Thời gian"
  },
  {
    "con": "Khi một vật bị kéo lên cao, thì năng lượng thế của vật sẽ tăng lên theo độ cao",
    "re": "Năng lượng thế = Khối lượng x Gia tốc trọng trường x Độ cao"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác, thì tổng động năng của hai vật trước và sau va chạm sẽ được bảo toàn",
    "re": "Động năng trước va chạm = Động năng sau va chạm"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn, thì dây dẫn sẽ sinh ra một từ trường xung quanh nó",
    "re": "Từ trường xung quanh dây dẫn có dòng điện"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác, thì nó sẽ bị khúc xạ",
    "re": "Góc khúc xạ phụ thuộc vào chỉ số khúc xạ của hai môi trường"
  },
  {
    "con": "Khi một vật quay quanh một điểm cố định, thì lực hướng tâm tác dụng lên vật sẽ tỉ lệ thuận với khối lượng và vận tốc của vật",
    "re": "Lực hướng tâm = Khối lượng x Vận tốc^2 / Bán kính"
  },
  {
    "con": "Khi một vật dao động điều hòa, thì nó sẽ có một tần số nhất định và biên độ dao động không thay đổi theo thời gian",
    "re": "Tần số và biên độ là các đặc trưng của dao động điều hòa"
  },
  {
    "con": "Lực tác dụng lên một vật có thể làm vật đó thay đổi vận tốc",
    "re": "Vật sẽ tăng tốc hoặc giảm tốc tùy thuộc vào hướng của lực"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu hủy",
    "re": "Năng lượng chỉ có thể chuyển đổi từ dạng này sang dạng khác"
  },
  {
    "con": "Khi một vật di chuyển trong không gian, nó có thể có động năng",
    "re": "Động năng phụ thuộc vào khối lượng và vận tốc của vật"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nhiệt của vật cũng tăng theo"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước",
    "re": "Ánh sáng sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Khi một vật chịu tác dụng của lực đàn hồi",
    "re": "Vật sẽ trở lại hình dạng ban đầu khi lực được loại bỏ"
  },
  {
    "con": "Khi một vật rơi tự do",
    "re": "Vật sẽ chịu tác động của trọng lực và tăng tốc với gia tốc g"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn",
    "re": "Dây dẫn sẽ sinh ra một từ trường xung quanh nó"
  },
  {
    "con": "Khi áp suất trong một chất khí giảm",
    "re": "Thể tích của chất khí sẽ tăng lên nếu nhiệt độ không đổi"
  },
  {
    "con": "Khi một vật va chạm với một vật khác",
    "re": "Động lượng của hệ thống sẽ được bảo toàn nếu không có lực bên ngoài tác động"
  },
  {
    "con": "Mức vững vàng của cân bằng được xác định bởi những yếu tố nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật đang chuyển động với vận tốc 3\\frac{m}{s}. Nếu bỗng nhiên các lực tác dụng lên nó mất đi thì",
    "re": "nó sẽ tiếp tục chuyển động với vận tốc 3\\frac{m}{s} theo hướng ban đầu"
  },
  {
    "con": "Một vật có khối lượng 2 kg và chịu tác dụng của lực 10 N. Nếu lực này được giữ nguyên thì",
    "re": "vật sẽ có gia tốc 5\\frac{m}{s^2} theo định luật II Newton"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20 m. Nếu không có lực cản không khí thì",
    "re": "vật sẽ chạm đất sau khoảng 2\\sqrt{2} giây"
  },
  {
    "con": "Một lò xo bị nén với độ nén 0.1 m. Nếu độ cứng của lò xo là 200 N/m thì",
    "re": "lực đàn hồi của lò xo sẽ là 20 N"
  },
  {
    "con": "Một vật có khối lượng 5 kg di chuyển với vận tốc 10\\frac{m}{s}. Nếu nó va chạm hoàn toàn đàn hồi với một vật khác thì",
    "re": "tổng động năng của hệ sẽ được bảo toàn"
  },
  {
    "con": "Một dòng điện chạy qua một dây dẫn có điện trở 4 Ω. Nếu hiệu điện thế đặt vào dây dẫn là 12 V thì",
    "re": "dòng điện chạy qua dây dẫn sẽ là 3 A theo định luật Ohm"
  },
  {
    "con": "Một vật có khối lượng 1 kg đang đứng yên. Nếu một lực 5 N tác dụng vào nó thì",
    "re": "vật sẽ bắt đầu chuyển động với gia tốc 5\\frac{m}{s^2}"
  },
  {
    "con": "Một vật quay quanh một trục với bán kính 2 m. Nếu vật có vận tốc 4\\frac{m}{s} thì",
    "re": "gia tốc hướng tâm của vật sẽ là 8\\frac{m}{s^2}"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz. Nếu tốc độ âm thanh trong không khí là 340 m/s thì",
    "re": "bước sóng của âm sẽ là 0.772 m"
  },
  {
    "con": "Một vật có khối lượng 10 kg được nâng lên cao 5 m. Nếu gia tốc trọng trường là 9.8\\frac{m}{s^2} thì",
    "re": "công thực hiện để nâng vật lên sẽ là 490 J"
  },
  {
    "con": "Cho hai lực đồng quy có độ lớn F_{1}= 40N, F_{2}= 30N . Tìm độ lớn của hai lực khi chúng hợp nhau một góc 90\\circ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 10 kg và chịu tác dụng của lực 50 N. Tính gia tốc của vật?",
    "re": "Gia tốc của vật là 5 m/s²"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20 m. Tính thời gian vật rơi đến mặt đất?",
    "re": "Thời gian rơi là khoảng 2.02 giây"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0.1 m. Tính năng lượng tiềm năng trong lò xo?",
    "re": "Năng lượng tiềm năng là 1 J"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc 15 m/s. Tính quãng đường đi được trong 10 giây?",
    "re": "Quãng đường đi được là 150 m"
  },
  {
    "con": "Một quả bóng có khối lượng 0.5 kg va chạm với tường và phản hồi lại với vận tốc 10 m/s. Tính động lượng của quả bóng?",
    "re": "Động lượng của quả bóng là 5 kg·m/s"
  },
  {
    "con": "Một vật có khối lượng 2 kg được kéo lên cao với lực 20 N. Tính công thực hiện khi kéo vật lên cao 3 m?",
    "re": "Công thực hiện là 60 J"
  },
  {
    "con": "Một dòng điện có cường độ 2 A chạy qua một điện trở 5 Ω. Tính điện áp trên điện trở?",
    "re": "Điện áp là 10 V"
  },
  {
    "con": "Một vật có khối lượng 3 kg di chuyển với vận tốc 4 m/s. Tính năng lượng động của vật?",
    "re": "Năng lượng động là 24 J"
  },
  {
    "con": "Một chiếc xe có khối lượng 1000 kg đang chạy với vận tốc 20 m/s. Tính động năng của chiếc xe?",
    "re": "Động năng của chiếc xe là 200000 J"
  },
  {
    "con": "Một đoàn tàu đang chuyển động với vận tốc 72\\frac{km}{h} thì vào ga Huế và hãm phanh chuyển động chậm dần đều, sau 10 giây đạt còn lại 54\\frac{km}{h}. Quãng đường đoàn tàu đi được cho đến lúc dừng lại là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20m thì sau 2 giây, tốc độ của vật đạt khoảng",
    "re": "19.6 m/s"
  },
  {
    "con": "Một chiếc xe ô tô di chuyển với vận tốc 60 km/h thì sau 1 giờ, quãng đường xe đã đi được là",
    "re": "60 km"
  },
  {
    "con": "Một lò xo bị nén với độ biến dạng 0.1m thì lực đàn hồi của lò xo theo định luật Hooke là",
    "re": "F = k * 0.1 (với k là độ cứng của lò xo)"
  },
  {
    "con": "Một vật có khối lượng 5 kg và chịu tác dụng của lực 20 N thì gia tốc của vật là",
    "re": "4 m/s²"
  },
  {
    "con": "Một bóng đèn có công suất 60W thì trong 1 giờ tiêu thụ năng lượng là",
    "re": "216000 J"
  },
  {
    "con": "Một vật có khối lượng 10 kg và được nâng lên cao 2m thì năng lượng thế năng của vật là",
    "re": "196 J"
  },
  {
    "con": "Một dòng điện có cường độ 2A chạy qua một điện trở 5Ω thì điện áp trên điện trở là",
    "re": "10 V"
  },
  {
    "con": "Một chiếc xe đang chạy với vận tốc 80 km/h thì nếu phanh gấp và dừng lại trong 4 giây, gia tốc của xe là",
    "re": "-5.56 m/s²"
  },
  {
    "con": "Một vật có khối lượng 2 kg và di chuyển với vận tốc 3 m/s thì động năng của vật là",
    "re": "9 J"
  },
  {
    "con": "Phải treo một vật có khối lượng bằng bao nhiêu vào lò xo có độ cứng K = 100\\frac{N}{m} để lò xo dãn ra được 10cm? Lấy g = 10\\frac{m}{s^2}",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật rơi tự do từ độ cao h, thì tốc độ của vật sẽ tăng lên theo thời gian với gia tốc g = 9.8\\frac{m}{s^2}",
    "re": "Tốc độ của vật sẽ đạt giá trị v = g \\cdot t"
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m, thì vật sẽ có gia tốc a = \\frac{F}{m}",
    "re": "Gia tốc của vật sẽ tỷ lệ thuận với lực và nghịch đảo với khối lượng"
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính r và tốc độ v, thì lực hướng tâm F sẽ được tính bằng công thức F = \\frac{mv^2}{r}",
    "re": "Lực hướng tâm sẽ giữ cho vật chuyển động theo quỹ đạo tròn"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác, thì tổng động năng của hệ sẽ được bảo toàn",
    "re": "Động năng trước và sau va chạm sẽ bằng nhau"
  },
  {
    "con": "Khi một vật được nâng lên cao h, thì năng lượng thế năng của vật sẽ được tính bằng công thức E_p = mgh",
    "re": "Năng lượng thế năng sẽ tăng khi độ cao h tăng"
  },
  {
    "con": "Khi một dòng điện I chạy qua một dây dẫn có điện trở R, thì công suất P sẽ được tính bằng công thức P = I^2R",
    "re": "Công suất sẽ tăng khi dòng điện I tăng"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác, thì hiện tượng khúc xạ xảy ra theo định luật Snell: n_1 \\sin(\\theta_1) = n_2 \\sin(\\theta_2)",
    "re": "Góc khúc xạ sẽ phụ thuộc vào chỉ số khúc xạ của hai môi trường"
  },
  {
    "con": "Khi một vật dao động điều hòa với biên độ A và tần số f, thì phương trình dao động sẽ được mô tả bằng x(t) = A \\cos(2\\pi ft + \\phi)",
    "re": "Vị trí của vật sẽ thay đổi theo thời gian theo hàm cosin"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí, thì tốc độ của sóng sẽ phụ thuộc vào nhiệt độ của không khí",
    "re": "Tốc độ sóng âm sẽ tăng khi nhiệt độ không khí tăng"
  },
  {
    "con": "Lò xo có độ cứng k = 200 \\frac{N}{m}, một đầu cố định, đầu kia gắn với vật nhỏ. Khi lò xo bị giãn 2cm thì thế năng đàn hồi của hệ bằng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2kg rơi tự do từ độ cao 10m thì vận tốc của vật khi chạm đất là",
    "re": "14,14 m/s"
  },
  {
    "con": "Khi một vật chuyển động thẳng đều với vận tốc 5 m/s trong 10 giây thì quãng đường đi được là",
    "re": "50 m"
  },
  {
    "con": "Một lò xo bị nén với độ nén 5cm thì thế năng đàn hồi của lò xo được tính bằng công thức \\frac{1}{2} k x^2, với k = 100 \\frac{N}{m} thì thế năng đàn hồi là",
    "re": "12,5 J"
  },
  {
    "con": "Khi một vật có khối lượng 3kg được kéo lên cao 4m thì công thực hiện để nâng vật đó là",
    "re": "117,6 J"
  },
  {
    "con": "Nếu một dòng điện có cường độ 2A chạy qua một điện trở 5Ω thì điện áp trên điện trở đó là",
    "re": "10V"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước với góc tới 30 độ thì góc khúc xạ trong nước là",
    "re": "22,1 độ"
  },
  {
    "con": "Nếu một vật có khối lượng 1kg chuyển động với vận tốc 10 m/s thì động năng của vật đó là",
    "re": "50 J"
  },
  {
    "con": "Khi một vật chịu tác dụng của lực 10N trong 5s thì vận tốc của vật tăng thêm 10 m/s nếu khối lượng của vật là 1kg, thì lực tác dụng lên vật là",
    "re": "10 N"
  },
  {
    "con": "Nếu một sóng âm có tần số 440Hz thì bước sóng của nó trong không khí (với tốc độ âm thanh là 340 m/s) là",
    "re": "0,773 m"
  },
  {
    "con": "Khi một vật chuyển động trong trọng trường thì cơ năng của vật được xác định theo công thức:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một lực tác dụng lên một vật thì vật sẽ thay đổi vận tốc của nó theo định luật II Newton:",
    "re": "Lực tỉ lệ thuận với gia tốc và khối lượng của vật"
  },
  {
    "con": "Khi một vật rơi tự do thì gia tốc của nó là gia tốc trọng trường:",
    "re": "Gia tốc này có giá trị khoảng 9.81 m/s²"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác thì tổng động năng của hệ được bảo toàn:",
    "re": "Động năng trước va chạm bằng động năng sau va chạm"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn thì dây dẫn sẽ sinh ra từ trường xung quanh:",
    "re": "Từ trường này có thể được xác định bằng quy tắc bàn tay phải"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác thì nó sẽ bị khúc xạ:",
    "re": "Góc khúc xạ phụ thuộc vào chỉ số khúc xạ của hai môi trường"
  },
  {
    "con": "Khi một vật dao động điều hòa thì nó có thể được mô tả bằng hàm sin hoặc cos:",
    "re": "Tần số và biên độ xác định đặc tính của dao động"
  },
  {
    "con": "Khi một vật chịu tác dụng của lực ma sát thì lực ma sát sẽ cản trở chuyển động của vật:",
    "re": "Lực ma sát tỉ lệ thuận với lực tác dụng lên vật"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên thì năng lượng nội của vật cũng tăng theo:",
    "re": "Điều này dẫn đến sự gia tăng chuyển động của các phân tử trong vật"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí thì nó sẽ di chuyển với tốc độ khoảng 343 m/s:",
    "re": "Tốc độ này có thể thay đổi tùy thuộc vào nhiệt độ và áp suất của không khí"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 80m xuống đất, sau 4 s vật chạm đất . Lấy g = 10\\frac{m}{s^2}. Tính vận tốc lúc vừa chạm đất.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2 kg chịu tác dụng của lực 10 N, thì vật sẽ có gia tốc 5 m/s².",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chuyển động thẳng đều với vận tốc 20 m/s, thì quãng đường đi được sau 5 giây là 100 m.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một lò xo có độ cứng k = 200 N/m bị nén 0.1 m, thì năng lượng đàn hồi của lò xo là 1 J.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 3 kg di chuyển với vận tốc 4 m/s, thì động năng của vật là 24 J.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật được ném lên với vận tốc ban đầu 15 m/s, thì độ cao cực đại mà vật đạt được là 11.5 m (lấy g = 10 m/s²).",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dòng điện có cường độ 2 A chạy qua một điện trở 5 Ω, thì điện áp trên điện trở là 10 V.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 1 kg rơi tự do từ độ cao 20 m, thì vận tốc của vật khi chạm đất là 20 m/s.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 4 kg và vận tốc 3 m/s va chạm với một vật khác có khối lượng 2 kg đứng yên, thì tổng động lượng sau va chạm là 12 kg·m/s.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật quay quanh một trục với bán kính 2 m và có vận tốc góc 3 rad/s, thì vận tốc tuyến tính của vật là 6 m/s.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi",
    "re": "lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Một vật rơi tự do trong môi trường không có sức cản",
    "re": "vật sẽ tăng tốc với gia tốc 9.81 m/s²"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt",
    "re": "năng lượng tổng luôn được bảo toàn"
  },
  {
    "con": "Một vật có khối lượng lớn hơn sẽ có trọng lực lớn hơn",
    "re": "trọng lực tác dụng lên vật sẽ lớn hơn"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên",
    "re": "khối lượng riêng của chất đó sẽ giảm"
  },
  {
    "con": "Một dòng điện chạy qua một dây dẫn",
    "re": "sẽ tạo ra một từ trường xung quanh dây dẫn"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước",
    "re": "ánh sáng sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Khi một vật va chạm với một vật khác",
    "re": "năng lượng có thể được truyền từ vật này sang vật kia"
  },
  {
    "con": "Một lò xo bị nén hoặc kéo dài",
    "re": "sẽ tạo ra một lực phục hồi hướng về vị trí cân bằng"
  },
  {
    "con": "Khi một vật quay quanh một trục",
    "re": "có một lực hướng tâm tác dụng lên vật đó"
  },
  {
    "con": "Câu nào sau đây là đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Đơn vị đo hằng số hấp dẫn",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Lực tác dụng lên một vật có khối lượng thì vật sẽ có gia tốc",
    "re": "Vật sẽ chuyển động theo hướng của lực"
  },
  {
    "con": "Năng lượng không thể tự sinh ra hoặc mất đi",
    "re": "Năng lượng luôn được bảo toàn trong một hệ kín"
  },
  {
    "con": "Nhiệt độ tăng lên thì năng lượng động học của phân tử tăng",
    "re": "Chất sẽ trở nên nóng hơn"
  },
  {
    "con": "Áp suất tăng lên khi diện tích bề mặt giảm",
    "re": "Lực tác dụng trên bề mặt sẽ lớn hơn"
  },
  {
    "con": "Một vật đang chuyển động thẳng đều thì lực tác dụng lên vật bằng 0",
    "re": "Vật sẽ tiếp tục chuyển động với vận tốc không đổi"
  },
  {
    "con": "Khi một vật rơi tự do thì gia tốc của nó là hằng số",
    "re": "Gia tốc này bằng gia tốc trọng trường"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác thì tốc độ ánh sáng thay đổi",
    "re": "Ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Khi một vật dao động thì nó sẽ có năng lượng tiềm năng và động năng",
    "re": "Năng lượng tổng luôn được bảo toàn"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn thì sẽ sinh ra từ trường",
    "re": "Từ trường này có thể tác động lên các vật khác"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì lực tác dụng lên vật đó bằng 0",
    "re": "Vật không thay đổi vận tốc"
  },
  {
    "con": "Một vật rơi tự do thì gia tốc của nó là 9.8 m/s²",
    "re": "Vật chịu tác động của trọng lực"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên thì thể tích của chất đó cũng tăng lên",
    "re": "Hiện tượng giãn nở nhiệt"
  },
  {
    "con": "Khi một vật va chạm với một vật khác, tổng động lượng của hai vật được bảo toàn nếu không có lực bên ngoài tác động",
    "re": "Định luật bảo toàn động lượng"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước thì nó sẽ bị khúc xạ",
    "re": "Thay đổi hướng đi của ánh sáng"
  },
  {
    "con": "Một vật có khối lượng lớn hơn thì sẽ có trọng lực lớn hơn",
    "re": "Trọng lực tỷ lệ thuận với khối lượng"
  },
  {
    "con": "Khi một vật dao động thì nó sẽ tạo ra sóng âm",
    "re": "Sóng âm là kết quả của sự dao động"
  },
  {
    "con": "Khi điện áp tăng lên trong một mạch điện thì dòng điện cũng sẽ tăng lên",
    "re": "Theo định luật Ohm, I = U/R"
  },
  {
    "con": "Khi một vật được nâng lên cao thì nó có năng lượng tiềm năng lớn hơn",
    "re": "Năng lượng tiềm năng phụ thuộc vào độ cao"
  },
  {
    "con": "Điện trở của một dây dẫn tỉ lệ thuận với chiều dài của dây",
    "re": "Điện trở R = ρ(L/A) với ρ là điện trở suất"
  },
  {
    "con": "Điều nào sau đây là sai khi nói về phương và độ lớn của lực đàn hồi?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chọn phát biểu sai về chuyển động tròn đều",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì vận tốc của nó không thay đổi",
    "re": "Vật đó di chuyển với tốc độ không đổi"
  },
  {
    "con": "Lực tác dụng lên một vật không thay đổi thì vật sẽ không thay đổi vận tốc",
    "re": "Vật sẽ giữ nguyên trạng thái chuyển động"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt",
    "re": "Năng lượng chỉ có thể chuyển đổi từ dạng này sang dạng khác"
  },
  {
    "con": "Khi một vật rơi tự do thì chỉ có trọng lực tác động lên nó",
    "re": "Vật sẽ tăng tốc với gia tốc trọng trường"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn thì nó sẽ có trọng lực lớn hơn",
    "re": "Trọng lực tác dụng lên vật tỷ lệ thuận với khối lượng của nó"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên thì năng lượng nội tại của nó cũng tăng",
    "re": "Vật sẽ có nhiều năng lượng hơn"
  },
  {
    "con": "Nếu một vật va chạm đàn hồi với một vật khác thì tổng động năng được bảo toàn",
    "re": "Cả hai vật sẽ có động năng sau va chạm"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước thì nó sẽ bị khúc xạ",
    "re": "Ánh sáng sẽ thay đổi hướng đi"
  },
  {
    "con": "Nếu một vật quay quanh một điểm thì nó sẽ có lực hướng tâm tác động vào nó",
    "re": "Lực này giữ cho vật không bay ra ngoài"
  },
  {
    "con": "Điều nào sau đây sai khi nói về động lượng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt",
    "re": "Năng lượng tổng luôn được bảo toàn"
  },
  {
    "con": "Một vật có khối lượng lớn hơn sẽ rơi nhanh hơn một vật có khối lượng nhỏ hơn trong chân không",
    "re": "Cả hai vật sẽ rơi với cùng một tốc độ"
  },
  {
    "con": "Khi một vật va chạm với một vật khác và không có lực bên ngoài tác động",
    "re": "Động lượng tổng của hệ sẽ được bảo toàn"
  },
  {
    "con": "Nếu một vật được kéo lên cao hơn",
    "re": "Năng lượng tiềm năng của vật sẽ tăng"
  },
  {
    "con": "Khi một vật quay quanh một điểm cố định",
    "re": "Lực hướng tâm cần thiết để giữ vật trong quỹ đạo"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nhiệt của vật cũng tăng"
  },
  {
    "con": "Nếu một vật di chuyển trong một đường thẳng với gia tốc không đổi",
    "re": "Vận tốc của vật sẽ thay đổi theo thời gian"
  },
  {
    "con": "Khi một lực tác dụng lên một vật và vật không di chuyển",
    "re": "Lực tác dụng bằng lực cản"
  },
  {
    "con": "Vật chuyển động với vận tốc không đổi",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Một vật rơi tự do trong môi trường không có sức cản",
    "re": "Vật sẽ tăng tốc đều với gia tốc 9.81 m/s²"
  },
  {
    "con": "Năng lượng không thể tự sinh ra hoặc mất đi",
    "re": "Năng lượng tổng luôn được bảo toàn trong một hệ kín"
  },
  {
    "con": "Khi một vật va chạm với một vật khác",
    "re": "Động lượng của hệ hai vật được bảo toàn nếu không có lực bên ngoài tác dụng"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nội của vật cũng tăng lên"
  },
  {
    "con": "Khi một vật bị kéo lên cao",
    "re": "Công thực hiện bởi lực kéo bằng trọng lực của vật nhân với độ cao"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác",
    "re": "Ánh sáng sẽ bị khúc xạ tại bề mặt phân cách"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn",
    "re": "Sẽ tạo ra một từ trường xung quanh dây dẫn"
  },
  {
    "con": "Khi một vật dao động điều hòa",
    "re": "Vật có gia tốc tỉ lệ nghịch với độ biến dạng"
  },
  {
    "con": "Khi áp suất trong một chất lỏng tăng lên",
    "re": "Áp suất tại mọi điểm trong chất lỏng cũng tăng lên"
  },
  {
    "con": "Một vật chuyển động thẳng đều",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Một vật rơi tự do trong không khí",
    "re": "Chịu tác động của trọng lực và gia tốc của nó là 9.81 m/s²"
  },
  {
    "con": "Năng lượng không được tạo ra hay tiêu diệt",
    "re": "Năng lượng tổng trong một hệ kín luôn được bảo toàn"
  },
  {
    "con": "Một vật có khối lượng lớn hơn sẽ có trọng lực lớn hơn",
    "re": "Trọng lực của vật tỷ lệ thuận với khối lượng của nó"
  },
  {
    "con": "Một vật đang quay quanh một trục",
    "re": "Chịu tác động của lực hướng tâm"
  },
  {
    "con": "Một lò xo bị nén hoặc kéo",
    "re": "Lực đàn hồi tác dụng lên lò xo tỷ lệ thuận với độ biến dạng của nó"
  },
  {
    "con": "Một dòng điện chạy qua một dây dẫn",
    "re": "Tạo ra một từ trường xung quanh dây dẫn đó"
  },
  {
    "con": "Một vật có nhiệt độ cao hơn",
    "re": "Có xu hướng truyền nhiệt cho vật có nhiệt độ thấp hơn"
  },
  {
    "con": "Một sóng âm truyền qua không khí",
    "re": "Có thể bị phản xạ, khúc xạ hoặc hấp thụ"
  },
  {
    "con": "Phát biểu nào sau đây không đúng đối với một vật có trục quay cố định?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Một vật rơi tự do trong không khí",
    "re": "Chịu tác động của trọng lực và lực cản không khí"
  },
  {
    "con": "Năng lượng không được tạo ra hay tiêu diệt",
    "re": "Năng lượng tổng luôn được bảo toàn trong một hệ kín"
  },
  {
    "con": "Một vật có khối lượng lớn hơn vật khác",
    "re": "Sẽ có trọng lực tác dụng lớn hơn lên vật đó"
  },
  {
    "con": "Một lò xo bị nén hoặc kéo dài",
    "re": "Tạo ra lực đàn hồi theo định luật Hooke"
  },
  {
    "con": "Một dòng điện chạy qua một dây dẫn",
    "re": "Tạo ra từ trường xung quanh dây dẫn"
  },
  {
    "con": "Nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nhiệt của vật đó cũng tăng lên"
  },
  {
    "con": "Một vật va chạm với một vật khác",
    "re": "Có thể xảy ra sự chuyển giao động lượng giữa hai vật"
  },
  {
    "con": "Một vật di chuyển theo quỹ đạo tròn",
    "re": "Chịu tác động của lực hướng tâm"
  },
  {
    "con": "Chọn phát biểu sai?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hai lực cân bằng không thể có",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều",
    "re": "Tốc độ của nó không thay đổi"
  },
  {
    "con": "Năng lượng không thể tự sinh ra hoặc mất đi",
    "re": "Năng lượng luôn được bảo toàn"
  },
  {
    "con": "Một vật chịu tác dụng của lực kéo xuống",
    "re": "Nó sẽ có trọng lực tác động lên nó"
  },
  {
    "con": "Một vật có khối lượng lớn hơn",
    "re": "Nó sẽ có trọng lực lớn hơn khi ở cùng một vị trí"
  },
  {
    "con": "Một vật chuyển động tròn",
    "re": "Nó sẽ có gia tốc hướng tâm"
  },
  {
    "con": "Nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nhiệt của nó cũng tăng lên"
  },
  {
    "con": "Một điện tích dương và một điện tích âm gần nhau",
    "re": "Chúng sẽ hút nhau"
  },
  {
    "con": "Một sóng âm đi qua không khí",
    "re": "Nó sẽ truyền năng lượng qua không khí"
  },
  {
    "con": "Một vật rơi tự do",
    "re": "Nó sẽ chịu tác động của trọng lực mà không có lực cản"
  },
  {
    "con": "Vật thể chịu tác động của lực",
    "re": "Vật thể sẽ thay đổi vận tốc của nó"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt",
    "re": "Năng lượng chỉ có thể chuyển đổi từ dạng này sang dạng khác"
  },
  {
    "con": "Vật thể có khối lượng lớn hơn sẽ có trọng lực lớn hơn",
    "re": "Vật thể đó sẽ kéo các vật thể khác về phía nó mạnh hơn"
  },
  {
    "con": "Nhiệt độ của một vật thể tăng lên",
    "re": "Năng lượng nhiệt của vật thể đó cũng tăng lên"
  },
  {
    "con": "Một vật thể di chuyển theo đường thẳng",
    "re": "Nó sẽ tiếp tục di chuyển theo đường thẳng với vận tốc không đổi nếu không có lực tác động"
  },
  {
    "con": "Áp suất trong một chất lỏng tăng lên",
    "re": "Áp suất sẽ tác động đều lên mọi hướng trong chất lỏng đó"
  },
  {
    "con": "Một vật thể được thả rơi từ độ cao",
    "re": "Vật thể đó sẽ tăng tốc do trọng lực cho đến khi chạm đất"
  },
  {
    "con": "Một dòng điện chạy qua một dây dẫn",
    "re": "Sẽ tạo ra một từ trường xung quanh dây dẫn đó"
  },
  {
    "con": "Một vật thể có điện tích dương",
    "re": "Nó sẽ hút các vật thể có điện tích âm"
  },
  {
    "con": "Một lò xo bị nén hoặc kéo dài",
    "re": "Nó sẽ tạo ra một lực phục hồi hướng về vị trí cân bằng"
  },
  {
    "con": "Một vật chuyển động thẳng đều",
    "re": "Vận tốc của vật không thay đổi theo thời gian"
  },
  {
    "con": "Một vật chịu tác dụng của lực không cân bằng",
    "re": "Vật sẽ thay đổi vận tốc của nó"
  },
  {
    "con": "Năng lượng không thể tự sinh ra hoặc mất đi",
    "re": "Năng lượng luôn được bảo toàn trong một hệ kín"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nhiệt của vật cũng tăng theo"
  },
  {
    "con": "Một vật rơi tự do trong không khí",
    "re": "Chịu tác dụng của trọng lực và lực cản không khí"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác",
    "re": "Tốc độ ánh sáng thay đổi và có thể bị khúc xạ"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn",
    "re": "Dây dẫn sẽ sinh ra một từ trường xung quanh"
  },
  {
    "con": "Khi một vật va chạm với một vật khác",
    "re": "Động lượng của hệ vật được bảo toàn nếu không có lực bên ngoài tác động"
  },
  {
    "con": "Khi một vật được nâng lên cao",
    "re": "Năng lượng thế của vật tăng lên"
  },
  {
    "con": "Khi một lò xo bị nén hoặc kéo dài",
    "re": "Lò xo sẽ sinh ra một lực phục hồi theo định luật Hooke"
  },
  {
    "con": "Chọn phát biểu đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điều nào sau đây không đúng khi nói về chuyển động của vật ném ngang?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Vật chịu tác dụng của lực không đổi trong một khoảng thời gian nhất định",
    "re": "Vật sẽ có gia tốc không đổi"
  },
  {
    "con": "Năng lượng không được tạo ra hay tiêu diệt trong một hệ kín",
    "re": "Năng lượng tổng luôn được bảo toàn"
  },
  {
    "con": "Một vật chuyển động tròn đều",
    "re": "Vật đó luôn có gia tốc hướng vào tâm của vòng tròn"
  },
  {
    "con": "Khi một vật va chạm với một vật khác và không có lực bên ngoài tác động",
    "re": "Tổng động lượng của hai vật sẽ được bảo toàn"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nội tại của vật cũng sẽ tăng lên"
  },
  {
    "con": "Khi một vật rơi tự do trong không khí",
    "re": "Vật sẽ chịu tác động của trọng lực và lực cản không khí"
  },
  {
    "con": "Khi một lò xo bị nén hoặc kéo dài",
    "re": "Nó sẽ tạo ra một lực phục hồi theo định luật Hooke"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước",
    "re": "Ánh sáng sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Khi một điện tích dương và một điện tích âm lại gần nhau",
    "re": "Chúng sẽ hút nhau với một lực tỉ lệ thuận với tích của hai điện tích"
  },
  {
    "con": "Công thức liên hệ giữa vận tốc ném lên theo phương thẳng đứng và độ cao cực đại đạt được là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Lực hấp dẫn giữa hai vật tỉ lệ thuận với khối lượng của chúng và nghịch đảo với bình phương khoảng cách giữa chúng",
    "re": "Đó là định luật vạn vật hấp dẫn"
  },
  {
    "con": "Năng lượng cơ học của một vật trong hệ kín được bảo toàn",
    "re": "Tổng năng lượng cơ học không thay đổi"
  },
  {
    "con": "Khi một vật chuyển động thẳng đều, quãng đường đi được tỉ lệ thuận với thời gian",
    "re": "Vận tốc của vật là không đổi"
  },
  {
    "con": "Khi một vật rơi tự do, gia tốc của nó là 9.81 m/s²",
    "re": "Đó là gia tốc trọng trường gần bề mặt trái đất"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau, nó sẽ bị bẻ cong",
    "re": "Hiện tượng khúc xạ ánh sáng xảy ra"
  },
  {
    "con": "Khi một vật chịu tác dụng của lực không đổi, nó sẽ có gia tốc tỉ lệ thuận với lực và nghịch đảo với khối lượng",
    "re": "Đó là định luật II Newton"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên, thể tích của nó cũng sẽ tăng lên (trong điều kiện áp suất không đổi)",
    "re": "Đó là định luật Charles"
  },
  {
    "con": "Khi một sóng âm đi qua không khí, nó sẽ truyền đi dưới dạng dao động của các phân tử không khí",
    "re": "Đó là nguyên lý truyền âm"
  },
  {
    "con": "Khi một vật quay quanh một trục, lực hướng tâm cần thiết để giữ vật trong quỹ đạo tỉ lệ thuận với khối lượng và tốc độ của vật",
    "re": "Đó là định luật về chuyển động tròn"
  },
  {
    "con": "Hình bên là đồ thị biểu diễn sự phụ thuộc của độ dãn \\Deltal của một lò xo vào lực kéo F. Độ cứng của lò xo bằng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Khi một vật rơi tự do từ độ cao h, không có lực cản",
    "re": "Vật sẽ đạt vận tốc tối đa khi chạm đất"
  },
  {
    "con": "Khi một lò xo bị nén hoặc kéo ra, lực tác dụng lên lò xo tỉ lệ thuận với độ dãn của nó",
    "re": "Lực phục hồi của lò xo sẽ hướng về vị trí cân bằng"
  },
  {
    "con": "Khi một vật chuyển động tròn đều, gia tốc hướng tâm luôn hướng về tâm của vòng tròn",
    "re": "Vật sẽ duy trì chuyển động tròn đều nếu không có lực cản"
  },
  {
    "con": "Khi một vật va chạm với một vật khác và không có mất mát năng lượng",
    "re": "Động lượng của hệ thống sẽ được bảo toàn"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên, năng lượng nội tại của vật cũng tăng",
    "re": "Vật sẽ có khả năng truyền nhiệt cho vật khác"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn, nó sẽ tạo ra một từ trường xung quanh dây dẫn",
    "re": "Từ trường này có thể tác động lên các vật liệu từ tính"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác với chỉ số khúc xạ khác nhau",
    "re": "Ánh sáng sẽ bị khúc xạ tại bề mặt tiếp giáp giữa hai môi trường"
  },
  {
    "con": "Khi một vật được nâng lên cao hơn mặt đất",
    "re": "Năng lượng thế của vật sẽ tăng lên"
  },
  {
    "con": "Đồ thị vận tốc – thời gian của một chuyển động được biểu diễn như hình vẽ. Hãy cho biết trong những khoảng thời gian nào vật chuyển động nhanh dần đều?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h, không chịu tác động của lực cản. Hãy cho biết vận tốc của vật khi chạm đất sẽ phụ thuộc vào độ cao h.",
    "re": "Vận tốc sẽ tăng theo độ cao h"
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính r. Hãy cho biết gia tốc hướng tâm của vật sẽ phụ thuộc vào vận tốc v.",
    "re": "Gia tốc hướng tâm sẽ tăng khi vận tốc v tăng"
  },
  {
    "con": "Một lò xo bị nén hoặc kéo ra một khoảng x. Hãy cho biết lực đàn hồi của lò xo sẽ phụ thuộc vào độ biến dạng x.",
    "re": "Lực đàn hồi sẽ tỷ lệ thuận với độ biến dạng x"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Hãy cho biết động năng của vật sẽ phụ thuộc vào khối lượng m và vận tốc v.",
    "re": "Động năng sẽ tăng khi khối lượng m hoặc vận tốc v tăng"
  },
  {
    "con": "Một vật chịu tác dụng của lực F trong thời gian t. Hãy cho biết gia tốc của vật sẽ phụ thuộc vào lực F và khối lượng m của nó.",
    "re": "Gia tốc sẽ tỷ lệ thuận với lực F và tỷ lệ nghịch với khối lượng m"
  },
  {
    "con": "Một vật đang đứng yên và chịu tác dụng của lực kéo. Hãy cho biết vật sẽ bắt đầu chuyển động khi lực kéo lớn hơn lực ma sát.",
    "re": "Vật sẽ bắt đầu chuyển động khi lực kéo vượt qua lực ma sát"
  },
  {
    "con": "Một sóng âm truyền trong không khí. Hãy cho biết tốc độ của sóng âm sẽ phụ thuộc vào nhiệt độ của không khí.",
    "re": "Tốc độ sóng âm sẽ tăng khi nhiệt độ không khí tăng"
  },
  {
    "con": "Một vật có khối lượng m và vận tốc v va chạm với một vật khác. Hãy cho biết động lượng của hệ sẽ được bảo toàn nếu không có lực bên ngoài tác động.",
    "re": "Động lượng của hệ sẽ được bảo toàn trong va chạm"
  },
  {
    "con": "Một điện trở R được nối với nguồn điện có hiệu điện thế U. Hãy cho biết dòng điện I chạy qua điện trở sẽ phụ thuộc vào điện trở R và hiệu điện thế U.",
    "re": "Dòng điện I sẽ tỷ lệ nghịch với điện trở R và tỷ lệ thuận với hiệu điện thế U"
  },
  {
    "con": "Trong những phương trình dưới đây, phương trình nào biểu diễn qui luật của chuyển động thẳng đều?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi,",
    "re": "thì quãng đường đi được tỉ lệ thuận với thời gian."
  },
  {
    "con": "Khi lực tác dụng lên một vật tăng lên,",
    "re": "thì gia tốc của vật cũng tăng lên nếu khối lượng không đổi."
  },
  {
    "con": "Khi một vật rơi tự do,",
    "re": "thì nó chịu tác động của trọng lực và gia tốc rơi tự do là 9.81 m/s²."
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác,",
    "re": "thì lực hấp dẫn giữa chúng sẽ lớn hơn."
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên,",
    "re": "thì thể tích của chất khí thường sẽ tăng lên nếu áp suất không đổi."
  },
  {
    "con": "Nếu một vật va chạm đàn hồi với một vật khác,",
    "re": "thì tổng động năng của hệ sẽ được bảo toàn."
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước,",
    "re": "thì nó sẽ bị khúc xạ và thay đổi hướng."
  },
  {
    "con": "Nếu một dòng điện chạy qua một dây dẫn,",
    "re": "thì nó sẽ tạo ra một từ trường xung quanh dây dẫn đó."
  },
  {
    "con": "Khi một vật dao động điều hòa,",
    "re": "thì nó sẽ có một tần số và biên độ nhất định."
  },
  {
    "con": "Một chiếc xe chạy qua cầu với vận tốc 8 \\frac{m}{s} theo hướng Nam-Bắc. Một chiếc thuyền chuyển động với vận tốc 6 \\frac{m}{s} theo hướng Tây-Đông. Vận tốc của xe đối với thuyền là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20m. Thời gian rơi của vật là",
    "re": "khoảng 2.02 giây"
  },
  {
    "con": "Một lò xo bị nén với độ dài 0.5m và có độ cứng 200 N/m. Lực tác dụng lên lò xo là",
    "re": "100 N"
  },
  {
    "con": "Một quả bóng lăn trên mặt đất với vận tốc 5 \\frac{m}{s}. Nếu không có lực cản, quả bóng sẽ",
    "re": "tiếp tục lăn với vận tốc 5 \\frac{m}{s}"
  },
  {
    "con": "Một vật có khối lượng 10 kg di chuyển với vận tốc 3 \\frac{m}{s}. Động năng của vật là",
    "re": "45 J"
  },
  {
    "con": "Một chiếc xe có khối lượng 1000 kg tăng tốc từ 0 đến 20 \\frac{m}{s} trong 5 giây. Lực tác dụng lên xe là",
    "re": "4000 N"
  },
  {
    "con": "Một vật có khối lượng 2 kg treo lơ lửng trong trọng trường. Lực kéo của vật là",
    "re": "19.6 N"
  },
  {
    "con": "Một chiếc thuyền di chuyển với vận tốc 4 \\frac{m}{s} trên mặt nước. Nếu có gió thổi ngược chiều với vận tốc 2 \\frac{m}{s}, vận tốc của thuyền so với bờ là",
    "re": "2 \\frac{m}{s}"
  },
  {
    "con": "Một quả cầu có khối lượng 0.5 kg lăn xuống dốc cao 10m. Năng lượng tiềm năng của quả cầu ở đỉnh dốc là",
    "re": "49 J"
  },
  {
    "con": "Một vật có khối lượng 5 kg di chuyển với vận tốc 10 \\frac{m}{s}. Động lượng của vật là",
    "re": "50 kg·m/s"
  },
  {
    "con": "Cho 2 lực đồng qui có cùng độ lớn 100N. Hỏi góc giữa 2 lực bằng bao nhiêu thì hợp lực cũng có độ lớn bằng 100N",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 10kg và chịu tác dụng của lực 20N. Hỏi gia tốc của vật là bao nhiêu",
    "re": "Gia tốc của vật là 2m/s²"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20m. Hỏi thời gian vật rơi đến mặt đất là bao lâu",
    "re": "Thời gian rơi là khoảng 2s"
  },
  {
    "con": "Khi một vật chuyển động thẳng đều, nếu lực tác dụng lên vật bằng 0 thì",
    "re": "Vật sẽ duy trì vận tốc không đổi"
  },
  {
    "con": "Nếu một vật có khối lượng 5kg di chuyển với vận tốc 10m/s, thì động năng của vật là",
    "re": "Động năng của vật là 250J"
  },
  {
    "con": "Khi một vật được ném lên cao, nếu lực tác dụng của trọng lực lớn hơn lực đẩy thì",
    "re": "Vật sẽ dừng lại và rơi xuống"
  },
  {
    "con": "Nếu một lò xo bị nén với độ biến dạng 0.1m và có độ cứng 200N/m thì",
    "re": "Lực đàn hồi của lò xo là 20N"
  },
  {
    "con": "Nếu một vật có khối lượng 2kg và chịu tác dụng của lực 10N, thì lực ma sát tối đa có thể tác dụng lên vật là",
    "re": "Lực ma sát tối đa là 20N (nếu hệ số ma sát là 1)"
  },
  {
    "con": "Khi một vật quay quanh một trục với vận tốc không đổi, nếu bán kính quỹ đạo tăng lên thì",
    "re": "Lực hướng tâm cần thiết cũng sẽ tăng lên"
  },
  {
    "con": "Nếu một sóng âm có tần số 440Hz và tốc độ truyền sóng là 340m/s, thì",
    "re": "Chiều dài sóng là khoảng 0.773m"
  },
  {
    "con": "Từ độ cao h = 80 m so với mặt đất, một vật nhỏ được ném ngang với tốc độ ban đầu v_{o} = 20 \\frac{m}{s}. Bỏ qua sức cản của không khí. Lấy gia tốc rơi tự do g = 10 \\frac{m}{s^2}. Chọn gốc thời gian là khi ném vật. Véctơ vận tốc của vật hợp với phương thẳng đứng một góc \\alpha = 60\\circ vào thời điểm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m = 5 kg được treo lơ lửng trong trọng trường. Lực kéo của dây treo bằng 50 N",
    "re": "Vật đang ở trạng thái cân bằng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v = 15 \\frac{m}{s} trong 10 giây",
    "re": "Quãng đường đi được là 150 m"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h = 20 m, bỏ qua sức cản của không khí",
    "re": "Thời gian rơi là khoảng 2 \\sqrt{2} giây"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén một đoạn x = 0.1 m",
    "re": "Năng lượng tiềm năng đàn hồi của lò xo là 1 J"
  },
  {
    "con": "Một vật có khối lượng m = 10 kg di chuyển với vận tốc v = 5 \\frac{m}{s} và va chạm hoàn toàn đàn hồi với một vật khác có khối lượng m' = 10 kg đứng yên",
    "re": "Sau va chạm, vật đầu tiên dừng lại và vật thứ hai chuyển động với vận tốc 5 \\frac{m}{s}"
  },
  {
    "con": "Một vật có khối lượng m = 2 kg được kéo lên cao với gia tốc a = 2 \\frac{m}{s^2} trong trọng trường",
    "re": "Lực kéo cần thiết là 24 N"
  },
  {
    "con": "Một dòng điện có cường độ I = 3 A chạy qua một điện trở R = 4 \\Omega",
    "re": "Điện áp trên điện trở là 12 V"
  },
  {
    "con": "Một vật có khối lượng m = 1 kg được đặt trên mặt phẳng nghiêng với góc nghiêng \\theta = 30\\circ",
    "re": "Lực tác dụng lên vật theo phương vuông góc với mặt phẳng là 5 N"
  },
  {
    "con": "Một sóng âm có tần số f = 440 Hz và vận tốc truyền trong không khí v = 340 \\frac{m}{s}",
    "re": "Chiều dài sóng là 0.772 m"
  },
  {
    "con": "Một chiếc xe có khối lượng m = 100 kg đang chạy với vận tốc 30,6 \\frac{km}{h} thì hãm phanh. Biết lực hãm phanh là 250N. Quãng đường hãm phanh là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2 kg rơi tự do từ độ cao 20 m thì thời gian rơi xuống đất là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0,1 m thì năng lượng tiềm năng đàn hồi trong lò xo là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chiếc xe hơi di chuyển với vận tốc 60 km/h và có khối lượng 1200 kg thì động năng của xe là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 5 kg được kéo lên cao 3 m thì công thực hiện để nâng vật là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một dòng điện có cường độ 2 A chạy qua một điện trở 5 Ω thì điện áp trên điện trở là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 10 kg đang chuyển động với vận tốc 15 m/s thì lực quán tính của vật là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chiếc thuyền có khối lượng 300 kg đang nổi trên mặt nước thì lực đẩy Archimedes tác động lên thuyền là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 1 kg được ném lên với vận tốc 20 m/s thì độ cao tối đa mà vật đạt được là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một nguồn sáng phát ra ánh sáng với công suất 100 W thì độ sáng tại một điểm cách nguồn 2 m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một thang máy đang chuyển động xuống dưới với gia tốc a <g .Hệ quy chiếu nào dưới đây là hệ quy chiếu phi quán tính?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do trong chân không không bị cản trở bởi lực nào khác ngoài trọng lực.",
    "re": "Vật sẽ có gia tốc không đổi bằng gia tốc trọng trường g."
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng m, và vật đó không chuyển động.",
    "re": "Lực tác dụng phải được cân bằng bởi một lực khác."
  },
  {
    "con": "Một vật chuyển động tròn với tốc độ không đổi.",
    "re": "Vật đó vẫn chịu tác động của một lực hướng tâm."
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên.",
    "re": "Năng lượng nội tại của vật đó cũng sẽ tăng lên."
  },
  {
    "con": "Một lò xo bị nén hoặc kéo ra.",
    "re": "Lực đàn hồi của lò xo sẽ tỉ lệ thuận với độ biến dạng của nó."
  },
  {
    "con": "Khi một vật va chạm với một vật khác và không có lực bên ngoài tác động.",
    "re": "Tổng động lượng của hệ sẽ được bảo toàn."
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước.",
    "re": "Ánh sáng sẽ bị khúc xạ và thay đổi hướng."
  },
  {
    "con": "Một điện trở có điện áp U và dòng điện I chạy qua.",
    "re": "Công suất tiêu thụ của điện trở sẽ bằng P = U * I."
  },
  {
    "con": "Khi một vật được thả rơi từ độ cao h.",
    "re": "Thời gian rơi sẽ tỉ lệ với căn bậc hai của độ cao h."
  },
  {
    "con": "Một người gánh một thúng lúa và một thúng gạo, thúng lúa nặng 10kg, thúng gạo nặng 15kg. Đòn gánh dài 1m, hai thúng đặt ở hai đầu mút của đòn gánh. Vị trí đòn gánh đặt trên vai để hai thúng cân bằng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2kg và được thả rơi tự do từ độ cao 10m, thì vật đó sẽ đạt tốc độ khoảng 14m/s khi chạm đất",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chiếc xe hơi di chuyển với vận tốc 60 km/h và đột ngột phanh lại, thì xe sẽ dừng lại sau một khoảng cách nhất định phụ thuộc vào lực phanh",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một lực tác động lên một vật có khối lượng 5kg, thì gia tốc của vật đó sẽ tỷ lệ thuận với lực và tỷ lệ nghịch với khối lượng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật quay quanh một trục, thì lực hướng tâm cần thiết để giữ vật đó trong quỹ đạo tỷ lệ thuận với khối lượng và tốc độ của vật",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một lò xo bị nén hoặc kéo dài, thì lực phục hồi của lò xo sẽ tỷ lệ thuận với độ biến dạng của nó",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, thì nó sẽ bị khúc xạ và thay đổi hướng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có điện tích dương và một vật có điện tích âm lại gần nhau, thì chúng sẽ hút nhau",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật dao động trong một môi trường, thì tần số dao động của nó sẽ không thay đổi nếu môi trường không thay đổi",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật được đặt trong một trường hấp dẫn, thì nó sẽ chịu tác động của lực hấp dẫn tỷ lệ thuận với khối lượng của nó",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chia một vật khối lượng M thành 2 phần m_{1} và m_{2} rồi đặt chúng ở một khoảng cách xác định",
    "re": "lực hấp dẫn giữa m_{1} và m_{2} lớn nhất khi chúng ở gần nhau nhất"
  },
  {
    "con": "Tăng tốc độ của một vật trong một khoảng thời gian nhất định",
    "re": "thì lực tác dụng lên vật đó sẽ tăng theo định luật Newton thứ hai"
  },
  {
    "con": "Giảm độ cao của một vật đang rơi tự do",
    "re": "thì thời gian rơi sẽ giảm theo quy luật của chuyển động rơi tự do"
  },
  {
    "con": "Tăng khối lượng của một vật trong một hệ thống kín",
    "re": "thì năng lượng toàn phần của hệ thống sẽ không thay đổi theo định luật bảo toàn năng lượng"
  },
  {
    "con": "Đặt một vật trong một trường điện từ",
    "re": "thì vật sẽ chịu tác dụng của lực điện và lực từ"
  },
  {
    "con": "Tăng nhiệt độ của một chất lỏng",
    "re": "thì thể tích của chất lỏng đó sẽ tăng lên theo quy luật giãn nở nhiệt"
  },
  {
    "con": "Đặt một vật vào trong chân không",
    "re": "thì vật sẽ không chịu tác dụng của lực cản không khí"
  },
  {
    "con": "Thay đổi hướng của một lực tác dụng lên một vật",
    "re": "thì chuyển động của vật sẽ thay đổi theo hướng của lực mới"
  },
  {
    "con": "Tăng khoảng cách giữa hai điện tích cùng dấu",
    "re": "thì lực đẩy giữa chúng sẽ giảm theo định luật Coulomb"
  },
  {
    "con": "Giảm tốc độ của một vật đang chuyển động",
    "re": "thì vật sẽ mất năng lượng động năng theo định luật bảo toàn năng lượng"
  },
  {
    "con": "Chọn đúng tần số quay của kim giờ trên mặt đồng hồ",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Áp dụng định luật Newton thứ nhất cho một vật không chịu lực tác động",
    "re": "Vật sẽ giữ nguyên trạng thái chuyển động của nó"
  },
  {
    "con": "Tăng lực tác dụng lên một vật mà không thay đổi khối lượng của nó",
    "re": "Vật sẽ có gia tốc lớn hơn"
  },
  {
    "con": "Giảm khoảng cách giữa hai điện tích cùng dấu",
    "re": "Lực tương tác giữa chúng sẽ tăng lên"
  },
  {
    "con": "Sử dụng công thức F = ma với F là lực, m là khối lượng và a là gia tốc",
    "re": "Có thể tính được lực tác dụng lên vật"
  },
  {
    "con": "Đặt một vật trong môi trường chân không",
    "re": "Vật sẽ rơi tự do mà không bị cản trở"
  },
  {
    "con": "Tăng nhiệt độ của một chất lỏng",
    "re": "Chất lỏng sẽ mở rộng và có thể thay đổi trạng thái"
  },
  {
    "con": "Sử dụng định luật bảo toàn năng lượng trong một hệ kín",
    "re": "Tổng năng lượng của hệ sẽ không thay đổi"
  },
  {
    "con": "Chọn đúng đơn vị đo điện trở là Ohm",
    "re": "Có thể xác định được khả năng dẫn điện của vật liệu"
  },
  {
    "con": "Thực hiện thí nghiệm với lực hấp dẫn trên các vật thể khác nhau",
    "re": "Sẽ thấy rằng tất cả các vật thể rơi với gia tốc giống nhau"
  },
  {
    "con": "Một quả cầu khối lượng 0,5 kg được buộc vào đầu của 1 sợi dây dài 0,5 m rồi quay dây sao cho quả cầu chuyển động tròn đều trong mặt phẳng nằm ngang và sợi dây làm thành một góc 300 so với phương thẳng đứng. Lấy g = 9,8 \\frac{m}{s^2}. Xác định tốc độ dài của quả cầu.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2 kg rơi tự do từ độ cao 20 m. Lấy g = 9,8 \\frac{m}{s^2}. Tính vận tốc của vật khi chạm đất.",
    "re": "Vận tốc là 19,8 \\frac{m}{s}"
  },
  {
    "con": "Một chiếc xe ô tô di chuyển với vận tốc 20 m/s và dừng lại trong 5 giây. Tính gia tốc của xe.",
    "re": "Gia tốc là -4 \\frac{m}{s^2}"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0,1 m. Tính năng lượng tiềm năng đàn hồi trong lò xo.",
    "re": "Năng lượng tiềm năng đàn hồi là 1 J"
  },
  {
    "con": "Một vật có khối lượng 3 kg di chuyển với vận tốc 10 m/s. Tính động năng của vật.",
    "re": "Động năng là 150 J"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu 15 m/s. Tính chiều cao tối đa mà quả bóng đạt được. Lấy g = 9,8 \\frac{m}{s^2}.",
    "re": "Chiều cao tối đa là 11,5 m"
  },
  {
    "con": "Một vật có khối lượng 5 kg được kéo lên cao 2 m. Tính công thực hiện để kéo vật lên. Lấy g = 9,8 \\frac{m}{s^2}.",
    "re": "Công thực hiện là 98 J"
  },
  {
    "con": "Một chiếc xe lăn bánh trên mặt phẳng nằm ngang với lực ma sát 100 N. Nếu lực kéo là 300 N, thì lực tổng hợp tác dụng lên xe là bao nhiêu?",
    "re": "Lực tổng hợp là 200 N"
  },
  {
    "con": "Một vật có khối lượng 4 kg treo lơ lửng trên một sợi dây. Tính lực căng của dây khi vật đứng yên.",
    "re": "Lực căng của dây là 39,2 N"
  },
  {
    "con": "Một vật có khối lượng 1 kg quay tròn với bán kính 0,5 m và vận tốc 4 m/s. Tính gia tốc hướng tâm của vật.",
    "re": "Gia tốc hướng tâm là 32 m/s²"
  },
  {
    "con": "Hai vật rơi tự do từ cùng một độ cao, nơi có g=10\\frac{m}{s^2}. Biết sau 2s kể từ lúc vật hai bắt đầu rơi khoảng cách giữa hai vật là 2,5m. Hỏi vật hai rơi sau vật một bao lâu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2 kg và một vật có khối lượng 3 kg được thả rơi tự do từ cùng một độ cao. Nếu không có lực cản không khí, thì cả hai vật sẽ chạm đất cùng một lúc.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chiếc xe chuyển động với vận tốc 20 m/s. Nếu nó tăng tốc với gia tốc 2 m/s² trong 5 giây, thì vận tốc của xe sau 5 giây sẽ là 30 m/s.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật nặng 10 N được treo vào một sợi dây. Nếu lực kéo của dây là 10 N, thì vật sẽ ở trạng thái cân bằng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0,1 m. Nếu tính năng lượng tiềm năng của lò xo, thì năng lượng tiềm năng là 1 J.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 5 kg di chuyển với vận tốc 10 m/s. Nếu tính động năng của vật, thì động năng là 250 J.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính 2 m và vận tốc 4 m/s, thì gia tốc hướng tâm của vật là 8 m/s².",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 1 kg rơi từ độ cao 20 m, thì vận tốc của vật khi chạm đất sẽ khoảng 20 m/s (không tính lực cản không khí).",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một dòng điện có cường độ 3 A chạy qua một điện trở 4 Ω. Nếu tính công suất tiêu thụ của điện trở, thì công suất là 12 W.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 2 kg được kéo lên cao 5 m với gia tốc trọng trường g = 10 m/s², thì công thực hiện để nâng vật là 100 J.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cho cơ hệ như hình vẽ, biết hai vật m_{1} = 1 kg; m_{2} = 2 kg, được nối với nhau bằng một sợi dây nhẹ không giãn, bắc qua một ròng rọc có ma sát không đáng kể. Cho g = 10 \\frac{m}{s^2}, Tính sức căng của sợi dây và gia tốc của cơ hệ ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chuyển động thẳng đều với vận tốc v, thì quãng đường đi được trong thời gian t là s = v * t.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực F và có khối lượng m, thì gia tốc a của vật được tính bằng công thức a = \\frac{F}{m}.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, thì thời gian rơi t được tính bằng công thức t = \\sqrt{\\frac{2h}{g}} với g là gia tốc trọng trường.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động năng của vật được tính bằng công thức E_k = \\frac{1}{2}mv^2.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật bị kéo lên cao với lực F và có khối lượng m, thì công thực hiện để nâng vật lên được tính bằng W = F * h.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một lò xo có độ cứng k bị nén hoặc kéo một khoảng x, thì lực đàn hồi F của lò xo được tính bằng công thức F = -kx.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật quay quanh một trục với bán kính r và vận tốc góc \\omega, thì vận tốc tuyến tính v của vật được tính bằng công thức v = r\\omega.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sóng có tần số f và bước sóng \\lambda, thì vận tốc của sóng v được tính bằng công thức v = f\\lambda.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một điện trở có điện trở R và có dòng điện I chạy qua, thì công suất P tiêu thụ được tính bằng công thức P = RI^2.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật nặng m được nối vào sợi dây, đầu còn lại sợi dây nối vào điểm cố định Q (xem hình vẽ). Tác dụng lên vật m một lực F không đổi theo phương ngang, khi ở trạng thái cân bằng dây treo hợp với phương thẳng đứng một góc \\alpha. Chọn phương án sai?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi v, không có lực tác dụng lên nó.",
    "re": "Vật sẽ tiếp tục chuyển động với vận tốc v"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h, không có lực cản từ không khí.",
    "re": "Vật sẽ đạt vận tốc tối đa khi chạm đất"
  },
  {
    "con": "Một lò xo bị nén hoặc kéo ra một khoảng x, với độ cứng k.",
    "re": "Lực tác dụng lên lò xo sẽ bằng -kx"
  },
  {
    "con": "Một vật có khối lượng m di chuyển trên mặt phẳng nằm ngang với lực ma sát f.",
    "re": "Lực tổng hợp tác dụng lên vật sẽ bằng lực kéo trừ lực ma sát"
  },
  {
    "con": "Một điện tích q đặt trong điện trường E.",
    "re": "Điện tích sẽ chịu tác dụng của lực F = qE"
  },
  {
    "con": "Một dòng điện chạy qua một dây dẫn có điện trở R.",
    "re": "Công suất tiêu thụ điện sẽ bằng P = I^2R"
  },
  {
    "con": "Một vật có khối lượng m được thả rơi từ độ cao h.",
    "re": "Năng lượng tiềm năng của vật sẽ chuyển thành năng lượng động năng khi vật rơi"
  },
  {
    "con": "Một sóng âm truyền qua không khí với tốc độ v.",
    "re": "Tần số f của sóng sẽ liên quan đến bước sóng \\lambda theo công thức v = f\\lambda"
  },
  {
    "con": "Một vật có khối lượng m quay quanh một trục với vận tốc góc \\omega.",
    "re": "Lực ly tâm tác dụng lên vật sẽ bằng m\\omega^2r, với r là bán kính quay"
  },
  {
    "con": "Ca nô đi ngang qua sông từ M đến N như hình vẽ. Nhưng do dòng nước chảy nên sau một thời gian t = 2 phút, ca nô đến vị trí P ở bờ bên kia, cách P một đoạn NP =180m. Nếu người lái giữ cho mũi ca nô luôn hướng theo phương chếch với bờ sông góc 60\\circ và máy như trước thì ca nô sẽ sang đúng điểm N. Vận tốc của dòng nước so với bờ sông và vận tốc của ca nô so với dòng nước lần lượt là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Nếu h càng lớn thì thời gian rơi t sẽ càng dài.",
    "re": "Vật sẽ chạm đất sau thời gian t dài hơn"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v. Nếu vận tốc v tăng thì quãng đường đi được trong thời gian t sẽ tăng.",
    "re": "Quãng đường đi được sẽ lớn hơn"
  },
  {
    "con": "Một lò xo bị nén hoặc kéo ra. Nếu lực tác dụng lên lò xo tăng thì độ biến dạng của lò xo cũng sẽ tăng.",
    "re": "Lò xo sẽ bị biến dạng nhiều hơn"
  },
  {
    "con": "Một điện trở có điện áp U. Nếu điện áp U tăng thì cường độ dòng điện I chạy qua điện trở sẽ tăng theo định luật Ohm.",
    "re": "Cường độ dòng điện I sẽ lớn hơn"
  },
  {
    "con": "Một vật có khối lượng m. Nếu khối lượng m tăng thì trọng lực tác dụng lên vật sẽ tăng.",
    "re": "Trọng lực sẽ lớn hơn"
  },
  {
    "con": "Một vật đang chuyển động tròn đều. Nếu bán kính r của quỹ đạo tăng thì vận tốc góc ω sẽ giảm.",
    "re": "Vận tốc góc ω sẽ nhỏ hơn"
  },
  {
    "con": "Một sóng âm truyền trong không khí. Nếu nhiệt độ không khí tăng thì tốc độ truyền sóng âm sẽ tăng.",
    "re": "Tốc độ truyền sóng âm sẽ lớn hơn"
  },
  {
    "con": "Một vật có năng lượng động năng. Nếu vận tốc v của vật tăng thì năng lượng động năng sẽ tăng theo bình phương vận tốc.",
    "re": "Năng lượng động năng sẽ lớn hơn"
  },
  {
    "con": "Một vật chịu tác dụng của lực F. Nếu lực F tăng thì gia tốc a của vật sẽ tăng theo định luật Newton thứ hai.",
    "re": "Gia tốc a sẽ lớn hơn"
  },
  {
    "con": "Xe chạy chậm dần lên một dốc có độ dài là S. Tốc độ ở chân dốc 54\\frac{km}{h}, ở đỉnh dốc là 36\\frac{km}{h}. Chọn gốc tọa độ tại chân dốc, chiều dương là chiều chuyển động. Sau khi lên được nửa dốc thì tốc độ xe bằng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Thời gian rơi là t. Vận tốc của vật khi chạm đất bằng",
    "re": "v = g * t, với g là gia tốc trọng trường"
  },
  {
    "con": "Một lò xo bị nén với độ biến dạng x. Lực tác dụng lên lò xo bằng",
    "re": "F = k * x, với k là độ cứng của lò xo"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Động năng của vật bằng",
    "re": "E_k = \\frac{1}{2} m v^2"
  },
  {
    "con": "Một vật chịu tác dụng của lực F trong thời gian t. Công thực hiện bởi lực F bằng",
    "re": "A = F * s, với s là quãng đường vật di chuyển"
  },
  {
    "con": "Một vật có khối lượng m được treo trên một dây. Lực căng trong dây bằng",
    "re": "T = m * g, với g là gia tốc trọng trường"
  },
  {
    "con": "Một dòng điện I chạy qua một điện trở R. Nhiệt lượng tỏa ra trong thời gian t bằng",
    "re": "Q = I^2 * R * t"
  },
  {
    "con": "Một sóng có tần số f và bước sóng λ. Tốc độ của sóng bằng",
    "re": "v = f * λ"
  },
  {
    "con": "Một vật có khối lượng m di chuyển theo chiều ngang với vận tốc v. Lực quán tính của vật bằng",
    "re": "F = m * a, với a là gia tốc của vật"
  },
  {
    "con": "Một vật quay quanh một trục với bán kính r và vận tốc góc ω. Tốc độ tuyến tính của vật bằng",
    "re": "v = r * ω"
  },
  {
    "con": "Một vật khối lượng m = 0,4 kg đặt trên mặt bàn nằm ngang như hình bên. Hệ số ma sát trượt giữa vật và mặt bàn là \\mut = 0,2. Tác dụng vào vật một lực kéo F_{k} = 1 N có phương nằm ngang. Lấy gia tốc rơi tự do g = 10 \\frac{m}{s^2}. Sau 2 giây kể từ lúc tác dụng lực kéo F_{k} vật đi được quãng đường là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v = 5 m/s. Nếu thời gian chuyển động là t = 4 giây",
    "re": "Quãng đường vật đi được là 20 m"
  },
  {
    "con": "Một vật có khối lượng m = 2 kg rơi tự do từ độ cao h = 20 m. Lấy g = 10 \\frac{m}{s^2}",
    "re": "Thời gian rơi của vật là 2 giây"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén một đoạn x = 0,1 m",
    "re": "Lực đàn hồi của lò xo là 20 N"
  },
  {
    "con": "Một vật có khối lượng m = 3 kg được kéo lên cao với gia tốc a = 2 \\frac{m}{s^2} và g = 10 \\frac{m}{s^2}",
    "re": "Lực kéo cần thiết là 36 N"
  },
  {
    "con": "Một vật có khối lượng m = 5 kg nằm trên mặt phẳng nghiêng với góc nghiêng \\theta = 30 độ. Lấy g = 10 \\frac{m}{s^2}",
    "re": "Lực tác dụng lên vật theo phương vuông góc với mặt phẳng là 25 N"
  },
  {
    "con": "Một vật có khối lượng m = 1 kg di chuyển với vận tốc v = 10 m/s. Nếu vật va chạm hoàn toàn đàn hồi với vật khác có khối lượng m' = 1 kg đứng yên",
    "re": "Vận tốc của hai vật sau va chạm là 5 m/s"
  },
  {
    "con": "Một vật có khối lượng m = 4 kg được treo vào một lò xo có độ cứng k = 100 N/m. Nếu lò xo bị kéo dãn một đoạn x",
    "re": "Lực đàn hồi của lò xo là 400 N"
  },
  {
    "con": "Một vật có khối lượng m = 0,5 kg được ném thẳng đứng lên với vận tốc ban đầu v_0 = 20 m/s. Lấy g = 10 \\frac{m}{s^2}",
    "re": "Chiều cao cực đại mà vật đạt được là 20 m"
  },
  {
    "con": "Một vật có khối lượng m = 2 kg chuyển động tròn đều với bán kính r = 3 m và vận tốc v = 6 m/s",
    "re": "Gia tốc hướng tâm của vật là 12 \\frac{m}{s^2}"
  },
  {
    "con": "Đặt hai quả cầu có khối lượng là m_{1} và m_{2} cùng trên một đường thẳng và giữ cho quả cầu 1 cố định. Khi đặt cho quả cầu 2 vào vị trí A thì lực hút giữa chúng là 36.10^-4 N; khi đặt quả cầu 2 vào vị trí B thì lực hút giữa chúng là 9.10^-4 N. Lực hút giữa chúng khi đặt quả cầu 2 vào trung điểm của đoạn AB là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m rơi tự do từ độ cao h. Khi chạm đất, vận tốc của vật là",
    "re": "v = √(2gh)"
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m, nếu lực này không thay đổi và vật bắt đầu chuyển động, thì gia tốc của vật là",
    "re": "a = F/m"
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính r và vận tốc v, thì lực hướng tâm tác dụng lên vật là",
    "re": "F = mv²/r"
  },
  {
    "con": "Nếu một vật có khối lượng m được kéo lên cao với lực F, thì công thực hiện bởi lực này là",
    "re": "W = F * h"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí, nếu tần số f của sóng tăng lên, thì bước sóng λ của sóng sẽ",
    "re": "giảm xuống"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v và va chạm hoàn toàn đàn hồi với một vật khác, thì tổng động năng của hai vật sau va chạm sẽ",
    "re": "bằng tổng động năng trước va chạm"
  },
  {
    "con": "Khi một vật chịu tác dụng của hai lực cùng phương và cùng chiều, thì lực tổng hợp tác dụng lên vật là",
    "re": "tổng của hai lực đó"
  },
  {
    "con": "Nếu một vật được ném lên với vận tốc ban đầu v và góc ném θ, thì thời gian vật bay lên đến điểm cao nhất là",
    "re": "t = v * sin(θ) / g"
  },
  {
    "con": "Khi một vật dao động điều hòa với biên độ A và tần số f, thì vận tốc cực đại của vật là",
    "re": "v_max = 2πfA"
  },
  {
    "con": "Hai ô tô cùng chuyển động thẳng đều từ hai bến xe A và B cách nhau 20 km trên một đoạn đường thẳng. Nếu hai ô tô chạy ngược chiều thì chúng sẽ gặp nhau sau 15 phút. Nếu hai ô tô chạy cùng chiều thì chúng sẽ đuổi kịp nhau sau 1 giờ. Vận tốc của hai ô tô lần lượt là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Nếu h = 20 m thì thời gian rơi của vật sẽ là khoảng 2 giây.",
    "re": "Vật sẽ chạm đất sau 2 giây"
  },
  {
    "con": "Một lò xo có độ cứng k. Nếu lò xo bị nén một đoạn x thì lực tác dụng lên lò xo sẽ là F = k * x.",
    "re": "Lực tác dụng lên lò xo tỉ lệ thuận với độ nén"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Nếu vận tốc tăng gấp đôi thì động năng của vật sẽ tăng gấp bốn lần.",
    "re": "Động năng tỉ lệ với bình phương vận tốc"
  },
  {
    "con": "Một dòng điện chạy qua một dây dẫn. Nếu điện trở của dây dẫn tăng thì cường độ dòng điện sẽ giảm nếu điện áp không đổi.",
    "re": "Cường độ dòng điện tỉ lệ nghịch với điện trở"
  },
  {
    "con": "Một vật có khối lượng m được treo vào một lò xo. Nếu khối lượng tăng gấp đôi thì độ dài của lò xo sẽ tăng lên một lượng nhất định.",
    "re": "Lực kéo của lò xo tỉ lệ với khối lượng"
  },
  {
    "con": "Một quả bóng được ném lên cao. Nếu lực tác dụng lên quả bóng là trọng lực thì quả bóng sẽ dừng lại và rơi xuống.",
    "re": "Quả bóng sẽ dừng lại tại điểm cao nhất"
  },
  {
    "con": "Một chiếc xe đang chạy với vận tốc v. Nếu xe phanh lại và dừng lại trong thời gian t thì quãng đường xe đã đi được sẽ là S = v * t.",
    "re": "Quãng đường tỉ lệ với vận tốc và thời gian"
  },
  {
    "con": "Một vật có khối lượng m di chuyển trong không gian. Nếu không có lực tác dụng thì vật sẽ tiếp tục chuyển động với vận tốc không đổi.",
    "re": "Vật sẽ giữ nguyên vận tốc nếu không có lực tác dụng"
  },
  {
    "con": "Một sóng âm truyền trong không khí. Nếu nhiệt độ không khí tăng thì tốc độ truyền sóng âm cũng sẽ tăng.",
    "re": "Tốc độ truyền sóng âm tỉ lệ thuận với nhiệt độ không khí"
  },
  {
    "con": "Khối lượng súng là 4kg và của đạn là 50g. Lúc thoát khỏi nòng súng, đạn có vận tốc 800\\frac{m}{s}. Vận tốc giật lùi của súng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2kg và được tác động bởi lực 10N trong 5 giây. Vận tốc cuối cùng của vật là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20m. Thời gian để vật chạm đất là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0.1m. Năng lượng tiềm năng trong lò xo là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chiếc xe có khối lượng 1000kg di chuyển với vận tốc 20m/s. Động năng của xe là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 5kg được kéo lên cao 3m. Công thực hiện để nâng vật là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một dòng điện có cường độ 2A chạy qua một điện trở 5Ω. Điện áp trên điện trở là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 10kg và được kéo với lực 30N. Gia tốc của vật là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sóng âm có tần số 440Hz và vận tốc 340m/s. Chiều dài sóng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 3kg và được ném lên với vận tốc 15m/s. Độ cao tối đa mà vật đạt được là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Thanh AB đồng chất, tiết diện đều, trọng lượng 6N, có đầu A tì vào sàn nhà nằm ngang, đầu B được giữ bởi một lò xo BC, độ cứng k = 250\\frac{N}{m}, theo phương thẳng đứng như hình 4. Độ dãn của lò xo khi thanh cân bằng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2kg rơi tự do từ độ cao 20m, không có lực cản không khí tác động, thì vận tốc của vật khi chạm đất là",
    "re": "Vận tốc là 20m/s"
  },
  {
    "con": "Một lò xo có độ cứng k = 100\\frac{N}{m} bị nén 0.5m, thì lực nén tác dụng lên lò xo là",
    "re": "Lực nén là 50N"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc 10m/s trong 5 giây, thì quãng đường mà vật đi được là",
    "re": "Quãng đường là 50m"
  },
  {
    "con": "Một vật có khối lượng 5kg được kéo lên cao với lực 60N, thì gia tốc của vật là",
    "re": "Gia tốc là 3m/s²"
  },
  {
    "con": "Một dòng điện có cường độ 2A chạy qua một điện trở 5Ω, thì điện áp trên điện trở là",
    "re": "Điện áp là 10V"
  },
  {
    "con": "Một vật có khối lượng 1kg di chuyển với vận tốc 15m/s, thì động năng của vật là",
    "re": "Động năng là 112.5J"
  },
  {
    "con": "Một vật nặng 10N treo lơ lửng trên một lò xo, thì độ dãn của lò xo khi vật ở trạng thái cân bằng là",
    "re": "Độ dãn của lò xo là 0.1m nếu k = 100\\frac{N}{m}"
  },
  {
    "con": "Một vật có khối lượng 3kg được thả rơi từ độ cao 15m, thì năng lượng tiềm năng của vật tại độ cao đó là",
    "re": "Năng lượng tiềm năng là 45J"
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính 2m và vận tốc 4m/s, thì gia tốc hướng tâm của vật là",
    "re": "Gia tốc hướng tâm là 8m/s²"
  },
  {
    "con": "Vệ tinh nhân tạo của Trái Đất ở độ cao 300 km bay với tốc độ 7,9 k\\frac{m}{s}. Tính tốc độ góc, chu kì của nó. Coi chuyển động là tròn đều. Bán kính trái đất bằng 6400 km",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2 kg chịu tác dụng của lực 10 N. Tính gia tốc của vật.",
    "re": "Gia tốc của vật là 5 m/s²"
  },
  {
    "con": "Một chiếc xe ô tô di chuyển với vận tốc 20 m/s và dừng lại trong 5 giây. Tính gia tốc của xe.",
    "re": "Gia tốc của xe là -4 m/s²"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu 15 m/s. Tính chiều cao tối đa mà quả bóng đạt được.",
    "re": "Chiều cao tối đa là 11,5 m"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20 m. Tính thời gian vật rơi đến mặt đất.",
    "re": "Thời gian rơi là khoảng 2,02 giây"
  },
  {
    "con": "Một lò xo có độ cứng 200 N/m bị nén 0,1 m. Tính năng lượng tiềm năng của lò xo.",
    "re": "Năng lượng tiềm năng là 1 J"
  },
  {
    "con": "Một vật có khối lượng 3 kg di chuyển với vận tốc 10 m/s. Tính động năng của vật.",
    "re": "Động năng của vật là 150 J"
  },
  {
    "con": "Một dòng điện có cường độ 2 A chạy qua một điện trở 5 Ω. Tính điện áp trên điện trở.",
    "re": "Điện áp là 10 V"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz và vận tốc 340 m/s. Tính bước sóng của sóng âm.",
    "re": "Bước sóng là 0,773 m"
  },
  {
    "con": "Một vật có khối lượng 1 kg được nâng lên cao 2 m. Tính công thực hiện để nâng vật.",
    "re": "Công thực hiện là 19,6 J"
  },
  {
    "con": "Một lò xo có độ cứng k, có chiều dài tự nhiên l_{0} một đầu giữ cố định ở A đầu kia gắn vào quả cầu khối lượng m có thể trượt không ma sát trên thanh (\\Delta) nằm ngang. Thanh (\\Delta) quay đều với vận tốc góc \\omega quanh trục (\\Delta) thẳng đứng. Tính độ dãn của lò xo khi l_{0} = 20 cm, \\omega = 20\\pi \\frac{rad}{s}, m = 10 g; k = 200 \\frac{N}{m}, \\pi = 10",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m rơi tự do từ độ cao h, không chịu tác động của lực cản không khí",
    "re": "Vật sẽ đạt vận tốc tối đa v = \\sqrt{2gh} khi chạm đất"
  },
  {
    "con": "Một điện trở R được nối với nguồn điện có hiệu điện thế U",
    "re": "Dòng điện I chạy qua điện trở sẽ được tính bằng công thức I = \\frac{U}{R}"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc v",
    "re": "Quãng đường s vật đi được trong thời gian t sẽ là s = vt"
  },
  {
    "con": "Một lò xo bị nén hoặc kéo với độ dãn x",
    "re": "Lực F tác dụng lên lò xo sẽ được tính bằng công thức F = kx, với k là độ cứng của lò xo"
  },
  {
    "con": "Một vật có khối lượng m di chuyển trên mặt phẳng nằm ngang với lực ma sát f",
    "re": "Lực tổng hợp F sẽ bằng F = ma - f, với a là gia tốc của vật"
  },
  {
    "con": "Một sóng âm có tần số f và tốc độ truyền sóng v",
    "re": "Chiều dài sóng \\lambda sẽ được tính bằng công thức \\lambda = \\frac{v}{f}"
  },
  {
    "con": "Một vật có khối lượng m được treo vào một lò xo",
    "re": "Lò xo sẽ dãn một khoảng x, với F = mg = kx, trong đó g là gia tốc trọng trường"
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính r và vận tốc góc \\omega",
    "re": "Gia tốc hướng tâm a sẽ được tính bằng công thức a = \\omega^2 r"
  },
  {
    "con": "Một nguồn sáng phát ra ánh sáng với cường độ I",
    "re": "Cường độ ánh sáng tại một điểm cách nguồn một khoảng d sẽ giảm theo công thức I' = \\frac{I}{4\\pi d^2}"
  },
  {
    "con": "Một vận động viên đứng cách lưới 8m theo phương ngang và nhảy lên cao để đập bóng từ độ cao 3m với mặt đất bóng đập theo phương ngang g=10\\frac{m}{s^2}. Giả sử đập bóng với tốc độ vừa đủ để bóng qua sát mép trên lưới cách mặt đất 2,2m và bóng sẽ chạm đất ở bên kia lưới, cách lưới một khoảng bằng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20m, không có lực cản không khí",
    "re": "Thời gian rơi là khoảng 2,02 giây"
  },
  {
    "con": "Một chiếc xe ô tô di chuyển với vận tốc không đổi 60 km/h trên đường thẳng",
    "re": "Gia tốc của xe là 0 m/s²"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu 15 m/s và chịu tác động của trọng lực g=9,8 m/s²",
    "re": "Quả bóng sẽ đạt độ cao tối đa khoảng 11,5m"
  },
  {
    "con": "Một lò xo có độ cứng k=200 N/m bị nén 0,1m",
    "re": "Năng lượng tiềm năng đàn hồi của lò xo là 1 J"
  },
  {
    "con": "Một vật có khối lượng 5 kg di chuyển với vận tốc 10 m/s",
    "re": "Động năng của vật là 250 J"
  },
  {
    "con": "Một dòng điện có cường độ 2 A chạy qua một điện trở 5 Ω",
    "re": "Điện áp trên điện trở là 10 V"
  },
  {
    "con": "Một vật có khối lượng 10 kg được kéo lên cao 5m với gia tốc trọng trường g=9,8 m/s²",
    "re": "Công thực hiện để nâng vật là 490 J"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz di chuyển trong không khí với tốc độ 340 m/s",
    "re": "Chiều dài sóng là khoảng 0,773 m"
  },
  {
    "con": "Một vật có khối lượng 2 kg va chạm hoàn toàn đàn hồi với một vật khác có khối lượng 3 kg đứng yên",
    "re": "Tổng động lượng trước và sau va chạm được bảo toàn"
  },
  {
    "con": "Trong một tàu khối lượng M=2000kg đứng yên có một hòn bi nằm yên trên mặt bàn nằm ngang gắn với toa tàu và cao hơn sàn toa 1,25m. Toa tàu bắt đầu chạy thì hòn bi lăn không ma sát trên mặt bàn được 50cm rồi rơi xuống sàn toa cách mép bàn theo phương ngang 78cm. Bỏ qua ma sát cản chuyển động của tàu . Lực kéo toa tàu là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m được thả rơi tự do từ độ cao h, không có lực cản không khí tác động,",
    "re": "vật sẽ đạt vận tốc tối đa v = √(2gh) khi chạm đất"
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m,",
    "re": "vật sẽ có gia tốc a = F/m theo định luật II Newton"
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính r và vận tốc v,",
    "re": "vật sẽ có gia tốc hướng tâm a_c = v²/r"
  },
  {
    "con": "Nếu một vật dao động điều hòa với biên độ A và tần số f,",
    "re": "thì chu kỳ T của dao động là T = 1/f"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước,",
    "re": "nó sẽ bị khúc xạ và giảm tốc độ"
  },
  {
    "con": "Nếu một điện trở R được nối với một nguồn điện có hiệu điện thế U,",
    "re": "thì dòng điện I chạy qua điện trở sẽ được tính bằng công thức I = U/R"
  },
  {
    "con": "Khi một vật chịu tác dụng của hai lực cùng phương và cùng chiều,",
    "re": "lực tổng hợp sẽ bằng tổng hai lực đó"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v và va chạm hoàn toàn đàn hồi với một vật khác,",
    "re": "thì tổng động năng của hai vật sẽ được bảo toàn"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí,",
    "re": "tốc độ của sóng âm sẽ phụ thuộc vào nhiệt độ của không khí"
  },
  {
    "con": "Cho hệ thống như hình vẽ, m_{1} = 3kg, m_{2} = 4kg. Bỏ qua khối lượng ròng rọc và dây. Cho g = 10\\frac{m}{s^2}. Tính gia tốc chuyển động của mỗi vật. Bỏ qua ma sát",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2kg rơi tự do từ độ cao 20m. Bỏ qua sức cản của không khí",
    "re": "Thời gian rơi là 2s"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0.1m",
    "re": "Năng lượng tiềm năng trong lò xo là 1 J"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc 5 m/s trong 10 giây",
    "re": "Quãng đường đi được là 50 m"
  },
  {
    "con": "Một vật có khối lượng 10kg được kéo lên cao với lực 100N, bỏ qua ma sát",
    "re": "Gia tốc của vật là 0 m/s²"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu 15 m/s, bỏ qua sức cản không khí",
    "re": "Chiều cao tối đa đạt được là 11.5 m"
  },
  {
    "con": "Một vật có khối lượng 5kg chuyển động với vận tốc 10 m/s",
    "re": "Động năng của vật là 250 J"
  },
  {
    "con": "Một dòng điện có cường độ 2A chạy qua một điện trở 5Ω",
    "re": "Điện áp trên điện trở là 10V"
  },
  {
    "con": "Một vật có khối lượng 3kg được đặt trên mặt phẳng nghiêng với góc 30 độ",
    "re": "Lực kéo xuống mặt phẳng là 14.7 N"
  },
  {
    "con": "Một sóng âm có tần số 440Hz di chuyển trong không khí với tốc độ 340m/s",
    "re": "Chiều dài sóng là 0.773m"
  },
  {
    "con": "Trong các phát biểu dưới đây, phát biểu nào đúng ? Chuyển động cơ là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi trong một khoảng thời gian nhất định,",
    "re": "quãng đường đi được là tích của vận tốc và thời gian."
  },
  {
    "con": "Khi một lực tác dụng lên một vật và không có lực nào khác tác dụng lên vật đó,",
    "re": "vật sẽ chuyển động theo hướng của lực tác dụng."
  },
  {
    "con": "Nếu một vật chịu tác dụng của trọng lực,",
    "re": "vật sẽ có xu hướng rơi xuống dưới."
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên,",
    "re": "thể tích của chất khí sẽ tăng nếu áp suất không đổi."
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn một vật khác,",
    "re": "thì lực hấp dẫn giữa hai vật đó sẽ lớn hơn."
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước,",
    "re": "ánh sáng sẽ bị khúc xạ và thay đổi hướng."
  },
  {
    "con": "Nếu một vật dao động quanh vị trí cân bằng,",
    "re": "thì nó sẽ tạo ra sóng."
  },
  {
    "con": "Khi một điện tích dương và một điện tích âm lại gần nhau,",
    "re": "chúng sẽ hút nhau."
  },
  {
    "con": "Nếu một vật được ném lên cao,",
    "re": "thì nó sẽ đạt đến độ cao cực đại trước khi rơi xuống."
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi",
    "re": "Gia tốc của vật đó bằng 0"
  },
  {
    "con": "Lực tác dụng lên một vật có khối lượng m",
    "re": "Vật sẽ có gia tốc a = F/m, với F là lực tác dụng"
  },
  {
    "con": "Một vật rơi tự do trong môi trường không có sức cản",
    "re": "Vật sẽ tăng tốc với gia tốc khoảng 9.81 m/s²"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt",
    "re": "Năng lượng tổng trong một hệ kín luôn được bảo toàn"
  },
  {
    "con": "Một lò xo bị nén hoặc kéo dài",
    "re": "Lực phục hồi của lò xo tỉ lệ thuận với độ biến dạng của nó"
  },
  {
    "con": "Một vật có khối lượng lớn hơn vật khác",
    "re": "Vật nặng hơn không nhất thiết rơi nhanh hơn vật nhẹ hơn trong chân không"
  },
  {
    "con": "Một dòng điện chạy qua một dây dẫn",
    "re": "Sẽ tạo ra một từ trường xung quanh dây dẫn đó"
  },
  {
    "con": "Nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nội của vật đó cũng sẽ tăng lên"
  },
  {
    "con": "Một vật chuyển động tròn đều",
    "re": "Vật đó vẫn có gia tốc do sự thay đổi hướng của vận tốc"
  },
  {
    "con": "Một vật va chạm đàn hồi với một vật khác",
    "re": "Tổng động năng của hai vật sẽ được bảo toàn sau va chạm"
  },
  {
    "con": "Phát biểu nào sau đây là sai khi nói về khái niệm gia tốc?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động nhanh dần đều thì",
    "re": "Gia tốc a > 0"
  },
  {
    "con": "Một vật chuyển động chậm dần đều thì",
    "re": "Gia tốc a < 0"
  },
  {
    "con": "Một vật đứng yên thì",
    "re": "Vận tốc v = 0"
  },
  {
    "con": "Lực tác dụng lên một vật không đổi thì",
    "re": "Gia tốc a là hằng số"
  },
  {
    "con": "Một vật chịu tác dụng của lực hấp dẫn thì",
    "re": "Nó sẽ rơi tự do với gia tốc g ≈ 9.81 m/s²"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác thì",
    "re": "Tổng động năng trước và sau va chạm là như nhau"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên thì",
    "re": "Thể tích của vật khí sẽ tăng nếu áp suất không đổi"
  },
  {
    "con": "Khi một vật quay quanh một trục thì",
    "re": "Lực hướng tâm cần thiết để giữ vật trong quỹ đạo"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác thì",
    "re": "Tốc độ ánh sáng thay đổi tùy thuộc vào chỉ số khúc xạ của môi trường"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn thì",
    "re": "Dây dẫn sẽ sinh ra một từ trường xung quanh"
  },
  {
    "con": "Vật chuyển động thẳng nhanh dần đều",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Lực tác dụng lên một vật không đổi",
    "re": "Vật sẽ có gia tốc không đổi"
  },
  {
    "con": "Năng lượng không được tạo ra hay tiêu hủy",
    "re": "Tổng năng lượng trong hệ kín là hằng số"
  },
  {
    "con": "Vật rơi tự do trong môi trường không có sức cản",
    "re": "Gia tốc của vật là 9.81 m/s²"
  },
  {
    "con": "Áp suất được tính bằng lực tác dụng trên diện tích",
    "re": "Áp suất tăng khi diện tích giảm"
  },
  {
    "con": "Nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nội tại của vật cũng tăng lên"
  },
  {
    "con": "Vật có khối lượng lớn hơn sẽ có trọng lực lớn hơn",
    "re": "Trọng lực tác dụng lên vật tỷ lệ thuận với khối lượng"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác",
    "re": "Ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Điện trở của một dây dẫn tỉ lệ thuận với chiều dài",
    "re": "Điện trở tăng khi chiều dài dây dẫn tăng"
  },
  {
    "con": "Khi một vật dao động điều hòa",
    "re": "Vật sẽ có vị trí và vận tốc thay đổi theo thời gian"
  },
  {
    "con": "Trong các phương trình của chất điểm chuyển động dưới đây, phương trình nào mô tả chuyển động thẳng biến đổi đều?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật rơi tự do từ độ cao nhất định, tốc độ của nó sẽ tăng lên theo thời gian.",
    "re": "Vật sẽ đạt đến tốc độ tối đa khi chạm đất"
  },
  {
    "con": "Khi lực tác dụng lên một vật tăng lên, gia tốc của vật cũng sẽ tăng lên nếu khối lượng không đổi.",
    "re": "Vật sẽ chuyển động nhanh hơn"
  },
  {
    "con": "Khi một vật di chuyển theo quỹ đạo tròn, lực hướng tâm luôn hướng về tâm của quỹ đạo.",
    "re": "Vật sẽ duy trì chuyển động tròn"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên, thể tích của chất khí sẽ tăng nếu áp suất không đổi.",
    "re": "Chất khí sẽ nở ra"
  },
  {
    "con": "Khi một vật va chạm với một vật khác và không có lực bên ngoài tác động, tổng động lượng của hệ sẽ được bảo toàn.",
    "re": "Tổng động lượng trước và sau va chạm sẽ bằng nhau"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nó sẽ bị khúc xạ và thay đổi hướng.",
    "re": "Ánh sáng sẽ chậm lại và đổi hướng"
  },
  {
    "con": "Khi một vật dao động điều hòa, nó sẽ có một tần số nhất định.",
    "re": "Vật sẽ lặp lại chuyển động theo chu kỳ"
  },
  {
    "con": "Khi một điện tích dương và một điện tích âm lại gần nhau, chúng sẽ hút nhau.",
    "re": "Lực hút giữa chúng sẽ tăng lên khi khoảng cách giảm"
  },
  {
    "con": "Khi một vật được nâng lên cao, năng lượng tiềm năng của nó sẽ tăng lên.",
    "re": "Vật sẽ có khả năng thực hiện công lớn hơn"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì quãng đường đi được tỉ lệ thuận với thời gian",
    "re": "Vận tốc của vật là không đổi"
  },
  {
    "con": "Khi lực tác dụng lên một vật tăng lên thì gia tốc của vật sẽ tăng lên",
    "re": "Nếu khối lượng của vật không thay đổi"
  },
  {
    "con": "Khi một vật rơi tự do thì tốc độ của nó sẽ tăng lên theo thời gian",
    "re": "Vì trọng lực tác động lên vật"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên thì thể tích của chất khí sẽ tăng lên",
    "re": "Nếu áp suất không đổi"
  },
  {
    "con": "Khi một vật va chạm với một vật khác thì tổng động lượng của hai vật sẽ được bảo toàn",
    "re": "Nếu không có lực bên ngoài tác động"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước thì nó sẽ bị khúc xạ",
    "re": "Vì sự thay đổi tốc độ ánh sáng"
  },
  {
    "con": "Khi một vật dao động thì nó sẽ quay trở lại vị trí cân bằng",
    "re": "Vì lực phục hồi tác động lên vật"
  },
  {
    "con": "Khi một điện tích dương và một điện tích âm lại gần nhau thì chúng sẽ hút nhau",
    "re": "Vì quy luật tương tác điện"
  },
  {
    "con": "Khi một vật được nâng lên cao thì năng lượng thế của nó sẽ tăng lên",
    "re": "Vì công của lực trọng trường"
  },
  {
    "con": "Khi một sóng âm đi qua không khí thì nó sẽ truyền đi với tốc độ nhất định",
    "re": "Vì sự dao động của các phân tử không khí"
  },
  {
    "con": "Khi một vật có khối lượng lớn hơn vật khác thì lực hấp dẫn giữa chúng sẽ lớn hơn",
    "re": "Vì định luật vạn vật hấp dẫn"
  },
  {
    "con": "Khi viết kết quả thực hành thì cách viết nào dưới đây là không đúng:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Vật thể chịu tác động của lực.",
    "re": "Vật thể sẽ thay đổi vận tốc của nó."
  },
  {
    "con": "Năng lượng không được tạo ra hay tiêu diệt.",
    "re": "Năng lượng chỉ chuyển đổi từ dạng này sang dạng khác."
  },
  {
    "con": "Vật thể có khối lượng lớn hơn.",
    "re": "Nó sẽ có trọng lực lớn hơn khi ở cùng một vị trí."
  },
  {
    "con": "Nhiệt độ của một vật tăng lên.",
    "re": "Năng lượng nhiệt của vật đó cũng sẽ tăng."
  },
  {
    "con": "Một vật chuyển động theo quỹ đạo tròn.",
    "re": "Nó sẽ chịu tác động của lực hướng tâm."
  },
  {
    "con": "Ánh sáng đi từ môi trường này sang môi trường khác.",
    "re": "Nó sẽ bị khúc xạ."
  },
  {
    "con": "Một vật rơi tự do.",
    "re": "Nó sẽ tăng tốc với gia tốc 9.81 m/s²."
  },
  {
    "con": "Một dòng điện chạy qua một dây dẫn.",
    "re": "Nó sẽ tạo ra một từ trường xung quanh dây dẫn."
  },
  {
    "con": "Một vật có khối lượng và vận tốc.",
    "re": "Nó sẽ có động năng."
  },
  {
    "con": "Một vật bị nén trong lò xo.",
    "re": "Nó sẽ có năng lượng tiềm năng đàn hồi."
  },
  {
    "con": "Chọn đáp án sai.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong các công thức dưới đây về chuyển động tròn đều, công thức nào là SAI?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi",
    "re": "quỹ đạo của nó là một đường thẳng"
  },
  {
    "con": "Khi lực tác dụng lên một vật tăng lên",
    "re": "gia tốc của vật cũng sẽ tăng lên nếu khối lượng không đổi"
  },
  {
    "con": "Một vật rơi tự do trong môi trường không có sức cản",
    "re": "tốc độ của nó sẽ tăng đều theo thời gian"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác",
    "re": "tổng động năng của hệ sẽ được bảo toàn"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác",
    "re": "lực hấp dẫn giữa chúng sẽ lớn hơn"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "năng lượng nội tại của vật cũng sẽ tăng"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước",
    "re": "tốc độ ánh sáng sẽ giảm và ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Nếu một dòng điện chạy qua một dây dẫn",
    "re": "sẽ tạo ra một từ trường xung quanh dây dẫn đó"
  },
  {
    "con": "Khi một vật quay quanh một trục",
    "re": "có một lực hướng tâm tác dụng lên vật đó"
  },
  {
    "con": "Đồ thị tọa độ - thời gian của chuyển động thẳng biến đổi đều có dạng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Lực tác dụng lên một vật có khối lượng m sẽ làm vật đó tăng tốc với gia tốc a",
    "re": "F = m * a"
  },
  {
    "con": "Năng lượng không thể tự sinh ra hoặc mất đi trong một hệ kín",
    "re": "Năng lượng được bảo toàn"
  },
  {
    "con": "Khi một vật chuyển động tròn đều, gia tốc hướng về tâm của vòng tròn",
    "re": "Gia tốc này gọi là gia tốc hướng tâm"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên, thể tích của vật khí thường sẽ tăng",
    "re": "Đây là quy luật Charles"
  },
  {
    "con": "Khi một vật rơi tự do, gia tốc của nó là gia tốc trọng trường",
    "re": "Gia tốc này khoảng 9.81 m/s²"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác, nó sẽ bị khúc xạ",
    "re": "Góc khúc xạ phụ thuộc vào chỉ số khúc xạ của hai môi trường"
  },
  {
    "con": "Khi một vật dao động điều hòa, nó sẽ có một tần số nhất định",
    "re": "Tần số này liên quan đến chu kỳ dao động"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn, nó sẽ tạo ra một từ trường xung quanh dây dẫn",
    "re": "Đây là nguyên lý của điện từ"
  },
  {
    "con": "Khi một vật va chạm với một vật khác, tổng động năng của hệ có thể được bảo toàn trong va chạm đàn hồi",
    "re": "Trong va chạm không đàn hồi, tổng động năng không được bảo toàn"
  },
  {
    "con": "Trong các công thức dưới đây công thức nào mô tả đúng công thức cộng vận tốc?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi trong một khoảng thời gian nhất định",
    "re": "Vật đó sẽ di chuyển một khoảng cách tỉ lệ thuận với thời gian"
  },
  {
    "con": "Khi lực tác dụng lên một vật tăng lên",
    "re": "Gia tốc của vật đó cũng sẽ tăng lên nếu khối lượng không đổi"
  },
  {
    "con": "Khi một vật rơi tự do trong môi trường không có sức cản",
    "re": "Vật đó sẽ tăng tốc với gia tốc khoảng 9.81 m/s²"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn một vật khác",
    "re": "Vật đó sẽ có trọng lực lớn hơn vật kia khi ở cùng một nơi"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác",
    "re": "Tổng động năng của hai vật sẽ được bảo toàn"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nội tại của vật đó cũng sẽ tăng lên"
  },
  {
    "con": "Nếu một vật quay quanh một trục",
    "re": "Vật đó sẽ có một lực hướng tâm tác dụng lên nó"
  },
  {
    "con": "Khi một sóng âm đi qua không khí",
    "re": "Nó sẽ truyền năng lượng từ nguồn phát đến tai người nghe"
  },
  {
    "con": "Nếu một điện tích dương và một điện tích âm lại gần nhau",
    "re": "Chúng sẽ hút nhau với một lực điện"
  },
  {
    "con": "Một học sinh đánh rơi cùng một lúc 2 vật: cặp sách và cái bút từ một vị trí ở tầng 2 xuống, bỏ qua lực cản của môi trường",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi trong một khoảng thời gian nhất định",
    "re": "Vị trí của vật sẽ thay đổi theo một đường thẳng"
  },
  {
    "con": "Một vật chịu tác dụng của lực kéo xuống và lực phản lực từ mặt đất",
    "re": "Vật sẽ ở trạng thái cân bằng nếu hai lực này bằng nhau"
  },
  {
    "con": "Một học sinh thả một quả bóng từ độ cao nhất định",
    "re": "Quả bóng sẽ rơi xuống đất do tác động của trọng lực"
  },
  {
    "con": "Một vật có khối lượng lớn hơn sẽ chịu tác động của lực hấp dẫn lớn hơn",
    "re": "Vật đó sẽ có trọng lực lớn hơn so với vật có khối lượng nhỏ hơn"
  },
  {
    "con": "Một chiếc xe đang di chuyển với vận tốc 60 km/h và phanh gấp",
    "re": "Chiếc xe sẽ giảm tốc độ và dừng lại sau một khoảng thời gian nhất định"
  },
  {
    "con": "Một học sinh kéo một chiếc xe đồ chơi trên mặt phẳng ngang",
    "re": "Lực kéo phải lớn hơn lực ma sát để xe di chuyển"
  },
  {
    "con": "Một vật được ném lên cao với một vận tốc ban đầu",
    "re": "Vật sẽ đạt đến độ cao cực đại trước khi rơi xuống"
  },
  {
    "con": "Một dòng điện chạy qua một dây dẫn",
    "re": "Sẽ tạo ra một từ trường xung quanh dây dẫn đó"
  },
  {
    "con": "Một chiếc gương phẳng phản chiếu hình ảnh của một vật",
    "re": "Hình ảnh phản chiếu sẽ có kích thước và hình dạng giống như vật thật"
  },
  {
    "con": "Trong chuyển động thẳng đều của một chất điểm thì:",
    "re": "vận tốc của chất điểm là không đổi"
  },
  {
    "con": "Khi một vật chịu tác dụng của lực không đổi thì:",
    "re": "vật sẽ có gia tốc không đổi"
  },
  {
    "con": "Khi một vật rơi tự do thì:",
    "re": "vật sẽ chịu tác dụng của trọng lực và gia tốc rơi tự do là 9.81 m/s²"
  },
  {
    "con": "Trong một hệ thống kín, tổng năng lượng được bảo toàn thì:",
    "re": "năng lượng không thể tự sinh ra hoặc mất đi"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên thì:",
    "re": "động năng của các phân tử trong vật cũng tăng lên"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác thì:",
    "re": "ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Khi một vật dao động điều hòa thì:",
    "re": "vật sẽ có vị trí và vận tốc thay đổi theo thời gian"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn thì:",
    "re": "dây dẫn sẽ sinh ra từ trường xung quanh"
  },
  {
    "con": "Khi áp suất trong một chất khí giảm thì:",
    "re": "thể tích của chất khí sẽ tăng lên theo định luật Boyle"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác thì:",
    "re": "tổng động năng của hệ trước và sau va chạm là như nhau"
  },
  {
    "con": "Chuyển động thẳng đều là chuyển động thẳng trong đó",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Lực tác dụng lên một vật có thể làm thay đổi vận tốc của vật đó",
    "re": "Vật có thể tăng tốc hoặc giảm tốc"
  },
  {
    "con": "Năng lượng không thể tự sinh ra hoặc mất đi",
    "re": "Năng lượng chỉ có thể chuyển đổi từ dạng này sang dạng khác"
  },
  {
    "con": "Khi một vật rơi tự do, nó chịu tác động của trọng lực",
    "re": "Vật sẽ tăng tốc với gia tốc khoảng 9.81 m/s²"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn thì",
    "re": "Nó sẽ có trọng lực lớn hơn so với vật có khối lượng nhỏ hơn"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên thì",
    "re": "Động năng của các phân tử trong chất đó cũng tăng lên"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước thì",
    "re": "Tốc độ ánh sáng sẽ giảm và ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Nếu một vật quay quanh một điểm cố định thì",
    "re": "Nó sẽ có một lực hướng tâm tác động vào nó"
  },
  {
    "con": "Khi một vật va chạm với một vật khác thì",
    "re": "Năng lượng có thể được truyền từ vật này sang vật kia"
  },
  {
    "con": "Nếu một mạch điện kín có điện trở thì",
    "re": "Dòng điện sẽ chảy qua mạch đó"
  },
  {
    "con": "Trong các công thức dưới đây, công thức nào không phải là công thức của sự rơi tự do của các vật:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật chuyển động với vận tốc không đổi, lực tác dụng lên vật đó là:",
    "re": "Bằng 0"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực không đổi và khối lượng của nó là m, thì gia tốc của vật đó là:",
    "re": "a = F/m"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên, thể tích của vật đó sẽ:",
    "re": "Tăng lên (nếu vật đó không bị giới hạn)"
  },
  {
    "con": "Nếu một vật được ném lên cao, thì vận tốc của nó sẽ:",
    "re": "Giảm dần cho đến khi đạt đến điểm cao nhất"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nó sẽ:",
    "re": "Bị khúc xạ và chậm lại"
  },
  {
    "con": "Nếu một điện trở có điện áp không đổi, thì cường độ dòng điện chạy qua nó sẽ:",
    "re": "Tăng lên khi điện trở giảm"
  },
  {
    "con": "Khi một vật dao động điều hòa, biên độ dao động là:",
    "re": "Khoảng cách lớn nhất từ vị trí cân bằng"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác và cả hai vật đều rơi tự do, thì:",
    "re": "Chúng sẽ rơi xuống đất cùng một lúc"
  },
  {
    "con": "Khi một lò xo bị nén hoặc kéo dài, nó sẽ tạo ra một lực phục hồi tỷ lệ với độ biến dạng của nó, theo định luật:",
    "re": "Hooke"
  },
  {
    "con": "Trong các trường hợp sau đây trường hợp nào có thể xem vật như một chất điểm?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì vận tốc của nó không thay đổi.",
    "re": "Vận tốc là hằng số"
  },
  {
    "con": "Khi một vật rơi tự do thì nó chịu tác động của trọng lực.",
    "re": "Vật sẽ tăng tốc với gia tốc khoảng 9.81 m/s²"
  },
  {
    "con": "Khi lực tác dụng lên một vật lớn hơn lực ma sát thì vật sẽ chuyển động.",
    "re": "Vật sẽ bắt đầu di chuyển"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên thì thể tích của chất khí sẽ tăng.",
    "re": "Chất khí nở ra"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác thì tổng động năng được bảo toàn.",
    "re": "Không có năng lượng mất mát"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước thì nó sẽ bị khúc xạ.",
    "re": "Ánh sáng sẽ thay đổi hướng"
  },
  {
    "con": "Khi một vật quay quanh một trục thì nó có động năng quay.",
    "re": "Động năng phụ thuộc vào tốc độ và khối lượng"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn thì nó sẽ tạo ra từ trường.",
    "re": "Từ trường có thể tác động lên các vật khác"
  },
  {
    "con": "Khi áp suất trong một chất lỏng tăng lên thì điểm sôi của chất lỏng cũng tăng.",
    "re": "Chất lỏng cần nhiệt độ cao hơn để sôi"
  },
  {
    "con": "Vật chuyển động có gia tốc hướng tâm khi",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Lực tác dụng lên một vật không đổi khi",
    "re": "Vật sẽ có gia tốc không đổi"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt khi",
    "re": "Năng lượng tổng luôn được bảo toàn"
  },
  {
    "con": "Vật rơi tự do trong môi trường không có sức cản khi",
    "re": "Gia tốc của nó là gia tốc trọng trường"
  },
  {
    "con": "Hai vật va chạm hoàn toàn đàn hồi khi",
    "re": "Tổng động năng trước và sau va chạm là như nhau"
  },
  {
    "con": "Áp suất trong chất lỏng tăng khi",
    "re": "Độ sâu của chất lỏng tăng lên"
  },
  {
    "con": "Nhiệt độ của một vật tăng khi",
    "re": "Năng lượng nhiệt được cung cấp cho vật"
  },
  {
    "con": "Một vật có khối lượng lớn hơn sẽ có trọng lực lớn hơn khi",
    "re": "Cùng một gia tốc trọng trường"
  },
  {
    "con": "Khi một vật quay quanh một trục cố định khi",
    "re": "Nó có gia tốc hướng tâm"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau khi",
    "re": "Ánh sáng sẽ bị bẻ cong"
  },
  {
    "con": "Một vật chuyển động thẳng đều",
    "re": "vận tốc của nó không thay đổi theo thời gian"
  },
  {
    "con": "Khi một lực tác dụng lên một vật",
    "re": "vật sẽ có gia tốc tỉ lệ thuận với lực và nghịch đảo với khối lượng"
  },
  {
    "con": "Trong một hệ kín, tổng năng lượng luôn được bảo toàn",
    "re": "năng lượng không thể tự sinh ra hoặc mất đi"
  },
  {
    "con": "Khi một vật rơi tự do",
    "re": "gia tốc của nó là 9.81 m/s² hướng xuống dưới"
  },
  {
    "con": "Khi một vật quay quanh một trục",
    "re": "vật sẽ có gia tốc hướng tâm hướng về phía trục quay"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "năng lượng nội của vật cũng tăng theo"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước",
    "re": "tốc độ ánh sáng sẽ giảm và ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Khi một vật va chạm với một vật khác",
    "re": "động lượng tổng của hai vật sẽ được bảo toàn nếu không có lực bên ngoài tác động"
  },
  {
    "con": "Khi một lò xo bị nén hoặc kéo dài",
    "re": "nó sẽ tạo ra một lực phục hồi tỉ lệ thuận với độ biến dạng"
  },
  {
    "con": "Trong một mạch điện kín",
    "re": "dòng điện sẽ chạy nếu có sự chênh lệch điện thế"
  },
  {
    "con": "Trong các câu dưới đây câu nào sai? Véctơ gia tốc hướng tâm trong chuyển động tròn đều có đặc điểm:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chu kì của một chuyển động tròn đều là 5 s. Bán kính của chuyển động là 25 m. Tốc độ dài của chuyển động là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Lực tác dụng lên một vật có khối lượng 10 kg và gia tốc 2 m/s² là:",
    "re": "20 N"
  },
  {
    "con": "Năng lượng động năng của một vật có khối lượng 2 kg và vận tốc 3 m/s là:",
    "re": "9 J"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20 m. Thời gian rơi xuống đất là:",
    "re": "2 s"
  },
  {
    "con": "Nếu một lò xo có độ cứng 100 N/m bị nén 0.5 m, thì năng lượng tiềm năng trong lò xo là:",
    "re": "12.5 J"
  },
  {
    "con": "Một vật có khối lượng 5 kg di chuyển với vận tốc 10 m/s. Động năng của vật là:",
    "re": "250 J"
  },
  {
    "con": "Nếu một dòng điện có cường độ 3 A chạy qua một điện trở 4 Ω, thì điện áp trên điện trở là:",
    "re": "12 V"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nếu góc tới là 30 độ, thì góc khúc xạ là:",
    "re": "22.1 độ"
  },
  {
    "con": "Nếu một vật có khối lượng 1 kg được nâng lên cao 10 m, thì công thực hiện là:",
    "re": "98 J"
  },
  {
    "con": "Khi một vật quay quanh một trục với tốc độ góc 4 rad/s và bán kính 2 m, thì tốc độ dài của vật là:",
    "re": "8 m/s"
  },
  {
    "con": "Một chất điểm chuyển động trên trục Ox. Phương trình chuyển động có dạng x = -t^2 + 10t + 8 (m;s) (t ≥ 0 ), chất điểm chuyển động",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h, không có lực cản, vật sẽ đạt vận tốc tối đa khi chạm đất",
    "re": "Vận tốc tối đa phụ thuộc vào độ cao h"
  },
  {
    "con": "Một vật có khối lượng m được treo bằng dây, nếu lực kéo lớn hơn trọng lực thì vật sẽ chuyển động lên",
    "re": "Vật sẽ di chuyển lên trên"
  },
  {
    "con": "Khi một vật chuyển động tròn đều, nếu bán kính tăng lên thì tốc độ góc sẽ giảm",
    "re": "Tốc độ góc tỉ lệ nghịch với bán kính"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực không đổi, thì gia tốc của vật sẽ không thay đổi",
    "re": "Gia tốc tỉ lệ thuận với lực tác dụng"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí, nếu nhiệt độ không khí tăng lên thì tốc độ sóng sẽ tăng",
    "re": "Tốc độ sóng âm tỉ lệ thuận với nhiệt độ"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v, thì động năng của vật sẽ được tính bằng công thức 1/2 mv^2",
    "re": "Động năng là một đại lượng dương"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác, tổng động lượng trước và sau va chạm sẽ được bảo toàn",
    "re": "Động lượng là một đại lượng bảo toàn trong va chạm đàn hồi"
  },
  {
    "con": "Nếu một vật được ném lên cao với vận tốc ban đầu v, thì độ cao tối đa đạt được sẽ tỉ lệ với bình phương vận tốc ban đầu",
    "re": "Độ cao tối đa phụ thuộc vào v^2"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn, nếu điện trở của dây dẫn tăng lên thì cường độ dòng điện sẽ giảm",
    "re": "Cường độ dòng điện tỉ lệ nghịch với điện trở"
  },
  {
    "con": "Hai vật có khối lượng m_{1} = 2m_{2} rơi tự do tại cùng một địa điểm với vận tốc tương ứng trước khi chạm đất là v_{1} và v_{2} thì",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi thì",
    "re": "Quỹ đạo của vật là một đường thẳng"
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng m thì",
    "re": "Vật sẽ có gia tốc a = F/m, với F là lực tác dụng"
  },
  {
    "con": "Nếu một vật được ném lên với vận tốc ban đầu v_{0} thì",
    "re": "Vật sẽ đạt đến độ cao cực đại trước khi rơi xuống"
  },
  {
    "con": "Khi hai vật va chạm đàn hồi thì",
    "re": "Tổng động năng của hệ trước và sau va chạm là như nhau"
  },
  {
    "con": "Nếu một vật chịu tác dụng của trọng lực và lực cản không khí thì",
    "re": "Vật sẽ đạt đến vận tốc giới hạn khi lực cản bằng trọng lực"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước thì",
    "re": "Ánh sáng sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Nếu một dòng điện chạy qua một dây dẫn thì",
    "re": "Dây dẫn sẽ phát sinh nhiệt do hiệu ứng Joule"
  },
  {
    "con": "Khi một vật dao động điều hòa với biên độ A và tần số f thì",
    "re": "Vật sẽ có chu kỳ T = 1/f"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v thì",
    "re": "Động năng của vật là K.E = 1/2 mv^2"
  },
  {
    "con": "Trong chuyển động quay quanh trục của Trái Đất, một điểm ở Sài Gòn và một điểm ở Hà Nội có cùng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chịu tác dụng của lực không đổi trong một khoảng thời gian nhất định",
    "re": "Vật đó sẽ có gia tốc không đổi"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt trong một hệ kín",
    "re": "Tổng năng lượng trong hệ đó sẽ luôn được bảo toàn"
  },
  {
    "con": "Một vật rơi tự do trong môi trường không có sức cản",
    "re": "Vật đó sẽ tăng tốc với gia tốc khoảng 9.81 m/s²"
  },
  {
    "con": "Khi một vật chuyển động tròn đều, hướng của vận tốc của nó luôn",
    "re": "Thay đổi nhưng độ lớn của vận tốc không thay đổi"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nó sẽ",
    "re": "Bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác",
    "re": "Tổng động năng của hai vật sẽ được bảo toàn"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác và cả hai vật đều chịu tác dụng của cùng một lực",
    "re": "Vật có khối lượng lớn hơn sẽ có gia tốc nhỏ hơn"
  },
  {
    "con": "Khi một sóng âm đi từ không khí vào nước",
    "re": "Tốc độ của sóng âm sẽ tăng lên"
  },
  {
    "con": "Khi một điện tích dương và một điện tích âm lại gần nhau",
    "re": "Chúng sẽ hút nhau"
  },
  {
    "con": "Một ôtô bắt đầu chuyển động thẳng nhanh dần đều với vận tốc 5\\frac{m}{s}, sau 30s vận tốc của ôtô đạt 8\\frac{m}{s}. Độ lớn gia tốc của ôtô nhận giá trị nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20m. Thời gian để vật chạm đất là bao lâu?",
    "re": "Thời gian rơi là khoảng 2s"
  },
  {
    "con": "Khi một lực 10N tác dụng lên một vật có khối lượng 2kg, vật sẽ có gia tốc bao nhiêu?",
    "re": "Gia tốc của vật là 5\\frac{m}{s^2}"
  },
  {
    "con": "Nếu một lò xo bị nén với độ dài 0.5m và có độ cứng 200N/m, thì lực nén của lò xo là bao nhiêu?",
    "re": "Lực nén của lò xo là 100N"
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính 10m và vận tốc 4\\frac{m}{s}, thì gia tốc hướng tâm của vật là bao nhiêu?",
    "re": "Gia tốc hướng tâm là 0.8\\frac{m}{s^2}"
  },
  {
    "con": "Nếu một vật có khối lượng 5kg di chuyển với vận tốc 3\\frac{m}{s}, thì động năng của vật là bao nhiêu?",
    "re": "Động năng của vật là 22.5J"
  },
  {
    "con": "Khi một điện trở có điện áp 12V và dòng điện 3A chạy qua, thì điện trở đó có giá trị bao nhiêu?",
    "re": "Giá trị điện trở là 4\\Omega"
  },
  {
    "con": "Nếu một vật có khối lượng 10kg được nâng lên cao 2m, thì công thực hiện là bao nhiêu?",
    "re": "Công thực hiện là 200J"
  },
  {
    "con": "Khi một sóng âm có tần số 440Hz truyền trong không khí với tốc độ 340m/s, thì bước sóng của sóng âm là bao nhiêu?",
    "re": "Bước sóng là 0.773m"
  },
  {
    "con": "Nếu một vật có khối lượng 3kg rơi tự do từ độ cao 15m, thì vận tốc của vật khi chạm đất là bao nhiêu?",
    "re": "Vận tốc khi chạm đất là khoảng 17.15\\frac{m}{s}"
  },
  {
    "con": "Hành khách A đứng trên toa tàu, nhìn qua cửa số toa sang hành khách B ở toa bên cạnh. Hai toa tàu đang đỗ trên hai đường tàu song song với nhau trong sân ga. Bỗng A thấy B chuyển động về phía sau. Tình huống nào sau đây chắc chắn không xảy ra?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h, không chịu tác động của lực cản không khí. Vật đó sẽ rơi xuống với gia tốc g.",
    "re": "Vật sẽ tăng tốc đều với gia tốc g"
  },
  {
    "con": "Một chiếc xe đang di chuyển với vận tốc không đổi. Nếu không có lực tác động vào xe, thì vận tốc của xe sẽ không thay đổi.",
    "re": "Xe sẽ tiếp tục di chuyển với vận tốc không đổi"
  },
  {
    "con": "Khi một lực tác động lên một vật, nếu lực đó lớn hơn lực cản của vật, thì vật sẽ bắt đầu chuyển động.",
    "re": "Vật sẽ tăng tốc"
  },
  {
    "con": "Một lò xo bị nén hoặc kéo ra. Nếu lực tác động lên lò xo vượt quá giới hạn đàn hồi, thì lò xo sẽ không trở về trạng thái ban đầu.",
    "re": "Lò xo sẽ bị biến dạng vĩnh viễn"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nếu góc tới lớn hơn góc tới giới hạn, thì ánh sáng sẽ không truyền vào nước.",
    "re": "Ánh sáng sẽ bị phản xạ hoàn toàn"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Nếu vật va chạm với một vật khác và dừng lại, thì động lượng của hệ sẽ được bảo toàn.",
    "re": "Động lượng của vật thứ hai sẽ thay đổi"
  },
  {
    "con": "Khi một điện tích dương và một điện tích âm lại gần nhau, thì chúng sẽ hút nhau.",
    "re": "Lực hút giữa chúng sẽ tăng lên"
  },
  {
    "con": "Nếu một vật quay quanh một trục với vận tốc góc không đổi, thì lực hướng tâm tác động lên vật sẽ không thay đổi.",
    "re": "Vật sẽ duy trì chuyển động tròn đều"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên, nếu chất đó không thay đổi thể tích, thì áp suất của chất đó sẽ tăng.",
    "re": "Áp suất sẽ tỉ lệ thuận với nhiệt độ"
  },
  {
    "con": "Một chất điểm chuyển động dọc theo trục 0x theo phương trình: x = 5 + 6t – 0,2t^2 (với x tính bằng mét, t tính bằng giây). Xác định gia tốc và vận tốc ban đầu của chất điểm?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Nếu h = 20m, thì thời gian để vật chạm đất là khoảng 2 giây.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0,1m. Nếu tính năng lượng đàn hồi, thì năng lượng đàn hồi của lò xo là 1 J.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m = 2 kg chuyển động với vận tốc v = 3 m/s. Nếu tính động năng của vật, thì động năng là 9 J.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 5 kg nằm trên mặt phẳng nghiêng với góc 30 độ. Nếu tính lực kéo xuống của vật, thì lực kéo xuống là khoảng 25 N.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một dòng điện có cường độ I = 2 A chạy qua một điện trở R = 5 Ω. Nếu tính điện áp, thì điện áp là 10 V.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 10 kg được kéo lên cao với gia tốc 2 m/s². Nếu tính lực kéo cần thiết, thì lực kéo là 120 N.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sóng âm có tần số f = 440 Hz. Nếu tính chu kỳ của sóng, thì chu kỳ là 0,00227 s.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 3 kg và vận tốc 4 m/s va chạm với một vật khác đứng yên. Nếu tính xung lượng của vật, thì xung lượng là 12 kg·m/s.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 1 kg được thả rơi từ độ cao 10 m. Nếu tính vận tốc khi chạm đất, thì vận tốc là khoảng 14 m/s.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong chuyển động thẳng biến đổi đều, hệ số góc của đường biểu diễn vận tốc theo thời gian bằng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Lực tác dụng lên một vật có khối lượng m sẽ làm vật đó tăng tốc theo hướng của lực với gia tốc a",
    "re": "Gia tốc a bằng lực tác dụng chia cho khối lượng m"
  },
  {
    "con": "Khi một vật rơi tự do, gia tốc của nó là",
    "re": "9,8 m/s² hướng xuống dưới"
  },
  {
    "con": "Trong một hệ thống kín, tổng năng lượng luôn được bảo toàn",
    "re": "Năng lượng không thể tự sinh ra hoặc mất đi"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác, nếu tốc độ ánh sáng giảm",
    "re": "Ánh sáng sẽ bị khúc xạ về phía pháp tuyến"
  },
  {
    "con": "Khi một vật dao động điều hòa, biên độ dao động là",
    "re": "Khoảng cách lớn nhất từ vị trí cân bằng đến vị trí cực đại"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động năng của vật đó là",
    "re": "1/2 m v²"
  },
  {
    "con": "Khi một lực tác dụng lên một vật và không có lực nào khác tác dụng ngược lại, vật sẽ",
    "re": "Chuyển động theo hướng của lực tác dụng"
  },
  {
    "con": "Trong một mạch điện, nếu điện trở R tăng mà điện áp U không đổi",
    "re": "Dòng điện I sẽ giảm"
  },
  {
    "con": "Khi một vật bị nén hoặc kéo dài, năng lượng đàn hồi của nó được tính bằng",
    "re": "1/2 k x², với k là hệ số đàn hồi và x là độ biến dạng"
  },
  {
    "con": "Phương trình chuyển động của một chất điểm dọc theo trục Ox có dạng x = 5 – 20t ( x đo bằng km và t đo bằng giờ). Quãng đường đi được của chất điểm sau 2 giờ chuyển động là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Thời gian rơi t sẽ tỉ lệ thuận với căn bậc hai của độ cao h",
    "re": "Thời gian rơi t sẽ tăng khi độ cao h tăng"
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m, gia tốc a của vật sẽ tỉ lệ thuận với lực F và tỉ lệ nghịch với khối lượng m",
    "re": "Gia tốc a sẽ tăng khi lực F tăng hoặc khối lượng m giảm"
  },
  {
    "con": "Khi một vật chuyển động tròn đều, vận tốc của nó sẽ luôn hướng về tâm của vòng tròn",
    "re": "Vật sẽ có gia tốc hướng tâm không đổi"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động năng của vật sẽ được tính bằng công thức 1/2 mv^2",
    "re": "Động năng sẽ tăng khi vận tốc v tăng"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác, tổng động lượng của hệ sẽ được bảo toàn",
    "re": "Tổng động lượng trước va chạm sẽ bằng tổng động lượng sau va chạm"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực kéo về F và lực cản không khí, thì lực tổng hợp sẽ là hiệu của hai lực này",
    "re": "Vật sẽ có gia tốc theo hướng của lực kéo về F"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên, thể tích của chất khí sẽ tăng nếu áp suất không đổi",
    "re": "Thể tích của chất khí sẽ tỉ lệ thuận với nhiệt độ tuyệt đối"
  },
  {
    "con": "Nếu một sóng âm truyền qua không khí, thì tốc độ của sóng âm sẽ phụ thuộc vào nhiệt độ của không khí",
    "re": "Tốc độ sóng âm sẽ tăng khi nhiệt độ không khí tăng"
  },
  {
    "con": "Khi một vật dao động điều hòa, biên độ dao động A sẽ xác định độ lớn của lực phục hồi",
    "re": "Lực phục hồi sẽ tỉ lệ thuận với biên độ A"
  },
  {
    "con": "Khi hắt hơi mạnh mắt có thể nhắm lại trong 500ms. Nếu một phi công đang lái máy bay Airbus A320 với tốc độ 1040\\frac{km}{h} thì quãng đường máy bay có thể bay được trong thời gian này gần giá trị nào nhất?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật rơi tự do từ độ cao h, thì thời gian rơi t phụ thuộc vào độ cao h.",
    "re": "Thời gian rơi t = \\sqrt{\\frac{2h}{g}}"
  },
  {
    "con": "Khi một vật chuyển động thẳng đều với vận tốc v, thì quãng đường s vật đi được trong thời gian t là s = vt.",
    "re": "Quãng đường s = vt"
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m, thì gia tốc a của vật được tính bằng công thức a = \\frac{F}{m}.",
    "re": "Gia tốc a = \\frac{F}{m}"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, thì nó sẽ bị khúc xạ và thay đổi hướng.",
    "re": "Góc khúc xạ phụ thuộc vào chỉ số khúc xạ của hai môi trường"
  },
  {
    "con": "Khi một vật dao động điều hòa với tần số f, thì chu kỳ T của nó được tính bằng T = \\frac{1}{f}.",
    "re": "Chu kỳ T = \\frac{1}{f}"
  },
  {
    "con": "Khi một điện trở R được nối với một hiệu điện thế U, thì cường độ dòng điện I chạy qua nó được tính bằng công thức I = \\frac{U}{R}.",
    "re": "Cường độ dòng điện I = \\frac{U}{R}"
  },
  {
    "con": "Khi một vật có khối lượng m di chuyển với vận tốc v, thì động năng K của nó được tính bằng K = \\frac{1}{2}mv^2.",
    "re": "Động năng K = \\frac{1}{2}mv^2"
  },
  {
    "con": "Khi một vật chịu tác dụng của lực đàn hồi F, thì lực này tỉ lệ thuận với độ biến dạng x của vật.",
    "re": "F = kx, với k là hệ số đàn hồi"
  },
  {
    "con": "Khi một sóng âm truyền trong không khí, thì tốc độ của sóng âm phụ thuộc vào nhiệt độ của không khí.",
    "re": "Tốc độ sóng âm tăng khi nhiệt độ không khí tăng"
  },
  {
    "con": "Một vật được thả từ trên máy bay ở độ cao 80m. Cho rằng vật rơi tự do với g = 10\\frac{m}{s^2}, thời gian rơi là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2kg và chịu tác dụng của lực 10N, thì gia tốc của vật là",
    "re": "5\\frac{m}{s^2}"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc 20\\frac{m}{s}, thì quãng đường đi được sau 5 giây là",
    "re": "100m"
  },
  {
    "con": "Một lò xo có độ cứng k = 200N/m bị nén 0.1m, thì năng lượng đàn hồi của lò xo là",
    "re": "1J"
  },
  {
    "con": "Một vật có khối lượng 1kg rơi tự do từ độ cao 20m, thì vận tốc của vật khi chạm đất là",
    "re": "20\\frac{m}{s}"
  },
  {
    "con": "Một điện trở có điện trở R = 10Ω và dòng điện chạy qua là 2A, thì công suất tiêu thụ của điện trở là",
    "re": "40W"
  },
  {
    "con": "Một vật có khối lượng 3kg di chuyển với vận tốc 4\\frac{m}{s}, thì động năng của vật là",
    "re": "24J"
  },
  {
    "con": "Một vật được ném lên với vận tốc ban đầu 15\\frac{m}{s}, thì độ cao cực đại mà vật đạt được là",
    "re": "11.5m"
  },
  {
    "con": "Một sóng âm có tần số 440Hz, thì chu kỳ của sóng âm đó là",
    "re": "0.00227s"
  },
  {
    "con": "Một vật có khối lượng 5kg và vận tốc 10\\frac{m}{s} va chạm hoàn toàn đàn hồi với vật khác, thì tổng động năng sau va chạm là",
    "re": "250J"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 80m . Quãng đường vật rơi được trong 2s và trong giây thứ 2 là : Lấy g = 10\\frac{m}{s^2}.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2kg và chịu tác dụng của lực 10N. Nếu lực này được giữ nguyên, thì vật sẽ có gia tốc là 5\\frac{m}{s^2}.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc 20m/s. Nếu thời gian chuyển động là 3s, thì quãng đường vật đi được là 60m.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một lò xo có độ cứng k = 200N/m. Nếu lò xo bị nén 0.1m, thì lực tác dụng lên lò xo là 20N.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 5kg di chuyển với vận tốc 10m/s. Nếu vật va chạm hoàn toàn đàn hồi với vật khác, thì động năng của vật sau va chạm sẽ được bảo toàn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một điện trở có điện trở R = 10Ω. Nếu dòng điện chạy qua điện trở là 2A, thì điện áp trên điện trở là 20V.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 1kg rơi tự do trong 3 giây. Nếu lấy g = 10\\frac{m}{s^2}, thì quãng đường vật rơi được là 45m.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 3kg được treo vào một sợi dây. Nếu trọng lực tác dụng lên vật là 30N, thì gia tốc của vật là 10\\frac{m}{s^2}.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một sóng âm có tần số 440Hz. Nếu tốc độ âm thanh trong không khí là 340m/s, thì bước sóng của sóng âm là 0.773m.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 4kg và vận tốc 5m/s. Nếu vật dừng lại trong 2s, thì lực tác dụng lên vật là 10N.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chiếc thuyền buồm chạy ngược dòng sông, sau 1 giờ đi được 10 (km). Một khúc gỗ trôi theo dòng sông, sau 1 phút trôi được \\frac{100}{3} m . Vận tốc của thuyền buồm so với nước bằng bao nhiêu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20m, không có lực cản. Thời gian để vật chạm đất là bao nhiêu?",
    "re": "Thời gian là khoảng 2 giây"
  },
  {
    "con": "Một chiếc xe ô tô di chuyển với vận tốc 60 km/h. Nếu xe chạy liên tục trong 2 giờ, quãng đường xe đã đi được là bao nhiêu?",
    "re": "Quãng đường là 120 km"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0.1m. Lực nén của lò xo là bao nhiêu?",
    "re": "Lực nén là 20 N"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu 15 m/s. Thời gian để quả bóng đạt độ cao tối đa là bao nhiêu?",
    "re": "Thời gian là 1.5 giây"
  },
  {
    "con": "Một vật có khối lượng 5 kg chịu tác dụng của lực 10 N. Gia tốc của vật là bao nhiêu?",
    "re": "Gia tốc là 2 m/s²"
  },
  {
    "con": "Một chiếc xe đạp có khối lượng 15 kg di chuyển với vận tốc 5 m/s. Động năng của xe đạp là bao nhiêu?",
    "re": "Động năng là 187.5 J"
  },
  {
    "con": "Một vật có khối lượng 10 kg được nâng lên cao 2m. Công thực hiện để nâng vật là bao nhiêu?",
    "re": "Công là 196 J"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz. Tốc độ âm thanh trong không khí là 340 m/s. Bước sóng của âm là bao nhiêu?",
    "re": "Bước sóng là 0.772 m"
  },
  {
    "con": "Một vật có khối lượng 2 kg di chuyển với vận tốc 3 m/s va chạm với một vật khác đứng yên. Nếu va chạm hoàn toàn đàn hồi, vận tốc của vật sau va chạm là bao nhiêu?",
    "re": "Vận tốc của vật sau va chạm là 1.5 m/s"
  },
  {
    "con": "Một xe đạp đang chuyển động với vận tốc 5 \\frac{m}{s} thì hãm phanh chuyển động thẳng chậm dần đều. Hình bên là đồ thị vận tốc - thời gian của xe đạp. Quãng đường xe đạp đi được từ lúc hãm phanh cho đến lúc dừng lại là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20m thì sau 2 giây, vật sẽ đạt vận tốc khoảng",
    "re": "20 m/s"
  },
  {
    "con": "Một lò xo bị nén với độ biến dạng 0.1m thì lực đàn hồi tác dụng lên lò xo là",
    "re": "F = k \\cdot 0.1, với k là độ cứng của lò xo"
  },
  {
    "con": "Một vật có khối lượng 2kg và chịu tác dụng của lực 10N thì gia tốc của vật sẽ là",
    "re": "5 m/s²"
  },
  {
    "con": "Một chiếc xe ô tô đang chạy với vận tốc 60 km/h thì sau khi tăng tốc trong 5 giây, vận tốc của xe sẽ là",
    "re": "60 km/h + gia tốc \\cdot 5s"
  },
  {
    "con": "Một dòng điện có cường độ 2A chạy qua một điện trở 5Ω thì công suất tiêu thụ của điện trở là",
    "re": "10W"
  },
  {
    "con": "Một vật có khối lượng 1kg được nâng lên cao 2m thì năng lượng thế năng của vật là",
    "re": "20J"
  },
  {
    "con": "Một sóng âm có tần số 440Hz thì bước sóng của nó trong không khí (với tốc độ âm thanh khoảng 340m/s) sẽ là",
    "re": "0.773m"
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính 1m và vận tốc 2m/s thì gia tốc hướng tâm của vật là",
    "re": "2 m/s²"
  },
  {
    "con": "Một chiếc thuyền di chuyển trên mặt nước với vận tốc 3 m/s thì sau khi gặp dòng chảy ngược với vận tốc 1 m/s, vận tốc của thuyền sẽ là",
    "re": "2 m/s"
  },
  {
    "con": "Một vật chuyển động thẳng không đổi chiều. Trên quãng đường AB, vật đi nửa quãng đường đầu với vận tốc v_{1} = 20 \\frac{m}{s}, nửa quãng đường sau vật đi với vận tốc v_{2} = 5 \\frac{m}{s}. Vận tốc trung bình trên cả quãng đường là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chịu tác dụng của lực không đổi trong một khoảng thời gian t. Nếu lực F = 10 N và khối lượng m = 2 kg, thì gia tốc a của vật là:",
    "re": "Câu trả lời đúng với a = 5 \\frac{m}{s^2}"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Nếu h = 20 m, thì thời gian rơi t là:",
    "re": "Câu trả lời đúng với t = 2 \\sqrt{\\frac{h}{g}}"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén một đoạn x = 0.1 m. Thế năng đàn hồi của lò xo là:",
    "re": "Câu trả lời đúng với W = \\frac{1}{2} k x^2 = 1 J"
  },
  {
    "con": "Một vật có khối lượng m = 3 kg di chuyển với vận tốc v = 4 \\frac{m}{s}. Nếu vật va chạm hoàn toàn đàn hồi với một vật khác, thì động năng của vật sau va chạm là:",
    "re": "Câu trả lời đúng với động năng = \\frac{1}{2} m v^2 = 24 J"
  },
  {
    "con": "Một dòng điện có cường độ I = 2 A chạy qua một điện trở R = 5 \\Omega. Nếu điện áp U được tính bằng công thức U = I \\cdot R, thì điện áp U là:",
    "re": "Câu trả lời đúng với U = 10 V"
  },
  {
    "con": "Một vật có khối lượng m = 1 kg được treo trên một dây. Nếu lực kéo F = 9.8 N, thì lực căng T trong dây là:",
    "re": "Câu trả lời đúng với T = 9.8 N"
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính r = 0.5 m và vận tốc v = 2 \\frac{m}{s}. Nếu gia tốc hướng tâm a_c được tính bằng công thức a_c = \\frac{v^2}{r}, thì gia tốc hướng tâm là:",
    "re": "Câu trả lời đúng với a_c = 8 \\frac{m}{s^2}"
  },
  {
    "con": "Một sóng âm có tần số f = 440 Hz và vận tốc v = 340 \\frac{m}{s}. Nếu bước sóng \\lambda được tính bằng công thức \\lambda = \\frac{v}{f}, thì bước sóng là:",
    "re": "Câu trả lời đúng với \\lambda = 0.772 m"
  },
  {
    "con": "Một vật có khối lượng m = 5 kg được thả rơi từ độ cao h. Nếu h = 10 m, thì năng lượng tiềm năng E_p của vật là:",
    "re": "Câu trả lời đúng với E_p = mgh = 490 J"
  },
  {
    "con": "Hai điểm A và B cách nhau 200m, tại A có một ôtô có vận tốc 3\\frac{m}{s} và đang chuyển động nhanh dần đều với gia tốc 2\\frac{m}{s^2} đi đến B. Cùng lúc đó một ôtô khác bắt đầu khởi hành từ B về A với gia tốc 2,8\\frac{m}{s^2}. Hai xe gặp nhau cách A một khoảng bằng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2kg rơi tự do từ độ cao 20m, không có lực cản không khí tác động, vật sẽ chạm đất với vận tốc khoảng",
    "re": "20\\frac{m}{s}"
  },
  {
    "con": "Một lò xo có độ cứng k = 100N/m bị nén 0.5m, năng lượng tiềm năng đàn hồi của lò xo là",
    "re": "12.5J"
  },
  {
    "con": "Một vật có khối lượng 5kg di chuyển với vận tốc 10\\frac{m}{s}, động năng của vật là",
    "re": "250J"
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính 2m và vận tốc 4\\frac{m}{s}, gia tốc hướng tâm của vật là",
    "re": "8\\frac{m}{s^2}"
  },
  {
    "con": "Nếu một lực 10N tác động lên một vật có khối lượng 2kg, gia tốc của vật sẽ là",
    "re": "5\\frac{m}{s^2}"
  },
  {
    "con": "Khi một vật chuyển động thẳng đều, nếu vận tốc của nó là 15\\frac{m}{s}, thì quãng đường đi được sau 4 giây sẽ là",
    "re": "60m"
  },
  {
    "con": "Một quả bóng nảy lên từ mặt đất với độ cao tối đa 1.5m, vận tốc khi chạm đất lần đầu là",
    "re": "5.4\\frac{m}{s}"
  },
  {
    "con": "Nếu một vật có khối lượng 3kg được kéo lên cao 4m, công thực hiện để nâng vật là",
    "re": "117.6J"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác có cùng khối lượng và cùng vận tốc, cả hai vật sẽ",
    "re": "đổi chỗ cho nhau"
  },
  {
    "con": "Lấy bán kính Trái Đất bằng R = 6 400 km. Trong chuyển động quay quanh trục của Trái Đất, một điểm trên bề mặt Trái Đất ở vĩ độ 600 có tốc độ dài gần đúng là.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h, không có lực cản không khí.",
    "re": "Vật sẽ đạt vận tốc tối đa khi chạm đất."
  },
  {
    "con": "Một lực F tác dụng lên một vật có khối lượng m.",
    "re": "Vật sẽ có gia tốc a = F/m."
  },
  {
    "con": "Một vật chuyển động tròn với bán kính r và vận tốc v.",
    "re": "Vật sẽ có gia tốc hướng tâm a_c = v^2/r."
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác.",
    "re": "Tổng động năng của hệ sẽ được bảo toàn."
  },
  {
    "con": "Một sóng âm truyền trong không khí với tốc độ v.",
    "re": "Tần số f của sóng sẽ liên quan đến bước sóng λ qua công thức v = fλ."
  },
  {
    "con": "Một điện tích q đặt trong điện trường E.",
    "re": "Điện tích sẽ chịu lực F = qE."
  },
  {
    "con": "Một mạch điện có điện trở R và hiệu điện thế U.",
    "re": "Dòng điện I trong mạch sẽ được tính bằng công thức I = U/R."
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v.",
    "re": "Động năng của vật sẽ được tính bằng công thức K.E. = 1/2 mv^2."
  },
  {
    "con": "Một vật chịu tác dụng của trọng lực g.",
    "re": "Lực trọng lực sẽ được tính bằng công thức F = mg."
  },
  {
    "con": "Đồ thị tọa độ - thời gian của hai chiếc xe I và II được biểu diễn như hình vẽ bên.\nPhương trình chuyển động của xe I và II lần lượt là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Lực tác dụng lên một vật có khối lượng m sẽ tạo ra gia tốc a.",
    "re": "Gia tốc của vật sẽ được tính bằng công thức F = m * a."
  },
  {
    "con": "Một vật rơi tự do từ độ cao h mà không bị cản trở.",
    "re": "Thời gian rơi của vật sẽ được tính bằng công thức t = √(2h/g), với g là gia tốc trọng trường."
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính r và vận tốc v.",
    "re": "Lực hướng tâm tác dụng lên vật sẽ được tính bằng công thức F = m * v²/r."
  },
  {
    "con": "Năng lượng của một vật có khối lượng m và vận tốc v.",
    "re": "Được tính bằng công thức động năng KE = 1/2 * m * v²."
  },
  {
    "con": "Khi một sóng âm truyền qua không khí với tốc độ v.",
    "re": "Tần số f của sóng sẽ được tính bằng công thức f = v/λ, với λ là bước sóng."
  },
  {
    "con": "Một vật chịu tác dụng của hai lực cân bằng.",
    "re": "Vật sẽ không thay đổi trạng thái chuyển động của nó."
  },
  {
    "con": "Khi một vật được kéo lên cao với lực F và chiều cao h.",
    "re": "Công thực hiện sẽ được tính bằng công thức W = F * h."
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác.",
    "re": "Tổng động năng của hệ sẽ được bảo toàn trước và sau va chạm."
  },
  {
    "con": "Khi một điện tích q được đặt trong điện trường E.",
    "re": "Lực tác dụng lên điện tích sẽ được tính bằng công thức F = q * E."
  },
  {
    "con": "Một vật chuyển động thẳng nhanh dần đều với vận tốc đầu v_{0} = 18 \\frac{km}{h}. Trong giây thứ tư kể từ lúc bắt đầu chuyển động vật đi được quãng đường 12 (m). Gia tốc của vật có giá trị là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 5 kg chịu tác dụng của lực 20 N. Gia tốc của vật sẽ là",
    "re": "4 m/s²"
  },
  {
    "con": "Khi một vật rơi tự do từ độ cao h, thời gian rơi t sẽ tỉ lệ thuận với căn bậc hai của độ cao h.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có vận tốc ban đầu 0 m/s và gia tốc 2 m/s², thì sau 5 giây, vận tốc của vật sẽ là",
    "re": "10 m/s"
  },
  {
    "con": "Khi một vật chuyển động tròn đều, gia tốc hướng tâm luôn hướng về tâm của vòng tròn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 10 kg và vận tốc 3 m/s, thì động năng của vật sẽ là",
    "re": "45 J"
  },
  {
    "con": "Khi một lực tác dụng lên một vật không thay đổi, thì gia tốc của vật sẽ không thay đổi.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật va chạm đàn hồi với một vật khác, thì tổng động lượng của hệ sẽ được bảo toàn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật lăn trên mặt phẳng nghiêng, trọng lực của vật sẽ được phân thành hai thành phần: thành phần vuông góc và thành phần song song với mặt phẳng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 2 kg và chịu tác dụng của lực 10 N, thì lực ma sát tối đa mà vật có thể chịu là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một ôtô chạy đều trên đường thẳng với tốc độ 30 \\frac{m}{s}  vượt quá tốc độ cho phép và bị cảnh sát giao thông phát hiện. Chỉ sau 108 s khi ôtô đi ngang qua một cảnh sát, anh này phóng xe đuổi theo với gia tốc có độ lớn bằng 2,8 \\frac{m}{s^2} . Sau thời gian \\Deltat thì anh cảnh sát đuổi kịp ôtô và quãng đường anh đi được là \\Deltas. Độ lớn của \\Deltas.\\Deltat gần giá trị nào nhất sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h mà không bị cản trở,",
    "re": "thời gian rơi tỉ lệ với căn bậc hai của độ cao h."
  },
  {
    "con": "Một lò xo bị nén hoặc kéo ra khỏi vị trí cân bằng,",
    "re": "lực phục hồi tác dụng lên lò xo tỉ lệ với độ biến dạng của nó."
  },
  {
    "con": "Khi một vật chuyển động tròn đều với tốc độ không đổi,",
    "re": "vật đó luôn chịu một lực hướng tâm hướng vào tâm của đường tròn."
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v,",
    "re": "thì động năng của vật đó được tính bằng công thức \\frac{1}{2}mv^2."
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m,",
    "re": "thì vật đó sẽ có gia tốc a tỉ lệ thuận với lực và tỉ lệ nghịch với khối lượng, theo định luật Newton thứ hai."
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác,",
    "re": "thì nó sẽ bị khúc xạ và thay đổi hướng."
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cùng phương và cùng chiều,",
    "re": "thì tổng hợp của hai lực đó sẽ là tổng của độ lớn của chúng."
  },
  {
    "con": "Khi một điện tích q di chuyển trong một điện trường E,",
    "re": "thì nó sẽ chịu tác dụng của một lực điện F = qE."
  },
  {
    "con": "Nếu một sóng âm truyền qua không khí,",
    "re": "thì nó sẽ có tần số và bước sóng xác định, liên quan đến tốc độ âm thanh trong không khí."
  },
  {
    "con": "Để ước lượng độ sâu của một giếng cạn nước, bạn Nam dùng đồng hồ bấm giây, ghé sát tai vào miệng giếng và thả một hòn đá rơi tự do từ miệng giếng; sau 3 s thì Nam nghe thấy tiếng hòn đá đập vào đáy giếng. Giả sử tốc độ truyền âm trong không khí là 330 \\frac{m}{s} , lấy g = 9,9 \\frac{m}{s^2} . Độ sâu của giếng gần nhất với giá trị",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật rơi tự do từ độ cao h, thời gian rơi t được tính bằng công thức t = \\sqrt{\\frac{2h}{g}} với g là gia tốc trọng trường",
    "re": "Thời gian rơi t sẽ tăng khi độ cao h tăng"
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m, gia tốc a của vật được tính bằng công thức F = ma",
    "re": "Gia tốc a sẽ tăng khi lực F tăng hoặc khối lượng m giảm"
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính r và tốc độ v, lực hướng tâm F được tính bằng công thức F = \\frac{mv^2}{r}",
    "re": "Lực hướng tâm F sẽ tăng khi tốc độ v tăng"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nó sẽ bị khúc xạ và thay đổi hướng",
    "re": "Góc khúc xạ sẽ nhỏ hơn góc tới khi ánh sáng đi từ môi trường ít dày đặc vào môi trường dày đặc"
  },
  {
    "con": "Khi một vật dao động điều hòa với biên độ A và tần số f, năng lượng dao động E được tính bằng công thức E = \\frac{1}{2} k A^2 với k là độ cứng của lò xo",
    "re": "Năng lượng E sẽ tăng khi biên độ A tăng"
  },
  {
    "con": "Khi một điện trở R được nối với một nguồn điện có hiệu điện thế U, dòng điện I chạy qua điện trở được tính bằng công thức I = \\frac{U}{R}",
    "re": "Dòng điện I sẽ tăng khi hiệu điện thế U tăng hoặc điện trở R giảm"
  },
  {
    "con": "Khi một vật bị tác dụng bởi hai lực cùng phương và cùng chiều, tổng lực F tổng sẽ bằng tổng hai lực đó",
    "re": "Vật sẽ chịu gia tốc theo chiều của tổng lực F tổng"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí, tốc độ truyền sóng v phụ thuộc vào nhiệt độ của không khí",
    "re": "Tốc độ truyền sóng v sẽ tăng khi nhiệt độ không khí tăng"
  },
  {
    "con": "Khi một vật được ném lên với vận tốc ban đầu v0, độ cao cực đại h đạt được được tính bằng công thức h = \\frac{v_0^2}{2g}",
    "re": "Độ cao cực đại h sẽ tăng khi vận tốc ban đầu v0 tăng"
  },
  {
    "con": "Trên trục Ox một chất điểm chuyển động biến đổi đều theo chiều dương có hoành độ ở các thời điểm t_{1}, t_{2}, t_{3} tương ứng là: x_{1}, x_{2}, x_{3} . Biết rằng t_{3}-t_{2}=t_{2}-t_{1}=t . Gia tốc của chất điểm bằng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h trong môi trường không có sức cản không khí, thời gian rơi t sẽ liên quan đến độ cao h theo công thức h = 1/2 * g * t^2",
    "re": "Thời gian rơi t được tính bằng t = √(2h/g)"
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m, nếu lực này không thay đổi, thì gia tốc a của vật sẽ được tính bằng",
    "re": "a = F/m"
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính r và vận tốc v, thì tần số f của chuyển động sẽ được tính bằng",
    "re": "f = v/(2πr)"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v và va chạm hoàn toàn đàn hồi với một vật khác có khối lượng m', thì tổng động năng của hệ trước và sau va chạm sẽ",
    "re": "không thay đổi"
  },
  {
    "con": "Khi một vật chịu tác dụng của hai lực cùng chiều F1 và F2, thì lực tổng hợp F sẽ bằng",
    "re": "F = F1 + F2"
  },
  {
    "con": "Nếu một vật có khối lượng m được nâng lên cao h trong trường trọng lực, thì công W thực hiện để nâng vật sẽ được tính bằng",
    "re": "W = mgh"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí, nếu tần số f của sóng tăng lên, thì bước sóng λ sẽ",
    "re": "giảm xuống"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v và dừng lại, thì động năng của vật sẽ",
    "re": "bằng 0"
  },
  {
    "con": "Khi một vật quay quanh một trục với tốc độ góc ω, thì gia tốc hướng tâm a_t sẽ được tính bằng",
    "re": "a_t = ω^2 * r"
  },
  {
    "con": "Hai chất điểm chuyển động thẳng đều trên hai trục Ox và Oy vuông góc với nhau. Tại thời điểm t = 0, vật 1 đang ở A cách O một đoạn l_{1}= 100 m, vật 2 đang ở B cách O một đoạn l_{2}= 120 m, hai vật cùng chuyển động hướng về O với các vận tốc v_{1} = 4 \\frac{m}{s}  và v_{2} = 3 \\frac{m}{s} .khoảng cách nhỏ nhất giữa hai vật là?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h mà không có lực cản. Khi vật chạm đất, vận tốc của nó sẽ đạt giá trị tối đa.",
    "re": "Vận tốc của vật khi chạm đất phụ thuộc vào độ cao h và gia tốc trọng trường."
  },
  {
    "con": "Một vật có khối lượng m được treo vào một lò xo có độ cứng k. Khi vật được kéo xuống một đoạn x và thả ra, lò xo sẽ tác dụng lực phục hồi lên vật.",
    "re": "Lực phục hồi của lò xo sẽ tỉ lệ thuận với độ biến dạng x theo định luật Hooke."
  },
  {
    "con": "Một chiếc xe đang di chuyển với vận tốc v và phanh gấp. Nếu lực phanh F được tác dụng lên xe, thì xe sẽ dừng lại trong một khoảng cách d.",
    "re": "Khoảng cách d phụ thuộc vào vận tốc v và lực phanh F."
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính r và vận tốc v, thì gia tốc hướng tâm a_t sẽ được tính bằng công thức a_t = \\frac{v^2}{r}.",
    "re": "Gia tốc hướng tâm a_t luôn hướng về tâm của vòng tròn."
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác, tổng động năng của hệ trước và sau va chạm sẽ được bảo toàn.",
    "re": "Điều này có nghĩa là động năng không bị mất đi trong va chạm đàn hồi."
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v va chạm với một vật khác có khối lượng M đứng yên. Nếu va chạm là hoàn toàn không đàn hồi, thì hai vật sẽ di chuyển cùng nhau sau va chạm.",
    "re": "Tổng động lượng của hệ trước và sau va chạm sẽ được bảo toàn."
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác với chỉ số khúc xạ khác nhau, thì ánh sáng sẽ bị khúc xạ.",
    "re": "Góc khúc xạ sẽ phụ thuộc vào góc tới và chỉ số khúc xạ của hai môi trường."
  },
  {
    "con": "Khi một điện tích q được đặt trong một điện trường E, thì điện tích sẽ chịu tác dụng của một lực F.",
    "re": "Lực F được tính bằng công thức F = qE."
  },
  {
    "con": "Khi một sóng âm truyền qua không khí, tốc độ của sóng âm sẽ phụ thuộc vào nhiệt độ của không khí.",
    "re": "Tốc độ sóng âm tăng khi nhiệt độ không khí tăng."
  },
  {
    "con": "Véc-tơ động lượng là véc-tơ",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Lực tác dụng lên một vật có thể làm thay đổi vận tốc của nó",
    "re": "Vật sẽ chuyển động nhanh hơn, chậm hơn hoặc thay đổi hướng"
  },
  {
    "con": "Năng lượng không thể tự sinh ra hoặc mất đi",
    "re": "Năng lượng chỉ có thể chuyển đổi từ dạng này sang dạng khác"
  },
  {
    "con": "Một vật đang chuyển động thẳng đều",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nhiệt của vật cũng tăng lên"
  },
  {
    "con": "Khi một vật rơi tự do",
    "re": "Chỉ có trọng lực tác dụng lên vật"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác",
    "re": "Tốc độ ánh sáng thay đổi và có thể bị khúc xạ"
  },
  {
    "con": "Khi một vật va chạm với một vật khác",
    "re": "Động lượng của hệ vật được bảo toàn nếu không có lực bên ngoài tác dụng"
  },
  {
    "con": "Khi một chất lỏng được đun nóng",
    "re": "Mật độ của chất lỏng sẽ giảm"
  },
  {
    "con": "Khi một vật dao động",
    "re": "Nó sẽ có năng lượng cơ học được bảo toàn trong quá trình dao động"
  },
  {
    "con": "Cánh tay đòn của lực F đối với tâm quay O là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Vật chuyển động thẳng đều thì quãng đường đi được tỉ lệ thuận với thời gian",
    "re": "Vận tốc là hằng số"
  },
  {
    "con": "Lực tác dụng lên một vật thì vật sẽ có gia tốc",
    "re": "Gia tốc tỉ lệ thuận với lực và nghịch với khối lượng"
  },
  {
    "con": "Năng lượng không thể tự sinh ra hay mất đi",
    "re": "Năng lượng luôn được bảo toàn trong một hệ kín"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên thì năng lượng nội tại của vật",
    "re": "Cũng tăng theo"
  },
  {
    "con": "Khi một vật rơi tự do thì",
    "re": "Gia tốc của nó là gia tốc trọng trường"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau",
    "re": "Ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Khi một vật dao động điều hòa thì",
    "re": "Vật sẽ có vị trí và vận tốc thay đổi theo thời gian"
  },
  {
    "con": "Khi có dòng điện chạy qua một dây dẫn thì",
    "re": "Dây dẫn sẽ sinh ra từ trường xung quanh"
  },
  {
    "con": "Khi áp suất trong một chất lỏng tăng lên thì",
    "re": "Áp suất tại mọi điểm trong chất lỏng cũng tăng lên"
  },
  {
    "con": "Một vật chuyển động thẳng đều.",
    "re": "Vận tốc của vật không thay đổi theo thời gian."
  },
  {
    "con": "Một vật chịu tác dụng của lực không cân bằng.",
    "re": "Vật sẽ thay đổi vận tốc của nó."
  },
  {
    "con": "Năng lượng không thể tự sinh ra hoặc mất đi.",
    "re": "Năng lượng chỉ có thể chuyển đổi từ dạng này sang dạng khác."
  },
  {
    "con": "Một vật rơi tự do trong môi trường không có sức cản.",
    "re": "Vật sẽ tăng tốc với gia tốc khoảng 9.81 m/s²."
  },
  {
    "con": "Một lò xo bị nén hoặc kéo dài.",
    "re": "Lực tác dụng lên lò xo tỉ lệ thuận với độ biến dạng của nó."
  },
  {
    "con": "Một vật có khối lượng lớn hơn sẽ chịu lực hấp dẫn lớn hơn.",
    "re": "Lực hấp dẫn tỉ lệ thuận với khối lượng của vật."
  },
  {
    "con": "Một dòng điện chạy qua một dây dẫn.",
    "re": "Sẽ tạo ra một từ trường xung quanh dây dẫn."
  },
  {
    "con": "Một vật phát ra ánh sáng.",
    "re": "Nó có thể là nguồn sáng hoặc phản xạ ánh sáng từ nguồn khác."
  },
  {
    "con": "Nhiệt độ của một vật tăng lên.",
    "re": "Năng lượng nhiệt của vật cũng tăng lên."
  },
  {
    "con": "Một vật chuyển động tròn đều.",
    "re": "Vật có gia tốc hướng tâm dù vận tốc có thể không thay đổi."
  },
  {
    "con": "Chọn phát biểu sai. Xét một vật chuyển động với vận tốc không quá lớn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Điều kiện cân bằng của một vật rắn chịu tác dụng của ba lực không song song là ba lực đó phải",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chuyển động thẳng đều thì vận tốc của nó sẽ",
    "re": "không thay đổi theo thời gian"
  },
  {
    "con": "Nếu lực tác dụng lên một vật lớn hơn lực cản thì vật đó sẽ",
    "re": "chuyển động theo hướng của lực tác dụng"
  },
  {
    "con": "Nếu nhiệt độ của một vật tăng lên thì năng lượng nội tại của vật đó sẽ",
    "re": "tăng theo"
  },
  {
    "con": "Nếu một vật rơi tự do thì gia tốc của nó sẽ",
    "re": "bằng gia tốc trọng trường"
  },
  {
    "con": "Nếu một sóng âm có tần số cao thì âm thanh phát ra sẽ",
    "re": "có âm sắc cao"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn thì trọng lực tác dụng lên nó sẽ",
    "re": "lớn hơn"
  },
  {
    "con": "Nếu một vật được ném lên cao thì vận tốc của nó sẽ",
    "re": "giảm dần cho đến khi đạt đến độ cao cực đại"
  },
  {
    "con": "Nếu một mạch điện kín có điện trở lớn thì cường độ dòng điện sẽ",
    "re": "nhỏ hơn"
  },
  {
    "con": "Nếu ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau thì",
    "re": "ánh sáng sẽ bị bẻ cong"
  },
  {
    "con": "Trong các phương trình dưới đây phương trình nào là phương trình tọa độ của chuyển động thẳng đều với vận tốc 4 \\frac{m}{s}",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi",
    "re": "Vật đó sẽ di chuyển theo một đường thẳng"
  },
  {
    "con": "Khi lực tác dụng lên một vật lớn hơn lực cản",
    "re": "Vật sẽ tăng tốc"
  },
  {
    "con": "Khi một vật rơi tự do trong môi trường không có không khí",
    "re": "Vật sẽ rơi với gia tốc 9.81 \\frac{m}{s^2}"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nội tại của vật đó cũng sẽ tăng"
  },
  {
    "con": "Khi một vật bị kéo dài hoặc nén",
    "re": "Vật sẽ tạo ra lực đàn hồi theo định luật Hooke"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước",
    "re": "Ánh sáng sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Khi một vật có khối lượng lớn hơn vật khác",
    "re": "Vật lớn hơn sẽ có trọng lực tác dụng mạnh hơn"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn",
    "re": "Dây dẫn sẽ sinh ra từ trường xung quanh"
  },
  {
    "con": "Khi một vật quay quanh một trục",
    "re": "Vật đó sẽ có động năng quay"
  },
  {
    "con": "Để nâng đều một hòn đá có trọng lượng 50 N lên độ cao 10 m cần một thực hiện một công là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc 20 m/s sẽ di chuyển được 100 m trong khoảng thời gian",
    "re": "5 giây"
  },
  {
    "con": "Khi một lực 10 N tác động lên một vật có khối lượng 2 kg, gia tốc của vật sẽ là",
    "re": "5 m/s²"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao 20 m, thời gian rơi sẽ khoảng",
    "re": "2 giây"
  },
  {
    "con": "Khi một lò xo bị nén với độ biến dạng 0.5 m và có độ cứng 200 N/m, lực nén của lò xo sẽ là",
    "re": "100 N"
  },
  {
    "con": "Nếu một vật có khối lượng 3 kg di chuyển với vận tốc 4 m/s, động năng của vật sẽ là",
    "re": "24 J"
  },
  {
    "con": "Khi một vật quay quanh một trục với bán kính 2 m và vận tốc góc 3 rad/s, gia tốc hướng tâm sẽ là",
    "re": "4.5 m/s²"
  },
  {
    "con": "Nếu một điện trở có giá trị 10 Ω và dòng điện chạy qua là 2 A, điện áp trên điện trở sẽ là",
    "re": "20 V"
  },
  {
    "con": "Khi một vật có khối lượng 5 kg được kéo lên với lực 50 N, công thực hiện sẽ là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một sóng âm có tần số 440 Hz, bước sóng của sóng trong không khí sẽ là",
    "re": "0.78 m"
  },
  {
    "con": "Mức quán tính của vật quay quanh một trục không phụ thuộc vào",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Lực tác dụng lên một vật không bằng không",
    "re": "Vật sẽ có gia tốc"
  },
  {
    "con": "Năng lượng không được tạo ra hay tiêu diệt",
    "re": "Năng lượng chỉ chuyển đổi từ dạng này sang dạng khác"
  },
  {
    "con": "Vật có khối lượng lớn hơn sẽ chịu tác động của lực hấp dẫn mạnh hơn",
    "re": "Vật đó sẽ rơi nhanh hơn trong chân không"
  },
  {
    "con": "Nếu nhiệt độ của một vật tăng lên",
    "re": "Năng lượng động học của các phân tử trong vật đó cũng tăng lên"
  },
  {
    "con": "Khi một vật chuyển động theo đường thẳng",
    "re": "Vật đó sẽ có vận tốc không đổi nếu không có lực tác dụng"
  },
  {
    "con": "Nếu một vật va chạm với một vật khác và không có lực bên ngoài tác động",
    "re": "Tổng động lượng của hệ sẽ được bảo toàn"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác",
    "re": "Tốc độ ánh sáng sẽ thay đổi tùy thuộc vào chỉ số khúc xạ của môi trường"
  },
  {
    "con": "Nếu một vật được nâng lên cao",
    "re": "Năng lượng thế của vật đó sẽ tăng lên"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn",
    "re": "Sẽ tạo ra một từ trường xung quanh dây dẫn đó"
  },
  {
    "con": "Biểu thức của định luật Húc về lực đàn hồi lò xo là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì vận tốc của nó không thay đổi.",
    "re": "Vật đó có gia tốc bằng 0"
  },
  {
    "con": "Khi một lực tác dụng lên một vật thì vật đó sẽ bị biến dạng hoặc thay đổi chuyển động.",
    "re": "Lực có thể làm thay đổi trạng thái của vật"
  },
  {
    "con": "Năng lượng không thể tự sinh ra hay mất đi mà chỉ chuyển đổi từ dạng này sang dạng khác.",
    "re": "Nguyên lý bảo toàn năng lượng được áp dụng"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên thì thể tích của nó thường tăng theo.",
    "re": "Hiện tượng giãn nở nhiệt xảy ra"
  },
  {
    "con": "Nếu một vật rơi tự do thì gia tốc của nó là gia tốc trọng trường.",
    "re": "Gia tốc này có giá trị khoảng 9.81 m/s²"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau thì nó sẽ bị khúc xạ.",
    "re": "Hiện tượng khúc xạ ánh sáng xảy ra"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn thì lực hấp dẫn tác dụng lên nó cũng lớn hơn.",
    "re": "Lực hấp dẫn tỷ lệ thuận với khối lượng"
  },
  {
    "con": "Khi một vật quay quanh một điểm cố định thì nó có gia tốc hướng tâm.",
    "re": "Gia tốc này luôn hướng về tâm quay"
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cân bằng thì nó sẽ không chuyển động.",
    "re": "Vật đó sẽ ở trạng thái tĩnh hoặc chuyển động thẳng đều"
  },
  {
    "con": "Ba vật dưới đây (Hình a, b, c) vật nào ở trạng thái cân bằng bền?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì lực tác dụng lên vật đó là gì?",
    "re": "Lực tác dụng bằng 0"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên thì thể tích của chất đó sẽ như thế nào?",
    "re": "Thể tích của chất đó sẽ tăng lên"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn thì trọng lực tác dụng lên vật đó sẽ như thế nào?",
    "re": "Trọng lực tác dụng sẽ lớn hơn"
  },
  {
    "con": "Khi một vật rơi tự do thì gia tốc của nó là gì?",
    "re": "Gia tốc của nó là gia tốc trọng trường"
  },
  {
    "con": "Nếu một vật quay quanh một trục thì lực hướng tâm tác dụng lên vật đó sẽ như thế nào?",
    "re": "Lực hướng tâm sẽ giữ cho vật không rơi ra ngoài"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước thì hiện tượng gì xảy ra?",
    "re": "Ánh sáng bị khúc xạ"
  },
  {
    "con": "Nếu một vật có vận tốc tăng dần thì vật đó đang chuyển động như thế nào?",
    "re": "Vật đó đang chuyển động tăng tốc"
  },
  {
    "con": "Khi một lò xo bị nén hoặc kéo dài thì nó sẽ tạo ra lực như thế nào?",
    "re": "Lò xo sẽ tạo ra lực phục hồi"
  },
  {
    "con": "Nếu một vật có năng lượng cơ học bảo toàn thì tổng năng lượng của nó sẽ như thế nào?",
    "re": "Tổng năng lượng của nó sẽ không thay đổi"
  },
  {
    "con": "Chọn đáp án sai. Cho phương trình của 1 chuyển động thẳng theo phương trình x = 10 - 4t + t^2 (m,s). Suy ra",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi",
    "re": "Quỹ đạo của vật là một đường thẳng"
  },
  {
    "con": "Một vật chịu tác dụng của lực không đổi",
    "re": "Vật sẽ có gia tốc không đổi"
  },
  {
    "con": "Năng lượng cơ học được bảo toàn trong một hệ kín",
    "re": "Tổng năng lượng động và thế không thay đổi"
  },
  {
    "con": "Một vật rơi tự do trong trường hấp dẫn",
    "re": "Vật sẽ có gia tốc bằng gia tốc trọng trường"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nội của vật cũng tăng lên"
  },
  {
    "con": "Một sóng âm truyền qua không khí",
    "re": "Sóng âm sẽ có tần số và bước sóng xác định"
  },
  {
    "con": "Khi một điện tích di chuyển trong một từ trường",
    "re": "Điện tích sẽ chịu tác dụng của lực Lorentz"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác",
    "re": "Ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác",
    "re": "Tổng động năng trước và sau va chạm sẽ được bảo toàn"
  },
  {
    "con": "Vật chuyển động thẳng đều",
    "re": "Vận tốc của vật không thay đổi theo thời gian"
  },
  {
    "con": "Lực tác dụng lên một vật",
    "re": "Vật sẽ thay đổi vận tốc hoặc hướng chuyển động"
  },
  {
    "con": "Năng lượng không thể tự sinh ra hoặc mất đi",
    "re": "Tổng năng lượng trong một hệ kín luôn được bảo toàn"
  },
  {
    "con": "Khi một vật rơi tự do",
    "re": "Vật sẽ chịu tác động của trọng lực và gia tốc rơi tự do là 9.81 m/s²"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nội tại của vật cũng sẽ tăng theo"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác",
    "re": "Tốc độ ánh sáng sẽ thay đổi và có thể bị khúc xạ"
  },
  {
    "con": "Khi một vật dao động điều hòa",
    "re": "Vật sẽ có vị trí và vận tốc thay đổi theo thời gian theo một chu kỳ nhất định"
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng",
    "re": "Vật sẽ có gia tốc tỉ lệ thuận với lực và tỉ lệ nghịch với khối lượng"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác",
    "re": "Tổng động năng trước và sau va chạm sẽ được bảo toàn"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn",
    "re": "Dây dẫn sẽ sinh ra một từ trường xung quanh"
  },
  {
    "con": "Biểu thức tính độ lớn hợp của hai lực đồng quy F_{1} và F_{2} hợp với nhau góc α là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì vận tốc của nó là:",
    "re": "Không thay đổi theo thời gian"
  },
  {
    "con": "Khi một vật rơi tự do thì gia tốc của nó là:",
    "re": "Gia tốc trọng trường, khoảng 9.81 m/s²"
  },
  {
    "con": "Nếu lực tác dụng lên một vật không đổi và khối lượng của vật là m thì gia tốc a của vật được tính bằng:",
    "re": "a = F/m, với F là lực tác dụng"
  },
  {
    "con": "Khi một vật quay quanh một trục thì lực hướng tâm tác dụng lên vật là:",
    "re": "Lực giữ cho vật chuyển động theo quỹ đạo tròn"
  },
  {
    "con": "Nếu nhiệt độ của một vật tăng lên thì năng lượng nội tại của vật:",
    "re": "Tăng lên"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau thì:",
    "re": "Ánh sáng sẽ bị bẻ cong"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v thì động năng của vật được tính bằng:",
    "re": "E_k = 1/2 mv²"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác thì:",
    "re": "Tổng động năng trước và sau va chạm là như nhau"
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cân bằng thì:",
    "re": "Vật sẽ đứng yên hoặc chuyển động thẳng đều"
  },
  {
    "con": "Một vật có khối lượng 500 g chuyển động thẳng dọc trục Ox với vận tốc 18 \\frac{km}{h}. Động lượng của vật là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20 m. Thời gian rơi của vật là",
    "re": "Câu trả lời đúng là khoảng 2,02 giây"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0,1 m. Năng lượng đàn hồi của lò xo là",
    "re": "Câu trả lời đúng là 1 J"
  },
  {
    "con": "Một vật có khối lượng 2 kg được kéo với lực 10 N. Gia tốc của vật là",
    "re": "Câu trả lời đúng là 5 m/s²"
  },
  {
    "con": "Một vật có khối lượng 1 kg di chuyển với vận tốc 10 m/s. Động năng của vật là",
    "re": "Câu trả lời đúng là 50 J"
  },
  {
    "con": "Một dòng điện có cường độ 2 A chạy qua một điện trở 5 Ω. Điện áp trên điện trở là",
    "re": "Câu trả lời đúng là 10 V"
  },
  {
    "con": "Một vật có khối lượng 3 kg đứng yên trên mặt đất. Lực trọng lực tác dụng lên vật là",
    "re": "Câu trả lời đúng là 29,4 N"
  },
  {
    "con": "Một vật chuyển động tròn với bán kính 2 m và vận tốc 4 m/s. Gia tốc hướng tâm của vật là",
    "re": "Câu trả lời đúng là 8 m/s²"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz và vận tốc 340 m/s. Chiều dài sóng của âm là",
    "re": "Câu trả lời đúng là 0,773 m"
  },
  {
    "con": "Một vật có khối lượng 4 kg và vận tốc 3 m/s va chạm hoàn toàn đàn hồi với một vật khác. Động lượng trước va chạm là",
    "re": "Câu trả lời đúng là 12 kg·m/s"
  },
  {
    "con": "Chọn đáp án đúng. Đặc điểm của cặp \"lực và phản lực\" trong định luật III Niutơn là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều thì",
    "re": "lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên thì",
    "re": "khối lượng riêng của chất đó thường giảm"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực không đổi trong một khoảng thời gian nhất định thì",
    "re": "vật sẽ có gia tốc không đổi"
  },
  {
    "con": "Khi một vật rơi tự do thì",
    "re": "vật chịu tác dụng của trọng lực và có gia tốc 9.81 m/s²"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác thì",
    "re": "lực hấp dẫn giữa hai vật sẽ lớn hơn"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước thì",
    "re": "ánh sáng sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Nếu một vật dao động điều hòa thì",
    "re": "vật sẽ có biên độ và tần số nhất định"
  },
  {
    "con": "Khi một điện tích di chuyển trong từ trường thì",
    "re": "điện tích sẽ chịu tác dụng của lực Lorentz"
  },
  {
    "con": "Nếu một vật va chạm đàn hồi với vật khác thì",
    "re": "tổng động năng của hai vật trước và sau va chạm sẽ bằng nhau"
  },
  {
    "con": "Gọi \\DeltaA, A , lần lượt là sai số tuyệt đối và giá trị trung bình của một phép đo đại lượng A. Biểu thức tính sai số tỉ đối ε của phép đo là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi",
    "re": "Quỹ đạo của vật là một đường thẳng"
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng m",
    "re": "Vật sẽ có gia tốc a = \\frac{F}{m}"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nội tại của vật cũng tăng lên"
  },
  {
    "con": "Khi một vật rơi tự do từ độ cao h",
    "re": "Vận tốc của vật sẽ tăng theo thời gian với gia tốc g = 9.81 m/s²"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác",
    "re": "Tốc độ ánh sáng sẽ thay đổi tùy thuộc vào chỉ số khúc xạ của môi trường"
  },
  {
    "con": "Khi một vật chịu tác dụng của hai lực cân bằng",
    "re": "Vật sẽ đứng yên hoặc chuyển động thẳng đều"
  },
  {
    "con": "Khi một sóng âm đi qua không khí",
    "re": "Tốc độ của sóng âm sẽ phụ thuộc vào nhiệt độ của không khí"
  },
  {
    "con": "Khi một điện tích q được đặt trong một điện trường E",
    "re": "Điện tích sẽ chịu một lực F = qE"
  },
  {
    "con": "Khi một vật dao động điều hòa với tần số f",
    "re": "Thời gian dao động của vật là T = \\frac{1}{f}"
  },
  {
    "con": "Đại lượng đặc trưng cho mức quán tính của vật là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Lực tác dụng lên một vật có khối lượng m sẽ tạo ra gia tốc a",
    "re": "Vật sẽ chuyển động theo hướng của lực"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt",
    "re": "Năng lượng chỉ có thể chuyển đổi từ dạng này sang dạng khác"
  },
  {
    "con": "Khi một vật chuyển động tròn đều",
    "re": "Vật sẽ có gia tốc hướng vào tâm của vòng tròn"
  },
  {
    "con": "Nếu một vật chịu tác dụng của lực cân bằng",
    "re": "Vật sẽ đứng yên hoặc chuyển động với vận tốc không đổi"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nội tại của vật cũng sẽ tăng lên"
  },
  {
    "con": "Nếu một vật va chạm đàn hồi với một vật khác",
    "re": "Tổng động năng của hai vật sẽ được bảo toàn"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác",
    "re": "Ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Nếu một vật có điện tích dương",
    "re": "Nó sẽ hút các điện tích âm và đẩy các điện tích dương"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn",
    "re": "Sẽ tạo ra một từ trường xung quanh dây dẫn đó"
  },
  {
    "con": "Một lực \\overrightarrow{F} không đổi liên tục kéo 1 vật chuyển động với vận tốc v theo hướng của lực \\overrightarrow{F}. Công suất của lực \\overrightarrow{F} là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng m rơi tự do trong trường hấp dẫn của Trái Đất. Gia tốc của vật đó là:",
    "re": "9.81 m/s²"
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính r và vận tốc v. Gia tốc hướng tâm của vật đó là:",
    "re": "a = \\frac{v^2}{r}"
  },
  {
    "con": "Khi một vật chịu tác dụng của lực kéo về F và lực cản F_d. Nếu F > F_d thì vật sẽ:",
    "re": "chuyển động theo hướng của lực kéo"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Động năng của vật đó là:",
    "re": "E_k = \\frac{1}{2}mv^2"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác, tổng động lượng của hệ vật đó sẽ:",
    "re": "giữ nguyên"
  },
  {
    "con": "Một vật nằm trên mặt phẳng nghiêng với góc α. Lực tác dụng lên vật theo phương vuông góc với mặt phẳng nghiêng là:",
    "re": "F_n = mg \\cos(α)"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên, thể tích của chất đó sẽ:",
    "re": "tăng lên (nếu áp suất không đổi)"
  },
  {
    "con": "Một sóng âm truyền trong không khí với tốc độ v. Nếu tần số của sóng là f thì bước sóng λ của sóng đó là:",
    "re": "λ = \\frac{v}{f}"
  },
  {
    "con": "Khi một điện tích q di chuyển trong một điện trường E, công thực hiện bởi điện trường là:",
    "re": "W = qEd"
  },
  {
    "con": "Lực có tác dụng làm cho vật rắn quay quanh một trục khi",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Vật chịu tác dụng của lực hấp dẫn thì",
    "re": "Nó sẽ rơi xuống đất nếu không có lực cản"
  },
  {
    "con": "Năng lượng được bảo toàn trong một hệ kín thì",
    "re": "Tổng năng lượng của hệ sẽ không thay đổi theo thời gian"
  },
  {
    "con": "Vật chuyển động thẳng đều thì",
    "re": "Vận tốc của nó sẽ không thay đổi"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên thì",
    "re": "Năng lượng nội tại của vật cũng sẽ tăng"
  },
  {
    "con": "Khi một vật va chạm với một vật khác thì",
    "re": "Tổng động lượng của hai vật sẽ được bảo toàn nếu không có lực bên ngoài tác dụng"
  },
  {
    "con": "Áp suất được định nghĩa là lực tác dụng trên một đơn vị diện tích thì",
    "re": "Áp suất sẽ tăng nếu lực tác dụng tăng hoặc diện tích giảm"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác thì",
    "re": "Nó sẽ bị khúc xạ nếu hai môi trường có chỉ số khúc xạ khác nhau"
  },
  {
    "con": "Khi một vật dao động điều hòa thì",
    "re": "Vận tốc của nó sẽ thay đổi theo thời gian và đạt cực đại tại vị trí cân bằng"
  },
  {
    "con": "Khi một điện tích di chuyển trong một từ trường thì",
    "re": "Nó sẽ chịu tác dụng của một lực từ"
  },
  {
    "con": "Hệ thức của định luật vạn vật hấp dẫn là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Lực tác dụng lên một vật tỉ lệ thuận với khối lượng và gia tốc của nó",
    "re": "Vật sẽ có gia tốc lớn hơn"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt",
    "re": "Tổng năng lượng trong hệ kín là hằng số"
  },
  {
    "con": "Áp suất là lực tác dụng trên một đơn vị diện tích",
    "re": "Áp suất sẽ tăng khi lực tăng hoặc diện tích giảm"
  },
  {
    "con": "Nhiệt độ của một vật tăng lên khi năng lượng nhiệt được cung cấp",
    "re": "Vật sẽ có động năng cao hơn"
  },
  {
    "con": "Một vật chuyển động thẳng đều",
    "re": "Vật sẽ có vận tốc không đổi"
  },
  {
    "con": "Khi một vật va chạm với một vật khác và không có lực bên ngoài tác động",
    "re": "Tổng động lượng của hệ sẽ được bảo toàn"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác",
    "re": "Ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Khi một vật chịu tác dụng của lực kéo về phía trung tâm",
    "re": "Vật sẽ chuyển động theo quỹ đạo tròn"
  },
  {
    "con": "Khi một vật được nâng lên cao",
    "re": "Năng lượng thế của vật sẽ tăng lên"
  },
  {
    "con": "Một vật chuyển động thẳng đều",
    "re": "vận tốc của nó không thay đổi"
  },
  {
    "con": "Lực tác dụng lên một vật",
    "re": "sẽ làm thay đổi trạng thái chuyển động của vật đó"
  },
  {
    "con": "Năng lượng không thể được tạo ra hoặc tiêu diệt",
    "re": "nó chỉ có thể chuyển đổi từ dạng này sang dạng khác"
  },
  {
    "con": "Một vật rơi tự do",
    "re": "chịu tác động của trọng lực và có gia tốc không đổi"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng",
    "re": "năng lượng nội tại của vật đó cũng tăng"
  },
  {
    "con": "Khi một vật va chạm với một vật khác",
    "re": "động lượng của hệ thống sẽ được bảo toàn nếu không có lực bên ngoài tác động"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác",
    "re": "nó sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Một dòng điện chạy qua một dây dẫn",
    "re": "sẽ tạo ra một từ trường xung quanh dây dẫn đó"
  },
  {
    "con": "Khi một vật dao động",
    "re": "nó sẽ có tần số và biên độ nhất định"
  },
  {
    "con": "Khi áp suất trong một chất khí tăng",
    "re": "thể tích của chất khí đó sẽ giảm nếu nhiệt độ không đổi"
  },
  {
    "con": "Chọn đáp án sai. Chuyển động tròn đều có",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chọn đáp án đúng. Lực ma sát trượt",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều",
    "re": "Vận tốc của nó không thay đổi theo thời gian"
  },
  {
    "con": "Một vật chịu tác dụng của lực tổng hợp không bằng 0",
    "re": "Vật sẽ có gia tốc"
  },
  {
    "con": "Năng lượng không thể tự sinh ra hoặc mất đi",
    "re": "Năng lượng luôn được bảo toàn trong một hệ kín"
  },
  {
    "con": "Một vật rơi tự do trong môi trường không có sức cản",
    "re": "Vật sẽ tăng tốc với gia tốc 9.81 m/s²"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên",
    "re": "Năng lượng nội tại của vật cũng tăng lên"
  },
  {
    "con": "Một dòng điện chạy qua một dây dẫn",
    "re": "Sẽ tạo ra một từ trường xung quanh dây dẫn đó"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước",
    "re": "Tia sáng sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Khi một vật va chạm với một vật khác và không có mất mát năng lượng",
    "re": "Thì động lượng của hệ thống được bảo toàn"
  },
  {
    "con": "Khi một vật quay quanh một trục",
    "re": "Thì nó có động năng quay"
  },
  {
    "con": "Momen ngẫu lực được xác định bằng công thức",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Lực tác dụng lên một vật có khối lượng sẽ tạo ra gia tốc",
    "re": "Vật sẽ chuyển động theo hướng của lực"
  },
  {
    "con": "Năng lượng được bảo toàn trong một hệ kín",
    "re": "Tổng năng lượng của hệ không thay đổi"
  },
  {
    "con": "Áp suất được tính bằng lực chia cho diện tích",
    "re": "Áp suất sẽ tăng khi lực tăng hoặc diện tích giảm"
  },
  {
    "con": "Khi một vật rơi tự do, nó chịu tác động của trọng lực",
    "re": "Vật sẽ tăng tốc với gia tốc trọng trường"
  },
  {
    "con": "Định luật bảo toàn động lượng áp dụng cho các va chạm",
    "re": "Tổng động lượng trước va chạm bằng tổng động lượng sau va chạm"
  },
  {
    "con": "Nhiệt độ tăng lên sẽ làm tăng năng lượng động của phân tử",
    "re": "Chất sẽ có xu hướng mở rộng"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác",
    "re": "Ánh sáng sẽ bị khúc xạ"
  },
  {
    "con": "Điện trở của một dây dẫn tỉ lệ thuận với chiều dài và tỉ lệ nghịch với diện tích mặt cắt",
    "re": "Điện trở sẽ tăng khi chiều dài tăng hoặc diện tích giảm"
  },
  {
    "con": "Khi một vật dao động, nó sẽ có vị trí cân bằng",
    "re": "Vật sẽ trở về vị trí cân bằng sau khi bị lệch"
  },
  {
    "con": "Một chiếc thuyền chuyển động thẳng đều xuôi dòng sông với v =10 \\frac{m}{s} so với dòng nước. Biết vận tốc dòng nước là 1 \\frac{m}{s}. Xác định vận tốc của thuyền so với bờ sông.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h = 20 m. Biết gia tốc trọng trường g = 9.8 \\frac{m}{s^2}. Tính thời gian rơi của vật.",
    "re": "Thời gian rơi là khoảng 2.02 giây"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 \\frac{N}{m} bị nén một đoạn x = 0.1 m. Tính năng lượng tiềm năng của lò xo.",
    "re": "Năng lượng tiềm năng là 1 J"
  },
  {
    "con": "Một chiếc xe có khối lượng m = 1000 kg chuyển động với vận tốc v = 20 \\frac{m}{s}. Tính động năng của chiếc xe.",
    "re": "Động năng là 200000 J"
  },
  {
    "con": "Một vật có khối lượng m = 5 kg được kéo lên cao với lực F = 50 N. Nếu vật di chuyển lên cao h = 2 m, tính công thực hiện.",
    "re": "Công thực hiện là 100 J"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu v_0 = 15 \\frac{m}{s}. Tính chiều cao tối đa mà quả bóng đạt được.",
    "re": "Chiều cao tối đa là 11.47 m"
  },
  {
    "con": "Một mạch điện có điện trở R = 10 \\Omega và hiệu điện thế U = 20 V. Tính cường độ dòng điện trong mạch.",
    "re": "Cường độ dòng điện là 2 A"
  },
  {
    "con": "Một vật có khối lượng m = 2 kg di chuyển với vận tốc v = 3 \\frac{m}{s}. Nếu vật va chạm đàn hồi với một vật khác, tính vận tốc sau va chạm.",
    "re": "Vận tốc sau va chạm phụ thuộc vào khối lượng vật thứ hai"
  },
  {
    "con": "Một sóng âm có tần số f = 440 Hz và vận tốc truyền sóng v = 340 \\frac{m}{s}. Tính bước sóng của sóng âm.",
    "re": "Bước sóng là 0.773 m"
  },
  {
    "con": "Một vật có khối lượng m = 10 kg được treo vào một lò xo. Nếu lò xo có độ cứng k = 500 \\frac{N}{m}, tính độ biến dạng của lò xo.",
    "re": "Độ biến dạng của lò xo là 0.2 m"
  },
  {
    "con": "Trong công tốc tính vận tốc của chuyển động thẳng nhanh dần đều: v = v_{o} + at",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật rơi tự do, gia tốc của nó là 9.81 m/s²",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong định luật Newton thứ nhất, một vật sẽ giữ nguyên trạng thái chuyển động của nó nếu không có lực tác động",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi lực tác dụng lên một vật tăng lên, gia tốc của vật cũng sẽ tăng theo định luật Newton thứ hai: F = ma",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong một hệ kín, tổng năng lượng được bảo toàn, nghĩa là năng lượng không thể tự sinh ra hoặc mất đi",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác, nó sẽ bị khúc xạ",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật dao động, tần số của nó là số lần nó hoàn thành một chu kỳ trong một giây",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong một mạch điện, nếu điện trở tăng lên mà điện áp không thay đổi, thì dòng điện sẽ giảm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật va chạm với một vật khác, tổng động lượng của hệ sẽ được bảo toàn nếu không có lực bên ngoài tác động",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên, năng lượng động học của các phân tử trong vật đó cũng sẽ tăng lên",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Phải treo một vật có trọng lượng bằng bao nhiêu vào lò xo có độ cứng k =100 \\frac{N}{m} để nó dãn ra được 10 cm?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi thì quãng đường đi được tỉ lệ thuận với thời gian.",
    "re": "Quy tắc này đúng"
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng m thì vật sẽ có gia tốc a tỉ lệ thuận với lực và tỉ lệ nghịch với khối lượng.",
    "re": "Định luật II Newton đúng"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h thì thời gian rơi tỉ lệ với căn bậc hai của độ cao.",
    "re": "Quy tắc này đúng"
  },
  {
    "con": "Khi một vật quay quanh một trục thì lực hướng tâm cần thiết để giữ vật trong quỹ đạo tỉ lệ với khối lượng và bình phương vận tốc.",
    "re": "Quy tắc này đúng"
  },
  {
    "con": "Nếu một vật va chạm đàn hồi với một vật khác thì tổng động năng trước và sau va chạm được bảo toàn.",
    "re": "Quy tắc này đúng"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên thì thể tích của nó cũng sẽ tăng lên nếu áp suất không đổi.",
    "re": "Quy tắc này đúng theo định luật Charles"
  },
  {
    "con": "Nếu một điện tích q di chuyển trong một điện trường E thì nó sẽ chịu tác dụng của một lực điện F tỉ lệ với điện tích và cường độ điện trường.",
    "re": "Quy tắc này đúng"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác thì góc khúc xạ tỉ lệ với tỉ số của chỉ số khúc xạ của hai môi trường.",
    "re": "Quy tắc này đúng theo định luật Snell"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v thì động năng của nó được tính bằng công thức \\frac{1}{2}mv^2.",
    "re": "Công thức này đúng"
  },
  {
    "con": "Cho một vật có khối lượng 3kg được treo (như hình vẽ) với dây treo hợp với phương thẳng đứng một góc 30\\circ. Lấy g = 10 \\frac{m}{s^2} , xác định lực căng của dây và lực tác dụng của vật lên tường.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chuyển động thẳng đều với vận tốc 5 m/s, thì quãng đường đi được sau 10 giây là 50 m.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao 20 m, thì thời gian rơi xuống đất là khoảng 2 s.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu lực tác dụng lên một vật có khối lượng 2 kg là 10 N, thì gia tốc của vật là 5 m/s².",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một lò xo có độ cứng k = 200 N/m bị nén 0.1 m, thì năng lượng đàn hồi của lò xo là 1 J.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 1 kg di chuyển với vận tốc 10 m/s, thì động năng của vật là 50 J.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 5 kg được nâng lên cao 2 m, thì công thực hiện để nâng vật là 100 J.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dòng điện có cường độ 2 A chạy qua một điện trở 5 Ω, thì điện áp trên điện trở là 10 V.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 4 kg di chuyển với vận tốc 3 m/s, thì động lượng của vật là 12 kg·m/s.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cân bằng, thì vật sẽ không thay đổi trạng thái chuyển động.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một con tàu vũ trụ bay về hướng mặt trăng, biết khoảng cách giữa tâm trái đất và mặt trăng bằng 60 lần bán kính trái đất và khối lượng mặt trăng nhỏ hơn khối lượng của trái đất 81 lần. Xác định vị trí con tàu sao cho lực hấp dẫn của trái đất và mặt trăng tác dụng lên con tàu cân bằng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h, không có lực cản của không khí, thì thời gian rơi của vật sẽ tỉ lệ với căn bậc hai của độ cao h.",
    "re": "Thời gian rơi tỉ lệ với căn bậc hai của độ cao"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v, thì động năng của vật được tính bằng công thức 1/2 mv^2.",
    "re": "Động năng của vật được tính bằng công thức 1/2 mv^2"
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m, thì gia tốc a của vật sẽ tỉ lệ thuận với lực F và nghịch đảo với khối lượng m.",
    "re": "Gia tốc a = F/m"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác, thì góc khúc xạ sẽ thay đổi theo định luật Snell.",
    "re": "Góc khúc xạ thay đổi theo định luật Snell"
  },
  {
    "con": "Khi một vật quay quanh một trục, thì lực hướng tâm cần thiết để giữ vật trong quỹ đạo tỉ lệ với khối lượng và bình phương vận tốc của vật.",
    "re": "Lực hướng tâm tỉ lệ với m*v^2/r"
  },
  {
    "con": "Khi một điện tích q di chuyển trong một trường điện E, thì lực tác dụng lên điện tích đó sẽ tỉ lệ với độ lớn của điện tích và cường độ trường điện.",
    "re": "Lực tác dụng F = qE"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí, thì tốc độ của sóng âm phụ thuộc vào nhiệt độ của không khí.",
    "re": "Tốc độ sóng âm phụ thuộc vào nhiệt độ không khí"
  },
  {
    "con": "Khi một vật bị nén hoặc kéo dài, thì lực đàn hồi sẽ tỉ lệ với độ biến dạng của vật theo định luật Hooke.",
    "re": "Lực đàn hồi F = kx"
  },
  {
    "con": "Khi một vật chuyển động tròn đều, thì vận tốc của vật luôn hướng về phía tâm của quỹ đạo.",
    "re": "Vận tốc luôn hướng về phía tâm quỹ đạo"
  },
  {
    "con": "Một thanh sắt dài, đồng chất, tiết diện đều, được đặt trên bàn sao cho 1/4 chiều dài của nó nhô ra khỏi bàn. Tại đầu nhô ra, người ta đặt một lực F hướng thẳng đứng xuống dưới. Khi lực đạt tới giá trị 40 N thì đầu kia của thanh sắt bắt đầu bênh lên. Lấy 2 g 10 \\frac{m}{s} . Trọng lượng của thanh là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2 kg được thả rơi tự do từ độ cao 20 m. Nếu không có lực cản của không khí, thì thời gian rơi của vật là",
    "re": "Câu trả lời đúng là khoảng 2.02 giây"
  },
  {
    "con": "Một lò xo có độ cứng k = 100 N/m bị nén lại 0.5 m. Nếu lò xo được thả ra, thì năng lượng tiềm năng đàn hồi của lò xo là",
    "re": "Câu trả lời đúng là 12.5 J"
  },
  {
    "con": "Một chiếc xe có khối lượng 1000 kg đang chuyển động với vận tốc 20 m/s. Nếu xe phanh lại và dừng lại trong 5 giây, thì lực phanh trung bình tác dụng lên xe là",
    "re": "Câu trả lời đúng là 4000 N"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu 15 m/s. Nếu lấy g = 10 m/s², thì chiều cao tối đa mà quả bóng đạt được là",
    "re": "Câu trả lời đúng là 11.25 m"
  },
  {
    "con": "Một vật có khối lượng 5 kg được kéo lên cao với lực 50 N. Nếu lực kéo lớn hơn trọng lực của vật, thì vật sẽ",
    "re": "Câu trả lời đúng là sẽ di chuyển lên trên"
  },
  {
    "con": "Một dòng điện có cường độ 2 A chạy qua một điện trở 5 Ω. Nếu điện trở không thay đổi, thì công suất tiêu thụ của điện trở là",
    "re": "Câu trả lời đúng là 20 W"
  },
  {
    "con": "Một vật có khối lượng 3 kg di chuyển với vận tốc 10 m/s. Nếu vật va chạm hoàn toàn đàn hồi với một vật khác có khối lượng 3 kg đứng yên, thì vận tốc của hai vật sau va chạm sẽ",
    "re": "Câu trả lời đúng là 5 m/s cho mỗi vật"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz truyền trong không khí với tốc độ 340 m/s. Nếu tốc độ sóng không thay đổi, thì bước sóng của sóng âm là",
    "re": "Câu trả lời đúng là 0.773 m"
  },
  {
    "con": "Một vật có khối lượng 10 kg được đặt trên mặt phẳng nghiêng với góc 30 độ. Nếu không có ma sát, thì lực tác dụng lên vật theo phương vuông góc với mặt phẳng nghiêng là",
    "re": "Câu trả lời đúng là 49 N"
  },
  {
    "con": "Một tấm ván nặng 210 N được bắc qua một con mương. Trọng tâm của tấm ván cách điểm tựa A 2,4 m và điểm tựa B 1,2 m. Lực mà tấm ván tác dụng lên điểm tựa A là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một vật có khối lượng 10 kg được thả rơi tự do từ độ cao 20 m, thì vận tốc của vật khi chạm đất là",
    "re": "14 m/s"
  },
  {
    "con": "Nếu một lực 50 N tác dụng lên một vật có khối lượng 5 kg, thì gia tốc của vật là",
    "re": "10 m/s²"
  },
  {
    "con": "Nếu một chiếc xe chuyển động với vận tốc 20 m/s và dừng lại trong 5 giây, thì gia tốc của xe là",
    "re": "-4 m/s²"
  },
  {
    "con": "Nếu một lò xo có độ cứng k = 200 N/m bị nén 0,1 m, thì năng lượng tiềm năng đàn hồi trong lò xo là",
    "re": "1 J"
  },
  {
    "con": "Nếu một vật có khối lượng 2 kg di chuyển với vận tốc 3 m/s, thì động năng của vật là",
    "re": "9 J"
  },
  {
    "con": "Nếu một vật được kéo lên cao 5 m với lực 100 N, thì công thực hiện là",
    "re": "500 J"
  },
  {
    "con": "Nếu một sóng âm có tần số 440 Hz, thì chu kỳ của sóng âm đó là",
    "re": "0,00227 s"
  },
  {
    "con": "Nếu một điện trở có giá trị 10 Ω và dòng điện chạy qua nó là 2 A, thì điện áp trên điện trở là",
    "re": "20 V"
  },
  {
    "con": "Nếu một vật có khối lượng 1 kg được nâng lên cao 10 m, thì trọng lực tác dụng lên vật là",
    "re": "10 N"
  },
  {
    "con": "Để chuẩn bị bay trên các con tàu vũ trụ, các nhà du hành phải luyện tập trên máy quay li tâm. Giả sử ghế ngồi ở cách tâm của máy quay một khoảng 5 m và nhà du hành chịu một gia tốc hướng tâm bằng 7 lần gia tốc trong trường g. Lấy g=9,8 \\frac{m}{s^2}. Tốc độ dài của nhà du hành là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật rơi tự do từ độ cao h, thì thời gian rơi của vật đó được tính bằng công thức t = \\sqrt{\\frac{2h}{g}} với g là gia tốc trọng trường.",
    "re": "Thời gian rơi t sẽ tăng khi độ cao h tăng."
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng m, thì gia tốc a của vật đó được tính bằng công thức F = ma, với F là lực tác dụng.",
    "re": "Gia tốc a sẽ tăng khi lực F tăng hoặc khối lượng m giảm."
  },
  {
    "con": "Khi một vật chuyển động tròn đều với bán kính r và tốc độ v, thì gia tốc hướng tâm a_c được tính bằng công thức a_c = \\frac{v^2}{r}.",
    "re": "Gia tốc hướng tâm a_c sẽ tăng khi tốc độ v tăng."
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác, thì tổng động năng của hệ trước và sau va chạm sẽ được bảo toàn.",
    "re": "Động năng của hệ sẽ không thay đổi trong va chạm đàn hồi."
  },
  {
    "con": "Khi một vật được kéo lên cao với một lực F, thì công thực hiện bởi lực F được tính bằng W = F \\cdot d \\cdot cos(\\theta), với d là khoảng cách và \\theta là góc giữa lực và hướng di chuyển.",
    "re": "Công W sẽ tăng khi khoảng cách d tăng hoặc lực F tăng."
  },
  {
    "con": "Khi một sóng âm truyền qua không khí, thì tốc độ của sóng âm v phụ thuộc vào nhiệt độ của không khí.",
    "re": "Tốc độ sóng âm v sẽ tăng khi nhiệt độ không khí tăng."
  },
  {
    "con": "Khi một vật có khối lượng m di chuyển với vận tốc v, thì động lượng p của vật đó được tính bằng công thức p = mv.",
    "re": "Động lượng p sẽ tăng khi khối lượng m hoặc vận tốc v tăng."
  },
  {
    "con": "Khi một vật chịu tác dụng của trọng lực và lực cản không khí, thì lực tổng hợp F_t sẽ được tính bằng F_t = mg - F_c, với F_c là lực cản.",
    "re": "Vật sẽ rơi chậm hơn khi lực cản F_c tăng."
  },
  {
    "con": "Khi một điện tích q di chuyển trong một điện trường E, thì lực điện F tác dụng lên điện tích đó được tính bằng công thức F = qE.",
    "re": "Lực điện F sẽ tăng khi điện tích q hoặc cường độ điện trường E tăng."
  },
  {
    "con": "Kết quả sai số tuyệt đối của một phép đo là 6,07. Số chữ số có nghĩa là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Lực tác dụng lên một vật có khối lượng 10 kg và gia tốc 2 m/s²",
    "re": "Lực là 20 N"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20 m",
    "re": "Thời gian rơi khoảng 2,02 giây"
  },
  {
    "con": "Năng lượng của một vật có khối lượng 5 kg chuyển động với vận tốc 10 m/s",
    "re": "Năng lượng động là 250 J"
  },
  {
    "con": "Một lò xo có độ cứng 200 N/m bị nén 0,1 m",
    "re": "Năng lượng tiềm năng đàn hồi là 1 J"
  },
  {
    "con": "Một vật có khối lượng 2 kg di chuyển với vận tốc 3 m/s va chạm hoàn toàn đàn hồi với một vật khác",
    "re": "Tổng động năng được bảo toàn"
  },
  {
    "con": "Một dòng điện có cường độ 5 A chạy qua một điện trở 10 Ω",
    "re": "Công suất tiêu thụ là 25 W"
  },
  {
    "con": "Một vật có khối lượng 1 kg được nâng lên cao 5 m",
    "re": "Công thực hiện là 50 J"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz",
    "re": "Bước sóng trong không khí khoảng 0,78 m"
  },
  {
    "con": "Một vật có khối lượng 3 kg quay quanh một trục với bán kính 2 m và vận tốc 4 m/s",
    "re": "Lực hướng tâm là 6 N"
  },
  {
    "con": "Người ta ném một vật từ mặt đất lên cao theo phương thẳng đứng với vận tốc 4,0 \\frac{m}{s}. Lấy 2 g 10 \\frac{m}{s} , thời gian để vật chuyển động đến độ cao cực đại là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc 20 \\frac{m}{s} trong 5 giây",
    "re": "Quãng đường vật đi được là 100 mét"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20 mét, lấy g = 10 \\frac{m}{s^2}",
    "re": "Thời gian để vật chạm đất là 2 giây"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 \\frac{N}{m} bị nén 0,1 mét",
    "re": "Lực tác dụng lên lò xo là 20 N"
  },
  {
    "con": "Một vật có khối lượng 2 kg chuyển động với vận tốc 3 \\frac{m}{s}",
    "re": "Động năng của vật là 9 J"
  },
  {
    "con": "Một vật có khối lượng 5 kg đứng yên trên mặt đất",
    "re": "Lực tác dụng lên vật do trọng lực là 50 N"
  },
  {
    "con": "Một dòng điện có cường độ 2 A chạy qua một điện trở 10 \\Omega",
    "re": "Điện áp trên điện trở là 20 V"
  },
  {
    "con": "Một vật có khối lượng 1 kg di chuyển với vận tốc 4 \\frac{m}{s} va chạm hoàn toàn đàn hồi với một vật khác có khối lượng 1 kg đứng yên",
    "re": "Sau va chạm, vật đầu tiên dừng lại và vật thứ hai di chuyển với vận tốc 4 \\frac{m}{s}"
  },
  {
    "con": "Một vật có khối lượng 3 kg được kéo lên cao với lực 30 N",
    "re": "Vật đang chịu một gia tốc 0 m/s² nếu lực kéo bằng trọng lực"
  },
  {
    "con": "Một sóng âm có tần số 440 Hz di chuyển trong không khí với tốc độ 340 \\frac{m}{s}",
    "re": "Chiều dài sóng là 0,773 m"
  },
  {
    "con": "Một vật có khối lượng m = 10 kg rơi tự do từ độ cao h = 20 m. Vận tốc của vật khi chạm đất là",
    "re": "v = 20 m/s"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén một đoạn x = 0,1 m. Lực đàn hồi của lò xo là",
    "re": "F = 20 N"
  },
  {
    "con": "Một vật có khối lượng m = 5 kg chuyển động với vận tốc v = 10 m/s. Động năng của vật là",
    "re": "KE = 250 J"
  },
  {
    "con": "Một vật có khối lượng m = 2 kg được kéo lên cao với lực F = 20 N. Công thực hiện để nâng vật lên cao h = 5 m là",
    "re": "W = 100 J"
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính r = 2 m và vận tốc v = 4 m/s. Gia tốc hướng tâm của vật là",
    "re": "a_c = 8 m/s²"
  },
  {
    "con": "Một vật có khối lượng m = 3 kg nằm trên mặt phẳng nghiêng với góc nghiêng \theta = 30°. Lực kéo vật xuống mặt phẳng là",
    "re": "F = 14,7 N"
  },
  {
    "con": "Một sóng âm có tần số f = 440 Hz và vận tốc âm thanh v = 340 m/s. Độ dài sóng của âm là",
    "re": "λ = 0,773 m"
  },
  {
    "con": "Một điện trở có giá trị R = 10 Ω và dòng điện chạy qua là I = 2 A. Điện áp trên điện trở là",
    "re": "U = 20 V"
  },
  {
    "con": "Một vật có khối lượng m = 1 kg và vận tốc v = 5 m/s va chạm với một vật khác đứng yên. Nếu va chạm hoàn toàn đàn hồi, vật thứ hai sẽ có vận tốc là",
    "re": "v' = 5 m/s"
  },
  {
    "con": "Một vật có khối lượng m = 4 kg được treo vào một lò xo. Nếu lò xo có độ cứng k = 100 N/m, độ biến dạng của lò xo khi vật treo là",
    "re": "x = 0,4 m"
  },
  {
    "con": "Xác định vị trí trọng tâm của bản mỏng là đĩa tròn tâm O bán kính R, bản bị khoét một lỗ tròn bán kính \\frac{R}{2} như hình vẽ",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi",
    "re": "Quỹ đạo của vật là một đường thẳng"
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng m, và lực này không bị cân bằng",
    "re": "Vật sẽ có gia tốc theo hướng của lực tác dụng"
  },
  {
    "con": "Khi một vật rơi tự do trong môi trường không có lực cản",
    "re": "Vật sẽ tăng tốc với gia tốc khoảng 9.81 m/s²"
  },
  {
    "con": "Khi một lò xo bị nén hoặc kéo ra",
    "re": "Lực đàn hồi tác dụng lên lò xo sẽ tỉ lệ thuận với độ biến dạng của nó"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau",
    "re": "Ánh sáng sẽ bị khúc xạ tại bề mặt phân cách giữa hai môi trường"
  },
  {
    "con": "Khi một điện tích q được đặt trong một điện trường E",
    "re": "Điện tích sẽ chịu tác dụng của một lực điện F = qE"
  },
  {
    "con": "Khi một vật quay quanh một trục với vận tốc góc không đổi",
    "re": "Lực hướng tâm tác dụng lên vật sẽ giữ cho vật chuyển động theo quỹ đạo tròn"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên",
    "re": "Thể tích của chất khí sẽ tăng nếu áp suất không đổi"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí",
    "re": "Tần số của sóng âm sẽ quyết định cao độ của âm thanh mà ta nghe được"
  },
  {
    "con": "Một đĩa tròn nhỏ bán kính R lăn không trượt ở vành ngoài của đĩa tròn lớn bán kính 2R trong mặt phẳng chứa hai đĩa, đĩa lớn nằm cố định. Thời gian lăn hết một vòng quanh tâm đĩa lớn là T. Tốc độ góc của đĩa nhỏ là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h trong không khí không có lực cản, thời gian rơi là t",
    "re": "Vận tốc của vật khi chạm đất là v = g * t, với g là gia tốc trọng trường"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo dài một khoảng x",
    "re": "Lực phục hồi của lò xo là F = -k * x"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v trên mặt phẳng ngang không có ma sát",
    "re": "Động lượng của vật là p = m * v"
  },
  {
    "con": "Một điện trở R được nối với nguồn điện có hiệu điện thế U",
    "re": "Dòng điện chạy qua điện trở là I = U / R"
  },
  {
    "con": "Một sóng âm có tần số f và tốc độ truyền sóng v",
    "re": "Chiều dài sóng là λ = v / f"
  },
  {
    "con": "Một vật có khối lượng m được treo vào một lò xo và lò xo bị kéo dài một khoảng x",
    "re": "Lực kéo của lò xo bằng trọng lực của vật là k * x = m * g"
  },
  {
    "con": "Một vật chuyển động tròn đều với bán kính R và vận tốc góc ω",
    "re": "Gia tốc hướng tâm của vật là a = ω² * R"
  },
  {
    "con": "Một vật có khối lượng m va chạm đàn hồi với một vật khác có khối lượng M",
    "re": "Tổng động lượng trước va chạm bằng tổng động lượng sau va chạm"
  },
  {
    "con": "Một ánh sáng đi từ môi trường không khí vào môi trường nước với góc tới i",
    "re": "Góc khúc xạ r sẽ tuân theo định luật Snell: n1 * sin(i) = n2 * sin(r)"
  },
  {
    "con": "Để đẩy một thùng phi nặng có bán kính R = 30cm vượt qua một bậc thềm cao h <15cm. Người ta phải tác dụng vào thùng một lực F có phương ngang đi qua trục O của thùng và có độ lớn tối thiểu bằng trọng lực P của thùng.\nHãy xác định độ cao h của bậc thềm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một vật chuyển động thẳng đều, vận tốc của nó không thay đổi theo thời gian.",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Khi một vật rơi tự do, gia tốc của nó luôn bằng gia tốc trọng trường g.",
    "re": "Vật sẽ tăng tốc với gia tốc g = 9.81 m/s²"
  },
  {
    "con": "Nếu một vật chịu tác dụng của một lực không đổi trong một khoảng thời gian t, thì vận tốc của vật sẽ thay đổi theo công thức v = v0 + at.",
    "re": "Vận tốc cuối cùng v phụ thuộc vào vận tốc ban đầu v0 và gia tốc a"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác, tổng động năng của hệ trước và sau va chạm sẽ được bảo toàn.",
    "re": "Động năng không thay đổi trong va chạm đàn hồi"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động lượng của vật được tính bằng công thức p = mv.",
    "re": "Động lượng p tỷ lệ thuận với khối lượng và vận tốc"
  },
  {
    "con": "Khi một vật quay quanh một trục, lực hướng tâm cần thiết để giữ vật trong chuyển động quay tỷ lệ thuận với khối lượng và bình phương vận tốc của vật.",
    "re": "Lực hướng tâm Fh = mv²/r"
  },
  {
    "con": "Nếu một vật được nâng lên cao h, thì công thực hiện để nâng vật được tính bằng công thức W = mgh.",
    "re": "Công W tỷ lệ thuận với khối lượng m và độ cao h"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác, nếu góc tới lớn hơn góc giới hạn, ánh sáng sẽ bị phản xạ hoàn toàn.",
    "re": "Hiện tượng phản xạ toàn phần xảy ra"
  },
  {
    "con": "Nếu một sóng âm truyền qua không khí, thì tốc độ của sóng âm phụ thuộc vào nhiệt độ của không khí.",
    "re": "Tốc độ sóng âm tăng khi nhiệt độ không khí tăng"
  },
  {
    "con": "Đồ thị vận tốc của một chất điểm chuyển động dọc theo trục Ox được biểu diễn như trên hình, gia tốc của chất điểm trong khoảng thời gian từ 5 s tới 15 s là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc không đổi, quãng đường đi được trong khoảng thời gian t là",
    "re": "S = v * t"
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng m, gia tốc a của vật sẽ được tính bằng",
    "re": "F = m * a"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao h, thời gian rơi t sẽ được tính bằng",
    "re": "t = √(2h/g)"
  },
  {
    "con": "Khi một vật quay quanh một trục với vận tốc góc ω, tần số f của chuyển động sẽ được tính bằng",
    "re": "f = ω / (2π)"
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cân bằng, thì vật đó sẽ",
    "re": "không thay đổi vận tốc"
  },
  {
    "con": "Khi một sóng âm truyền trong không khí, tốc độ của sóng âm phụ thuộc vào",
    "re": "nhiệt độ của không khí"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v va chạm với một vật khác, động lượng trước va chạm sẽ bằng",
    "re": "động lượng sau va chạm nếu không có lực bên ngoài tác động"
  },
  {
    "con": "Khi một vật được ném lên cao, vận tốc của nó sẽ giảm dần cho đến khi đạt đến độ cao cực đại, tại đó",
    "re": "vận tốc bằng 0"
  },
  {
    "con": "Nếu một vật có năng lượng động học E_k, thì năng lượng động học được tính bằng công thức",
    "re": "E_k = 1/2 * m * v^2"
  },
  {
    "con": "Một vận động viên môn hốc cây (môn khúc côn cầu) dùng gậy gạt quả bóng để truyền cho nó một tốc độ đầu 10 \\frac{m}{s}. Hệ số ma sát trượt giữa quả bóng với mặt băng là 0,10. Lấy g = 9,8 \\frac{m}{s^2}. Quãng đường quả bóng đi được là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20m. Nếu không có lực cản không khí, thời gian vật rơi xuống đất là:",
    "re": "Câu trả lời đúng là khoảng 2,02 giây"
  },
  {
    "con": "Một chiếc xe ô tô di chuyển với vận tốc 60 km/h. Nếu xe tăng tốc đều với gia tốc 2 m/s², thời gian để xe đạt vận tốc 80 km/h là:",
    "re": "Câu trả lời đúng là 10 giây"
  },
  {
    "con": "Một quả bóng được ném thẳng lên với vận tốc đầu 15 m/s. Nếu lấy g = 9,8 m/s², chiều cao tối đa mà quả bóng đạt được là:",
    "re": "Câu trả lời đúng là khoảng 11,5 mét"
  },
  {
    "con": "Một vật có khối lượng 5 kg được treo trên một sợi dây. Nếu lực kéo của dây là 50 N, thì vật sẽ:",
    "re": "Câu trả lời đúng là sẽ không rơi xuống"
  },
  {
    "con": "Một lò xo có độ cứng k = 200 N/m bị nén 0,1 m. Nếu lò xo được thả ra, năng lượng tiềm năng của lò xo là:",
    "re": "Câu trả lời đúng là 1 J"
  },
  {
    "con": "Một chiếc xe tải có khối lượng 1000 kg di chuyển với vận tốc 20 m/s. Nếu xe dừng lại trong 5 giây, lực tác động lên xe là:",
    "re": "Câu trả lời đúng là 4000 N"
  },
  {
    "con": "Một vật có khối lượng 10 kg di chuyển với vận tốc 5 m/s. Nếu vật va chạm hoàn toàn đàn hồi với một vật khác có khối lượng 10 kg đang đứng yên, thì vận tốc của hai vật sau va chạm sẽ:",
    "re": "Câu trả lời đúng là 2,5 m/s cho cả hai vật"
  },
  {
    "con": "Một mạch điện có điện áp 12 V và điện trở 4 Ω. Nếu điện trở không thay đổi, thì cường độ dòng điện trong mạch là:",
    "re": "Câu trả lời đúng là 3 A"
  },
  {
    "con": "Một vật có khối lượng 2 kg di chuyển với vận tốc 10 m/s. Nếu vật va chạm với một vật khác có khối lượng 3 kg đang đứng yên và va chạm không đàn hồi, thì vận tốc của hệ sau va chạm là:",
    "re": "Câu trả lời đúng là 4 m/s"
  },
  {
    "con": "Tính khoảng cách giữa tâm vệ tinh địa tĩnh của Trái Đất với tâm Trái Đất. Biết khối lượng của Trái Đất là M= 6.10^24 kg. Chu kì quay của Trái Đất quanh trục của nó là 24 h. Hằng số hấp dẫn G = 6,67.10^-11 \\frac{Nm^2}{kg^2}",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h. Biết rằng gia tốc trọng trường g = 9,81 m/s². Nếu thời gian rơi là t thì khoảng cách rơi được tính bằng công thức h = 0,5 * g * t²",
    "re": "Khoảng cách rơi h được tính chính xác"
  },
  {
    "con": "Một vật có khối lượng m di chuyển với vận tốc v. Nếu lực tác dụng lên vật là F thì theo định luật II Newton, F = m * a, với a là gia tốc của vật",
    "re": "Gia tốc a được tính chính xác"
  },
  {
    "con": "Một lò xo có độ cứng k bị nén hoặc kéo một khoảng x. Nếu lực tác dụng lên lò xo là F thì theo định luật Hooke, F = -k * x",
    "re": "Lực F được tính chính xác"
  },
  {
    "con": "Một vật có khối lượng m di chuyển theo một đường tròn với bán kính r và vận tốc v. Nếu lực hướng tâm tác dụng lên vật là F thì F = m * (v²/r)",
    "re": "Lực hướng tâm F được tính chính xác"
  },
  {
    "con": "Một điện trở có điện trở R và dòng điện I chạy qua. Nếu hiệu điện thế U giữa hai đầu điện trở thì theo định luật Ohm, U = R * I",
    "re": "Hiệu điện thế U được tính chính xác"
  },
  {
    "con": "Một vật có khối lượng m được nâng lên cao h. Nếu trọng lực tác dụng lên vật là P = m * g, thì công thực hiện để nâng vật là A = P * h",
    "re": "Công A được tính chính xác"
  },
  {
    "con": "Một sóng có bước sóng λ và tần số f. Nếu vận tốc sóng là v thì theo công thức v = f * λ",
    "re": "Vận tốc sóng v được tính chính xác"
  },
  {
    "con": "Một vật có khối lượng m va chạm với một vật khác có khối lượng M. Nếu va chạm là hoàn toàn đàn hồi thì tổng động năng trước và sau va chạm được bảo toàn",
    "re": "Động năng được bảo toàn"
  },
  {
    "con": "Một vật có khối lượng m và vận tốc v va chạm với mặt đất. Nếu vật rơi từ độ cao h thì năng lượng thế năng tại độ cao h được tính bằng công thức E_p = m * g * h",
    "re": "Năng lượng thế năng E_p được tính chính xác"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h, nếu không có lực cản thì thời gian rơi t sẽ được tính bằng công thức t = \\sqrt{\\frac{2h}{g}} với g là gia tốc trọng trường.",
    "re": "Thời gian rơi t được xác định chính xác."
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v, thì động năng của vật đó được tính bằng công thức E_k = \\frac{1}{2}mv^2.",
    "re": "Động năng E_k được tính chính xác."
  },
  {
    "con": "Nếu một lực F tác dụng lên một vật có khối lượng m và gây ra gia tốc a, thì theo định luật Newton thứ hai, F = ma.",
    "re": "Lực F được xác định chính xác."
  },
  {
    "con": "Nếu một vật quay quanh một trục với vận tốc góc \\omega, thì năng lượng quay của vật được tính bằng công thức E_r = \\frac{1}{2}I\\omega^2, với I là mô men quán tính.",
    "re": "Năng lượng quay E_r được tính chính xác."
  },
  {
    "con": "Nếu một vật chịu tác dụng của hai lực cùng phương và cùng chiều, thì tổng lực tác dụng lên vật là tổng của hai lực đó.",
    "re": "Tổng lực được xác định chính xác."
  },
  {
    "con": "Nếu một vật chuyển động tròn đều với bán kính r và vận tốc v, thì gia tốc hướng tâm a_c được tính bằng công thức a_c = \\frac{v^2}{r}.",
    "re": "Gia tốc hướng tâm a_c được tính chính xác."
  },
  {
    "con": "Nếu một sóng âm có tần số f và vận tốc truyền trong không khí là v, thì bước sóng \\lambda được tính bằng công thức \\lambda = \\frac{v}{f}.",
    "re": "Bước sóng \\lambda được xác định chính xác."
  },
  {
    "con": "Nếu một vật có khối lượng m và được nâng lên độ cao h, thì công thực hiện để nâng vật đó được tính bằng công thức A = mgh.",
    "re": "Công A được tính chính xác."
  },
  {
    "con": "Nếu một vật va chạm đàn hồi với một vật khác, thì tổng động năng trước và sau va chạm được bảo toàn.",
    "re": "Động năng được bảo toàn trong va chạm đàn hồi."
  },
  {
    "con": "Từ một điểm ở độ cao h =18m so với mặt đất và cách tường nhà một khoảng L = 3 m, người ta ném một hòn sỏi theo phương nằm ngang với vận tốc ban đầu vo. Trên tường có một cửa sổ chiều cao a = 1 m, mép dưới của cửa cách mặt đất một khoảng b = 2 m. Hỏi giá trị của vo phải nằm trong giới hạn nào để hòn sỏi lọt qua cửa sổ? Bỏ qua bề dày tường, lấy g = 9,8 \\frac{m}{s^2}",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tốc kế của xe máy đang chỉ 41 \\frac{km}{h}. Giá trị này là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 1 kg và chịu tác dụng của lực 10 N. Vật này sẽ có gia tốc",
    "re": "10 m/s²"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 20 m. Thời gian rơi của vật này là",
    "re": "khoảng 2 s"
  },
  {
    "con": "Nếu một vật chuyển động thẳng đều với vận tốc 5 m/s, thì quãng đường đi được sau 10 giây là",
    "re": "50 m"
  },
  {
    "con": "Khi một vật bị nén trong lò xo, thì năng lượng tiềm năng đàn hồi của lò xo là",
    "re": "0,5 kx² (k là độ cứng của lò xo, x là độ biến dạng)"
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên, thì thể tích của chất khí sẽ",
    "re": "tăng lên (theo định luật Charles)"
  },
  {
    "con": "Khi một vật chuyển động tròn đều, thì gia tốc hướng tâm của vật này là",
    "re": "tỷ lệ thuận với bình phương vận tốc và tỷ lệ nghịch với bán kính"
  },
  {
    "con": "Nếu một dòng điện chạy qua một dây dẫn có điện trở R, thì công suất tiêu thụ của dây dẫn là",
    "re": "P = I²R (I là cường độ dòng điện)"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, thì ánh sáng sẽ",
    "re": "bị khúc xạ và đổi hướng"
  },
  {
    "con": "Nếu một vật có khối lượng 2 kg và vận tốc 3 m/s, thì động năng của vật này là",
    "re": "9 J"
  },
  {
    "con": "Một lò xo có chiều dài tự nhiên 10cm và có độ cứng 40 \\frac{N}{m}. Giữ cố định một đầu và tác dụng vào đầu kia một lực 1N để nén lò xo. Chiều dài của lò xo khi bị nén là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2kg và chịu tác dụng của lực 10N. Nếu không có lực cản, thì gia tốc của vật là:",
    "re": "5 \\frac{m}{s^2}"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu 20m/s. Nếu không có lực cản, thì chiều cao tối đa mà quả bóng đạt được là:",
    "re": "20m"
  },
  {
    "con": "Một vật rơi tự do từ độ cao 45m. Nếu không có lực cản, thì thời gian để vật chạm đất là:",
    "re": "3s"
  },
  {
    "con": "Một dòng điện có cường độ 2A chạy qua một điện trở 5Ω. Nếu điện áp được duy trì, thì công suất tiêu thụ của điện trở là:",
    "re": "20W"
  },
  {
    "con": "Một chiếc xe có khối lượng 1000kg di chuyển với vận tốc 15m/s. Nếu xe dừng lại trong 5 giây, thì lực phanh cần thiết là:",
    "re": "3000N"
  },
  {
    "con": "Một vật có khối lượng 3kg được treo vào một lò xo có độ cứng 60 \\frac{N}{m}. Nếu lò xo bị kéo dài, thì độ dài của lò xo khi vật ở trạng thái cân bằng là:",
    "re": "0.5m"
  },
  {
    "con": "Một sóng âm có tần số 440Hz. Nếu tốc độ âm thanh trong không khí là 340m/s, thì bước sóng của sóng âm là:",
    "re": "0.7727m"
  },
  {
    "con": "Một vật có khối lượng 5kg di chuyển với vận tốc 10m/s. Nếu vật va chạm hoàn toàn đàn hồi với một vật khác có khối lượng 5kg đứng yên, thì vận tốc của hai vật sau va chạm là:",
    "re": "5m/s cho mỗi vật"
  },
  {
    "con": "Câu \"Vụng chẻ, khỏe nêm\" nói về việc khi chẻ củi, với những khúc củi lớn người ta thường đặt cái nêm (là một miếng thép có tiết diện hình tam giác) cắm vào khúc củi sau đó lấy búa đập mạnh vào nêm. Khi gõ mạnh búa vào nêm thì củi dễ dàng bị bửa ra. Hiện tượng trên được giải thích là do có hiện tượng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi",
    "re": "thì lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Khi một vật rơi tự do từ độ cao nhất định",
    "re": "thì vật sẽ tăng tốc đều do trọng lực"
  },
  {
    "con": "Khi một lực tác dụng lên một vật có khối lượng lớn hơn",
    "re": "thì gia tốc của vật sẽ nhỏ hơn so với khi tác dụng lên vật có khối lượng nhỏ hơn"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên",
    "re": "thì thể tích của chất khí sẽ tăng nếu áp suất không đổi"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước",
    "re": "thì ánh sáng sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Khi một vật dao động với tần số cao",
    "re": "thì năng lượng của vật sẽ lớn hơn"
  },
  {
    "con": "Khi một nam châm được đưa lại gần một vật kim loại",
    "re": "thì vật kim loại có thể bị hút vào nam châm nếu nó là sắt, niken hoặc coban"
  },
  {
    "con": "Khi một điện tích dương và một điện tích âm lại gần nhau",
    "re": "thì chúng sẽ hút nhau"
  },
  {
    "con": "Khi một vật bị nén lại",
    "re": "thì nó sẽ có khả năng sinh ra lực đàn hồi khi được thả ra"
  },
  {
    "con": "Một vật chuyển động thẳng đều sẽ có vận tốc không đổi",
    "re": "quãng đường đi được tỉ lệ thuận với thời gian"
  },
  {
    "con": "Khi một lực tác động lên một vật có khối lượng, vật sẽ có gia tốc",
    "re": "tỉ lệ thuận với lực và tỉ lệ nghịch với khối lượng"
  },
  {
    "con": "Nếu một vật rơi tự do từ độ cao nhất định",
    "re": "thì nó sẽ đạt vận tốc lớn nhất khi chạm đất"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên",
    "re": "thì thể tích của chất khí sẽ tăng nếu áp suất không đổi"
  },
  {
    "con": "Nếu một vật chịu tác động của hai lực cùng phương và cùng chiều",
    "re": "thì tổng hợp lực sẽ là tổng của hai lực"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước",
    "re": "thì nó sẽ bị khúc xạ và đổi hướng"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác",
    "re": "thì nó sẽ có trọng lực lớn hơn vật đó"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn",
    "re": "thì nó sẽ tạo ra một từ trường xung quanh dây dẫn"
  },
  {
    "con": "Nếu một vật được ném lên cao",
    "re": "thì nó sẽ đạt đến độ cao cực đại trước khi rơi xuống"
  },
  {
    "con": "Khi một chất lỏng sôi",
    "re": "thì nhiệt độ của nó không tăng cho đến khi tất cả chất lỏng chuyển thành hơi"
  },
  {
    "con": "Khổng Thị Hằng, một cựu học sinh của trường Nguyễn Viết Xuân, đã rất xuất sắc trong vai trò là thủ môn đội tuyển bóng đá nữ tại Seagames 30. Theo em, các thủ môn có thể bắt \"dính\" bóng là do có",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tại những khúc cua, các tay đua phải thực hiện động tác kỹ thuật nghiêng xe để",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động với vận tốc không đổi sẽ",
    "re": "có gia tốc bằng 0"
  },
  {
    "con": "Khi lực tác dụng lên một vật tăng lên, gia tốc của vật sẽ",
    "re": "tăng lên nếu khối lượng không đổi"
  },
  {
    "con": "Khi một vật rơi tự do, tốc độ của nó sẽ",
    "re": "tăng lên theo thời gian do trọng lực"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn thì lực hấp dẫn giữa nó và một vật khác sẽ",
    "re": "lớn hơn"
  },
  {
    "con": "Khi một vật va chạm với một vật khác, tổng động lượng của hệ sẽ",
    "re": "được bảo toàn nếu không có lực bên ngoài tác động"
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên, thể tích của chất đó sẽ",
    "re": "tăng lên nếu áp suất không đổi"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước, nó sẽ",
    "re": "bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Nếu một vật dao động với tần số cao hơn, năng lượng của nó sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Khi một nam châm di chuyển gần một cuộn dây, điện áp trong cuộn dây sẽ",
    "re": "được tạo ra do hiện tượng cảm ứng điện từ"
  },
  {
    "con": "Lực ma sát trượt không phụ thuộc vào những yếu tố nào?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Vật nặng hơn sẽ chịu tác động của lực hấp dẫn lớn hơn?",
    "re": "Vật sẽ rơi nhanh hơn nếu không có lực cản"
  },
  {
    "con": "Năng lượng không thể tự sinh ra hay tự mất đi?",
    "re": "Năng lượng chỉ có thể chuyển đổi từ dạng này sang dạng khác"
  },
  {
    "con": "Nếu một vật chuyển động với vận tốc không đổi?",
    "re": "Lực tác động lên vật bằng 0"
  },
  {
    "con": "Khi nhiệt độ của một chất tăng lên?",
    "re": "Thể tích của chất khí sẽ tăng nếu áp suất không đổi"
  },
  {
    "con": "Nếu một vật bị tác động bởi lực không cân bằng?",
    "re": "Vật sẽ thay đổi vận tốc của mình"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước?",
    "re": "Ánh sáng sẽ bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác?",
    "re": "Vật đó sẽ có trọng lực lớn hơn nếu ở cùng một vị trí"
  },
  {
    "con": "Khi một vật dao động quanh vị trí cân bằng?",
    "re": "Nó sẽ có động năng và thế năng thay đổi liên tục"
  },
  {
    "con": "Nếu một dòng điện chạy qua một dây dẫn?",
    "re": "Dây dẫn sẽ sinh ra từ trường xung quanh"
  },
  {
    "con": "Một vật chuyển động có phương trình: x = 10 − 20t − 2t^2 \\frac{m}{s} , khi vật có tọa độ bằng  không, vận tốc nhận giá trị",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chịu tác dụng của lực không đổi, khi lực tác dụng lên vật lớn hơn lực cản, vật sẽ tăng tốc",
    "re": "Vật sẽ chuyển động với gia tốc dương"
  },
  {
    "con": "Khi một vật rơi tự do, nếu không có lực cản, thì gia tốc của vật sẽ bằng gia tốc trọng trường",
    "re": "Gia tốc là 9.81 m/s²"
  },
  {
    "con": "Nếu một vật có khối lượng m và vận tốc v, thì động năng của vật được tính bằng công thức: Ek = 0.5 * m * v^2",
    "re": "Động năng là một đại lượng dương"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác, nếu không có mất mát năng lượng, thì tổng động năng trước và sau va chạm sẽ bằng nhau",
    "re": "Động năng được bảo toàn"
  },
  {
    "con": "Nếu một vật quay quanh một trục với vận tốc góc không đổi, thì lực hướng tâm tác dụng lên vật sẽ tỉ lệ thuận với bình phương vận tốc",
    "re": "Lực hướng tâm là F = m * ω² * r"
  },
  {
    "con": "Khi một vật di chuyển theo quỹ đạo tròn, nếu bán kính quỹ đạo tăng lên, thì lực hướng tâm cần thiết để giữ vật trong quỹ đạo sẽ giảm",
    "re": "Lực hướng tâm tỉ lệ nghịch với bán kính"
  },
  {
    "con": "Nếu một vật được ném lên với vận tốc ban đầu v0, thì chiều cao tối đa mà vật đạt được sẽ phụ thuộc vào vận tốc ban đầu và góc ném",
    "re": "Chiều cao tối đa được tính bằng h = (v0² * sin²(θ)) / (2 * g)"
  },
  {
    "con": "Khi một sóng âm truyền qua không khí, nếu tần số sóng tăng, thì bước sóng sẽ giảm",
    "re": "Tần số và bước sóng tỉ lệ nghịch với nhau"
  },
  {
    "con": "Nếu một điện trở có điện áp U và dòng điện I chạy qua, thì công suất tiêu thụ của điện trở được tính bằng công thức: P = U * I",
    "re": "Công suất là đại lượng dương"
  },
  {
    "con": "Một giọt nước rơi tự do từ độ cao 10m xuống mặt đất, gia tốc rơi tự do g = 10 \\frac{m}{s^2} . Vận tốc của giọt nước khi chạm đất là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật có khối lượng 2 kg chịu tác dụng của lực 10 N, thì gia tốc của vật là",
    "re": "5 \\frac{m}{s^2}"
  },
  {
    "con": "Một lò xo bị nén với độ biến dạng 0.1 m, hệ số đàn hồi của lò xo là 200 N/m, thì lực đàn hồi của lò xo là",
    "re": "20 N"
  },
  {
    "con": "Một vật chuyển động thẳng đều với vận tốc 15 m/s trong 10 giây, thì quãng đường mà vật đi được là",
    "re": "150 m"
  },
  {
    "con": "Một quả bóng được ném lên với vận tốc ban đầu 20 m/s, thì độ cao tối đa mà quả bóng đạt được là",
    "re": "20 m"
  },
  {
    "con": "Một vật có khối lượng 5 kg rơi tự do, thì trọng lực tác dụng lên vật là",
    "re": "50 N"
  },
  {
    "con": "Một dòng điện có cường độ 2 A chạy qua một điện trở 5 Ω, thì điện áp trên điện trở là",
    "re": "10 V"
  },
  {
    "con": "Một vật có khối lượng 3 kg di chuyển với vận tốc 4 m/s, thì động năng của vật là",
    "re": "24 J"
  },
  {
    "con": "Một chiếc xe ô tô có khối lượng 1000 kg đang di chuyển với vận tốc 20 m/s, thì động lượng của xe là",
    "re": "20000 kg·m/s"
  },
  {
    "con": "Một vật chịu tác dụng của hai lực cân bằng, thì vật sẽ",
    "re": "không thay đổi vận tốc"
  },
  {
    "con": "Cặp “lực và phản lực” trong định luật III Niutơn:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều:",
    "re": "Lực tác dụng lên vật bằng 0"
  },
  {
    "con": "Năng lượng không thể tự sinh ra hoặc mất đi:",
    "re": "Tổng năng lượng trong một hệ kín luôn bảo toàn"
  },
  {
    "con": "Một vật rơi tự do trong trường hấp dẫn:",
    "re": "Chịu tác động của trọng lực mà không có lực cản"
  },
  {
    "con": "Khi nhiệt độ của một vật tăng lên:",
    "re": "Năng lượng động học của các phân tử trong vật tăng lên"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác:",
    "re": "Tổng động năng trước và sau va chạm được bảo toàn"
  },
  {
    "con": "Khi ánh sáng đi từ không khí vào nước:",
    "re": "Tia sáng bị khúc xạ và thay đổi hướng"
  },
  {
    "con": "Khi một vật quay quanh một trục:",
    "re": "Có lực hướng tâm tác dụng lên vật"
  },
  {
    "con": "Khi điện áp tăng trong một mạch điện:",
    "re": "Dòng điện trong mạch cũng sẽ tăng nếu điện trở không đổi"
  },
  {
    "con": "Khi một vật được nâng lên cao:",
    "re": "Năng lượng thế của vật tăng lên"
  },
  {
    "con": "Những vật chuyển động sau đây, vật nào được coi là chất điểm?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật chuyển động thẳng đều, vận tốc của nó không thay đổi",
    "re": "Vật đó có gia tốc bằng 0"
  },
  {
    "con": "Khi một lực tác dụng lên một vật, vật đó sẽ thay đổi vận tốc",
    "re": "Vật đó sẽ có gia tốc"
  },
  {
    "con": "Nếu một vật rơi tự do, không có lực cản từ không khí",
    "re": "Vật đó sẽ tăng tốc với gia tốc 9.81 m/s²"
  },
  {
    "con": "Khi một vật va chạm đàn hồi với một vật khác",
    "re": "Tổng động năng của hệ sẽ được bảo toàn"
  },
  {
    "con": "Nếu một vật có khối lượng lớn hơn vật khác và cả hai vật đều rơi tự do",
    "re": "Cả hai vật sẽ rơi xuống đất cùng một lúc"
  },
  {
    "con": "Khi một vật quay quanh một trục, lực hướng tâm tác dụng lên vật đó",
    "re": "Lực này giữ cho vật không bay ra ngoài"
  },
  {
    "con": "Nếu một vật được kéo lên cao, công thực hiện trên vật đó",
    "re": "Sẽ bằng trọng lực của vật nhân với độ cao"
  },
  {
    "con": "Khi một dòng điện chạy qua một dây dẫn, dây dẫn đó sẽ sinh ra từ trường",
    "re": "Từ trường này có thể tác động lên các vật khác"
  },
  {
    "con": "Nếu một vật có nhiệt độ cao hơn môi trường xung quanh",
    "re": "Nó sẽ truyền nhiệt cho môi trường cho đến khi cân bằng nhiệt độ"
  },
  {
    "con": "một vật đang chuyển động mà tất cả các lực tác dụng vào nó bỗng nhiên ngừng tác dụng",
    "re": "vật sẽ tiếp tục chuyển động theo hướng và vận tốc hiện tại"
  },
  {
    "con": "một vật chịu tác dụng của lực không đổi",
    "re": "vật sẽ có gia tốc không đổi theo hướng của lực"
  },
  {
    "con": "một vật có khối lượng lớn hơn một vật khác",
    "re": "vật có khối lượng lớn hơn sẽ có trọng lực lớn hơn"
  },
  {
    "con": "một vật rơi tự do trong môi trường không có không khí",
    "re": "vật sẽ rơi với gia tốc 9.81 m/s²"
  },
  {
    "con": "một lò xo bị nén hoặc kéo",
    "re": "lò xo sẽ tạo ra một lực phục hồi hướng về vị trí cân bằng"
  },
  {
    "con": "một vật chuyển động tròn đều",
    "re": "vật sẽ có gia tốc hướng tâm hướng về tâm của vòng tròn"
  },
  {
    "con": "một điện tích dương và một điện tích âm đặt gần nhau",
    "re": "chúng sẽ hút nhau"
  },
  {
    "con": "một sóng âm đi qua không khí",
    "re": "sóng sẽ truyền đi với tốc độ khoảng 343 m/s"
  },
  {
    "con": "một vật có nhiệt độ cao hơn môi trường xung quanh",
    "re": "vật sẽ tỏa nhiệt ra môi trường cho đến khi đạt cân bằng nhiệt"
  },
  {
    "con": "một vật va chạm đàn hồi với một vật khác",
    "re": "tổng động năng của hệ sẽ được bảo toàn"
  },
  {
    "con": "Xét chuyển động ném ngang của một chất điểm M có gốc tọa độ O tại vị trí ném và hệ trục tọa độ Oxy (Ox nằm ngang; Oy thẳng đứng) nằm trong mặt phẳng quỹ đạo của M. Gọi Mx là hình chiếu của M trên phương Ox. Chuyển động của Mx là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một vật rơi tự do từ độ cao h trong môi trường không có sức cản của không khí,",
    "re": "vận tốc của vật tăng theo thời gian với gia tốc g = 9.81 m/s²"
  },
  {
    "con": "Khi một lực F tác dụng lên một vật có khối lượng m,",
    "re": "vật sẽ có gia tốc a = F/m theo định luật II Newton"
  },
  {
    "con": "Trong một hệ thống kín, tổng động lượng của hệ thống sẽ",
    "re": "không thay đổi nếu không có lực bên ngoài tác dụng"
  },
  {
    "con": "Khi ánh sáng đi từ môi trường này sang môi trường khác có chỉ số khúc xạ khác nhau,",
    "re": "ánh sáng sẽ bị bẻ cong tại bề mặt phân cách giữa hai môi trường"
  },
  {
    "con": "Nếu một vật có khối lượng m di chuyển với vận tốc v và va chạm hoàn toàn đàn hồi với một vật khác,",
    "re": "thì tổng động năng của hai vật trước và sau va chạm sẽ được bảo toàn"
  },
  {
    "con": "Khi một vật quay quanh một trục với vận tốc góc ω,",
    "re": "thì lực hướng tâm tác dụng lên vật là F = mω²r"
  },
  {
    "con": "Nếu một sóng âm truyền trong không khí với tần số f,",
    "re": "thì bước sóng λ của sóng âm sẽ được tính bằng công thức λ = v/f, với v là tốc độ âm thanh trong không khí"
  },
  {
    "con": "Khi một điện tích q di chuyển trong một trường điện đều,",
    "re": "nó sẽ chịu tác dụng của một lực điện F = qE, với E là cường độ điện trường"
  },
  {
    "con": "Nếu một vật được treo bằng một dây và chịu tác dụng của trọng lực,",
    "re": "thì lực căng trong dây sẽ cân bằng với trọng lực của vật khi vật đứng yên"
  }
]