[
  {
    "con": "Cho 3,0 gam glyxin tác dụng với dung dịch HCl dư, cô cạn cẩn thận chung dịch sau phản ứng, thu được m gam muối khan. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một kim loại tác dụng với axit, sản phẩm tạo thành sẽ là muối và khí hidro",
    "re": "Đúng"
  },
  {
    "con": "Nếu nhiệt độ của một phản ứng hóa học tăng lên, thì tốc độ phản ứng thường sẽ tăng",
    "re": "Đúng"
  },
  {
    "con": "Khi hòa tan một chất rắn vào nước, nếu chất đó không tan, thì dung dịch sẽ không có sự thay đổi về nồng độ",
    "re": "Đúng"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là axit",
    "re": "Đúng"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện yếm khí, thì sản phẩm có thể khác với phản ứng xảy ra trong điều kiện có oxy",
    "re": "Đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C, thì chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng",
    "re": "Đúng"
  },
  {
    "con": "Khi một dung dịch muối được bay hơi, nếu không có phản ứng hóa học xảy ra, thì muối sẽ kết tinh lại",
    "re": "Đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì có thể xảy ra cả phản ứng tiến và phản ứng lùi",
    "re": "Đúng"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên, thì khả năng xảy ra phản ứng với chất khác cũng sẽ tăng",
    "re": "Đúng"
  },
  {
    "con": "Cho 12,6 gam $MgCO_{3}$ tác dụng hết với dung dịch HCl dư, thu được V lít khí $CO_{2}$. Giá trị của V là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học, tốc độ phản ứng sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7, dung dịch đó sẽ",
    "re": "có tính axit"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước, thì chất đó sẽ",
    "re": "dễ dàng hòa tan trong dung môi nước"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện áp suất cao, thì sản phẩm khí sẽ",
    "re": "có thể bị nén lại"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit, thì sản phẩm thu được sẽ",
    "re": "là muối và khí hydro"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên, thì tốc độ phản ứng sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C, thì chất đó sẽ",
    "re": "có thể tồn tại ở trạng thái khí ở nhiệt độ phòng"
  },
  {
    "con": "Khi một dung dịch có nồng độ ion OH- cao, thì dung dịch đó sẽ",
    "re": "có tính kiềm"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì có thể xảy ra",
    "re": "cả phản ứng tiến và phản ứng ngược"
  },
  {
    "con": "Thủy phân hoàn toàn m gam tinh bột thành glucozơ. Cho toàn bộ glucozơ tham gia phản ứng tráng bạc (hiệu suất 100%), thu được 30,24 gam Ag. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi đốt cháy hoàn toàn 1 mol metan (CH4) trong không khí, sản phẩm thu được là CO2 và H2O. Số mol CO2 tạo thành là",
    "re": "1 mol"
  },
  {
    "con": "Nếu một dung dịch chứa 0,1 mol/l NaCl, thì nồng độ ion Na+ trong dung dịch là",
    "re": "0,1 mol/l"
  },
  {
    "con": "Khi hòa tan 58,5 gam NaCl vào 1 lít nước, thì nồng độ mol của dung dịch NaCl là",
    "re": "1 mol/l"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra theo phương trình: A + B → C, với hiệu suất phản ứng là 80%, thì lượng sản phẩm C thu được sẽ là",
    "re": "80% lượng lý thuyết"
  },
  {
    "con": "Khi cho 2 mol H2 phản ứng với 1 mol O2, sản phẩm thu được là nước. Số mol nước tạo thành là",
    "re": "2 mol"
  },
  {
    "con": "Nếu một chất rắn tan hoàn toàn trong nước tạo thành dung dịch, thì chất đó được gọi là",
    "re": "chất tan"
  },
  {
    "con": "Khi nhiệt độ tăng, nếu áp suất không đổi, thì thể tích khí sẽ",
    "re": "tăng theo định luật Charles"
  },
  {
    "con": "Nếu pH của dung dịch axit là 3, thì nồng độ ion H+ trong dung dịch là",
    "re": "0,001 mol/l"
  },
  {
    "con": "Khi cho 1 mol axit clohidric (HCl) phản ứng với 1 mol natri hidroxit (NaOH), sản phẩm thu được là",
    "re": "1 mol natri clorua (NaCl) và 1 mol nước (H2O)"
  },
  {
    "con": "Nước có công thức hóa học là H2O",
    "re": "Nước là một hợp chất hóa học"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số nguyên tử tăng dần",
    "re": "Bảng tuần hoàn phản ánh tính chất hóa học của các nguyên tố"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng",
    "re": "Nhiệt độ ảnh hưởng đến năng lượng va chạm giữa các phân tử"
  },
  {
    "con": "Một dung dịch có pH < 7",
    "re": "Dung dịch đó là axit"
  },
  {
    "con": "Khi một nguyên tố mất electron, nó trở thành ion dương",
    "re": "Ion dương có điện tích dương"
  },
  {
    "con": "Phản ứng hóa học có thể xảy ra khi các chất phản ứng tiếp xúc với nhau",
    "re": "Phản ứng hóa học tạo ra sản phẩm mới"
  },
  {
    "con": "Khi một hợp chất ion tan trong nước, nó phân ly thành các ion",
    "re": "Dung dịch đó dẫn điện"
  },
  {
    "con": "Khi một chất tham gia phản ứng oxi hóa, nó mất electron",
    "re": "Chất đó bị oxi hóa"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng",
    "re": "Tốc độ phản ứng có thể tăng lên"
  },
  {
    "con": "Khi một phản ứng hóa học đạt đến trạng thái cân bằng",
    "re": "Tốc độ phản ứng thuận và phản ứng nghịch bằng nhau"
  },
  {
    "con": "Chất nào sau đây bị thủy phân khi đun nóng trong môi trường axit?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn nước,",
    "re": "thì chất đó có khả năng tạo liên kết hydro mạnh hơn nước."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kiềm,",
    "re": "thì sản phẩm của phản ứng có thể là muối và nước."
  },
  {
    "con": "Nếu nồng độ của dung dịch axit tăng,",
    "re": "thì độ pH của dung dịch sẽ giảm."
  },
  {
    "con": "Nếu một kim loại phản ứng với axit,",
    "re": "thì sản phẩm tạo ra sẽ là muối và khí hidro."
  },
  {
    "con": "Nếu nhiệt độ của một phản ứng hóa học tăng,",
    "re": "thì tốc độ phản ứng thường sẽ tăng theo."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử đối xứng,",
    "re": "thì chất đó có thể không có tính chiral."
  },
  {
    "con": "Nếu một dung dịch có pH = 7,",
    "re": "thì dung dịch đó được coi là trung tính."
  },
  {
    "con": "Nếu một chất có tính oxi hóa mạnh,",
    "re": "thì nó có khả năng nhận electron từ chất khác."
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch,",
    "re": "thì sản phẩm có thể chuyển đổi trở lại thành phản ứng ban đầu."
  },
  {
    "con": "Hòa tan hết m gam Al trong dung dịch HCl dư, thu được 0,21 mol khí $H_{2}$. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nung 1 mol CaCO3 đến nhiệt độ cao, thu được 1 mol CaO và 1 mol CO2.",
    "re": "Phản ứng phân hủy xảy ra"
  },
  {
    "con": "Hòa tan 58,5 gam NaCl vào 1 lít nước, nồng độ mol của dung dịch NaCl là",
    "re": "1 mol/lít"
  },
  {
    "con": "Khi cho 2 mol H2 phản ứng với 1 mol O2, sản phẩm thu được là",
    "re": "2 mol H2O"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7, dung dịch đó sẽ",
    "re": "trở thành dung dịch axit"
  },
  {
    "con": "Khi cho 1 mol khí lý tưởng vào một bình chứa có thể thay đổi thể tích ở nhiệt độ không đổi, áp suất của khí sẽ",
    "re": "tăng lên khi thể tích giảm"
  },
  {
    "con": "Khi phản ứng giữa axit và bazơ xảy ra, sản phẩm thu được sẽ là",
    "re": "muối và nước"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước, chất đó sẽ",
    "re": "được coi là chất tan tốt"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Khi một chất có điện tích dương, nó sẽ",
    "re": "thu hút các ion âm"
  },
  {
    "con": "Este X có công thức phân tử $C_{4}H_{8}O_{2}$. Thủy phân X trong dung dịch $H_{2}SO_{4}$ loãng, đun nóng, thu được sản phẩm gồm axit propionic và chất hữu cơ. Công thức của Y là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi cho khí CO2 vào dung dịch nước vôi trong, nếu có kết tủa xuất hiện thì",
    "re": "Dung dịch đã chứa ion Ca2+"
  },
  {
    "con": "Nếu một hợp chất hữu cơ có công thức phân tử $C_{n}H_{2n+2}$ thì",
    "re": "Hợp chất đó là ankan"
  },
  {
    "con": "Khi đun nóng dung dịch NaOH với hợp chất hữu cơ chứa nhóm chức -OH, nếu có khí thoát ra thì",
    "re": "Hợp chất đó là ancol"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra với sự tham gia của chất xúc tác thì",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Khi cho dung dịch HCl vào dung dịch NaOH, nếu có hiện tượng tỏa nhiệt thì",
    "re": "Phản ứng trung hòa đã xảy ra"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit tạo ra khí H2 thì",
    "re": "Kim loại đó nằm trong dãy hoạt động hóa học"
  },
  {
    "con": "Khi cho dung dịch AgNO3 vào dung dịch NaCl, nếu có kết tủa trắng xuất hiện thì",
    "re": "Dung dịch đã chứa ion Cl-"
  },
  {
    "con": "Nếu một hợp chất có công thức phân tử $C_{n}H_{2n-2}$ thì",
    "re": "Hợp chất đó là anken"
  },
  {
    "con": "Khi đun nóng một este với dung dịch NaOH, nếu có sản phẩm là ancol và muối thì",
    "re": "Phản ứng thủy phân este đã xảy ra"
  },
  {
    "con": "$Cho Fe(OH) _{3}$ phản ứng với dung dịch $H_{2}SO_{4}$ loãng dư, tạo ra muối nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức phân tử $C_{6}H_{12}O_{6}$ thì hợp chất đó là glucose.",
    "re": "Hợp chất đó là một monosaccharide"
  },
  {
    "con": "Nếu một dung dịch có pH < 7 thì dung dịch đó là axit.",
    "re": "Dung dịch đó có tính axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra mà có sự thay đổi màu sắc, thì có thể có sự hình thành sản phẩm mới.",
    "re": "Có sự hình thành sản phẩm mới"
  },
  {
    "con": "Nếu nhiệt độ của một phản ứng hóa học tăng lên, thì tốc độ phản ứng thường sẽ tăng.",
    "re": "Tốc độ phản ứng sẽ tăng"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit, thì sẽ tạo ra khí hydro.",
    "re": "Khí hydro được sinh ra"
  },
  {
    "con": "Nếu một dung dịch chứa ion $Na^+$ và $Cl^-$, thì dung dịch đó có thể là $NaCl$.",
    "re": "Dung dịch đó có thể là muối ăn"
  },
  {
    "con": "Nếu một hợp chất có liên kết ion, thì nó thường có điểm nóng chảy cao.",
    "re": "Điểm nóng chảy cao"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì nó sẽ giải phóng năng lượng.",
    "re": "Giải phóng năng lượng"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước, thì nó có thể là một chất điện ly.",
    "re": "Chất đó có thể là chất điện ly"
  },
  {
    "con": "Nung nóng một lượng butan trong bình kín (với xúc tác thích hợp), thu được 0,02 mol hỗn hợp X gồm $H_{2}$ và các hiđrocacbon mạch hở ($CH_{4}$, $C_{2}H_{4}$, $C_{2}H_{6}$, $C_{3}H_{6}$, $C_{4}H_{8}$, $C_{4}H_{10}$). Cho toàn bộ X vào bình chứa dung dịch $Br_{2}$ dư thì có tối đa a mol $Br_{2}$ phản ứng, khối lượng bình tăng 15,54 gam và thoát ra hỗn hợp khí Y. Đốt cháy hoàn toàn Y cần vừa đủ 0,74 mol $O_{2}$, thu được $CO_{2}$ và $H_{2}O$. Giá trị của a là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hòa tan 1 mol NaCl vào 1 lít nước, thì nồng độ dung dịch NaCl là 1 mol/lít"
  },
  {
    "con": "Khi đun nóng một lượng axit sulfuric đặc, thì axit này sẽ mất nước và tạo thành oleum"
  },
  {
    "con": "Nếu cho một lượng đồng (II) oxit vào dung dịch axit hydrochloric, thì sẽ thu được dung dịch đồng (II) clorua"
  },
  {
    "con": "Khi cho khí CO vào dung dịch nước brom, thì khí CO sẽ không phản ứng với nước brom"
  },
  {
    "con": "Nếu cho một lượng axit acetic vào dung dịch natri hydroxit, thì sẽ xảy ra phản ứng trung hòa tạo ra natri acetate và nước"
  },
  {
    "con": "Khi đốt cháy hoàn toàn 1 mol metan trong không khí, thì sẽ thu được 1 mol CO2 và 2 mol H2O"
  },
  {
    "con": "Nếu cho một lượng bột sắt vào dung dịch axit sulfuric loãng, thì sẽ thu được khí hydro và dung dịch sắt (II) sulfate"
  },
  {
    "con": "Khi hòa tan 1 mol glucose vào 1 lít nước, thì nồng độ dung dịch glucose là 1 mol/lít"
  },
  {
    "con": "Nếu cho một lượng bột nhôm vào dung dịch axit clohidric, thì sẽ thu được khí hydro và dung dịch nhôm clorua"
  },
  {
    "con": "Cho sơ đồ chuyển hóa: NaOH\\xrightarrow{+X}Z\\xrightarrow{+Y}NaOH\\xrightarrow{+X}E\\xrightarrow{+Y}$CaCO_{3}$\nBiết: X, Y, Z, E là các hợp chất khác nhau và khác $CaCO_{3}$; mỗi mũi tên ứng với một phương trình hóa học của phản ứng giữa hai chất tương ứng. Các chất X, Y thỏa mãn sơ đồ trên lần lượt là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O thì nó là nước",
    "re": "H2O là nước"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra giữa axit và bazơ thì sản phẩm tạo ra sẽ là muối và nước",
    "re": "Sản phẩm là muối và nước"
  },
  {
    "con": "Nếu nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng thường tăng lên",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Nếu một chất có độ pH nhỏ hơn 7 thì chất đó được coi là axit",
    "re": "Chất đó là axit"
  },
  {
    "con": "Nếu một chất có độ pH lớn hơn 7 thì chất đó được coi là bazơ",
    "re": "Chất đó là bazơ"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt thì nó sẽ giải phóng năng lượng",
    "re": "Giải phóng năng lượng"
  },
  {
    "con": "Nếu một chất có khối lượng mol lớn hơn một chất khác thì nó sẽ nặng hơn khi so sánh cùng một số mol",
    "re": "Chất đó nặng hơn"
  },
  {
    "con": "Nếu một dung dịch có nồng độ molarity cao hơn thì nó chứa nhiều mol chất tan hơn trong cùng một thể tích",
    "re": "Chứa nhiều mol chất tan hơn"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng thuận nghịch thì nó có thể xảy ra theo cả hai chiều",
    "re": "Có thể xảy ra theo cả hai chiều"
  },
  {
    "con": "Hỗn hợp E gồm axit oleic, axit panmitic và triglixerit X (tỉ lệ mol tương ứng là 3 : 2 : 1). Đốt cháy hoàn toàn m gam E cần vừa đủ 4,0 mol $O_{2}$, thu được CO2 và $H_{2}O$. Mặt khác, cho m gam E tác dụng hết với lượng dư dung dịch NaOH đun nóng, thu được sản phẩm hữu cơ gồm glixerol và 47,08 gam hỗn hợp hai muối. Phần trăm khối lượng của X trong E là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch chứa NaCl và được điện phân, thì sản phẩm thu được ở cực dương là khí clo.",
    "re": "Khí clo được sinh ra"
  },
  {
    "con": "Nếu một hợp chất hữu cơ có công thức phân tử CnH2n+2, thì hợp chất đó là ankan.",
    "re": "Hợp chất đó là ankan"
  },
  {
    "con": "Nếu nhiệt độ của một phản ứng hóa học tăng lên, thì tốc độ phản ứng thường sẽ tăng.",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Nếu pH của dung dịch giảm xuống dưới 7, thì dung dịch đó trở thành axit.",
    "re": "Dung dịch trở thành axit"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit, thì sản phẩm thu được sẽ là muối và khí hidro.",
    "re": "Sản phẩm là muối và khí hidro"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao hơn, thì khả năng dẫn điện của dung dịch đó cũng cao hơn.",
    "re": "Khả năng dẫn điện cao hơn"
  },
  {
    "con": "Nếu một chất rắn tan trong nước tạo thành dung dịch, thì chất đó được gọi là chất tan.",
    "re": "Chất đó là chất tan"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện không có không khí, thì sản phẩm thu được có thể khác so với phản ứng xảy ra có không khí.",
    "re": "Sản phẩm có thể khác nhau"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C, thì chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng.",
    "re": "Chất có thể tồn tại ở trạng thái khí"
  },
  {
    "con": "Hỗn hợp E gồm hai amin X ($C_{n}H_{m}N$), Y ($C_{n}H_{m+1}N_{2}$, với n \\geq 2) và hai anken đồng đẳng kế tiếp. Đốt cháy hoàn toàn 0,08 mol E, thu được 0,03 mol $N_{2}$, 0,22 mol $CO_{2}$ và 0,30 mol $H_{2}O$. Phần trăm khối lượng của X trong E là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một axit mạnh như HCl được hòa tan trong nước, nồng độ ion H+ trong dung dịch sẽ tăng lên",
    "re": "pH của dung dịch sẽ giảm"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng sẽ thường tăng lên",
    "re": "do năng lượng hoạt hóa được cung cấp nhiều hơn"
  },
  {
    "con": "Khi một muối được hòa tan trong nước, nếu muối đó là muối tan tốt, thì dung dịch sẽ dẫn điện",
    "re": "do sự hiện diện của các ion tự do"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C, thì chất đó có thể bay hơi ở nhiệt độ phòng",
    "re": "và có thể được coi là chất dễ bay hơi"
  },
  {
    "con": "Khi một kim loại phản ứng với axit, thì sản phẩm của phản ứng thường là muối và khí hydro",
    "re": "nếu kim loại đó nằm trên dãy hoạt động hóa học"
  },
  {
    "con": "Nếu dung dịch có nồng độ ion OH- cao, thì dung dịch đó sẽ có tính kiềm",
    "re": "và pH của dung dịch sẽ lớn hơn 7"
  },
  {
    "con": "Khi một chất rắn được nung nóng và chuyển thành khí mà không qua trạng thái lỏng, thì quá trình này gọi là thăng hoa",
    "re": "và thường xảy ra với các chất như băng khô"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì có thể xảy ra cả phản ứng tiến và phản ứng lùi",
    "re": "và trạng thái cân bằng sẽ đạt được"
  },
  {
    "con": "Khi một dung dịch có nồng độ axit yếu được pha loãng, thì pH của dung dịch sẽ tăng lên",
    "re": "do nồng độ ion H+ giảm"
  },
  {
    "con": "Tiến hành thí nghiệm theo các bước sau:\nBước 1: Cho 5 giọt dung dịch $CuSO_{4}$ 0,5% vào ống nghiệm sạch\nBước 2: Thêm 1 ml dung dịch NaOH 10% vào ống nghiệm, lắc đều; gạn phần dung dịch, giữ lại kết tủa\nBước 3: Thêm tiếp 2 ml dung dịch glucozơ 1% vào ống nghiệm, lắc đều\nPhát biểu nào sau đây sai?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ của một phản ứng hóa học tăng lên",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Thêm một chất xúc tác vào phản ứng",
    "re": "Thời gian phản ứng sẽ giảm mà không làm thay đổi sản phẩm"
  },
  {
    "con": "Khi nồng độ của một chất phản ứng tăng lên",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Khi pH của dung dịch axit giảm",
    "re": "Tính axit của dung dịch sẽ tăng lên"
  },
  {
    "con": "Khi một kim loại phản ứng với axit",
    "re": "Sẽ tạo ra khí hidro và muối"
  },
  {
    "con": "Khi một dung dịch bão hòa được làm nguội",
    "re": "Có thể xuất hiện kết tinh"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong môi trường kín",
    "re": "Khối lượng tổng thể sẽ không thay đổi"
  },
  {
    "con": "Khi một chất điện phân được hòa tan trong nước",
    "re": "Nó sẽ phân ly thành các ion"
  },
  {
    "con": "Khi một phản ứng oxi hóa xảy ra",
    "re": "Một chất sẽ mất electron"
  },
  {
    "con": "Cho hỗn hợp X gồm a mol Fe và 0,25 mol Mg vào dung dịch Y chứa $Cu(NO_{3})$ _{2} và $AgNO_{3}$ (tỉ lệ mol tương ứng 1 : 2). Sau khi các phản ứng kết thúc, thu được dung dịch Z và 61,6 gam chất rắn T gồm ba kim loại. Hòa tan toàn bộ T trong lượng dư dung dịch $H_{2}SO_{4}$ đặc nóng, thu được 0,55 mol $SO_{2}$ (sản phẩm khử duy nhất của H_{2}SO_{4}). Giá trị của a là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 1 mol NaCl vào 1 lít nước, nồng độ ion Na+ và Cl- trong dung dịch sẽ là",
    "re": "1 mol/lít"
  },
  {
    "con": "Nếu cho 2 mol H2 và 1 mol O2 vào bình kín và đun nóng, thì sản phẩm phản ứng sẽ là",
    "re": "2 mol H2O"
  },
  {
    "con": "Khi đun nóng 1 mol CaCO3, nếu không có khí CO2 thoát ra, thì sản phẩm thu được sẽ là",
    "re": "CaO"
  },
  {
    "con": "Nếu cho 0,5 mol HCl vào 0,5 mol NaOH, thì dung dịch thu được sẽ có pH là",
    "re": "7"
  },
  {
    "con": "Khi cho 1 mol Mg vào dung dịch HCl dư, thì lượng H2 sinh ra sẽ là",
    "re": "1 mol"
  },
  {
    "con": "Nếu cho 1 mol Fe vào dung dịch $Cu(NO_3)_2$, thì lượng Cu thu được sẽ là",
    "re": "0,5 mol"
  },
  {
    "con": "Khi hòa tan 1 mol KOH vào nước, thì nhiệt độ của dung dịch sẽ",
    "re": "tăng lên do phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu cho 1 mol NH3 vào 1 mol HCl, thì sản phẩm thu được sẽ là",
    "re": "1 mol NH4Cl"
  },
  {
    "con": "Khi cho 1 mol H2 vào 1 mol Cl2 và chiếu sáng, thì sản phẩm thu được sẽ là",
    "re": "2 mol HCl"
  },
  {
    "con": "Hỗn hợp T gồm ba este mạch hở X (đơn chức), Y (hai chức), Z (ba chức), đều được tạo thành từ axit cacboxylic và ancol. Đốt cháy hoàn toàn m gam T, thu được $H_{2}O$ và 2,0 mol $CO_{2}$. Xà phòng hóa hoàn toàn m gam T bằng dung dịch NaOH vừa đủ, thu được hỗn hợp E gồm hai ancol (có cùng số nguyên tử cacbon trong phân tử) và 53,95 gam hỗn hợp muối F. Cho E tác dụng hết với kim loại Na dư, thu được 0,4 mol $H_{2}$. Đốt cháy toàn bộ F, thu được H2O, $Na_{2}CO_{3}$ và 0,4 mol $CO_{2}$. Khối lượng của Y trong m gam T là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch chứa ion Ag+ được thêm vào dung dịch chứa ion Cl-, thì sẽ xảy ra phản ứng tạo thành kết tủa AgCl.",
    "re": "Kết tủa AgCl sẽ xuất hiện."
  },
  {
    "con": "Nếu một chất có nhiệt độ nóng chảy thấp hơn nhiệt độ phòng, thì chất đó sẽ tồn tại ở trạng thái lỏng tại nhiệt độ phòng.",
    "re": "Chất đó sẽ ở trạng thái lỏng."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng sẽ tăng lên.",
    "re": "Tốc độ phản ứng sẽ tăng."
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là axit.",
    "re": "Dung dịch đó là axit."
  },
  {
    "con": "Nếu một hợp chất có công thức phân tử CnH2n+2, thì hợp chất đó là ankan.",
    "re": "Hợp chất đó là ankan."
  },
  {
    "con": "Nếu một kim loại phản ứng với axit tạo ra khí H2, thì kim loại đó phải là kim loại hoạt động hơn H.",
    "re": "Kim loại đó hoạt động hơn H."
  },
  {
    "con": "Nếu một dung dịch chứa ion OH- được thêm vào dung dịch chứa ion H+, thì sẽ xảy ra phản ứng trung hòa.",
    "re": "Phản ứng trung hòa sẽ xảy ra."
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước, thì chất đó có thể được coi là chất tan tốt.",
    "re": "Chất đó là chất tan tốt."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì năng lượng được giải phóng trong quá trình phản ứng.",
    "re": "Năng lượng được giải phóng."
  },
  {
    "con": "Hòa tan hoàn toàn 26,52 gam $Al_{2}O_{3}$ bằng một lượng vừa đủ dung dịch $HNO_{3}$, thu được 247 gam dung dịch X. Làm lạnh X đến 20ˆ{o} thì có m gam tinh thể $Al(NO_{3}) _{3}.9H_{2}O$ tách ra. Biết ở 20ˆ{o}, cứ 100 gam $H_{2}O$ hòa tan được tối đa 75,44 gam $Al(NO_{3}) _{3}$. Giá trị của m gần nhất với giá trị nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi đun nóng 1 mol $NaCl$ trong nước, nồng độ ion $Na^+$ và $Cl^-$ trong dung dịch sẽ tăng lên.",
    "re": "Nồng độ ion $Na^+$ và $Cl^-$ tăng lên"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện tiêu chuẩn, thì sản phẩm sẽ được tạo ra với hiệu suất tối đa.",
    "re": "Sản phẩm được tạo ra với hiệu suất tối đa"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7, thì dung dịch đó trở thành dung dịch axit.",
    "re": "Dung dịch trở thành dung dịch axit"
  },
  {
    "con": "Nếu một chất rắn không tan trong nước, thì nó sẽ không tạo ra ion trong dung dịch.",
    "re": "Không tạo ra ion trong dung dịch"
  },
  {
    "con": "Khi nhiệt độ tăng lên, thì tốc độ phản ứng hóa học thường tăng lên.",
    "re": "Tốc độ phản ứng hóa học tăng lên"
  },
  {
    "con": "Nếu một chất có độ âm điện cao, thì nó có khả năng thu hút electron mạnh hơn.",
    "re": "Có khả năng thu hút electron mạnh hơn"
  },
  {
    "con": "Khi một dung dịch bão hòa được làm nguội, thì tinh thể sẽ bắt đầu hình thành.",
    "re": "Tinh thể sẽ bắt đầu hình thành"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì nó có thể xảy ra theo cả hai chiều.",
    "re": "Có thể xảy ra theo cả hai chiều"
  },
  {
    "con": "Khi một kim loại phản ứng với axit, thì khí hydro sẽ được sinh ra.",
    "re": "Khí hydro sẽ được sinh ra"
  },
  {
    "con": "Cho các phát biểu sau:\n(a) Do có tính sát trùng, fomon được dùng để ngâm mẫu động vật.\n(b) Mỡ lợn có chứa chất béo bão hòa (phân tử có các gốc hiđrocacbon no).\n(c) Quá trình chuyển hóa tinh bột trong cơ thể người có xảy ra phản ứng thủy phân.\n(d) Khi làm đậu phụ từ sữa đậu nành có xảy ra sự đông tụ protein.\n(đ) Vải lụa tơ tằm sẽ nhanh hỏng nếu ngâm, giặt trong xà phòng có tính kiềm.\nSố phát biểu đúng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất khí CO2 được sinh ra khi đốt cháy hợp chất hữu cơ có chứa carbon",
    "re": "phản ứng cháy xảy ra"
  },
  {
    "con": "Khi hòa tan muối ăn (NaCl) vào nước, ion Na+ và Cl- sẽ tách rời nhau",
    "re": "quá trình phân ly xảy ra"
  },
  {
    "con": "Nếu nhiệt độ của một chất lỏng tăng lên, thì độ hòa tan của nhiều muối trong chất lỏng đó sẽ tăng",
    "re": "hòa tan tốt hơn"
  },
  {
    "con": "Khi thêm axit vào dung dịch kiềm, thì pH của dung dịch sẽ giảm",
    "re": "phản ứng trung hòa xảy ra"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit, thì sẽ sinh ra khí hidro",
    "re": "phản ứng giữa kim loại và axit xảy ra"
  },
  {
    "con": "Khi đun nóng một hợp chất hữu cơ, nếu có sự tách khí, thì có thể xảy ra phản ứng phân hủy",
    "re": "phản ứng hóa học xảy ra"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là axit",
    "re": "tính axit của dung dịch"
  },
  {
    "con": "Khi một chất rắn tan trong nước, nếu nhiệt độ giảm, thì có thể xảy ra hiện tượng kết tinh",
    "re": "quá trình kết tinh xảy ra"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí, thì sản phẩm có thể khác so với điều kiện hiếu khí",
    "re": "sản phẩm phản ứng khác nhau"
  },
  {
    "con": "Cho các sơ đồ phản ứng xảy ra theo đúng tỉ lệ mol:\n        E + 2NaOH \\xrightarrow  Y + 2Z\n        F + 2NaOH \\xrightarrow  Z + T + $H_{2}O$\nBiết E, F đều là các hợp chất hữu cơ no, mạch hở, có công thức phân tử $C_{4}H_{6}O_{4}$, được tạo thành từ axit cacboxylic và ancol. Cho các phát biểu sau:\n(a) Chất T là muối của axit cacboxylic hai chức, mạch hở.\n(b) Chất Y tác dụng với dung dịch HCl sinh ra axit axetic.\n(c) Chất F là hợp chất hữu cơ tạp chức.\n(d) Từ chất Z điều chế trực tiếp được axit axetic.\n(đ) Chất E có khả năng tham gia phản ứng tráng bạc.\nSố phát biểu đúng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức phân tử CnH2n+2 thì",
    "re": "hợp chất đó là ankan"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao và áp suất lớn thì",
    "re": "phản ứng có thể xảy ra nhanh hơn và tạo ra sản phẩm nhiều hơn"
  },
  {
    "con": "Nếu một dung dịch có pH < 7 thì",
    "re": "dung dịch đó là axit"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện trong dung dịch thì",
    "re": "chất đó là chất điện ly"
  },
  {
    "con": "Nếu một phản ứng xảy ra theo tỉ lệ mol 1:1 giữa hai chất A và B thì",
    "re": "sản phẩm sẽ được tạo ra từ một mol A và một mol B"
  },
  {
    "con": "Nếu nhiệt độ tăng lên trong một phản ứng thuận nghịch thì",
    "re": "phản ứng sẽ dịch chuyển theo chiều phản ứng thu nhiệt"
  },
  {
    "con": "Nếu một hợp chất có liên kết đôi trong phân tử thì",
    "re": "hợp chất đó có thể tham gia phản ứng cộng"
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn nước thì",
    "re": "chất đó có thể có liên kết hydro mạnh"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao thì",
    "re": "tính chất hóa học của dung dịch sẽ mạnh hơn"
  },
  {
    "con": "Hỗn hợp X gồm Cu, CuO, Fe, $Fe_{3}O_{4}$. Hòa tan hết m gam X trong dung dịch chứa 1,325 mol HCl (dư 25% so với lượng phản ứng), thu được 0,08 mol $H_{2}$ và 250 gam dung dịch Y. Mặt khác, hòa tan hết m gam X trong dung dịch $H_{2}SO_{4}$ đặc nóng, thu được dung dịch Z (chứa 3 chất tan) và 0,12 mol $SO_{2}$ (sản phẩm khử duy nhất của H2SO4). Cho Z tác dụng với dung dịch $Ba(OH) _{2}$ dư, thu được kết tủa T. Nung T trong không khi đến khối lượng không đổi, thu được 172,81 gam chất rắn. Nồng độ phần trăm $FeCl_{3}$ trong Y là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Dung dịch chứa NaCl và AgNO3. Khi trộn hai dung dịch này lại, sẽ xuất hiện kết tủa AgCl.",
    "re": "AgCl là kết tủa trắng không tan trong nước"
  },
  {
    "con": "Khi đun nóng dung dịch H2SO4 đặc với đường, sẽ xảy ra phản ứng oxi hóa, tạo ra than và khí SO2.",
    "re": "Sản phẩm của phản ứng là than và khí SO2"
  },
  {
    "con": "Khi cho khí CO2 vào dung dịch nước vôi trong, sẽ xảy ra phản ứng tạo thành kết tủa CaCO3.",
    "re": "CaCO3 là kết tủa trắng xuất hiện trong dung dịch"
  },
  {
    "con": "Khi hòa tan kim loại kiềm thổ như Ca trong nước, sẽ tạo ra khí H2 và dung dịch kiềm.",
    "re": "Sản phẩm của phản ứng là khí H2 và dung dịch Ca(OH)2"
  },
  {
    "con": "Khi cho dung dịch NaOH vào dung dịch AlCl3, sẽ xảy ra phản ứng tạo thành kết tủa Al(OH)3.",
    "re": "Al(OH)3 là kết tủa trắng không tan trong nước"
  },
  {
    "con": "Khi nung nóng hỗn hợp NaHCO3 và NaCl, sẽ xảy ra phản ứng phân hủy NaHCO3, tạo ra Na2CO3, CO2 và H2O.",
    "re": "Sản phẩm của phản ứng là Na2CO3, CO2 và H2O"
  },
  {
    "con": "Khi cho dung dịch HCl vào dung dịch Na2CO3, sẽ xảy ra phản ứng tạo ra khí CO2.",
    "re": "Khí CO2 sẽ được giải phóng trong phản ứng"
  },
  {
    "con": "Khi cho dung dịch H2SO4 vào dung dịch NaOH, sẽ xảy ra phản ứng trung hòa, tạo ra nước và muối Na2SO4.",
    "re": "Sản phẩm của phản ứng là nước và Na2SO4"
  },
  {
    "con": "Khi cho dung dịch BaCl2 vào dung dịch Na2SO4, sẽ xảy ra phản ứng tạo thành kết tủa BaSO4.",
    "re": "BaSO4 là kết tủa trắng không tan trong nước"
  },
  {
    "con": "Cho các phát biểu sau:\n(a) Điện phân nóng chảy NaCl, thu được kim loại Na ở catot.\n(b) Thành phần chính của supephotphat kép là $Ca(H_{2}PO_{4})_{2}$.\n(c) Để lâu miếng gang trong không khí ẩm có xảy ra ăn mòn điện hóa học.\n(d) Sục khí $CO_{2}$ vào dung dịch $Ca(HCO_{3})_{2}$, thu được kết tủa.\nSố phát biểu đúng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất phản ứng với oxy, sản phẩm tạo thành thường là",
    "re": "khí CO2 hoặc H2O"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó",
    "re": "là dung dịch axit"
  },
  {
    "con": "Khi hòa tan NaOH vào nước, nhiệt độ của dung dịch",
    "re": "tăng lên do phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một hợp chất có công thức phân tử C2H6, thì hợp chất đó",
    "re": "là etan, một ankan"
  },
  {
    "con": "Khi sục khí NH3 vào dung dịch HCl, sẽ xảy ra",
    "re": "phản ứng tạo thành muối NH4Cl"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit, thì sản phẩm tạo thành sẽ",
    "re": "là muối và khí H2"
  },
  {
    "con": "Khi đun nóng dung dịch NaCl, sẽ xảy ra",
    "re": "sự phân ly ion Na+ và Cl-"
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn nước, thì chất đó",
    "re": "có khả năng tồn tại ở trạng thái lỏng ở nhiệt độ phòng"
  },
  {
    "con": "Khi thêm phenolphtalein vào dung dịch kiềm, màu của dung dịch sẽ",
    "re": "chuyển sang màu hồng"
  },
  {
    "con": "Polime nào sau đây có chứa nguyên tố nitơ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một hợp chất có công thức hóa học C2H6O là gì?",
    "re": "Câu trả lời đúng là etanol"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng sẽ tăng lên.",
    "re": "Điều này đúng theo định luật Arrhenius"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7, thì dung dịch đó trở thành axit.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một nguyên tố có số oxi hóa +1, thì nó có khả năng mất một electron.",
    "re": "Điều này đúng"
  },
  {
    "con": "Khi một kim loại phản ứng với axit, thì sản phẩm tạo ra sẽ bao gồm khí hydro.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao, thì áp suất thẩm thấu của dung dịch đó sẽ cao.",
    "re": "Điều này đúng theo định luật van 't Hoff"
  },
  {
    "con": "Khi một chất rắn tan trong nước, thì nó sẽ tạo ra dung dịch đồng nhất.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì nó có thể diễn ra theo cả hai chiều.",
    "re": "Điều này đúng"
  },
  {
    "con": "Khi nhiệt độ tăng, thì độ hòa tan của hầu hết các chất rắn trong nước cũng tăng.",
    "re": "Điều này đúng"
  },
  {
    "con": "Chất nào sau đây phản ứng với dung dịch $H_{2}SO_{4}$ đặc, nóng sinh ra khí $SO_{2}$?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Dung dịch $NaOH$ phản ứng với $HCl$ thì tạo ra muối nào?",
    "re": "Muối $NaCl$"
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn nước thì chất đó có thể là gì?",
    "re": "Chất lỏng có liên kết hydro mạnh"
  },
  {
    "con": "Khi đun nóng $CaCO_3$ thì sản phẩm thu được là gì?",
    "re": "Khí $CO_2$ và $CaO$"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra tỏa nhiệt thì phản ứng đó được gọi là gì?",
    "re": "Phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi cho $Na$ vào nước thì sản phẩm tạo thành là gì?",
    "re": "Dung dịch $NaOH$ và khí $H_2$"
  },
  {
    "con": "Nếu một chất có pH < 7 thì chất đó được gọi là gì?",
    "re": "Chất axit"
  },
  {
    "con": "Khi cho $Fe$ vào dung dịch $CuSO_4$ thì xảy ra hiện tượng gì?",
    "re": "Sắt sẽ đẩy đồng ra khỏi dung dịch"
  },
  {
    "con": "Nếu một chất có công thức phân tử $C_2H_6$ thì chất đó là gì?",
    "re": "Etan"
  },
  {
    "con": "Khi đốt cháy hoàn toàn một hydrocarbon thì sản phẩm tạo thành là gì?",
    "re": "Khí $CO_2$ và $H_2O$"
  },
  {
    "con": "Dung dịch chất nào sau đây làm quỳ tím chuyển thành màu đỏ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi cao hơn 100 độ C,",
    "re": "thì chất đó có thể là một chất lỏng ở nhiệt độ phòng."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao,",
    "re": "thì tốc độ phản ứng thường tăng lên."
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7,",
    "re": "thì dung dịch đó được coi là axit."
  },
  {
    "con": "Nếu một chất có khối lượng mol lớn hơn 100 g/mol,",
    "re": "thì chất đó thường có tính chất khác biệt so với các chất có khối lượng mol nhỏ hơn."
  },
  {
    "con": "Nếu một kim loại phản ứng với axit,",
    "re": "thì sản phẩm tạo thành thường là muối và khí hidro."
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao,",
    "re": "thì khả năng dẫn điện của dung dịch đó thường cao."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng,",
    "re": "thì chất đó có thể có tính quang hoạt."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt,",
    "re": "thì năng lượng được giải phóng ra môi trường xung quanh."
  },
  {
    "con": "Nếu một chất có điểm nóng chảy thấp,",
    "re": "thì chất đó thường tồn tại ở trạng thái lỏng hoặc khí ở nhiệt độ phòng."
  },
  {
    "con": "Kim loại nào sau đây không phản ứng được với dung dịch $CuSO_{4}$?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C, thì chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng.",
    "re": "Chất đó có thể tồn tại ở trạng thái khí"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra tỏa nhiệt, thì năng lượng được giải phóng ra môi trường.",
    "re": "Năng lượng được giải phóng ra môi trường"
  },
  {
    "con": "Nếu pH của dung dịch nhỏ hơn 7, thì dung dịch đó được coi là axit.",
    "re": "Dung dịch đó được coi là axit"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng, thì chất đó có thể có đồng phân quang học.",
    "re": "Chất đó có thể có đồng phân quang học"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit, thì sản phẩm của phản ứng thường là muối và khí hydro.",
    "re": "Sản phẩm của phản ứng thường là muối và khí hydro"
  },
  {
    "con": "Nếu nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch, thì phản ứng sẽ dịch chuyển theo chiều phản ứng thu nhiệt.",
    "re": "Phản ứng sẽ dịch chuyển theo chiều phản ứng thu nhiệt"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao, thì khả năng dẫn điện của dung dịch đó sẽ cao hơn.",
    "re": "Khả năng dẫn điện của dung dịch đó sẽ cao hơn"
  },
  {
    "con": "Nếu một chất có tính oxi hóa mạnh, thì nó có khả năng nhận electron từ chất khác.",
    "re": "Nó có khả năng nhận electron từ chất khác"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kiềm, thì sản phẩm có thể khác so với trong môi trường axit.",
    "re": "Sản phẩm có thể khác so với trong môi trường axit"
  },
  {
    "con": "Chất nào sau đây là đồng phân của glucozơ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong phản ứng hóa học thì",
    "re": "tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Chất nào có pH < 7 thì",
    "re": "đó là một axit"
  },
  {
    "con": "Khi một chất bị oxi hóa thì",
    "re": "nó mất electron"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao thì",
    "re": "nó có khả năng dẫn điện tốt hơn"
  },
  {
    "con": "Khi nhiệt độ giảm thì",
    "re": "tốc độ phản ứng hóa học thường giảm"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn nước thì",
    "re": "nó sẽ bay hơi nhanh hơn ở nhiệt độ phòng"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong môi trường kín thì",
    "re": "khối lượng tổng thể của hệ thống không thay đổi"
  },
  {
    "con": "Nếu một chất là bazơ thì",
    "re": "nó có khả năng nhận proton"
  },
  {
    "con": "Khi có sự hiện diện của xúc tác thì",
    "re": "tốc độ phản ứng hóa học sẽ tăng mà không làm thay đổi trạng thái của xúc tác"
  },
  {
    "con": "Kim loại nào sau đây có độ cứng lớn nhất?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O,",
    "re": "thì đó là nước."
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên,",
    "re": "thì động năng của các phân tử trong chất đó cũng tăng lên."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện không có không khí,",
    "re": "thì đó là phản ứng hiếm khi xảy ra oxi hóa."
  },
  {
    "con": "Nếu pH của một dung dịch nhỏ hơn 7,",
    "re": "thì dung dịch đó được coi là axit."
  },
  {
    "con": "Nếu một kim loại phản ứng với axit,",
    "re": "thì sản phẩm sẽ bao gồm muối và khí hydro."
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước,",
    "re": "thì chất đó sẽ bay hơi ở nhiệt độ phòng."
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao,",
    "re": "thì khả năng dẫn điện của dung dịch đó cũng cao."
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch,",
    "re": "thì sản phẩm có thể chuyển đổi trở lại thành phản ứng ban đầu."
  },
  {
    "con": "Nếu một chất có cấu trúc mạng tinh thể,",
    "re": "thì chất đó thường có tính chất cứng và bền."
  },
  {
    "con": "Kim loại Fe tác dụng với dung dịch $H _{2} SO _{4}$ loãng sinh ra khí $H _{2}$ và muối nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi đun nóng dung dịch NaCl với AgNO3, sẽ xảy ra phản ứng tạo ra kết tủa nào?",
    "re": "Câu trả lời đúng là AgCl"
  },
  {
    "con": "Nếu một chất có độ pH nhỏ hơn 7 thì chất đó được coi là gì?",
    "re": "Chất đó là axit"
  },
  {
    "con": "Khi cho Na vào nước, nếu có hiện tượng sủi bọt và sinh ra khí thì phản ứng xảy ra là gì?",
    "re": "Phản ứng giữa Na và nước tạo ra NaOH và H2"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học C6H12O6 thì hợp chất đó là gì?",
    "re": "Hợp chất đó là glucose"
  },
  {
    "con": "Khi đốt cháy hoàn toàn một hydrocarbon, nếu sản phẩm tạo ra là CO2 và H2O thì phản ứng đó được gọi là gì?",
    "re": "Phản ứng cháy"
  },
  {
    "con": "Nếu một dung dịch có nồng độ molarity 1M thì có nghĩa là gì?",
    "re": "Có 1 mol chất tan trong 1 lít dung môi"
  },
  {
    "con": "Khi cho bột đồng (II) oxit vào dung dịch axit clohidric, sản phẩm tạo ra là gì?",
    "re": "Sản phẩm là đồng (II) clorua và nước"
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn điểm sôi của nước thì chất đó có thể được phân loại là gì?",
    "re": "Chất đó có thể là chất lỏng hữu cơ"
  },
  {
    "con": "Khi cho dung dịch NaOH vào dung dịch HCl, nếu có hiện tượng tạo ra muối thì muối đó là gì?",
    "re": "Muối đó là NaCl"
  },
  {
    "con": "Kim loại Al tác dụng với dung dịch chất nào sau đây sinh ra $AlCl _{3}$?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi axit HCl tác dụng với kim loại Na thì sản phẩm tạo ra là gì?",
    "re": "Khí H2 và muối NaCl"
  },
  {
    "con": "Nếu dung dịch NaOH được thêm vào dung dịch HCl thì sẽ xảy ra phản ứng gì?",
    "re": "Tạo ra muối NaCl và nước"
  },
  {
    "con": "Khi đun nóng dung dịch NaHCO3 thì sản phẩm khí sinh ra là gì?",
    "re": "Khí CO2"
  },
  {
    "con": "Nếu một chất có độ pH lớn hơn 7 thì chất đó được gọi là gì?",
    "re": "Chất kiềm"
  },
  {
    "con": "Khi cho kim loại Cu vào dung dịch AgNO3 thì xảy ra hiện tượng gì?",
    "re": "Kim loại Ag sẽ được sinh ra và kim loại Cu sẽ tan"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học C2H6 thì nó thuộc loại gì?",
    "re": "Hydrocarbon bão hòa"
  },
  {
    "con": "Khi cho dung dịch phenolphtalein vào dung dịch NaOH thì hiện tượng gì xảy ra?",
    "re": "Dung dịch chuyển sang màu hồng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra tỏa nhiệt thì nó được gọi là gì?",
    "re": "Phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi cho dung dịch Ba(OH)2 vào dung dịch H2SO4 thì sản phẩm tạo ra là gì?",
    "re": "Muối BaSO4 và nước"
  },
  {
    "con": "Chất nào sau đây có khả năng làm mềm được nước cứng vĩnh cửu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng thường tăng lên",
    "re": "Điều này xảy ra do năng lượng va chạm giữa các phân tử tăng lên"
  },
  {
    "con": "Một dung dịch có pH < 7 thì dung dịch đó được coi là axit",
    "re": "Điều này cho thấy nồng độ ion H+ cao hơn ion OH-"
  },
  {
    "con": "Khi một chất rắn tan trong nước thì nó sẽ tạo ra dung dịch",
    "re": "Điều này xảy ra khi các phân tử nước tương tác với các phân tử của chất rắn"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín thì khối lượng tổng thể sẽ không thay đổi",
    "re": "Điều này phù hợp với định luật bảo toàn khối lượng"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên thì khả năng phản ứng của chất đó cũng tăng",
    "re": "Điều này do số lượng phân tử tham gia phản ứng tăng lên"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn nước thì chất đó sẽ bay hơi nhanh hơn khi đun nóng",
    "re": "Điều này xảy ra do áp suất hơi của chất đó cao hơn"
  },
  {
    "con": "Khi một chất phản ứng với oxy thì sản phẩm thường là oxit",
    "re": "Điều này đúng với nhiều phản ứng cháy"
  },
  {
    "con": "Nếu một ion mang điện tích dương thì nó sẽ di chuyển về cực âm trong điện trường",
    "re": "Điều này xảy ra do lực điện tác động lên ion"
  },
  {
    "con": "Khi một chất điện phân được hòa tan trong nước thì nó sẽ phân ly thành các ion",
    "re": "Điều này cho phép dung dịch dẫn điện"
  },
  {
    "con": "Ở trạng thái cơ bản, số electron lớp ngoài cùng của nguyên tử kim loại kiềm là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường",
    "re": "tăng lên"
  },
  {
    "con": "Trong một phản ứng hóa học, khối lượng của các chất phản ứng luôn",
    "re": "bằng khối lượng của các sản phẩm"
  },
  {
    "con": "Khi pH của dung dịch giảm, nồng độ ion H+ trong dung dịch",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước, thì chất đó thường",
    "re": "là chất ion hoặc phân cực"
  },
  {
    "con": "Khi một nguyên tử mất electron, nó trở thành",
    "re": "ion dương"
  },
  {
    "con": "Trong phản ứng oxi hóa khử, chất bị oxi hóa sẽ",
    "re": "mất electron"
  },
  {
    "con": "Nếu nhiệt độ của một khí tăng lên trong một bình kín, áp suất của khí",
    "re": "tăng lên"
  },
  {
    "con": "Khi một dung dịch có nồng độ ion OH- cao, dung dịch đó sẽ",
    "re": "có tính kiềm"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện tiêu chuẩn, thì thể tích của một mol khí sẽ",
    "re": "bằng 22,4 lít"
  },
  {
    "con": "Công thức cấu tạo thu gọn của anđehit fomic là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là một hợp chất được hình thành từ hai nguyên tố là hydro và oxy",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng thường tăng lên",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có độ pH nhỏ hơn 7, thì chất đó được coi là axit",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, thì nguyên tố đó là carbon",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao, thì khả năng dẫn điện của dung dịch đó thường cao hơn",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì năng lượng được giải phóng ra môi trường",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có cấu trúc mạng tinh thể, thì chất đó thường có điểm nóng chảy cao",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có tính kim loại mạnh, thì nó thường dễ dàng mất electron",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra giữa axit và bazơ, thì sản phẩm thường là muối và nước",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất nào sau đây là chất béo?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một hợp chất có công thức hóa học C2H6O là gì?",
    "re": "Câu trả lời đúng là ethanol"
  },
  {
    "con": "Nếu nhiệt độ tăng lên trong một phản ứng hóa học,",
    "re": "thì tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7,",
    "re": "thì chất đó được coi là axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín,",
    "re": "thì khối lượng tổng thể của hệ thống sẽ không thay đổi"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện trong dung dịch,",
    "re": "thì chất đó là một chất điện ly"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử 6,",
    "re": "thì nguyên tố đó là carbon"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt,",
    "re": "thì năng lượng được giải phóng ra môi trường"
  },
  {
    "con": "Nếu một dung dịch có nồng độ molarity cao,",
    "re": "thì số lượng mol chất tan trong dung dịch đó là lớn"
  },
  {
    "con": "Nếu một hợp chất có liên kết ion,",
    "re": "thì nó thường có điểm nóng chảy cao"
  },
  {
    "con": "Kim loại nào sau đây không phản ứng được với HCl trong dung dịch?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn điểm sôi của nước,",
    "re": "thì chất đó sẽ tồn tại ở trạng thái lỏng hoặc rắn ở nhiệt độ phòng."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao,",
    "re": "thì tốc độ phản ứng thường tăng lên."
  },
  {
    "con": "Nếu một dung dịch có pH < 7,",
    "re": "thì dung dịch đó được coi là axit."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng,",
    "re": "thì chất đó có thể có đồng phân quang học."
  },
  {
    "con": "Nếu một chất là muối,",
    "re": "thì nó được hình thành từ phản ứng giữa axit và bazơ."
  },
  {
    "con": "Nếu một nguyên tố có số oxi hóa cao nhất là +7,",
    "re": "thì nguyên tố đó có thể là Mangan (Mn)."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt,",
    "re": "thì năng lượng được giải phóng ra môi trường xung quanh."
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước,",
    "re": "thì chất đó thường là một muối hoặc đường."
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao,",
    "re": "thì khả năng dẫn điện của dung dịch đó cũng cao."
  },
  {
    "con": "Kim loại nào sau đây là kim loại kiềm thổ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học là gì?",
    "re": "Câu trả lời đúng là H2O"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C,",
    "re": "thì chất đó có thể là một chất lỏng ở nhiệt độ phòng"
  },
  {
    "con": "Khi axit phản ứng với bazơ,",
    "re": "thì sản phẩm tạo ra là muối và nước"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6,",
    "re": "thì nguyên tố đó là carbon"
  },
  {
    "con": "Khi một chất bị oxi hóa,",
    "re": "thì nó sẽ mất electron"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7,",
    "re": "thì dung dịch đó là axit"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường",
    "re": "tăng lên do các phân tử có năng lượng cao hơn"
  },
  {
    "con": "Nếu một hợp chất có công thức C2H6,",
    "re": "thì hợp chất đó là etan"
  },
  {
    "con": "Khi một chất bị phân hủy hoàn toàn,",
    "re": "thì nó sẽ tạo ra các sản phẩm đơn giản hơn"
  },
  {
    "con": "Chất nào sau đây tác dụng với dung dịch NaOH sinh ra khí H2?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn nước,",
    "re": "thì chất đó sẽ bay hơi dễ dàng hơn ở nhiệt độ phòng."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao,",
    "re": "thì tốc độ phản ứng thường tăng lên."
  },
  {
    "con": "Nếu một dung dịch có pH < 7,",
    "re": "thì dung dịch đó được coi là axit."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng,",
    "re": "thì chất đó có thể có đồng phân quang học."
  },
  {
    "con": "Nếu một kim loại phản ứng với axit,",
    "re": "thì sản phẩm sẽ bao gồm muối và khí H2 (nếu kim loại đứng trước H trong dãy hoạt động hóa học)."
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch,",
    "re": "thì sản phẩm có thể chuyển đổi trở lại thành phản ứng ban đầu."
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước,",
    "re": "thì chất đó thường là ion hoặc phân tử có khả năng tương tác tốt với nước."
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao,",
    "re": "thì khả năng dẫn điện của dung dịch đó thường cao hơn."
  },
  {
    "con": "Nếu một phản ứng hóa học tỏa nhiệt,",
    "re": "thì phản ứng đó được gọi là phản ứng tỏa nhiệt (exothermic)."
  },
  {
    "con": "Kim loại nào sau đây có tính khử mạnh hơn kim loại Zn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là NaCl, thì nó được tạo thành từ ion Na+ và Cl-",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu nhiệt độ của một phản ứng hóa học tăng lên, thì tốc độ phản ứng thường sẽ tăng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó là axit",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C, thì nó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường nước, thì nó có thể được gọi là phản ứng thủy phân",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất hữu cơ chứa nhóm chức -OH, thì nó được gọi là rượu",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit, thì sản phẩm tạo ra thường là muối và khí hidro",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước, thì nó có thể được coi là chất tan tốt",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì nó sẽ giải phóng năng lượng dưới dạng nhiệt",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Số liên kết peptit trong phân tử peptit Gly-Ala-Gly là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên thì tốc độ phản ứng hóa học thường",
    "re": "tăng lên"
  },
  {
    "con": "Số mol của chất trong dung dịch thì nồng độ molar được tính bằng",
    "re": "tổng số mol chia cho thể tích dung dịch (lít)"
  },
  {
    "con": "Chất điện ly mạnh trong nước thì sẽ phân ly hoàn toàn thành ion",
    "re": "tạo ra các ion tự do"
  },
  {
    "con": "Khi pH của dung dịch giảm thì nồng độ ion H+ trong dung dịch",
    "re": "tăng lên"
  },
  {
    "con": "Khi một phản ứng hóa học đạt trạng thái cân bằng thì tốc độ phản ứng thuận",
    "re": "bằng với tốc độ phản ứng nghịch"
  },
  {
    "con": "Khi nhiệt độ giảm thì độ hòa tan của khí trong chất lỏng",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một chất có độ âm điện cao thì khả năng thu hút electron trong liên kết hóa học",
    "re": "sẽ mạnh hơn"
  },
  {
    "con": "Khi có sự hiện diện của xúc tác thì năng lượng kích hoạt của phản ứng",
    "re": "sẽ giảm xuống"
  },
  {
    "con": "Trong phản ứng oxi hóa khử, chất bị oxi hóa thì sẽ",
    "re": "mất electron"
  },
  {
    "con": "Nồng độ khí metan cao là một trong những nguyên nhân gây ra các vụ nổ trong hầm mỏ. Công thức của metan là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có nhiệt độ nóng chảy thấp hơn nhiệt độ phòng, thì chất đó thường ở trạng thái rắn ở nhiệt độ phòng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường axit, thì pH của dung dịch sẽ giảm.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước, thì chất đó thường là ion hoặc phân cực.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số electron hóa trị là 1, thì nguyên tố đó thường thuộc nhóm 1 trong bảng tuần hoàn.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu nhiệt độ tăng trong một phản ứng hóa học, thì tốc độ phản ứng thường tăng lên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ ion H+ cao, thì dung dịch đó có tính axit.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là C2H6, thì hợp chất đó là etan.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì năng lượng được giải phóng trong quá trình phản ứng.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử phức tạp, thì nó có thể có nhiều tính chất hóa học khác nhau.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Thủy phân este nào sau đây trong dung dịch NaOH thu được natri fomat?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một axit mạnh phản ứng với một bazơ mạnh, sản phẩm thu được là muối và nước.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó là axit.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng lên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức phân tử C2H6, thì hợp chất đó là etan.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một kim loại phản ứng với axit, sản phẩm thu được là muối và khí hidro.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch chứa ion Cl-, thì dung dịch đó có thể phản ứng với ion Ag+ để tạo ra AgCl kết tủa.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất rắn tan trong nước, nếu nhiệt độ của dung dịch giảm, thì quá trình này là quá trình thu nhiệt.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí, thì sản phẩm có thể khác với phản ứng xảy ra trong điều kiện có oxy.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một dung dịch có nồng độ ion H+ cao, thì dung dịch đó có tính axit mạnh.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất X có công thức CH3NH2. Tên gọi của X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học H2O. Tên gọi của nước là",
    "re": "Nước"
  },
  {
    "con": "Chất Y có công thức C6H12O6. Tên gọi của Y là",
    "re": "Glucose"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì",
    "re": "tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Nếu pH của dung dịch là 7, thì dung dịch đó được coi là",
    "re": "trung tính"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước, thì chất đó được coi là",
    "re": "tan trong nước"
  },
  {
    "con": "Nếu một phản ứng hóa học tỏa nhiệt, thì phản ứng đó được gọi là",
    "re": "phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một chất có công thức hóa học NaCl, thì chất đó là",
    "re": "muối ăn"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, thì nguyên tố đó là",
    "re": "Carbon"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol là 1M, thì nồng độ của dung dịch đó là",
    "re": "1 mol chất tan trong 1 lít dung môi"
  },
  {
    "con": "Phát biểu nào sau đây sai?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "thường làm tăng tốc độ phản ứng"
  },
  {
    "con": "Một chất có độ pH dưới 7",
    "re": "được coi là axit"
  },
  {
    "con": "Khi một chất tan trong nước",
    "re": "nó tạo thành dung dịch"
  },
  {
    "con": "Số electron trong một nguyên tử bằng số proton",
    "re": "nếu nguyên tử đó trung hòa về điện"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra",
    "re": "năng lượng có thể được giải phóng hoặc hấp thụ"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo",
    "re": "số nguyên tử tăng dần"
  },
  {
    "con": "Khi nồng độ của một chất tăng lên",
    "re": "tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Một hợp chất ion được hình thành từ",
    "re": "sự kết hợp giữa cation và anion"
  },
  {
    "con": "Khi một chất bị oxi hóa",
    "re": "nó mất electron"
  },
  {
    "con": "Cho 180 gam dung dịch glucozơ 1% vào lượng dư dung dịch $AgNO_{3}$ trong $NH_{3}$, đun nóng nhẹ đến phản ứng hoàn toàn thu được m gam Ag. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 58,5 gam NaCl vào 1 lít nước, nồng độ mol của dung dịch NaCl là",
    "re": "1 mol/L"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện tiêu chuẩn, thì thể tích của 1 mol khí lý tưởng là",
    "re": "22,4 lít"
  },
  {
    "con": "Khi đun nóng dung dịch HCl với kim loại kẽm, sản phẩm thu được là",
    "re": "khí H2 và dung dịch ZnCl2"
  },
  {
    "con": "Nếu pH của dung dịch là 7, thì dung dịch đó được coi là",
    "re": "trung tính"
  },
  {
    "con": "Khi cho dung dịch NaOH vào dung dịch H2SO4, nếu tỷ lệ mol là 1:1, thì sản phẩm tạo thành là",
    "re": "Na2SO4 và nước"
  },
  {
    "con": "Nếu một hợp chất có công thức phân tử C2H6, thì nó thuộc loại",
    "re": "hydrocarbon no"
  },
  {
    "con": "Khi cho dung dịch Ba(OH)2 vào dung dịch H2SO4, thì sản phẩm tạo thành là",
    "re": "BaSO4 và nước"
  },
  {
    "con": "Nếu nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch, thì phản ứng sẽ chuyển dịch theo chiều",
    "re": "phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi cho dung dịch phenol vào dung dịch NaOH, thì sản phẩm tạo thành là",
    "re": "natri phenolat"
  },
  {
    "con": "Thuỷ phân hoàn toàn m gam metyl axetat bằng dung dịch NaOH đun nóng thu được 8,2 gam muối. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong phản ứng hóa học thì tốc độ phản ứng thường",
    "re": "tăng lên"
  },
  {
    "con": "Khi nồng độ dung dịch tăng thì áp suất hơi của dung dịch",
    "re": "giảm"
  },
  {
    "con": "Khi thêm axit vào dung dịch kiềm thì pH của dung dịch",
    "re": "giảm"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước thì nó thường là",
    "re": "chất ion"
  },
  {
    "con": "Khi nhiệt độ giảm thì độ hòa tan của khí trong chất lỏng",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra tỏa nhiệt thì nó được gọi là",
    "re": "phản ứng tỏa nhiệt"
  },
  {
    "con": "Khi pH của dung dịch axit mạnh giảm xuống dưới 7 thì dung dịch đó",
    "re": "vẫn là axit"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử phức tạp thì nó thường có",
    "re": "điểm sôi cao"
  },
  {
    "con": "Khi một kim loại phản ứng với axit thì sản phẩm tạo ra thường là",
    "re": "muối và khí hidro"
  },
  {
    "con": "Cho hỗn hợp gồm Fe và FeO phản ứng với lượng dư dung dịch $HNO_{3}$ (đặc, nóng), sau phản ứng thu được dung dịch chứa muối nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch chứa ion $Ag^+$ được thêm vào dung dịch chứa ion $Cl^-$, thì sẽ xảy ra hiện tượng kết tủa.",
    "re": "Kết tủa $AgCl$ xuất hiện"
  },
  {
    "con": "Nếu nhiệt độ của một phản ứng hóa học tăng lên, thì tốc độ phản ứng thường sẽ tăng.",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Nếu một chất có độ pH nhỏ hơn 7, thì chất đó được coi là axit.",
    "re": "Chất đó là axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí, thì sản phẩm có thể khác với phản ứng xảy ra trong điều kiện có oxy.",
    "re": "Sản phẩm phản ứng có thể khác nhau"
  },
  {
    "con": "Nếu cho một lượng dư dung dịch $NaOH$ vào dung dịch chứa ion $Cu^{2+}$, thì sẽ thu được kết tủa màu xanh.",
    "re": "Kết tủa $Cu(OH)_2$ xuất hiện"
  },
  {
    "con": "Nếu một chất có công thức phân tử $C_6H_{12}O_6$, thì chất đó là glucose.",
    "re": "Chất đó là glucose"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng oxi hóa khử, thì có sự chuyển giao electron giữa các chất tham gia phản ứng.",
    "re": "Có sự chuyển giao electron"
  },
  {
    "con": "Nếu một dung dịch có nồng độ molarity cao, thì khả năng dẫn điện của dung dịch đó thường cao hơn.",
    "re": "Khả năng dẫn điện cao hơn"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C, thì chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng.",
    "re": "Chất đó có thể tồn tại ở trạng thái khí"
  },
  {
    "con": "Số este có cùng công thức phân tử $C_{3}H_{6}O_{2}$ là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ sôi của nước là 100 độ C ở áp suất 1 atm",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Một hợp chất có công thức phân tử $C_{2}H_{5}OH$ là",
    "re": "Ethanol"
  },
  {
    "con": "Khi một kim loại phản ứng với axit, sản phẩm tạo ra là",
    "re": "Muối và khí hidro"
  },
  {
    "con": "Nếu pH của dung dịch là 7",
    "re": "Dung dịch đó là trung tính"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường",
    "re": "Tăng lên"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước",
    "re": "Chất đó có thể là muối hoặc đường"
  },
  {
    "con": "Khi một hợp chất hữu cơ có nhóm chức -OH",
    "re": "Hợp chất đó được gọi là rượu"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí",
    "re": "Sản phẩm có thể khác so với phản ứng xảy ra trong điều kiện có oxy"
  },
  {
    "con": "Khi một dung dịch có nồng độ ion H+ cao",
    "re": "Dung dịch đó có tính axit mạnh"
  },
  {
    "con": "Cho 11,2 gam kim loại Fe tác dụng hết với dung dịch $CuSO_{4}$ dư thu được m gam Cu. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 1 mol NaCl vào nước, nồng độ ion Na+ và Cl- trong dung dịch sẽ là",
    "re": "1 mol/lít"
  },
  {
    "con": "Khi đốt cháy hoàn toàn 1 mol C6H14 trong không khí, sản phẩm tạo thành sẽ là",
    "re": "6 mol CO2 và 7 mol H2O"
  },
  {
    "con": "Khi cho 2 mol H2 tác dụng với 1 mol O2, sản phẩm tạo thành sẽ là",
    "re": "2 mol H2O"
  },
  {
    "con": "Khi hòa tan 58,5 gam NaCl vào 1 lít nước, nồng độ mol của dung dịch sẽ là",
    "re": "1 mol/lít"
  },
  {
    "con": "Khi cho 1 mol HCl tác dụng với 1 mol NaOH, sản phẩm tạo thành sẽ là",
    "re": "1 mol NaCl và 1 mol H2O"
  },
  {
    "con": "Khi cho 10 gam CaCO3 tác dụng với dung dịch HCl dư, thể tích CO2 sinh ra ở điều kiện tiêu chuẩn sẽ là",
    "re": "22,4 lít"
  },
  {
    "con": "Khi cho 1 mol NH3 vào 1 mol HCl, sản phẩm tạo thành sẽ là",
    "re": "1 mol NH4Cl"
  },
  {
    "con": "Khi cho 1 mol Fe tác dụng với 3/2 mol O2, sản phẩm tạo thành sẽ là",
    "re": "1 mol Fe2O3"
  },
  {
    "con": "Khi cho 1 mol KOH vào 1 mol H2SO4, sản phẩm tạo thành sẽ là",
    "re": "1 mol K2SO4 và 2 mol H2O"
  },
  {
    "con": "Cho 0,1 mol axit glutamic tác dụng với dung dịch NaOH dư, sau phản ứng hoàn toàn thu được m gam muối. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 58,5 gam NaCl vào 1 lít nước, nồng độ mol của dung dịch NaCl là",
    "re": "0,5 mol/L"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ và áp suất không đổi, thì năng lượng tự do Gibbs sẽ",
    "re": "giảm khi phản ứng tiến hành theo chiều thuận"
  },
  {
    "con": "Khi cho 1 mol khí lý tưởng vào một bình chứa có thể thay đổi thể tích ở nhiệt độ không đổi, thì áp suất của khí sẽ",
    "re": "tăng khi thể tích giảm"
  },
  {
    "con": "Nếu một dung dịch có pH = 3, thì nồng độ ion H+ trong dung dịch đó là",
    "re": "0,001 mol/L"
  },
  {
    "con": "Khi cho 2 mol H2 và 1 mol O2 phản ứng với nhau, thì sản phẩm thu được sẽ là",
    "re": "2 mol H2O"
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn điểm sôi của nước, thì chất đó sẽ",
    "re": "không bay hơi ở nhiệt độ thường"
  },
  {
    "con": "Khi cho 1 mol axit sulfuric tác dụng với 2 mol NaOH, thì sản phẩm thu được sẽ là",
    "re": "1 mol muối Na2SO4 và 2 mol nước"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch và đạt trạng thái cân bằng, thì nồng độ của các chất tham gia và sản phẩm sẽ",
    "re": "không thay đổi theo thời gian"
  },
  {
    "con": "Khi cho 1 mol CaCO3 vào dung dịch axit, thì sản phẩm khí thoát ra sẽ là",
    "re": "CO2"
  },
  {
    "con": "Thí nghiệm nào sau đây không sinh ra đơn chất?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng?",
    "re": "Chất đó là chất khí ở nhiệt độ phòng"
  },
  {
    "con": "Một dung dịch có pH < 7?",
    "re": "Dung dịch đó là dung dịch axit"
  },
  {
    "con": "Một phản ứng hóa học xảy ra mà không có sự thay đổi về khối lượng?",
    "re": "Phản ứng đó tuân theo định luật bảo toàn khối lượng"
  },
  {
    "con": "Một nguyên tố có số hiệu nguyên tử 6?",
    "re": "Nguyên tố đó là cacbon (C)"
  },
  {
    "con": "Một hợp chất có công thức H2O?",
    "re": "Hợp chất đó là nước"
  },
  {
    "con": "Một phản ứng hóa học tỏa nhiệt?",
    "re": "Phản ứng đó là phản ứng tỏa nhiệt"
  },
  {
    "con": "Một chất có khả năng dẫn điện trong dung dịch?",
    "re": "Chất đó là chất điện ly"
  },
  {
    "con": "Một phản ứng hóa học xảy ra giữa axit và bazơ?",
    "re": "Phản ứng đó là phản ứng trung hòa"
  },
  {
    "con": "Một nguyên tố có tính kim loại mạnh?",
    "re": "Nguyên tố đó thường nằm ở bên trái bảng tuần hoàn"
  },
  {
    "con": "Hòa tan hết 1,19 gam hỗn hợp gồm Al và Zn trong dung dịch $H_{2}SO_{4}$ loãng, sau phản ứng thu được dung dịch chỉ chứa 5,03 gam muối sunfat trung hòa và V lít khí $H_{2}$. Giá trị của V là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nung 1 mol CaCO3 ở nhiệt độ cao, sản phẩm thu được là",
    "re": "1 mol CaO và 1 mol CO2"
  },
  {
    "con": "Khi cho 2 mol H2 phản ứng với 1 mol O2, sản phẩm thu được là",
    "re": "2 mol H2O"
  },
  {
    "con": "Khi hòa tan 58,5 gam NaCl vào 1 lít nước, nồng độ mol của dung dịch NaCl là",
    "re": "1 mol/L"
  },
  {
    "con": "Khi cho 1 mol HCl phản ứng với 1 mol NaOH, sản phẩm thu được là",
    "re": "1 mol NaCl và 1 mol H2O"
  },
  {
    "con": "Khi đốt cháy 1 mol C2H5OH trong không khí, sản phẩm thu được là",
    "re": "2 mol CO2 và 3 mol H2O"
  },
  {
    "con": "Khi cho 1 mol Fe vào dung dịch HCl, sản phẩm thu được là",
    "re": "1 mol FeCl2 và 1 mol H2"
  },
  {
    "con": "Khi hòa tan 10 gam KOH vào 1 lít nước, nồng độ mol của dung dịch KOH là",
    "re": "0,25 mol/L"
  },
  {
    "con": "Khi cho 1 mol NH3 vào dung dịch HCl, sản phẩm thu được là",
    "re": "1 mol NH4Cl"
  },
  {
    "con": "Khi cho 1 mol Na2CO3 vào dung dịch HCl, sản phẩm thu được là",
    "re": "2 mol NaCl, 1 mol CO2 và 1 mol H2O"
  },
  {
    "con": "Cặp chất nào sau đây đều có khả năng thủy phân trong môi trường axit, đun nóng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một dung dịch có pH < 7",
    "re": "Dung dịch đó là axit"
  },
  {
    "con": "Một chất có nhiệt độ sôi cao hơn nước",
    "re": "Chất đó có liên kết hydro mạnh"
  },
  {
    "con": "Khi một kim loại phản ứng với axit",
    "re": "Sẽ tạo ra khí hidro"
  },
  {
    "con": "Khi nồng độ dung dịch tăng",
    "re": "Độ dẫn điện của dung dịch cũng tăng"
  },
  {
    "con": "Khi một chất bị oxi hóa",
    "re": "Chất đó mất electron"
  },
  {
    "con": "Khi nhiệt độ tăng trong phản ứng hóa học",
    "re": "Tốc độ phản ứng thường tăng"
  },
  {
    "con": "Khi một muối hòa tan trong nước",
    "re": "Nó sẽ phân ly thành ion"
  },
  {
    "con": "Khi một chất có độ tan thấp trong nước",
    "re": "Chất đó thường là hợp chất không phân cực"
  },
  {
    "con": "Khi một phản ứng hóa học đạt trạng thái cân bằng",
    "re": "Tốc độ phản ứng thuận và phản ứng nghịch bằng nhau"
  },
  {
    "con": "Cho các thí nghiệm sau:\n        (a) Cho $Fe_{3}O_{4}$ vào dung dịch $H_{2}SO_{4}$ đặc, nóng.\n        (b) Cho dung dịch $AlCl_{3}$ vào dung dịch NaOH.\n        (c) Cho dung dịch HCl vào dung dịch $NaHCO_{3}$\n        (d) Cho kim loại Cu vào dung dịch HNO3 đặc, nóng.\n        (e) Cho dung dịch $NH_{4}H_{2}PO_{4}$ vào dung dịch NaOH dư, đun nóng.\nSau khi các phản ứng xảy ra hoàn toàn, số thí nghiệm sinh ra chất khí là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cho dung dịch NaOH vào dung dịch HCl",
    "re": "Sẽ tạo ra muối NaCl và nước"
  },
  {
    "con": "Cho kim loại Mg vào dung dịch H2SO4",
    "re": "Sẽ sinh ra khí H2 và muối MgSO4"
  },
  {
    "con": "Cho dung dịch Ba(OH)2 vào dung dịch H2SO4",
    "re": "Sẽ tạo ra muối BaSO4 kết tủa"
  },
  {
    "con": "Cho dung dịch NH4Cl vào dung dịch NaOH",
    "re": "Sẽ sinh ra khí NH3"
  },
  {
    "con": "Cho dung dịch AgNO3 vào dung dịch NaCl",
    "re": "Sẽ tạo ra kết tủa AgCl"
  },
  {
    "con": "Cho dung dịch H2O2 vào dung dịch KMnO4 trong môi trường axit",
    "re": "Sẽ xảy ra phản ứng oxi hóa khử"
  },
  {
    "con": "Cho dung dịch NaHCO3 vào dung dịch HCl",
    "re": "Sẽ sinh ra khí CO2"
  },
  {
    "con": "Cho kim loại Zn vào dung dịch CuSO4",
    "re": "Sẽ xảy ra phản ứng thế và tạo ra kim loại Cu"
  },
  {
    "con": "Cho dung dịch Na2CO3 vào dung dịch CaCl2",
    "re": "Sẽ tạo ra kết tủa CaCO3"
  },
  {
    "con": "Hỗn hợp E gồm Fe, $Fe_{3}O_{4}$, $Fe_{2}O_{3}$ và $FeS_{2}$. Nung 26,6 gam E trong bình kín chứa 0,3 mol $O_{2}$ thu được chất rắn X (chỉ gồm Fe và các oxit) và 0,2 mol khí $SO_{2}$. Hòa tan hết X trong dung dịch HCl nồng độ 7,3% thu được 2,24 lít khí $H_{2}$ và dung dịch Y chỉ chứa muối. Cho tiếp dung dịch $AgNO_{3}$ dư vào Y thu được 135,475 gam kết tủa gồm Ag và AgCl. Biết các phản ứng xảy ra hoàn toàn. Nồng độ phần trăm của muối FeCl2 trong Y gần nhất với giá trị nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu dung dịch NaOH được thêm vào dung dịch HCl, thì sẽ xảy ra phản ứng trung hòa tạo ra nước và muối NaCl.",
    "re": "Phản ứng trung hòa xảy ra"
  },
  {
    "con": "Nếu một chất rắn không tan trong nước, thì nó có thể là một muối không tan hoặc một hợp chất hữu cơ.",
    "re": "Chất rắn không tan trong nước"
  },
  {
    "con": "Nếu nhiệt độ của một phản ứng hóa học tăng lên, thì tốc độ phản ứng thường sẽ tăng lên.",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7, thì chất đó được coi là axit.",
    "re": "Chất đó là axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí, thì sản phẩm có thể khác với phản ứng xảy ra trong điều kiện có oxy.",
    "re": "Sản phẩm phản ứng khác nhau"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao, thì khả năng dẫn điện của dung dịch đó cũng cao.",
    "re": "Khả năng dẫn điện cao"
  },
  {
    "con": "Nếu một hợp chất có liên kết ion, thì nó thường có điểm nóng chảy cao.",
    "re": "Điểm nóng chảy cao"
  },
  {
    "con": "Nếu một chất có tính oxi hóa mạnh, thì nó có khả năng nhận electron từ chất khác.",
    "re": "Chất đó là chất oxi hóa mạnh"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra hoàn toàn, thì tất cả các chất phản ứng sẽ chuyển hóa thành sản phẩm.",
    "re": "Tất cả chất phản ứng chuyển hóa thành sản phẩm"
  },
  {
    "con": "Cho X là axit cacboxylic đơn chức, mạch hở, Y là ancol no, đa chức, mạch hở. Đun hỗn hợp gồm 2,5 mol X, 1 mol Y với xúc tác $H_{2}SO_{4}$ đặc (giả sử chỉ xảy ra phản ứng este hóa giữa X và Y) thu được 2,5 mol hỗn hợp E gồm X, Y và các sản phẩm hữu cơ (trong đó có chất Z chỉ chứa nhóm chức este). \nTiến hành các thí nghiệm sau:\n          Thí nghiệm 1: Cho 0,5 mol E tác dụng với Na dư, sau phản ứng hoàn toàn thu được 0,35 mol khí $H_{2}$.\n          Thí nghiệm 2: Cho 0,5 mol E vào dung dịch brom dư thì có tối đa 0,5 mol $Br_{2}$ tham gia phản ứng cộng.\n          Thí nghiệm 3: Đốt cháy hoàn toàn 0,5 mol E cần vừa đủ 2,95 mol khí $O_{2}$ thu được $CO_{2}$ và $H_{2}O$. \n        Biết có 12% axit X ban đầu đã chuyển thành Z. Phần trăm khối lượng của Z trong E là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất hữu cơ chứa nhóm chức -OH và có công thức phân tử CnH2n+2O, thì hợp chất đó là ancol.",
    "re": "Hợp chất đó là ancol"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó là dung dịch axit.",
    "re": "Dung dịch đó là dung dịch axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra theo phương trình cân bằng, thì tổng số mol chất phản ứng sẽ bằng tổng số mol chất sản phẩm tại trạng thái cân bằng.",
    "re": "Tổng số mol chất phản ứng bằng tổng số mol chất sản phẩm"
  },
  {
    "con": "Nếu cho một kim loại tác dụng với axit, thì sản phẩm thu được sẽ là muối và khí hidro.",
    "re": "Sản phẩm thu được là muối và khí hidro"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi cao hơn nước, thì chất đó sẽ không bay hơi ở nhiệt độ thường.",
    "re": "Chất đó sẽ không bay hơi ở nhiệt độ thường"
  },
  {
    "con": "Nếu một phản ứng hóa học tỏa nhiệt, thì năng lượng của sản phẩm sẽ thấp hơn năng lượng của các chất phản ứng.",
    "re": "Năng lượng của sản phẩm thấp hơn năng lượng của các chất phản ứng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol/lít cao, thì khả năng dẫn điện của dung dịch đó sẽ lớn.",
    "re": "Khả năng dẫn điện của dung dịch đó sẽ lớn"
  },
  {
    "con": "Nếu một hợp chất có công thức phân tử CnH2nO, thì hợp chất đó có thể là anđehit hoặc xeton.",
    "re": "Hợp chất đó có thể là anđehit hoặc xeton"
  },
  {
    "con": "Nếu một chất có khối lượng mol lớn hơn 100 g/mol, thì chất đó thường có nhiệt độ sôi cao.",
    "re": "Chất đó thường có nhiệt độ sôi cao"
  },
  {
    "con": "Điện phân dung dịch chứa x mol CuSO4, y mol $H_{2}SO_{4}$ và z mol NaCl (với điện cực trơ, có màng ngăn xốp, hiệu suất điện phân là 100%). Lượng khí sinh ra từ quá trình điện phân và khối lượng $Al_{2}O_{3}$ bị hòa tan tối đa trong dung dịch sau điện phân ứng với mỗi thí nghiệm được cho ở bảng dưới đây:\nBiết: tại catot ion Cuˆ{2+} điện phân hết thành Cu trước khi ion Hˆ{+} điện phân tạo thành khí H_{2-}  cường độ dòng điện bằng nhau và không đổi trong các thí nghiệm trên.\n        Tổng giá trị (x + y + z) bằng",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ của một phản ứng hóa học tăng lên",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Sự hiện diện của chất xúc tác trong phản ứng hóa học",
    "re": "Tốc độ phản ứng sẽ được tăng cường mà không làm thay đổi trạng thái cân bằng"
  },
  {
    "con": "Khi nồng độ của một chất phản ứng tăng lên",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Khi pH của dung dịch axit giảm",
    "re": "Tính axit của dung dịch sẽ tăng lên"
  },
  {
    "con": "Khi một kim loại phản ứng với axit",
    "re": "Sẽ sinh ra khí hidro và muối"
  },
  {
    "con": "Khi một dung dịch bão hòa được làm nguội",
    "re": "Sẽ có tinh thể muối lắng đọng"
  },
  {
    "con": "Khi một chất rắn không tan được thêm vào dung dịch",
    "re": "Sẽ không làm thay đổi nồng độ của các ion trong dung dịch"
  },
  {
    "con": "Khi một phản ứng hóa học đạt trạng thái cân bằng",
    "re": "Tốc độ phản ứng thuận và phản ứng nghịch sẽ bằng nhau"
  },
  {
    "con": "Khi một ion kim loại được cho vào dung dịch chứa ion của kim loại khác",
    "re": "Nếu ion kim loại đầu có khả năng khử mạnh hơn, nó sẽ thay thế ion kim loại kia"
  },
  {
    "con": "Cho E (C3H6O3) và F (C4H6O4) là hai chất hữu cơ mạch hở đều tạo từ axit cacboxylic và ancol. Từ E và F thực hiện sơ đồ các phản ứng sau:\n                (1) E + NaOH \\xrightarrow[to]  X + Y\n                (2) F + NaOH \\xrightarrow[to] X + Y\n                (3) X + HCl \\xrightarrow Z + NaCl\nBiết X, Y, Z là các chất hữu cơ, trong đó phân tử Y không có nhóm $-CH_{3}$  \nCho các phát biểu sau:\n        (a) Chất E và F đều là các este đa chức.\n        (b) Có hai công thức cấu tạo phù hợp với chất E.\n        (c) Chất X có khả năng tham gia phản ứng tráng bạc.\n        (d) Nhiệt độ sôi của chất Z cao hơn nhiệt độ sôi của ancol etylic.\n        (e) Cho a mol chất E tác dụng với Na dư thu được a mol khí $H_{2}$.\nSố phát biểu đúng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có công thức phân tử CnH2n+2 thì",
    "re": "chất đó là ankan"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra mà có sự thay đổi về năng lượng thì",
    "re": "phản ứng đó có thể là phản ứng tỏa nhiệt hoặc thu nhiệt"
  },
  {
    "con": "Nếu một dung dịch có pH < 7 thì",
    "re": "dung dịch đó là axit"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện trong dung dịch thì",
    "re": "chất đó là chất điện ly"
  },
  {
    "con": "Nếu một phản ứng xảy ra theo phương trình hóa học A + B → C + D thì",
    "re": "A và B là các chất phản ứng, C và D là sản phẩm"
  },
  {
    "con": "Nếu nhiệt độ tăng lên trong một phản ứng thuận nghịch thì",
    "re": "phản ứng sẽ dịch chuyển theo chiều thu nhiệt"
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn nước thì",
    "re": "chất đó có thể là một hợp chất hữu cơ có liên kết hydro mạnh"
  },
  {
    "con": "Nếu một ion kim loại có hóa trị +2 thì",
    "re": "ion đó có khả năng tạo thành muối với các anion"
  },
  {
    "con": "Nếu một phản ứng oxi hóa xảy ra thì",
    "re": "một chất sẽ mất electron"
  },
  {
    "con": "Cho các phát biểu sau:\n        (a) Cho đá vôi vào dung dịch axit axetic sẽ có khí bay ra.\n        (b) Thủy phân saccarozơ trong môi trường axit chỉ thu được glucozơ.\n        (c) Để loại bỏ anilin dính trong ống nghiệm có thể dùng dung dịch HCl.\n        (d) Đun nóng tripanmitin với dung dịch NaOH sẽ xảy ra phản ứng thủy phân.\n        (e) Trùng hợp axit terephtalic với etylen glicol thu được poli(etylen terephtalat).\nSố phát biểu đúng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi đun nóng natri bicarbonat sẽ giải phóng khí CO2",
    "re": "phản ứng phân hủy xảy ra"
  },
  {
    "con": "Nếu cho axit clohidric vào dung dịch natri hydroxide",
    "re": "sẽ xảy ra phản ứng trung hòa tạo ra nước và muối"
  },
  {
    "con": "Khi hòa tan muối ăn (NaCl) trong nước",
    "re": "sẽ tạo ra dung dịch điện ly"
  },
  {
    "con": "Nếu cho phenol vào dung dịch brom",
    "re": "sẽ xảy ra phản ứng thế tạo ra bromophenol"
  },
  {
    "con": "Khi đun nóng etanol với axit sulfuric",
    "re": "sẽ xảy ra phản ứng ester hóa"
  },
  {
    "con": "Nếu cho dung dịch kali permanganat vào dung dịch etanol",
    "re": "sẽ xảy ra phản ứng oxi hóa"
  },
  {
    "con": "Khi trộn axit sulfuric đặc với nước",
    "re": "sẽ tạo ra nhiệt độ cao và có thể gây bỏng"
  },
  {
    "con": "Nếu cho dung dịch axit nitric vào đồng",
    "re": "sẽ xảy ra phản ứng tạo ra muối đồng nitrat và khí NO2"
  },
  {
    "con": "Khi đun nóng glucozơ với dung dịch NaOH",
    "re": "sẽ xảy ra phản ứng thủy phân tạo ra fructozơ"
  },
  {
    "con": "Hỗn hợp E gồm các hiđrocacbon mạch hở có cùng số nguyên tử hiđro. Tỉ khối của E đối với $H_{2}$ là 12,5. Đốt cháy hoàn toàn a mol E cần vừa đủ 0,11 mol $O_{2}$ thu được $CO_{2}$ và $HO_{2}$. Mặt khác, a mol E tác dụng tối đa với x mol Br2 trong dung dịch. Giá trị của x là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có pH = 7 thì dung dịch đó là trung tính",
    "re": "Không có tính axit hay bazơ"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra với sự giải phóng năng lượng thì phản ứng đó là phản ứng tỏa nhiệt",
    "re": "Năng lượng được giải phóng ra ngoài môi trường"
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn nước thì chất đó có lực liên kết giữa các phân tử mạnh hơn nước",
    "re": "Chất đó có thể là một chất lỏng có liên kết hydro mạnh"
  },
  {
    "con": "Nếu một ion dương có điện tích +2 thì nó có khả năng thu hút hai electron",
    "re": "Ion đó có thể hình thành từ một nguyên tử mất hai electron"
  },
  {
    "con": "Nếu một hợp chất có công thức phân tử CnH2n+2 thì hợp chất đó là ankan",
    "re": "Hợp chất đó là một hiđrocacbon bão hòa"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao thì tốc độ phản ứng thường tăng lên",
    "re": "Nhiệt độ cao làm tăng năng lượng va chạm giữa các phân tử"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước thì chất đó thường là ion hoặc phân cực",
    "re": "Chất đó có khả năng tương tác tốt với nước"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol/lít cao thì số mol chất tan trong dung dịch đó cũng cao",
    "re": "Nồng độ mol/lít tỉ lệ thuận với số mol chất tan"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra theo phương trình cân bằng thì nồng độ các chất tham gia và sản phẩm không thay đổi theo thời gian",
    "re": "Phản ứng đạt trạng thái cân bằng động"
  },
  {
    "con": "Cho sơ đồ các phản ứng sau:\n                (1) X + $Ba(OH)_{2}$ → Y + Z\n                (2) X + T → $BMgCl_{2}$ + Z\n                (3) $BMgCl_{2}$ + $Ba(OH)_{2}$ → Y + T\nCác chất X, T thỏa mãn sơ đồ trên lần lượt là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "thường làm tăng tốc độ phản ứng"
  },
  {
    "con": "Một chất có độ pH dưới 7",
    "re": "là một axit"
  },
  {
    "con": "Khi một chất rắn tan trong nước",
    "re": "nó tạo thành dung dịch"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kín",
    "re": "khối lượng tổng thể của hệ thống sẽ không thay đổi"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên",
    "re": "tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử đối xứng",
    "re": "nó có thể là một chất không phân cực"
  },
  {
    "con": "Khi một ion dương kết hợp với một ion âm",
    "re": "chúng tạo thành một hợp chất ion"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch",
    "re": "có thể xảy ra theo cả hai chiều"
  },
  {
    "con": "Khi một chất bị oxi hóa",
    "re": "nó mất electron"
  },
  {
    "con": "Dẫn 0,2 mol hỗn hợp gồm khí $CO_{2}$ và hơi nước qua cacbon nung đỏ thu được 0,31 mol hỗn hợp X gồm CO, $H_{2}$ và $CO_{2}$. Cho toàn bộ X qua dung dịch chứa 0,15 mol NaOH và x mol $Ba(OH)_{2}$, sau phản ứng hoàn toàn thu được m gam kết tủa và dung dịch Y. Nhỏ từ từ từng giọt cho đến hết Y vào 100 ml dung dịch HCl 0,5M thu được 0,01 mol khí $CO_{2}$. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 1 mol NaCl vào 1 lít nước, nồng độ ion Na+ và Cl- trong dung dịch sẽ là",
    "re": "1 M"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ và áp suất không đổi, thì năng lượng tự do Gibbs của hệ sẽ",
    "re": "giảm xuống khi phản ứng tiến hành theo chiều thuận"
  },
  {
    "con": "Khi cho 1 mol khí $H_{2}$ phản ứng với 1 mol khí $O_{2}$ trong điều kiện tiêu chuẩn, sản phẩm thu được sẽ là",
    "re": "2 mol nước $H_{2}O$"
  },
  {
    "con": "Nếu pH của dung dịch axit sulfuric $H_{2}SO_{4}$ là 1, thì nồng độ mol của $H_{2}SO_{4}$ trong dung dịch là",
    "re": "0,1 M"
  },
  {
    "con": "Khi cho 1 mol $CaCO_{3}$ vào dung dịch axit clohidric $HCl$, sản phẩm khí thoát ra sẽ là",
    "re": "CO2"
  },
  {
    "con": "Nếu một dung dịch có nồng độ 0,5 M $NaOH$ được pha loãng gấp 2 lần, thì nồng độ mới của dung dịch sẽ là",
    "re": "0,25 M"
  },
  {
    "con": "Khi đun nóng 1 mol $NH_{4}Cl$, sản phẩm thu được sẽ là",
    "re": "1 mol $NH_{3}$ và 1 mol $HCl$"
  },
  {
    "con": "Nếu 2 mol $C_{2}H_{5}OH$ phản ứng với 3 mol $O_{2}$, thì sản phẩm thu được sẽ là",
    "re": "4 mol $CO_{2}$ và 6 mol $H_{2}O$"
  },
  {
    "con": "Khi cho 1 mol $Fe$ vào dung dịch $CuSO_{4}$, thì phản ứng xảy ra sẽ tạo ra",
    "re": "1 mol $Cu$ và 1 mol $FeSO_{4}$"
  },
  {
    "con": "Khi phân tích một loại chất béo (kí hiệu là X) chứa đồng thời các triglixerit và axit béo tự do (không có tạp chất khác) thấy oxi chiếm 10,88% theo khối lượng. Xà phòng hóa hoàn toàn m gam X bằng dung dịch NaOH dư đun nóng, sau phản ứng thu được dung dịch chứa 103,3 gam hỗn hợp các muối $C_{17}H_{35}COONa$, $C_{17}H_{33}COONa$, $C_{17}H_{31}COONa$ và 10,12 gam glixerol. Mặt khác, m gam X phản ứng tối đa với y mol $Br_{2}$ trong dung dịch. Giá trị của y là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một dung dịch axit mạnh như HCl được pha loãng, pH của dung dịch sẽ tăng lên",
    "re": "Dung dịch trở nên ít axit hơn"
  },
  {
    "con": "Khi một kim loại phản ứng với axit, sản phẩm tạo thành sẽ là muối và khí hidro",
    "re": "Kim loại sẽ bị oxi hóa"
  },
  {
    "con": "Khi nhiệt độ của một phản ứng hóa học tăng lên, tốc độ phản ứng thường sẽ tăng",
    "re": "Phản ứng sẽ xảy ra nhanh hơn"
  },
  {
    "con": "Khi một chất điện ly hoàn toàn trong nước, nó sẽ phân ly thành các ion",
    "re": "Dung dịch sẽ dẫn điện tốt"
  },
  {
    "con": "Khi một chất có độ tan thấp trong nước, nó sẽ không hòa tan nhiều trong dung dịch",
    "re": "Nồng độ của chất trong dung dịch sẽ thấp"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện áp suất cao, thể tích sản phẩm có thể giảm",
    "re": "Phản ứng sẽ có xu hướng chuyển dịch về phía có ít phân tử hơn"
  },
  {
    "con": "Khi một dung dịch có pH = 7, nó được coi là trung tính",
    "re": "Dung dịch không có tính axit hay bazơ"
  },
  {
    "con": "Khi một chất phản ứng với oxy, nó sẽ trải qua quá trình oxi hóa",
    "re": "Chất đó sẽ mất electron"
  },
  {
    "con": "Khi một dung dịch bazơ được trung hòa bằng axit, sản phẩm tạo thành sẽ là muối và nước",
    "re": "pH của dung dịch sẽ trở về gần 7"
  },
  {
    "con": "Canxi cacbonat được dùng sản xuất vôi, thủy tinh, xi măng. Công thức của canxi cacbonat là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là dung môi phổ biến nhất trong hóa học. Công thức hóa học của nước là",
    "re": "H2O"
  },
  {
    "con": "Khi axit phản ứng với bazơ, sản phẩm tạo thành là muối và nước. Phản ứng này được gọi là",
    "re": "Phản ứng trung hòa"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có tính chất hóa học tương tự nhau. Ví dụ, các nguyên tố nhóm 1 là",
    "re": "Kim loại kiềm"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng lên. Điều này là do",
    "re": "Tăng năng lượng va chạm giữa các phân tử"
  },
  {
    "con": "Khi một chất tan trong nước, nó có thể tạo ra ion. Chất này được gọi là",
    "re": "Chất điện ly"
  },
  {
    "con": "Trong phản ứng oxi hóa khử, chất bị oxi hóa sẽ mất electron. Chất này được gọi là",
    "re": "Chất khử"
  },
  {
    "con": "Khi một chất rắn hòa tan trong dung môi, nó tạo thành dung dịch. Dung dịch này có thể được gọi là",
    "re": "Dung dịch đồng nhất"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm. Đây là nguyên tắc của",
    "re": "Bảo toàn khối lượng"
  },
  {
    "con": "Khi một chất có nhiệt độ nóng chảy thấp hơn nhiệt độ phòng, nó thường tồn tại ở trạng thái",
    "re": "Chất lỏng hoặc khí"
  },
  {
    "con": "Kim loại nào sau đây có tính khử mạnh nhất?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là NaCl,",
    "re": "thì nó là muối ăn."
  },
  {
    "con": "Nếu pH của dung dịch là 7,",
    "re": "thì dung dịch đó được coi là trung tính."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và năng lượng được giải phóng,",
    "re": "thì phản ứng đó là phản ứng tỏa nhiệt."
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước,",
    "re": "thì chất đó sẽ bay hơi ở nhiệt độ phòng."
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao,",
    "re": "thì nó có khả năng dẫn điện tốt hơn."
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6,",
    "re": "thì nguyên tố đó là carbon."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí,",
    "re": "thì sản phẩm có thể là rượu hoặc axit lactic."
  },
  {
    "con": "Nếu một chất có tính axit mạnh,",
    "re": "thì nó sẽ có khả năng ion hóa cao trong nước."
  },
  {
    "con": "Nếu một hợp chất hữu cơ chứa nhóm chức -OH,",
    "re": "thì nó được gọi là ancol."
  },
  {
    "con": "Chất X có công thức Fe(NO_{3})_{3}. Tên gọi của X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất Y có công thức H_{2}O. Tên gọi của Y là",
    "re": "nước"
  },
  {
    "con": "Chất Z có công thức NaCl. Tên gọi của Z là",
    "re": "muối ăn"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì",
    "re": "tốc độ phản ứng thường tăng"
  },
  {
    "con": "Nếu pH của dung dịch là 7, thì dung dịch đó được coi là",
    "re": "trung tính"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C, thì chất đó có thể là",
    "re": "chất lỏng ở nhiệt độ phòng"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, thì nguyên tố đó là",
    "re": "carbon"
  },
  {
    "con": "Nếu một phản ứng hóa học tỏa nhiệt, thì phản ứng đó được gọi là",
    "re": "phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol là 1M, thì nồng độ của dung dịch đó là",
    "re": "1 mol chất tan trong 1 lít dung môi"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử là C_{2}H_{6}, thì chất đó là",
    "re": "ethane"
  },
  {
    "con": "Dung dịch nào sau đây làm quỳ tím chuyển sang màu xanh?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi cao hơn nước,",
    "re": "chất đó sẽ tồn tại ở trạng thái lỏng hoặc rắn ở nhiệt độ phòng."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao,",
    "re": "thì tốc độ phản ứng sẽ tăng lên."
  },
  {
    "con": "Nếu một dung dịch có pH < 7,",
    "re": "thì dung dịch đó là axit."
  },
  {
    "con": "Nếu một chất có khối lượng mol lớn hơn 100 g/mol,",
    "re": "thì chất đó thường có tính chất khác biệt so với các chất có khối lượng mol nhỏ hơn."
  },
  {
    "con": "Nếu một nguyên tố có số electron hóa trị là 1,",
    "re": "thì nguyên tố đó thường thuộc nhóm kim loại kiềm."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt,",
    "re": "thì năng lượng được giải phóng ra môi trường."
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước,",
    "re": "thì chất đó thường là muối hoặc đường."
  },
  {
    "con": "Nếu một hợp chất có liên kết ion,",
    "re": "thì hợp chất đó thường có điểm nóng chảy cao."
  },
  {
    "con": "Nếu một phản ứng xảy ra trong môi trường không có oxy,",
    "re": "thì đó có thể là phản ứng lên men."
  },
  {
    "con": "Sắt có số oxi hóa +3 trong hợp chất nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học H2O?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi axit hydrochloric (HCl) phản ứng với natri hydroxide (NaOH), sản phẩm tạo thành là muối và nước?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất chứa nguyên tố carbon và hydro, thì nó có thể là một hydrocarbon?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7, thì chất đó được coi là axit?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một nguyên tố có số oxi hóa -2, thì nó thường là một nguyên tố phi kim?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kín, thì khối lượng tổng thể của hệ thống sẽ không thay đổi?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất rắn tan trong nước, thì nó có thể tạo thành dung dịch?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì nó có thể diễn ra theo cả hai chiều?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Dung dịch nào sau đây có pH > 7?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất nào có công thức hóa học là H2O?",
    "re": "Đó là nước"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao?",
    "re": "Thì tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước?",
    "re": "Thì chất đó được gọi là chất tan"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6?",
    "re": "Thì nguyên tố đó là Carbon"
  },
  {
    "con": "Nếu một dung dịch có nồng độ molarity cao?",
    "re": "Thì dung dịch đó có khả năng dẫn điện tốt hơn"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt?",
    "re": "Thì nó giải phóng năng lượng dưới dạng nhiệt"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp?",
    "re": "Thì chất đó thường có lực liên kết yếu"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là NaCl?",
    "re": "Thì đó là muối ăn"
  },
  {
    "con": "Nếu một nguyên tố có tính kim loại mạnh?",
    "re": "Thì nó có khả năng nhường electron dễ dàng"
  },
  {
    "con": "Kim loại nào sau đây điều chế được bằng phương pháp thủy luyện?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là NaCl, thì nó được gọi là gì?",
    "re": "Muối ăn"
  },
  {
    "con": "Nếu pH của dung dịch là 7, thì dung dịch đó được coi là gì?",
    "re": "Trung tính"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì nó thường là loại phản ứng nào?",
    "re": "Phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, thì nguyên tố đó là gì?",
    "re": "Cacbon"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol là 1M, thì nó có bao nhiêu mol chất tan trong 1 lít dung dịch?",
    "re": "1 mol"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra giữa axit và bazơ, thì sản phẩm chính của phản ứng đó là gì?",
    "re": "Muối và nước"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C, thì nó có thể được phân loại là gì?",
    "re": "Chất lỏng dễ bay hơi"
  },
  {
    "con": "Nếu một nguyên tố có cấu hình electron là 1s² 2s² 2p⁶ 3s², thì nguyên tố đó là gì?",
    "re": "Magie"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra theo phương trình cân bằng, thì tổng số mol chất phản ứng phải bằng bao nhiêu?",
    "re": "Tổng số mol chất sản phẩm"
  },
  {
    "con": "Kim loại nào sau đây tác dụng với dung dịch H_{2}SO_{4} loãng sinh ra khí H_{2}?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là NaCl, thì nó được tạo thành từ ion Na^{+} và Cl^{-}.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu nhiệt độ của một chất tăng lên, thì động năng của các phân tử trong chất đó cũng tăng lên.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện không có không khí, thì nó được gọi là phản ứng yếm khí.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu pH của dung dịch là 7, thì dung dịch đó được coi là trung tính.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước, thì nó thường là một chất ion.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học tỏa nhiệt, thì nó được gọi là phản ứng tỏa nhiệt.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp, thì nó thường có lực liên kết giữa các phân tử yếu.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao, thì số lượng mol của chất tan trong dung dịch đó cũng cao.",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6, thì nó là nguyên tố cacbon (C).",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất nào sau đây được dùng để làm mềm nước cứng có tính cứng vĩnh cửu?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng thường tăng lên",
    "re": "Điều này xảy ra do năng lượng va chạm giữa các phân tử tăng lên"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7 thì chất đó được coi là axit",
    "re": "Chất đó có khả năng cho proton (H+) vào dung dịch"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín thì khối lượng tổng thể của hệ thống sẽ không thay đổi",
    "re": "Điều này tuân theo định luật bảo toàn khối lượng"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng thì chất đó có khả năng quay vòng ánh sáng phân cực",
    "re": "Chất đó được gọi là chất quang hoạt"
  },
  {
    "con": "Nếu nồng độ của một chất trong dung dịch tăng lên thì áp suất hơi của dung dịch sẽ giảm",
    "re": "Điều này xảy ra do sự cạnh tranh giữa các phân tử chất tan và chất lỏng"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit thì sản phẩm của phản ứng thường là muối và khí hydro",
    "re": "Điều này đúng với hầu hết các kim loại hoạt động"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch thì có thể xảy ra cả hai chiều",
    "re": "Điều này có nghĩa là sản phẩm có thể chuyển đổi trở lại thành phản ứng ban đầu"
  },
  {
    "con": "Nếu một dung dịch có nồng độ ion hydroxide (OH-) cao thì dung dịch đó có tính kiềm",
    "re": "Điều này dẫn đến độ pH cao hơn 7"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng thì chất đó sẽ tồn tại ở trạng thái khí",
    "re": "Điều này đúng trong điều kiện áp suất khí quyển"
  },
  {
    "con": "Số nguyên tử cacbon trong phân tử fructozơ là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ sôi của nước là 100 độ C ở áp suất 1 atm",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Phản ứng giữa axit và bazơ sẽ tạo ra muối và nước",
    "re": "Đây là phản ứng trung hòa"
  },
  {
    "con": "Số nguyên tử trong một phân tử nước là 3",
    "re": "Câu trả lời đúng là H2O"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng",
    "re": "Do năng lượng va chạm giữa các phân tử tăng lên"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7",
    "re": "Chất đó được coi là axit"
  },
  {
    "con": "Khi một kim loại phản ứng với axit",
    "re": "Sẽ tạo ra khí hydro và muối"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao",
    "re": "Thì nó có khả năng dẫn điện tốt hơn"
  },
  {
    "con": "Phản ứng oxi hóa khử xảy ra khi có sự chuyển giao electron",
    "re": "Một chất bị oxi hóa và một chất bị khử"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng",
    "re": "Thì nó có thể có đồng phân quang học"
  },
  {
    "con": "Khí sunfurơ là khí độc, khí thải ra môi trường",
    "re": "gây ô nhiễm không khí. Công thức của khí sunfurơ là SO2"
  },
  {
    "con": "Nước là dung môi phổ biến trong hóa học",
    "re": "có khả năng hòa tan nhiều chất khác nhau"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng",
    "re": "do các phân tử có năng lượng cao hơn và va chạm nhiều hơn"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có tính chất hóa học tương tự",
    "re": "do chúng có cùng số electron ở lớp ngoài cùng"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7",
    "re": "dung dịch trở thành axit"
  },
  {
    "con": "Khi một chất bị oxi hóa, nó mất electron",
    "re": "và có thể làm tăng số oxi hóa của nó"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, năng lượng có thể được giải phóng hoặc hấp thụ",
    "re": "tùy thuộc vào loại phản ứng đó là tỏa nhiệt hay thu nhiệt"
  },
  {
    "con": "Các ion dương và ion âm trong dung dịch có thể dẫn điện",
    "re": "do sự di chuyển của các ion trong dung dịch"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước, nó có thể tạo ra dung dịch",
    "re": "và làm thay đổi tính chất vật lý của nước"
  },
  {
    "con": "Khi một phản ứng hóa học đạt đến trạng thái cân bằng",
    "re": "tốc độ phản ứng thuận và phản ứng nghịch bằng nhau"
  },
  {
    "con": "Ở nhiệt độ thường, kim loại Fe tác dụng được với dung dịch nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi axit clohidric (HCl) tác dụng với natri hidroxit (NaOH),",
    "re": "sẽ tạo ra muối natri clorua (NaCl) và nước (H2O)"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường",
    "re": "sẽ tăng lên do năng lượng va chạm giữa các phân tử tăng"
  },
  {
    "con": "Trong phản ứng phân hủy, một hợp chất sẽ",
    "re": "tách thành hai hoặc nhiều chất đơn giản hơn"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7, dung dịch đó",
    "re": "sẽ trở thành dung dịch axit"
  },
  {
    "con": "Khi một kim loại phản ứng với oxy, sản phẩm tạo thành thường là",
    "re": "oxit của kim loại đó"
  },
  {
    "con": "Khi dung dịch chứa ion bạc (Ag+) tiếp xúc với ion clorua (Cl-),",
    "re": "sẽ tạo ra kết tủa clorua bạc (AgCl)"
  },
  {
    "con": "Trong phản ứng trao đổi ion, các ion sẽ",
    "re": "thay đổi vị trí cho nhau giữa các hợp chất"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước,",
    "re": "nó sẽ tạo thành dung dịch nếu chất đó tan được"
  },
  {
    "con": "Khi nhiệt độ của một khí tăng lên, thể tích của khí đó",
    "re": "sẽ tăng theo định luật Charles nếu áp suất không đổi"
  },
  {
    "con": "Chất nào sau đây tác dụng với dung dịch KHCO3 sinh ra khí CO_{2}?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong phản ứng hóa học thì tốc độ phản ứng sẽ tăng lên.",
    "re": "Điều này đúng"
  },
  {
    "con": "Chất điện ly mạnh trong dung dịch thì sẽ phân ly hoàn toàn thành ion.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu pH của dung dịch giảm thì nồng độ ion H^+ trong dung dịch tăng lên.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín thì năng lượng tổng quát sẽ được bảo toàn.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước thì nó sẽ dễ dàng phân tán trong dung dịch.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một phản ứng xảy ra với sự tham gia của chất xúc tác thì năng lượng kích hoạt sẽ giảm.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu nồng độ của các chất phản ứng tăng lên thì tốc độ phản ứng sẽ tăng lên.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử phức tạp thì nó có thể có nhiều tính chất hóa học khác nhau.",
    "re": "Điều này đúng"
  },
  {
    "con": "Nếu nhiệt độ của một chất lỏng tăng lên thì áp suất hơi của nó cũng sẽ tăng lên.",
    "re": "Điều này đúng"
  },
  {
    "con": "Polime nào sau đây được điều chế bằng phản ứng trùng ngưng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch?",
    "re": "Phản ứng sẽ chuyển dịch theo chiều tỏa nhiệt"
  },
  {
    "con": "Một dung dịch có pH < 7?",
    "re": "Dung dịch đó là axit"
  },
  {
    "con": "Một nguyên tố có số hiệu nguyên tử cao hơn 92?",
    "re": "Nguyên tố đó là một nguyên tố phóng xạ"
  },
  {
    "con": "Khi một kim loại phản ứng với axit?",
    "re": "Sẽ tạo ra muối và khí hidro"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên?",
    "re": "Độ dẫn điện của dung dịch sẽ tăng lên"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện áp suất cao?",
    "re": "Phản ứng sẽ có xu hướng chuyển dịch về phía có ít phân tử khí hơn"
  },
  {
    "con": "Một hợp chất có công thức hóa học C2H6?",
    "re": "Hợp chất đó là etan"
  },
  {
    "con": "Khi một chất rắn tan trong nước?",
    "re": "Sẽ tạo ra dung dịch"
  },
  {
    "con": "Khi nhiệt độ của một chất khí giảm?",
    "re": "Áp suất của chất khí đó sẽ giảm nếu thể tích không đổi"
  },
  {
    "con": "Ở điều kiện thường, chất nào sau đây làm mất màu dung dịch Br_{2}?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một axit phản ứng với một bazơ, sản phẩm tạo thành là gì?",
    "re": "Muối và nước"
  },
  {
    "con": "Nếu nhiệt độ tăng lên trong một phản ứng hóa học, thì tốc độ phản ứng sẽ như thế nào?",
    "re": "Tăng lên"
  },
  {
    "con": "Khi một chất điện phân được hòa tan trong nước, thì nó sẽ tạo ra gì?",
    "re": "Các ion tự do"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7, thì chất đó được phân loại là gì?",
    "re": "Axit"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện kín, thì năng lượng tổng quát của hệ sẽ như thế nào?",
    "re": "Giữ nguyên"
  },
  {
    "con": "Nếu một chất có khối lượng mol lớn hơn 100 g/mol, thì nó sẽ có đặc điểm gì?",
    "re": "Khó bay hơi hơn"
  },
  {
    "con": "Khi một dung dịch có nồng độ cao được pha loãng, thì nồng độ của dung dịch sẽ như thế nào?",
    "re": "Giảm xuống"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì nó có thể xảy ra theo chiều nào?",
    "re": "Cả hai chiều"
  },
  {
    "con": "Khi một kim loại phản ứng với axit, thì sản phẩm tạo thành sẽ là gì?",
    "re": "Muối và khí hidro"
  },
  {
    "con": "Số nhóm amino (NH_{2}) trong phân tử alanin là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên thì tốc độ phản ứng hóa học",
    "re": "tăng lên"
  },
  {
    "con": "Số mol của chất trong một dung dịch thì nồng độ của dung dịch đó",
    "re": "tăng lên"
  },
  {
    "con": "Phản ứng giữa axit và bazơ thì sản phẩm tạo ra",
    "re": "muối và nước"
  },
  {
    "con": "Khối lượng mol của một chất thì số mol của chất đó trong 1g",
    "re": "bằng 1/khối lượng mol"
  },
  {
    "con": "Số electron trong lớp vỏ ngoài cùng của nguyên tử thì tính chất hóa học của nguyên tử đó",
    "re": "được xác định"
  },
  {
    "con": "Sự hòa tan của một chất rắn trong nước thì nhiệt độ tăng lên",
    "re": "có thể làm tăng tốc độ hòa tan"
  },
  {
    "con": "Số lượng nguyên tử trong một phân tử thì khối lượng phân tử",
    "re": "tăng lên"
  },
  {
    "con": "Sự thay đổi pH trong dung dịch thì tính axit hoặc bazơ của dung dịch đó",
    "re": "thay đổi"
  },
  {
    "con": "Nồng độ của một dung dịch thì áp suất hơi của dung dịch đó",
    "re": "giảm xuống"
  },
  {
    "con": "Thủy phân tristearin ((C _{17}H _{35}COO) _{3}C _{3}H _{5}) trong dung dịch NaOH, thu được muối có công thức là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất rắn tan trong nước, nếu nó tạo thành dung dịch trong suốt thì chất đó được gọi là",
    "re": "chất tan"
  },
  {
    "con": "Nếu nhiệt độ của một phản ứng hóa học tăng lên, thì tốc độ phản ứng",
    "re": "thường tăng lên"
  },
  {
    "con": "Khi một axit phản ứng với một bazơ, nếu sản phẩm tạo thành là nước và muối thì phản ứng đó được gọi là",
    "re": "phản ứng trung hòa"
  },
  {
    "con": "Nếu một chất có độ pH nhỏ hơn 7, thì chất đó được coi là",
    "re": "axit"
  },
  {
    "con": "Khi một nguyên tố có số oxi hóa tăng lên trong phản ứng hóa học, thì nguyên tố đó",
    "re": "bị oxi hóa"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao hơn dung dịch khác, thì dung dịch đó được gọi là",
    "re": "dung dịch đậm đặc"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện áp suất cao, thì thể tích của sản phẩm",
    "re": "có thể giảm"
  },
  {
    "con": "Nếu một chất khí được làm lạnh đến nhiệt độ thấp, thì chất đó có thể",
    "re": "ngưng tụ thành lỏng"
  },
  {
    "con": "Khi một ion dương kết hợp với một ion âm, thì chúng tạo thành",
    "re": "một hợp chất ion"
  },
  {
    "con": "Tên gọi của este HCOOCH _{3} là",
    "re": "metyl format"
  },
  {
    "con": "Nhiệt độ sôi của nước là",
    "re": "100 độ C ở áp suất 1 atm"
  },
  {
    "con": "Phản ứng giữa axit và bazơ tạo ra",
    "re": "muối và nước"
  },
  {
    "con": "Khối lượng mol của nước là",
    "re": "18 g/mol"
  },
  {
    "con": "Khi pH của dung dịch nhỏ hơn 7 thì",
    "re": "dung dịch đó là axit"
  },
  {
    "con": "Khi một chất bị oxi hóa thì",
    "re": "nó mất electron"
  },
  {
    "con": "Trong phản ứng tổng hợp, các chất phản ứng kết hợp lại để tạo ra",
    "re": "một sản phẩm mới"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường",
    "re": "tăng lên"
  },
  {
    "con": "Chất điện ly mạnh là",
    "re": "chất hoàn toàn phân ly trong dung môi"
  },
  {
    "con": "Trong bảng tuần hoàn, các nguyên tố cùng nhóm có",
    "re": "tính chất hóa học tương tự"
  },
  {
    "con": "Dung dịch nào sau đây tác dụng được với Al(OH) _{3}?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là NaCl,",
    "re": "thì nó là muối natri clorua."
  },
  {
    "con": "Nếu nhiệt độ của một phản ứng hóa học tăng lên,",
    "re": "thì tốc độ phản ứng thường tăng lên."
  },
  {
    "con": "Nếu một dung dịch có pH < 7,",
    "re": "thì dung dịch đó được coi là axit."
  },
  {
    "con": "Nếu một nguyên tố có số oxi hóa là +2,",
    "re": "thì nó có khả năng mất hai electron."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kiềm,",
    "re": "thì sản phẩm có thể là muối và nước."
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C,",
    "re": "thì nó có thể tồn tại ở trạng thái lỏng ở nhiệt độ phòng."
  },
  {
    "con": "Nếu một hợp chất hữu cơ chứa nhóm chức -OH,",
    "re": "thì nó được gọi là rượu."
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch,",
    "re": "thì nó có thể diễn ra theo cả hai chiều."
  },
  {
    "con": "Nếu một nguyên tố có cấu hình electron là 1s² 2s² 2p⁶,",
    "re": "thì nó là nguyên tố khí hiếm neon."
  },
  {
    "con": "Kim loại nào sau đây là kim loại kiềm?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất chứa ion hydroxide (OH-),",
    "re": "thì hợp chất đó có thể là một bazơ."
  },
  {
    "con": "Nếu nhiệt độ của một phản ứng hóa học tăng lên,",
    "re": "thì tốc độ phản ứng thường sẽ tăng."
  },
  {
    "con": "Nếu một chất có độ pH dưới 7,",
    "re": "thì chất đó được coi là axit."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kín,",
    "re": "thì khối lượng tổng thể của hệ thống sẽ không thay đổi."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng,",
    "re": "thì chất đó có thể có đồng phân quang học."
  },
  {
    "con": "Nếu một kim loại phản ứng với axit,",
    "re": "thì sản phẩm sẽ bao gồm muối và khí hydro."
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao,",
    "re": "thì khả năng dẫn điện của dung dịch đó thường cao."
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước,",
    "re": "thì chất đó sẽ bay hơi dễ dàng hơn trong điều kiện thường."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt,",
    "re": "thì năng lượng được giải phóng ra môi trường."
  },
  {
    "con": "Phát biểu nào sau đây sai?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "thường làm tăng tốc độ phản ứng"
  },
  {
    "con": "Một chất có độ pH dưới 7",
    "re": "là một axit"
  },
  {
    "con": "Khi một chất phản ứng với oxy",
    "re": "thường tạo ra nhiệt và ánh sáng"
  },
  {
    "con": "Số mol của một chất trong một dung dịch",
    "re": "tỉ lệ thuận với nồng độ và thể tích của dung dịch"
  },
  {
    "con": "Khi một chất điện ly hoàn toàn trong nước",
    "re": "nó sẽ tạo ra các ion tự do"
  },
  {
    "con": "Khi nhiệt độ giảm xuống",
    "re": "khả năng hòa tan của khí trong chất lỏng thường tăng lên"
  },
  {
    "con": "Một phản ứng hóa học xảy ra trong điều kiện áp suất cao",
    "re": "có thể làm tăng tốc độ phản ứng nếu có sự thay đổi về thể tích"
  },
  {
    "con": "Khi một chất bị oxi hóa",
    "re": "nó sẽ mất electron"
  },
  {
    "con": "Khi một phản ứng hóa học đạt đến trạng thái cân bằng",
    "re": "tốc độ phản ứng thuận và phản ứng nghịch bằng nhau"
  },
  {
    "con": "Cho 0,75 gam H _{2}NCH _{2}COOH tác dụng hết với dung dịch NaOH, thu được dung dịch chứa m gam muối. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất rắn được hòa tan trong nước, nếu chất đó là muối, thì dung dịch sẽ dẫn điện",
    "re": "Đúng"
  },
  {
    "con": "Nếu nhiệt độ của một phản ứng hóa học tăng lên, thì tốc độ phản ứng sẽ thường tăng",
    "re": "Đúng"
  },
  {
    "con": "Khi một axit tác dụng với một bazơ, nếu phản ứng xảy ra hoàn toàn, thì sản phẩm cuối cùng sẽ là muối và nước",
    "re": "Đúng"
  },
  {
    "con": "Nếu một chất có độ pH nhỏ hơn 7, thì chất đó được coi là axit",
    "re": "Đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí, thì sản phẩm có thể khác với phản ứng xảy ra trong điều kiện có oxy",
    "re": "Đúng"
  },
  {
    "con": "Khi một dung dịch có nồng độ mol cao hơn được pha loãng, nếu thể tích tăng lên, thì nồng độ mol sẽ giảm",
    "re": "Đúng"
  },
  {
    "con": "Nếu một nguyên tố có số oxi hóa cao nhất là +7, thì nguyên tố đó có khả năng oxy hóa mạnh",
    "re": "Đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì có thể xảy ra cả hai chiều phản ứng",
    "re": "Đúng"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng, thì chất đó có thể có đồng phân quang học",
    "re": "Đúng"
  },
  {
    "con": "Có bao nhiêu tơ tổng hợp trong các tơ: capron, xenlulozơ axetat, visco, nilon-6,6?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ sôi của nước là 100 độ C ở áp suất 1 atm",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Khi một axit phản ứng với một bazơ",
    "re": "Sẽ tạo ra muối và nước"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7",
    "re": "Chất đó được coi là axit"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao",
    "re": "Tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Nếu một chất có khối lượng mol lớn hơn 100 g/mol",
    "re": "Chất đó thường có tính chất vật lý khác biệt so với các chất có khối lượng mol nhỏ hơn"
  },
  {
    "con": "Khi một ion dương kết hợp với một ion âm",
    "re": "Sẽ tạo thành một hợp chất ion"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch",
    "re": "Phản ứng có thể diễn ra theo cả hai chiều"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng",
    "re": "Tốc độ phản ứng có thể tăng lên nếu phản ứng phụ thuộc vào nồng độ"
  },
  {
    "con": "Nếu một chất có tính oxi hóa mạnh",
    "re": "Chất đó có khả năng nhận electron từ chất khác"
  },
  {
    "con": "Khi đốt cháy hoàn toàn 8,64 gam hỗn hợp glucozơ và saccarozơ cần vừa đủ 0,3 mol O _{2}, thu được CO _{2} và m gam H _{2}O. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 10 gam NaCl vào 100 ml nước, nồng độ mol của dung dịch NaCl là",
    "re": "0,17 M"
  },
  {
    "con": "Khi cho 2 mol H _{2} và 1 mol O _{2} phản ứng với nhau, sản phẩm thu được là",
    "re": "2 mol H _{2}O"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường",
    "re": "tăng lên"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7, dung dịch đó được coi là",
    "re": "axit"
  },
  {
    "con": "Khi cho 1 mol axit clohidric (HCl) vào 1 mol natri hydroxide (NaOH), sản phẩm thu được là",
    "re": "1 mol natri clorua (NaCl) và nước"
  },
  {
    "con": "Khi một kim loại phản ứng với axit, sản phẩm thường là",
    "re": "muối và khí hidro"
  },
  {
    "con": "Khi một dung dịch có nồng độ ion H^+ cao, tính chất của dung dịch đó là",
    "re": "mạnh"
  },
  {
    "con": "Khi một chất rắn tan trong nước, quá trình này được gọi là",
    "re": "hòa tan"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện áp suất cao, sản phẩm thường là",
    "re": "khác biệt so với điều kiện áp suất thấp"
  },
  {
    "con": "Cho dung dịch KOH dư vào dung dịch gồm FeCl _{2} và FeCl _{3}, thu được kết tủa X. Cho X tác dụng với dung dịch HNO_{3} dư, thu được dung dịch chứa muối",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu cho axit clohidric HCl vào dung dịch natri hydroxide NaOH, sẽ xảy ra phản ứng trung hòa",
    "re": "Sản phẩm là muối natri clorua và nước"
  },
  {
    "con": "Nếu đun nóng dung dịch chứa NaHCO3, sẽ xảy ra phản ứng phân hủy",
    "re": "Sản phẩm là Na2CO3, CO2 và H2O"
  },
  {
    "con": "Nếu cho dung dịch AgNO3 vào dung dịch NaCl, sẽ xuất hiện kết tủa trắng",
    "re": "Kết tủa là AgCl"
  },
  {
    "con": "Nếu cho dung dịch H2SO4 vào dung dịch NaOH, sẽ xảy ra phản ứng tạo muối",
    "re": "Sản phẩm là Na2SO4 và nước"
  },
  {
    "con": "Nếu cho khí CO2 vào dung dịch nước vôi trong, sẽ xảy ra phản ứng tạo kết tủa",
    "re": "Kết tủa là CaCO3"
  },
  {
    "con": "Nếu cho dung dịch HNO3 vào dung dịch Na2CO3, sẽ có khí thoát ra",
    "re": "Khí thoát ra là CO2"
  },
  {
    "con": "Nếu cho dung dịch BaCl2 vào dung dịch Na2SO4, sẽ xuất hiện kết tủa",
    "re": "Kết tủa là BaSO4"
  },
  {
    "con": "Nếu cho dung dịch K2Cr2O7 vào dung dịch FeSO4, sẽ xảy ra phản ứng oxi hóa khử",
    "re": "Ion Cr6+ sẽ được khử thành ion Cr3+"
  },
  {
    "con": "Nếu cho dung dịch NH4Cl vào dung dịch NaOH, sẽ có khí thoát ra",
    "re": "Khí thoát ra là NH3"
  },
  {
    "con": "Phát biểu nào sau đây đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch",
    "re": "Phản ứng sẽ dịch chuyển theo chiều tỏa nhiệt"
  },
  {
    "con": "Số mol của một chất trong dung dịch được tính bằng",
    "re": "Nồng độ mol nhân với thể tích dung dịch"
  },
  {
    "con": "Khi pH của dung dịch giảm",
    "re": "Nồng độ ion H+ trong dung dịch tăng lên"
  },
  {
    "con": "Khi một kim loại phản ứng với axit",
    "re": "Sẽ sinh ra khí hidro và muối"
  },
  {
    "con": "Trong phản ứng oxi hóa khử, chất bị oxi hóa",
    "re": "Sẽ mất electron"
  },
  {
    "con": "Khi nhiệt độ của một chất lỏng tăng lên",
    "re": "Áp suất hơi của chất lỏng cũng tăng lên"
  },
  {
    "con": "Khi một chất tan trong nước",
    "re": "Nó sẽ phân ly thành ion nếu đó là muối hoặc axit"
  },
  {
    "con": "Trong phản ứng tổng hợp, hai hay nhiều chất phản ứng",
    "re": "Sẽ tạo ra một sản phẩm mới"
  },
  {
    "con": "Khi nồng độ của một chất trong phản ứng tăng lên",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Cho mẩu natri vào ống nghiệm đựng 3ml chất lỏng X, thấy natri tan dần và có khí thoát ra. Chất X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan muối ăn (NaCl) vào nước, thấy dung dịch trở nên trong suốt. Dung dịch này là",
    "re": "Dung dịch điện ly"
  },
  {
    "con": "Khi đun nóng nước đến 100 độ C, nước sẽ chuyển thành",
    "re": "Hơi nước"
  },
  {
    "con": "Khi cho axit clohidric (HCl) vào dung dịch natri bicarbonat (NaHCO3), thấy có bọt khí thoát ra. Phản ứng này tạo ra",
    "re": "Khí carbon dioxide (CO2)"
  },
  {
    "con": "Khi cho phenol vào dung dịch brom, thấy dung dịch chuyển màu. Phản ứng này cho thấy phenol có",
    "re": "Tính chất khử"
  },
  {
    "con": "Khi cho dung dịch kali hydroxide (KOH) vào dung dịch axit sulfuric (H2SO4), sẽ xảy ra phản ứng trung hòa tạo ra",
    "re": "Nước và muối kali sulfate (K2SO4)"
  },
  {
    "con": "Khi đun nóng đồng(II) oxit (CuO) với carbon, đồng sẽ được khôi phục thành",
    "re": "Kim loại đồng (Cu)"
  },
  {
    "con": "Khi cho dung dịch axit nitric (HNO3) vào kim loại đồng (Cu), sẽ xảy ra phản ứng tạo ra",
    "re": "Muối đồng(II) nitrat (Cu(NO3)2)"
  },
  {
    "con": "Khi hòa tan đường vào nước, thấy dung dịch trở nên trong suốt. Điều này cho thấy đường là",
    "re": "Chất tan"
  },
  {
    "con": "Khi cho dung dịch amoniac (NH3) vào dung dịch đồng(II) sulfat (CuSO4), thấy xuất hiện màu xanh đậm. Điều này cho thấy amoniac có",
    "re": "Tính chất tạo phức"
  },
  {
    "con": "Hòa tan hết 2,43 gam Al trong dung dịch NaOH, thu được V ml khí H _{2}  (đktc). Giá trị của V là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi đun nóng 1 mol nước, nhiệt độ của nước sẽ tăng lên 100 độ C, nước sẽ chuyển thành hơi nước.",
    "re": "Quá trình bay hơi xảy ra"
  },
  {
    "con": "Khi cho 1 mol NaCl vào 1 lít nước, dung dịch sẽ có nồng độ 1 mol/lít.",
    "re": "Nồng độ mol của dung dịch là 1 M"
  },
  {
    "con": "Khi phản ứng giữa axit hydrochloric (HCl) và natri hydroxide (NaOH) xảy ra, sản phẩm tạo thành là",
    "re": "Natri clorua (NaCl) và nước (H2O)"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C, thì chất đó sẽ bay hơi ở nhiệt độ phòng.",
    "re": "Chất đó có thể tồn tại ở trạng thái khí"
  },
  {
    "con": "Khi cho 2 mol khí CO2 vào trong 1 lít nước, nồng độ của CO2 trong dung dịch sẽ là",
    "re": "2 mol/lít"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng sẽ",
    "re": "Tăng lên do năng lượng va chạm giữa các phân tử tăng"
  },
  {
    "con": "Khi cho 1 mol axit sulfuric (H2SO4) vào 1 lít nước, nhiệt độ của dung dịch sẽ",
    "re": "Tăng lên do phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7, thì chất đó được coi là",
    "re": "Axit"
  },
  {
    "con": "Khi cho 1 mol khí O2 vào 1 mol khí CH4 trong điều kiện đủ, sản phẩm tạo thành sẽ là",
    "re": "CO2 và H2O"
  },
  {
    "con": "Hòa tan hết 2,04 gam kim loại R (hóa trị II) trong dung dịch H_{2}SO_{4} loãng, thu được 0,085 mol H_{2}. Kim loại R là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi đun nóng 1 mol nước, nhiệt độ của nó sẽ tăng lên 100 độ C ở áp suất 1 atm, nước sẽ chuyển thành",
    "re": "hơi nước"
  },
  {
    "con": "Khi cho 1 mol khí CO vào 1 mol khí O_{2} trong điều kiện tiêu chuẩn, sản phẩm phản ứng sẽ là",
    "re": "1 mol khí CO_{2}"
  },
  {
    "con": "Nếu một dung dịch có pH = 3, thì dung dịch đó được coi là",
    "re": "axit mạnh"
  },
  {
    "con": "Khi hòa tan 58,5 gam NaCl vào 1 lít nước, nồng độ mol của dung dịch NaCl sẽ là",
    "re": "1 mol/lít"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra với tỉ lệ mol 1:2:3, thì số mol của sản phẩm sẽ là",
    "re": "3 lần số mol của chất phản ứng đầu tiên"
  },
  {
    "con": "Khi cho 2 mol H_{2} phản ứng với 1 mol O_{2}, sản phẩm thu được sẽ là",
    "re": "2 mol H_{2}O"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C, thì chất đó có thể được coi là",
    "re": "chất lỏng dễ bay hơi"
  },
  {
    "con": "Khi cho 1 mol axit HCl vào 1 mol NaOH, sản phẩm phản ứng sẽ là",
    "re": "1 mol NaCl và 1 mol nước"
  },
  {
    "con": "Nếu một kim loại có điện cực âm trong phản ứng điện phân, thì kim loại đó sẽ",
    "re": "được giải phóng tại điện cực âm"
  },
  {
    "con": "Polisaccarit X là chất rắn, màu trắng, dạng sợi. Trong bông nõn có gần 98% chất X. Thủy phân X, thu\nđược monosaccarit Y. Phát biểu nào sau đây đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có pH < 7 thì dung dịch đó là axit.",
    "re": "Dung dịch có tính axit"
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn nước thì chất đó có thể là một hợp chất có liên kết hydro mạnh.",
    "re": "Chất có liên kết hydro mạnh"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn các phản ứng ban đầu thì phản ứng đó là phản ứng tỏa nhiệt.",
    "re": "Phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit tạo ra khí hidro thì kim loại đó là kim loại hoạt động.",
    "re": "Kim loại hoạt động"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao hơn thì khả năng dẫn điện của dung dịch đó cũng cao hơn.",
    "re": "Khả năng dẫn điện cao hơn"
  },
  {
    "con": "Nếu một chất có cấu trúc mạng tinh thể thì chất đó thường có điểm nóng chảy cao.",
    "re": "Điểm nóng chảy cao"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao thì tốc độ phản ứng thường tăng lên.",
    "re": "Tốc độ phản ứng tăng lên"
  },
  {
    "con": "Nếu một chất có tính oxi hóa mạnh thì nó có khả năng nhận electron từ chất khác.",
    "re": "Khả năng nhận electron"
  },
  {
    "con": "Nếu một dung dịch có màu xanh lam khi thêm chỉ thị phenolphtalein thì dung dịch đó có tính kiềm.",
    "re": "Dung dịch có tính kiềm"
  },
  {
    "con": "Khi thủy phân hết 3,28 gam hỗn hợp X gồm hai este đơn chức, mạch hở thì cần vừa đủ 0,05 mol NaOH, thu được một muối và hỗn hợp Y gồm hai ancol cùng dãy đồng đẳng. Đốt cháy hết Y trong O_{2} dư, thu được CO_{2} và m gam H_{2}O. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 1 mol NaCl vào 1 lít nước, thì dung dịch thu được có nồng độ mol là",
    "re": "1 M"
  },
  {
    "con": "Khi đốt cháy hoàn toàn 1 mol metan (CH4) trong O2 dư, thì sản phẩm thu được là",
    "re": "CO2 và H2O"
  },
  {
    "con": "Khi cho 1 mol axit clohidric (HCl) tác dụng với 1 mol natri hidroxit (NaOH), thì sản phẩm tạo thành là",
    "re": "1 mol natri clorua (NaCl) và 1 mol nước (H2O)"
  },
  {
    "con": "Khi cho 2 mol axit sulfuric (H2SO4) tác dụng với 1 mol đồng (Cu), thì sản phẩm thu được là",
    "re": "1 mol đồng(II) sulfat (CuSO4) và 1 mol khí hidro (H2)"
  },
  {
    "con": "Khi hòa tan 58,5 gam NaCl vào 1 lít nước, thì nồng độ mol của dung dịch là",
    "re": "1 M"
  },
  {
    "con": "Khi cho 1 mol axit acetic (CH3COOH) tác dụng với 1 mol ancol etylic (C2H5OH), thì sản phẩm thu được là",
    "re": "1 mol este etyl axetat (CH3COOC2H5) và 1 mol nước (H2O)"
  },
  {
    "con": "Khi cho 1 mol canxi cacbonat (CaCO3) tác dụng với 2 mol axit clohidric (HCl), thì sản phẩm thu được là",
    "re": "1 mol canxi clorua (CaCl2), 1 mol khí CO2 và 1 mol nước (H2O)"
  },
  {
    "con": "Khi cho 1 mol kali hidroxit (KOH) tác dụng với 1 mol axit nitric (HNO3), thì sản phẩm thu được là",
    "re": "1 mol kali nitrat (KNO3) và 1 mol nước (H2O)"
  },
  {
    "con": "Khi cho 1 mol amoniac (NH3) tác dụng với 1 mol axit clohidric (HCl), thì sản phẩm thu được là",
    "re": "1 mol amoni clorua (NH4Cl)"
  },
  {
    "con": "Nung nóng m gam hỗn hợp X gồm Mg, Al và Cu trong O_{2} dư, thu được 15,8 gam hỗn hợp Y gồm các oxit. Hòa tan hết Y bằng lượng vừa đủ dung dịch gồm HCl 1M và H_{2}SO_{4} 0,5M, thu được dung dịch chứa 42,8 gam hỗn hợp muối trung hòa. Biết các phản ứng xảy ra hoàn toàn. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 1 mol NaCl vào nước, sẽ tạo ra 1 mol ion Na^+ và 1 mol ion Cl^- trong dung dịch",
    "re": "Dung dịch sẽ dẫn điện tốt"
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn nước, thì chất đó sẽ không bay hơi ở nhiệt độ thường",
    "re": "Chất đó sẽ tồn tại ở trạng thái lỏng hoặc rắn"
  },
  {
    "con": "Khi cho 1 mol H_2 vào 1 mol O_2 và đốt cháy, sẽ tạo ra 2 mol H_2O",
    "re": "Phản ứng sẽ tỏa nhiệt mạnh"
  },
  {
    "con": "Nếu một dung dịch có pH = 7, thì dung dịch đó được coi là trung tính",
    "re": "Nồng độ ion H^+ và OH^- trong dung dịch là bằng nhau"
  },
  {
    "con": "Khi thêm axit vào dung dịch kiềm, sẽ xảy ra phản ứng trung hòa",
    "re": "Sản phẩm của phản ứng là muối và nước"
  },
  {
    "con": "Nếu một kim loại có độ hoạt động hóa học cao, thì nó sẽ dễ dàng phản ứng với axit",
    "re": "Kim loại đó sẽ giải phóng khí H_2"
  },
  {
    "con": "Khi nung nóng CaCO_3, sẽ thu được CaO và CO_2",
    "re": "Phản ứng này là phản ứng phân hủy"
  },
  {
    "con": "Nếu một chất có cấu trúc mạng tinh thể, thì chất đó sẽ có điểm nóng chảy cao",
    "re": "Chất đó thường là rắn ở nhiệt độ phòng"
  },
  {
    "con": "Khi cho dung dịch AgNO_3 vào dung dịch NaCl, sẽ xảy ra phản ứng kết tủa",
    "re": "Sản phẩm kết tủa là AgCl"
  },
  {
    "con": "Thực hiện các thí nghiệm sau:\n(a) Cho hỗn hợp Na và Al (tỉ lệ mol 1 : 1) vào nước (dư).\n(b) Cho hỗn hợp Cu và Fe_{2}O_{3} (tỉ lệ mol tương ứng 2 : 1) vào dung dịch HCl (dư).\n(c) Cho hỗn hợp Ba và NH_{4}HCO_{3} vào nước (dư).\n(d) Cho hỗn hợp Cu và NaNO_{3} (tỉ lệ mol tương ứng 1 : 2) vào dung dịch HCl (dư).\n(e) Cho hỗn hợp BaCO_{3} và KHSO_{4} vào nước (dư).\nKhi phản ứng trong các thí nghiệm trên kết thúc, có bao nhiêu thí nghiệm không thu được chất rắn?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cho một dung dịch NaCl vào dung dịch AgNO_{3}.",
    "re": "Sẽ thu được kết tủa AgCl"
  },
  {
    "con": "Đun nóng dung dịch HCl với Mg.",
    "re": "Sẽ tạo ra khí H_{2} và dung dịch MgCl_{2}"
  },
  {
    "con": "Cho dung dịch NaOH vào dung dịch H_{2}SO_{4}.",
    "re": "Sẽ tạo ra muối Na_{2}SO_{4} và nước"
  },
  {
    "con": "Cho dung dịch HCl vào bột CaCO_{3}.",
    "re": "Sẽ tạo ra khí CO_{2} và dung dịch CaCl_{2}"
  },
  {
    "con": "Cho dung dịch Ba(OH)_{2} vào dung dịch NH_{4}Cl.",
    "re": "Sẽ tạo ra khí NH_{3} và dung dịch BaCl_{2}"
  },
  {
    "con": "Cho dung dịch KNO_{3} vào dung dịch BaCl_{2}.",
    "re": "Sẽ không có phản ứng xảy ra"
  },
  {
    "con": "Cho bột Fe vào dung dịch CuSO_{4}.",
    "re": "Sẽ xảy ra phản ứng và tạo ra bột Cu"
  },
  {
    "con": "Cho dung dịch HNO_{3} vào bột Zn.",
    "re": "Sẽ tạo ra khí H_{2} và dung dịch Zn(NO_{3})_{2}"
  },
  {
    "con": "Cho dung dịch NaHCO_{3} vào dung dịch HCl.",
    "re": "Sẽ tạo ra khí CO_{2} và dung dịch NaCl"
  },
  {
    "con": "Cho các phát biểu sau:\n(a) Nước quả chanh khử được mùi tanh của cá.\n(b) Fructozơ là monosaccarit duy nhất có trong mật ong.\n(c) Một số este hòa tan tốt nhiều chất hữu cơ nên được dùng làm dung môi.\n(e) Vải làm từ tơ nilon-6,6 bền trong môi trường bazơ hoặc môi trường axit.\n(d) Sản phẩm của phản ứng thủy phân saccarozơ được dùng trong kĩ thuật tráng gương\nSố phát biểu đúng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Một chất có độ pH dưới 7",
    "re": "là một axit"
  },
  {
    "con": "Khi một kim loại phản ứng với axit",
    "re": "sẽ tạo ra khí hidro"
  },
  {
    "con": "Khi dung dịch muối natri clorua được điện phân",
    "re": "sẽ tạo ra khí clo và natri hydroxide"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học CnH2n+2",
    "re": "thì nó là một ankan"
  },
  {
    "con": "Khi một este được thủy phân trong môi trường axit",
    "re": "sẽ tạo ra ancol và axit carboxylic"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yên tĩnh",
    "re": "thì nó có thể đạt được trạng thái cân bằng"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên",
    "re": "thì khả năng xảy ra phản ứng hóa học cũng tăng lên"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C",
    "re": "thì nó có thể là một chất lỏng dễ bay hơi"
  },
  {
    "con": "Thí nghiệm xác định định tính nguyên tố cacbon và hiđro trong phân tử saccarozơ được tiến hành theo các bước sau\nBước 1: Trộn đều khoảng 0,2 gam saccarozơ với 1 đến 2 gam đồng (II) oxit, sau đó cho hỗn hợp vào ống nghiệm khô (ống số 1) rồi thêm tiếp khoảng 1 gam đồng (II) oxit để phủ kín hỗn hợp. Nhồi một nhúm bông có rắc bột CuSO_{4} khan vào phần trên ống số 1 rồi nút bằng nút cao su có ống dẫn khí.\nBước 2: Lắp ống số 1 lên giá thí nghiệm rồi nhúng ống dẫn khí vào dung dịch Ca(OH)_{2} đựng trong ống nghiệm (ống số 2).\nBước 3: Dùng đèn cồn đun nóng ống số 1 (lúc đầu đun nhẹ, sau đó đun tập trung vào phần có hỗn hợp phản ứng).\nCho các phát biểu sau\n(a) CuSO4 khan được dùng để nhận biết H_{2}O sinh ra trong ống nghiệm.\n(b) Thí nghiệm trên, trong ống số 2 có xuất hiện kết tủa trắng.\n(c) Ở bước 2, lắp ống số 1 sao cho miệng ống hướng lên.\n(d) Thí nghiệm trên còn được dùng để xác định định tính nguyên tố oxi trong phân tử saccarozơ.\n(e) Kết thúc thí nghiệm: tắt đèn cồn, để ống số 1 nguội hẳn rồi mới đưa ống dẫn khí ra khỏi dung dịch trong ống số 2.\nSố phát biểu đúng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất phản ứng với axit tạo ra khí hiđro",
    "re": "chất đó là kim loại hoạt động"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7",
    "re": "dung dịch đó là axit"
  },
  {
    "con": "Khi nhiệt độ của một phản ứng hóa học tăng lên",
    "re": "tốc độ phản ứng thường tăng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước",
    "re": "chất đó sẽ bay hơi ở nhiệt độ thường"
  },
  {
    "con": "Khi một hợp chất ion được hòa tan trong nước",
    "re": "các ion của hợp chất đó sẽ tách ra và tự do di chuyển"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí",
    "re": "sản phẩm có thể khác so với phản ứng xảy ra trong điều kiện có oxy"
  },
  {
    "con": "Khi một chất bị oxi hóa",
    "re": "chất đó sẽ mất electron"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao",
    "re": "tính chất hóa học của dung dịch đó sẽ mạnh hơn"
  },
  {
    "con": "Khi một phản ứng hóa học đạt trạng thái cân bằng",
    "re": "tốc độ phản ứng thuận và phản ứng nghịch bằng nhau"
  },
  {
    "con": "Cho hỗn hợp E gồm ba chất X, Y và ancol propylic. X, Y là hai amin kế tiếp nhau trong cùng dãy đồng đẳng; phân tử X, Y đều có hai nhóm NH_{2} và gốc hiđrocacbon không no; MX < MY. Khi đốt cháy hết 0,1 mol E cần vừa đủ 0,67 mol O_{2}, thu được H_{2}O, N_{2} và 0,42 mol CO_{2}. Phần trăm khối lượng của Y trong E là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn nước, thì chất đó có thể là một hợp chất có liên kết hydro mạnh.",
    "re": "Chất đó có khả năng tạo liên kết hydro"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó là dung dịch axit.",
    "re": "Dung dịch đó có tính axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra tỏa nhiệt, thì phản ứng đó là phản ứng tỏa nhiệt.",
    "re": "Năng lượng được giải phóng trong quá trình phản ứng"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử đối xứng, thì chất đó có thể không có tính phân cực.",
    "re": "Chất đó có thể không tương tác với điện trường"
  },
  {
    "con": "Nếu một ion kim loại có hóa trị cao, thì ion đó thường có khả năng tạo thành các hợp chất bền hơn.",
    "re": "Hợp chất đó có thể có tính ổn định cao hơn"
  },
  {
    "con": "Nếu một phản ứng hóa học có hệ số cân bằng lớn hơn 1, thì sản phẩm của phản ứng chiếm ưu thế hơn phản ứng chất.",
    "re": "Phản ứng có xu hướng tiến về phía sản phẩm"
  },
  {
    "con": "Nếu một chất có tính oxi hóa mạnh, thì chất đó có khả năng nhận electron từ chất khác.",
    "re": "Chất đó có thể làm giảm hóa trị của chất khác"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao, thì khả năng dẫn điện của dung dịch đó cũng cao.",
    "re": "Dung dịch đó có nhiều ion tự do"
  },
  {
    "con": "Nếu một hợp chất có liên kết đôi trong cấu trúc, thì hợp chất đó có thể tham gia vào phản ứng cộng.",
    "re": "Hợp chất đó có khả năng phản ứng với các chất khác"
  },
  {
    "con": "Hỗn hợp E gồm axit panmitic, axit stearic và triglixerit X. Cho m gam E tác dụng hoàn toàn với dung dịch NaOH dư, thu được 57,84 gam hỗn hợp hai muối. Nếu đốt cháy hết m gam E thì cần vừa đủ 4,98 mol O_{2}, thu được H_{2}O và 3,48 mol CO_{2}. Khối lượng của X trong m gam E là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Dung dịch NaCl có nồng độ 0,1 mol/L. Nếu cho 1 L dung dịch này tác dụng với dung dịch AgNO3 dư thì sẽ thu được 0,1 mol AgCl kết tủa.",
    "re": "Khối lượng AgCl thu được là 10,5 gam"
  },
  {
    "con": "Khi đun nóng hỗn hợp khí CH4 và O2 với tỉ lệ mol 1:2, nếu phản ứng xảy ra hoàn toàn thì sẽ thu được CO2 và H2O.",
    "re": "Số mol CO2 thu được bằng số mol CH4 ban đầu"
  },
  {
    "con": "Khi cho 10 gam bột sắt tác dụng với 20 gam lưu huỳnh ở nhiệt độ cao, nếu phản ứng xảy ra hoàn toàn thì sẽ thu được 30 gam FeS.",
    "re": "Khối lượng Fe và S phản ứng hoàn toàn là 10 gam và 20 gam"
  },
  {
    "con": "Khi hòa tan 5 gam NaOH vào 1 L nước, nếu đo pH của dung dịch thì pH sẽ lớn hơn 7.",
    "re": "Dung dịch NaOH là dung dịch kiềm"
  },
  {
    "con": "Khi cho 1 mol H2 tác dụng với 1 mol O2 trong điều kiện thích hợp, nếu phản ứng xảy ra hoàn toàn thì sẽ thu được 1 mol H2O.",
    "re": "Khối lượng H2O thu được là 18 gam"
  },
  {
    "con": "Khi cho 2 mol HCl tác dụng với 1 mol CaCO3, nếu phản ứng xảy ra hoàn toàn thì sẽ thu được 1 mol CaCl2, 1 mol CO2 và 1 mol H2O.",
    "re": "Số mol sản phẩm là 3 mol"
  },
  {
    "con": "Khi hòa tan 10 gam KCl vào 100 mL nước, nếu đo nồng độ mol của dung dịch thì nồng độ sẽ là 0,85 mol/L.",
    "re": "Khối lượng KCl trong dung dịch là 10 gam"
  },
  {
    "con": "Khi cho 1 mol NH3 tác dụng với 1 mol HCl, nếu phản ứng xảy ra hoàn toàn thì sẽ thu được 1 mol NH4Cl.",
    "re": "Khối lượng NH4Cl thu được là 53,5 gam"
  },
  {
    "con": "Khi cho 5 gam axit acetic tác dụng với 5 gam NaOH, nếu phản ứng xảy ra hoàn toàn thì sẽ thu được 5 gam natri axetat.",
    "re": "Khối lượng sản phẩm là 5 gam"
  },
  {
    "con": "Hỗn hợp E gồm ba este mạch hở X, Y và Z, trong đó có một este hai chức và hai este đơn chức; MX < MY < MZ. Cho 24,66 gam E tác dụng hoàn toàn với dung dịch NaOH dư, thu được hỗn hợp các ancol no và 26,42 gam hỗn hợp muối của hai axit cacboxylic kế tiếp trong cùng dãy đồng đẳng. Khi đốt cháy hết 24,66 gam E thì cần vừa đủ 1,285 mol O_{2} thu được H_{2}O và 1,09 mol CO_{2}. Khối lượng của Y trong 24,66 gam E là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Dung dịch NaCl có nồng độ 0,1 M và thể tích 500 mL được điện phân trong điều kiện tiêu chuẩn",
    "re": "Sẽ thu được 11,2 L khí H_{2} ở cực âm"
  },
  {
    "con": "Khi cho 1 mol axit clohidric (HCl) tác dụng với 1 mol natri hidroxit (NaOH)",
    "re": "Sẽ thu được 1 mol muối natri clorua (NaCl) và 1 mol nước (H_{2}O)"
  },
  {
    "con": "Khi đun nóng 1 mol glucozơ (C_{6}H_{12}O_{6}) trong môi trường axit",
    "re": "Sẽ tạo ra 2 mol etanol (C_{2}H_{5}OH) và 2 mol CO_{2}"
  },
  {
    "con": "Khi cho 1 mol axit axetic (CH_{3}COOH) tác dụng với 1 mol ancol etylic (C_{2}H_{5}OH) trong điều kiện axit",
    "re": "Sẽ thu được 1 mol este etyl axetat (CH_{3}COOC_{2}H_{5}) và 1 mol nước (H_{2}O)"
  },
  {
    "con": "Khi cho 1 mol amoniac (NH_{3}) tác dụng với 1 mol axit clohidric (HCl)",
    "re": "Sẽ tạo ra 1 mol muối amoni clorua (NH_{4}Cl)"
  },
  {
    "con": "Khi đốt cháy 1 mol propan (C_{3}H_{8}) trong không khí",
    "re": "Sẽ thu được 3 mol CO_{2} và 4 mol H_{2}O"
  },
  {
    "con": "Khi cho 1 mol kali (K) tác dụng với nước (H_{2}O)",
    "re": "Sẽ tạo ra 1 mol kali hidroxit (KOH) và 0,5 mol khí H_{2}"
  },
  {
    "con": "Khi cho 1 mol sắt (Fe) tác dụng với 1 mol oxi (O_{2})",
    "re": "Sẽ tạo ra 1 mol sắt(III) oxit (Fe_{2}O_{3})"
  },
  {
    "con": "Khi cho 1 mol axit sulfuric (H_{2}SO_{4}) tác dụng với 1 mol đồng (Cu)",
    "re": "Sẽ tạo ra 1 mol đồng(II) sulfat (CuSO_{4}) và 1 mol khí H_{2}S"
  },
  {
    "con": "Nhiệt phân hoàn toàn 26,73 gam X (là muối ở dạng ngậm nước), thu được hỗn hợp Y (gồm khí và hơi) và 7,29 gam một chất rắn Z. Hấp thụ hết Y vào nước, thu được dung dịch T. Cho 180 ml dung dịch NaOH 1M vào T, thu được dung dịch chỉ chứa một muối, khối lượng của muối là 15,3 gam. Phần trăm khối lượng nguyên tố oxi trong X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một dung dịch chứa 0,1 mol/l NaCl và 0,1 mol/l KCl, khi trộn đều sẽ tạo ra dung dịch có nồng độ ion Cl- là",
    "re": "0,2 mol/l"
  },
  {
    "con": "Khi đun nóng 1 mol H2 với 1 mol O2 trong điều kiện thích hợp, sản phẩm thu được là",
    "re": "2 mol H2O"
  },
  {
    "con": "Khi cho 1 mol axit clohidric (HCl) tác dụng với 1 mol natri hidroxit (NaOH), sản phẩm tạo thành là",
    "re": "1 mol NaCl và 1 mol H2O"
  },
  {
    "con": "Khi hòa tan 10 gam NaOH vào 100 ml nước, nhiệt độ của dung dịch sẽ",
    "re": "tăng lên do phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một hợp chất hữu cơ có công thức phân tử C4H10O, thì nó có thể là",
    "re": "butanol"
  },
  {
    "con": "Khi cho 1 mol CaCO3 tác dụng với 2 mol HCl, sản phẩm khí sinh ra là",
    "re": "CO2"
  },
  {
    "con": "Khi cho 1 mol Fe tác dụng với 3/2 mol O2, sản phẩm tạo thành là",
    "re": "1 mol Fe2O3"
  },
  {
    "con": "Nếu một dung dịch có pH = 3, thì nồng độ ion H+ trong dung dịch đó là",
    "re": "0,001 mol/l"
  },
  {
    "con": "Khi cho 1 mol NH3 tác dụng với 1 mol HCl, sản phẩm tạo thành là",
    "re": "1 mol NH4Cl"
  },
  {
    "con": "Cho các sơ đồ phản ứng:\n(1) E + NaOH \\xrightarrow  X + Y\n(2) F + NaOH \\xrightarrow  X + Z\n(3) Y + HCl \\xrightarrow  T + NaCl\nBiết E, F đều là các hợp chất hữu cơ no, mạch hở, chỉ chứa nhóm chức este (được tạo thành từ axit cacboxylic và ancol) và trong phân tử có số nguyên tử cacbon bằng số nguyên tử oxi; E và Z có cùng số nguyên tử cacbon; ME < MF < 175.\nCho các phát biểu sau:\n(a) Nhiệt độ sôi của E thấp hơn nhiệt độ sôi của CH3COOH\n(b) Có hai công thức cấu tạo của F thỏa mãn sơ đồ trên.\n(c) Hai chất E và T có cùng công thức đơn giản nhất\n(d) Đốt cháy hoàn toàn Z, thu được Na_{2}CO_{3}, CO_{2} và H_{2}O.\n(e) Từ X điều chế trực tiếp được CH3COOH.\nSố phát biểu đúng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có công thức phân tử C_nH_{2n+2} thì chất đó là ankan.",
    "re": "Chất đó có tính chất của ankan."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường axit thì pH của dung dịch sẽ giảm.",
    "re": "Tính axit của dung dịch tăng lên."
  },
  {
    "con": "Nếu nhiệt độ tăng trong một phản ứng thuận nghịch, thì phản ứng sẽ chuyển dịch theo chiều phản ứng thu nhiệt.",
    "re": "Sản phẩm thu được sẽ tăng lên."
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước thì chất đó thường là hợp chất ion.",
    "re": "Chất đó có khả năng dẫn điện trong dung dịch."
  },
  {
    "con": "Nếu một hợp chất có liên kết đôi trong phân tử thì nó có thể tham gia phản ứng cộng.",
    "re": "Hợp chất đó có khả năng tạo ra sản phẩm mới."
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi cao hơn nước thì chất đó có thể là một hợp chất hữu cơ có khối lượng phân tử lớn.",
    "re": "Chất đó có thể có liên kết hydro."
  },
  {
    "con": "Nếu một phản ứng hóa học tỏa nhiệt thì năng lượng của sản phẩm thấp hơn năng lượng của phản ứng chất.",
    "re": "Phản ứng đó là phản ứng tỏa nhiệt."
  },
  {
    "con": "Nếu một dung dịch có pH = 7 thì dung dịch đó là trung tính.",
    "re": "Không có tính axit hay bazơ."
  },
  {
    "con": "Nếu một chất có cấu trúc mạng tinh thể thì chất đó thường có điểm nóng chảy cao.",
    "re": "Chất đó có tính chất vật lý ổn định."
  },
  {
    "con": "Chất nào sau đây thuộc loại polisaccarit?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao,",
    "re": "thì tốc độ phản ứng thường tăng lên."
  },
  {
    "con": "Nếu một dung dịch có pH < 7,",
    "re": "thì dung dịch đó được coi là axit."
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước,",
    "re": "thì chất đó sẽ bay hơi nhanh hơn trong điều kiện thường."
  },
  {
    "con": "Nếu một nguyên tố có số oxi hóa +1,",
    "re": "thì nguyên tố đó thường là kim loại kiềm."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt,",
    "re": "thì năng lượng được giải phóng ra môi trường xung quanh."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng,",
    "re": "thì chất đó có thể có đồng phân quang học."
  },
  {
    "con": "Nếu một dung dịch chứa ion kim loại nặng,",
    "re": "thì nó có thể gây ô nhiễm môi trường."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra giữa axit và bazơ,",
    "re": "thì sản phẩm tạo thành thường là muối và nước."
  },
  {
    "con": "Nếu một chất có tính chất điện ly mạnh,",
    "re": "thì nó sẽ phân ly hoàn toàn trong dung môi nước."
  },
  {
    "con": "Công thức hóa học của sắt (III) clorua là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học là",
    "re": "H2O"
  },
  {
    "con": "Khối lượng mol của carbon là",
    "re": "12 g/mol"
  },
  {
    "con": "Khi axit hydrochloric (HCl) phản ứng với natri hydroxide (NaOH), sản phẩm tạo thành là",
    "re": "Natri clorua (NaCl) và nước (H2O)"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường",
    "re": "tăng lên"
  },
  {
    "con": "Trong phản ứng oxi hóa, chất bị oxi hóa sẽ",
    "re": "mất electron"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7, dung dịch đó được coi là",
    "re": "axit"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước, nó sẽ tạo ra",
    "re": "dung dịch"
  },
  {
    "con": "Trong bảng tuần hoàn, các nguyên tố cùng nhóm có",
    "re": "tính chất hóa học tương tự"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, tổng khối lượng của các chất phản ứng sẽ",
    "re": "bằng tổng khối lượng của các sản phẩm"
  },
  {
    "con": "Kim loại nào sau đây tan trong nước ở điều kiện thường?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là NaCl,",
    "re": "thì nó là muối ăn"
  },
  {
    "con": "Nếu pH của dung dịch là 7,",
    "re": "thì dung dịch đó được coi là trung tính"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra tỏa nhiệt,",
    "re": "thì nó được gọi là phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C ở áp suất 1 atm,",
    "re": "thì chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol/lít cao,",
    "re": "thì nó có khả năng dẫn điện tốt hơn"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6,",
    "re": "thì nó là carbon"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường axit,",
    "re": "thì nó có thể tạo ra khí hydro"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử là C2H5OH,",
    "re": "thì đó là ethanol"
  },
  {
    "con": "Nếu một hợp chất hữu cơ chứa nhóm chức -OH,",
    "re": "thì nó được gọi là rượu"
  },
  {
    "con": "Crom tác dụng với lưu huỳnh (đun nóng), thu được sản phẩm là",
    "re": "Crom(II) sulfide"
  },
  {
    "con": "Nước và axit clohydric phản ứng với nhau, thu được sản phẩm là",
    "re": "Ion clorua và ion hydro"
  },
  {
    "con": "Khi đun nóng muối natri bicarbonat, sản phẩm thu được là",
    "re": "Natri cacbonat, nước và khí carbon dioxide"
  },
  {
    "con": "Khi axit sulfuric đặc tác dụng với đường, sản phẩm thu được là",
    "re": "Carbon và nước"
  },
  {
    "con": "Khi kim loại tác dụng với axit, sản phẩm thu được là",
    "re": "Muối và khí hydro"
  },
  {
    "con": "Khi đun nóng amoniac với axit nitric, sản phẩm thu được là",
    "re": "Amoni nitrat"
  },
  {
    "con": "Khi cacbon phản ứng với oxy, sản phẩm thu được là",
    "re": "Khí carbon dioxide"
  },
  {
    "con": "Khi nước đá tan thành nước, quá trình này là",
    "re": "Sự chuyển đổi trạng thái từ rắn sang lỏng"
  },
  {
    "con": "Khi một dung dịch axit được trung hòa bằng dung dịch kiềm, sản phẩm thu được là",
    "re": "Nước và muối"
  },
  {
    "con": "Khi ion kim loại tác dụng với dung dịch muối, có thể xảy ra hiện tượng",
    "re": "Phản ứng trao đổi"
  },
  {
    "con": "Kim loại nào sau đây không tan được trong dung dịch HCl?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn điểm sôi của nước,",
    "re": "thì chất đó sẽ tồn tại ở trạng thái lỏng hoặc rắn ở nhiệt độ phòng."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kiềm,",
    "re": "thì sản phẩm của phản ứng có thể là muối và nước."
  },
  {
    "con": "Nếu nồng độ của dung dịch axit tăng lên,",
    "re": "thì độ pH của dung dịch sẽ giảm."
  },
  {
    "con": "Nếu một chất là chất điện ly mạnh,",
    "re": "thì nó sẽ phân ly hoàn toàn trong dung dịch."
  },
  {
    "con": "Nếu nhiệt độ của một phản ứng hóa học tăng lên,",
    "re": "thì tốc độ phản ứng thường sẽ tăng."
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học CnH2n+2,",
    "re": "thì hợp chất đó là ankan."
  },
  {
    "con": "Nếu một chất có tính oxi hóa mạnh,",
    "re": "thì nó có khả năng nhận electron từ chất khác."
  },
  {
    "con": "Nếu một dung dịch có màu xanh lam,",
    "re": "thì có thể nó chứa ion Cu2+."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt,",
    "re": "thì nó sẽ giải phóng năng lượng dưới dạng nhiệt."
  },
  {
    "con": "Chất nào sau đây được dung để khử chua trong đất nông nghiệp?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước,",
    "re": "thì chất đó sẽ bay hơi ở nhiệt độ phòng."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao,",
    "re": "thì tốc độ phản ứng thường tăng lên."
  },
  {
    "con": "Nếu một dung dịch có pH < 7,",
    "re": "thì dung dịch đó được coi là axit."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng,",
    "re": "thì chất đó có thể có đồng phân quang học."
  },
  {
    "con": "Nếu một kim loại phản ứng với axit,",
    "re": "thì sản phẩm tạo ra thường là muối và khí hidro."
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao,",
    "re": "thì khả năng dẫn điện của dung dịch đó thường cao."
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch,",
    "re": "thì nó có thể diễn ra theo cả hai chiều."
  },
  {
    "con": "Nếu một chất có tính oxi hóa mạnh,",
    "re": "thì nó có khả năng nhận electron từ chất khác."
  },
  {
    "con": "Nếu nhiệt độ của một hệ thống tăng lên,",
    "re": "thì năng lượng động học của các phân tử trong hệ thống cũng tăng lên."
  },
  {
    "con": "Dung dịch nào sau đây không làm đổi màu quỳ tím?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong phản ứng hóa học thì tốc độ phản ứng sẽ tăng lên.",
    "re": "Điều này đúng với hầu hết các phản ứng hóa học."
  },
  {
    "con": "Nếu một chất có độ pH nhỏ hơn 7 thì chất đó là axit.",
    "re": "Điều này đúng theo định nghĩa về pH."
  },
  {
    "con": "Khi một kim loại phản ứng với axit thì sản phẩm tạo ra thường là muối và khí hidro.",
    "re": "Điều này đúng với nhiều phản ứng giữa kim loại và axit."
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện trong dung dịch thì chất đó là ion.",
    "re": "Điều này đúng với các chất điện ly."
  },
  {
    "con": "Khi nhiệt độ giảm thì độ hòa tan của khí trong chất lỏng thường tăng lên.",
    "re": "Điều này đúng theo quy luật Henry."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện kín thì khối lượng tổng của các chất phản ứng bằng khối lượng tổng của các sản phẩm.",
    "re": "Điều này đúng theo định luật bảo toàn khối lượng."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng thì chất đó có thể có đồng phân quang học.",
    "re": "Điều này đúng với các hợp chất hữu cơ."
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên thì áp suất hơi của dung dịch giảm xuống.",
    "re": "Điều này đúng theo định luật Raoult."
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch thì có thể xảy ra cả hai chiều.",
    "re": "Điều này đúng với các phản ứng hóa học không hoàn toàn."
  },
  {
    "con": "Hiện nay, nhiều nơi ở nông thôn đang sử dụng hầm biogas để xử lí chất thải trong chăn nuôi gia súc cung cấp nhiên liệu cho việc đun nấu. Chất dễ cháy trong khí biogas là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có nhiệt độ sôi là 100 độ C ở áp suất 1 atm,",
    "re": "nước sẽ chuyển từ trạng thái lỏng sang trạng thái khí"
  },
  {
    "con": "Khi một axit phản ứng với một bazơ,",
    "re": "sẽ xảy ra phản ứng trung hòa tạo ra muối và nước"
  },
  {
    "con": "Nếu một chất có độ pH nhỏ hơn 7,",
    "re": "chất đó được coi là axit"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường",
    "re": "tăng lên do các phân tử có năng lượng cao hơn"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học C2H6,",
    "re": "hợp chất đó là etan, một ankan"
  },
  {
    "con": "Khi một kim loại phản ứng với axit,",
    "re": "sẽ tạo ra muối và khí hidro"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao hơn dung dịch khác,",
    "re": "dung dịch đó sẽ có áp suất thẩm thấu cao hơn"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước,",
    "re": "sẽ tạo ra dung dịch đồng nhất"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí,",
    "re": "sản phẩm có thể khác so với phản ứng xảy ra trong điều kiện có oxy"
  },
  {
    "con": "Kim loại nào sau đây điều chế được bằng phương pháp thủy luyện?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn nhiệt độ phòng, thì chất đó thường tồn tại ở trạng thái khí.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra tỏa nhiệt, thì năng lượng được giải phóng ra môi trường.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu pH của dung dịch nhỏ hơn 7, thì dung dịch đó được coi là axit.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học CnH2n+2, thì hợp chất đó là ankan.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện trong dung dịch, thì chất đó thường là muối hoặc axit.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao, thì tốc độ phản ứng có thể tăng lên.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một nguyên tố có số oxi hóa cao nhất là +7, thì nguyên tố đó có thể là mangan.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao, thì khả năng phản ứng của các ion trong dung dịch cũng cao.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử phức tạp, thì nó có thể có nhiều tính chất hóa học khác nhau.",
    "re": "Kết quả đúng"
  },
  {
    "con": "Công thức của axit oleic là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước là một hợp chất có công thức hóa học H2O",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số nguyên tử tăng dần",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi axit phản ứng với bazơ, sản phẩm tạo thành là muối và nước",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khối lượng mol của một chất là khối lượng của một mol nguyên tử hoặc phân tử của chất đó",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Phản ứng hóa học có thể được biểu diễn bằng phương trình hóa học",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên thường làm tăng tốc độ phản ứng hóa học",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất xúc tác là một chất làm tăng tốc độ phản ứng mà không bị tiêu hao",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Trong một phản ứng hóa học, tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Ion dương được gọi là cation và ion âm được gọi là anion",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tơ nào sau đây thuộc loại tơ nhân tạo?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Một chất có nhiệt độ sôi cao hơn nhiệt độ sôi của nước?",
    "re": "Chất đó có thể là một hợp chất hữu cơ có khối lượng phân tử lớn"
  },
  {
    "con": "Một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao?",
    "re": "Phản ứng có thể là phản ứng nhiệt phân"
  },
  {
    "con": "Một dung dịch có pH < 7?",
    "re": "Dung dịch đó là dung dịch axit"
  },
  {
    "con": "Một chất có khả năng dẫn điện trong trạng thái lỏng?",
    "re": "Chất đó có thể là một muối hòa tan trong nước"
  },
  {
    "con": "Một nguyên tố có số hiệu nguyên tử 6?",
    "re": "Nguyên tố đó là cacbon"
  },
  {
    "con": "Một hợp chất có công thức hóa học H2O?",
    "re": "Hợp chất đó là nước"
  },
  {
    "con": "Một phản ứng hóa học tỏa nhiệt?",
    "re": "Phản ứng đó là phản ứng tỏa nhiệt"
  },
  {
    "con": "Một chất có khả năng phản ứng với kim loại để tạo ra khí hydro?",
    "re": "Chất đó là axit"
  },
  {
    "con": "Một hợp chất có công thức hóa học NaCl?",
    "re": "Hợp chất đó là muối ăn"
  },
  {
    "con": "Dung dịch chất nào sau đây hòa tan được Al(OH) _{3}?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn nước,",
    "re": "thì chất đó sẽ bay hơi nhanh hơn nước ở cùng nhiệt độ."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao,",
    "re": "thì tốc độ phản ứng thường tăng lên."
  },
  {
    "con": "Nếu pH của dung dịch nhỏ hơn 7,",
    "re": "thì dung dịch đó được coi là axit."
  },
  {
    "con": "Nếu một kim loại phản ứng với axit,",
    "re": "thì sản phẩm tạo ra thường là muối và khí hidro."
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao,",
    "re": "thì khả năng dẫn điện của dung dịch đó thường cao hơn."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng,",
    "re": "thì chất đó có thể có đồng phân quang học."
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch,",
    "re": "thì nó có thể diễn ra theo cả hai chiều."
  },
  {
    "con": "Nếu nhiệt độ tăng trong một phản ứng tỏa nhiệt,",
    "re": "thì sự cân bằng của phản ứng sẽ dịch chuyển sang bên sản phẩm."
  },
  {
    "con": "Nếu một chất có độ hòa tan cao trong nước,",
    "re": "thì nó thường là một chất ion hoặc phân cực."
  },
  {
    "con": "Cặp dung dịch chất nào sau đây phản ứng với nhau tạo ra chất khí?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi thấp hơn 100 độ C, thì chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng.",
    "re": "Chất đó có thể tồn tại ở trạng thái khí"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng thường tăng lên.",
    "re": "Tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Nếu một dung dịch có pH lớn hơn 7, thì dung dịch đó được coi là kiềm.",
    "re": "Dung dịch đó được coi là kiềm"
  },
  {
    "con": "Nếu một chất có khối lượng mol lớn hơn 100 g/mol, thì chất đó thường có điểm nóng chảy cao hơn.",
    "re": "Chất đó thường có điểm nóng chảy cao hơn"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt, thì năng lượng được giải phóng ra môi trường.",
    "re": "Năng lượng được giải phóng ra môi trường"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng, thì chất đó có thể có đồng phân quang học.",
    "re": "Chất đó có thể có đồng phân quang học"
  },
  {
    "con": "Nếu một dung dịch chứa ion kim loại, thì nó có khả năng dẫn điện.",
    "re": "Nó có khả năng dẫn điện"
  },
  {
    "con": "Nếu một chất phản ứng với axit tạo ra muối và nước, thì chất đó là một bazơ.",
    "re": "Chất đó là một bazơ"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường kín, thì khối lượng tổng thể của hệ thống không thay đổi.",
    "re": "Khối lượng tổng thể của hệ thống không thay đổi"
  },
  {
    "con": "Este nào sau đây tác dụng với dung dịch NaOH thu được natri axetat",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có nhiệt độ sôi 100 độ C ở áp suất 1 atm",
    "re": "Nước sẽ chuyển từ trạng thái lỏng sang trạng thái hơi"
  },
  {
    "con": "Một hợp chất có công thức hóa học C2H6O",
    "re": "Hợp chất này có thể là etanol"
  },
  {
    "con": "Khi cho axit clohidric vào dung dịch natri bicarbonat",
    "re": "Sẽ xảy ra phản ứng tạo ra khí carbon dioxide"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit sulfuric",
    "re": "Sẽ tạo ra muối và khí hydro"
  },
  {
    "con": "Khi nhiệt độ tăng, áp suất của khí trong một bình kín cũng tăng",
    "re": "Theo định luật Gay-Lussac"
  },
  {
    "con": "Nếu một dung dịch có pH < 7",
    "re": "Dung dịch đó là axit"
  },
  {
    "con": "Khi cho bột kim loại natri vào nước",
    "re": "Sẽ xảy ra phản ứng mãnh liệt và tạo ra khí hydro"
  },
  {
    "con": "Nếu một chất có điểm nóng chảy thấp hơn nhiệt độ phòng",
    "re": "Chất đó sẽ tồn tại ở trạng thái lỏng hoặc khí"
  },
  {
    "con": "Khi một hợp chất hữu cơ có nhóm chức -OH",
    "re": "Hợp chất đó được gọi là rượu"
  },
  {
    "con": "Cho 2 ml chất lỏng X vào ống nghiệm khô có sẵn vài viên đá bọt, sau đó thêm từng giọt dung dịch H_{2}SO_{4} đặc, lắc đều. Đun nóng hỗn hợp, sinh ra hiđrocacon làm nhạt màu dung dịch KMnO_{4}. Chất X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan NaCl vào nước, dung dịch sẽ dẫn điện tốt hơn so với nước tinh khiết",
    "re": "NaCl là chất điện ly mạnh"
  },
  {
    "con": "Khi đun nóng một hợp chất hữu cơ có chứa liên kết đôi, nếu có sự hiện diện của chất xúc tác, phản ứng có thể xảy ra nhanh hơn",
    "re": "Phản ứng có thể xảy ra theo cơ chế cộng"
  },
  {
    "con": "Khi cho axit vào dung dịch kiềm, nếu pH của dung dịch giảm xuống dưới 7",
    "re": "Dung dịch đã xảy ra phản ứng trung hòa"
  },
  {
    "con": "Khi cho một kim loại vào dung dịch muối của nó, nếu kim loại đó có độ hoạt động hóa học cao hơn",
    "re": "Kim loại sẽ thay thế ion kim loại trong muối"
  },
  {
    "con": "Khi đun nóng một hợp chất chứa cacbon trong điều kiện thiếu oxy, sản phẩm thu được sẽ là",
    "re": "Khí CO và than cốc"
  },
  {
    "con": "Khi cho dung dịch AgNO3 vào dung dịch NaCl, nếu có sự xuất hiện của kết tủa trắng",
    "re": "Kết tủa đó là AgCl"
  },
  {
    "con": "Khi một chất khí được làm lạnh đến nhiệt độ thấp hơn điểm sôi của nó, nếu áp suất không thay đổi",
    "re": "Chất khí sẽ chuyển sang trạng thái lỏng"
  },
  {
    "con": "Khi cho dung dịch HCl vào dung dịch NaOH, nếu thêm phenolphtalein vào",
    "re": "Dung dịch sẽ chuyển sang màu hồng khi phản ứng hoàn tất"
  },
  {
    "con": "Khi một chất rắn không tan trong nước được hòa tan trong dung môi hữu cơ, nếu dung môi đó có độ phân cực thấp",
    "re": "Chất rắn sẽ tan tốt hơn trong dung môi hữu cơ"
  },
  {
    "con": "Cho 7,5 gam amino axit X (công thức có dạng H_{2}NC_{n}H_{2n}COOH) tác dụng hết với dung dịch HCl dư, thu được 11,15 gam muối. Số nguyên tử hiđro trong phân tử X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất rắn tan trong nước, nếu nhiệt độ của dung dịch tăng lên thì",
    "re": "quá trình tan là tỏa nhiệt"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ và áp suất không đổi, thì",
    "re": "năng lượng tự do Gibbs của hệ sẽ giảm"
  },
  {
    "con": "Khi pH của dung dịch axit giảm, nếu nồng độ ion H+ tăng lên thì",
    "re": "tính axit của dung dịch tăng"
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn điểm sôi của nước, thì",
    "re": "chất đó sẽ không bay hơi ở nhiệt độ thường"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong môi trường kiềm, nếu có sự tham gia của ion OH- thì",
    "re": "phản ứng sẽ diễn ra theo chiều thuận"
  },
  {
    "con": "Nếu một hợp chất hữu cơ có nhóm chức -OH, thì",
    "re": "hợp chất đó có thể tham gia phản ứng este hóa"
  },
  {
    "con": "Khi một kim loại tác dụng với axit, nếu có khí thoát ra thì",
    "re": "kim loại đó có khả năng khử ion H+ thành H2"
  },
  {
    "con": "Nếu nồng độ của một dung dịch tăng lên, thì",
    "re": "độ dẫn điện của dung dịch cũng sẽ tăng"
  },
  {
    "con": "Khi một chất rắn được nung nóng và chuyển thành hơi, nếu áp suất giảm thì",
    "re": "nhiệt độ sôi của chất đó sẽ giảm"
  },
  {
    "con": "Đun nóng 100 ml dung dịch glucozơ a (mol/l) với lượng dư dung dịch AgNO_{3} trong NH_{3} Saukhi phản ứng xảy ra hoàn toàn, thu được 21,6 gam Ag. Giá trị của a là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 10 gam NaCl vào 100 ml nước, nồng độ mol của NaCl trong dung dịch là",
    "re": "0,17 mol/l"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện tiêu chuẩn (STP), thì thể tích của 1 mol khí là",
    "re": "22,4 lít"
  },
  {
    "con": "Khi cho 2 mol H2 phản ứng với 1 mol O2, thì sản phẩm tạo thành là",
    "re": "2 mol H2O"
  },
  {
    "con": "Nếu pH của dung dịch là 3, thì nồng độ ion H+ trong dung dịch là",
    "re": "0,001 mol/l"
  },
  {
    "con": "Khi đun nóng 100 ml dung dịch HCl 1M với lượng dư NaOH, thì pH của dung dịch sau phản ứng là",
    "re": "7"
  },
  {
    "con": "Nếu một hợp chất có công thức phân tử C6H12O6, thì nó thuộc loại",
    "re": "carbohydrate"
  },
  {
    "con": "Khi cho 1 mol CaCO3 phản ứng với 2 mol HCl, thì sản phẩm khí CO2 sinh ra là",
    "re": "0,5 mol"
  },
  {
    "con": "Nếu nhiệt độ tăng lên trong một phản ứng thuận nghịch tỏa nhiệt, thì vị trí cân bằng sẽ",
    "re": "dịch sang trái"
  },
  {
    "con": "Khi cho 1 mol Fe phản ứng với 3/2 mol O2, thì sản phẩm tạo thành là",
    "re": "1 mol Fe2O3"
  },
  {
    "con": "Thí nghiệm nào sau đây thu được muối sắt (III) sau khi kết thúc phản ứng ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ của một phản ứng hóa học tăng lên",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Một dung dịch có pH < 7",
    "re": "Dung dịch đó là axit"
  },
  {
    "con": "Một hợp chất có công thức hóa học C6H12O6",
    "re": "Hợp chất đó là glucose"
  },
  {
    "con": "Khi một kim loại phản ứng với axit",
    "re": "Sẽ tạo ra muối và khí hydro"
  },
  {
    "con": "Khi nồng độ của một chất tăng lên trong phản ứng",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Một chất có khả năng dẫn điện trong dung dịch",
    "re": "Chất đó là điện ly"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện kín",
    "re": "Khối lượng tổng thể sẽ được bảo toàn"
  },
  {
    "con": "Khi nhiệt độ giảm trong một phản ứng tỏa nhiệt",
    "re": "Phản ứng sẽ bị chậm lại"
  },
  {
    "con": "Khi một nguyên tố có số oxi hóa tăng lên",
    "re": "Nguyên tố đó bị oxi hóa"
  },
  {
    "con": "Thí nghiệm nào sau đây có xảy ra ăn mòn điện hóa học?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ của một phản ứng hóa học tăng lên",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Một dung dịch có pH < 7",
    "re": "Dung dịch đó là axit"
  },
  {
    "con": "Một nguyên tố có số proton bằng 6",
    "re": "Nguyên tố đó là Carbon"
  },
  {
    "con": "Một phản ứng hóa học xảy ra giữa axit và bazơ",
    "re": "Sẽ tạo ra muối và nước"
  },
  {
    "con": "Một hợp chất có công thức hóa học H2O",
    "re": "Hợp chất đó là nước"
  },
  {
    "con": "Một nguyên tố có tính kim loại cao",
    "re": "Sẽ dễ dàng mất electron"
  },
  {
    "con": "Một phản ứng oxi hóa xảy ra",
    "re": "Có sự mất electron"
  },
  {
    "con": "Một dung dịch có nồng độ mol cao",
    "re": "Sẽ có khả năng dẫn điện tốt hơn"
  },
  {
    "con": "Một phản ứng hóa học xảy ra trong điều kiện áp suất cao",
    "re": "Sẽ có thể tạo ra sản phẩm khác so với áp suất thấp"
  },
  {
    "con": "Đốt cháy hoàn toàn m gam Al trong khí O_{2} dư, thu được 10,2 gam Al_{2}O_{3}. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Pha loãng 1 mol HCl vào 1 lít nước, nồng độ HCl trong dung dịch là",
    "re": "1 M"
  },
  {
    "con": "Trộn 50 ml dung dịch NaOH 0,1 M với 50 ml dung dịch HCl 0,1 M, pH của dung dịch sau phản ứng là",
    "re": "7"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường",
    "re": "tăng lên"
  },
  {
    "con": "Khi nồng độ của một chất phản ứng tăng, tốc độ phản ứng sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Trong phản ứng giữa axit và bazơ, sản phẩm chính thường là",
    "re": "muối và nước"
  },
  {
    "con": "Khi một kim loại phản ứng với axit, sản phẩm thu được thường là",
    "re": "muối và khí hidro"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước, nó sẽ",
    "re": "dễ dàng hòa tan trong nước"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, năng lượng thường",
    "re": "được hấp thụ hoặc giải phóng"
  },
  {
    "con": "Trong một phản ứng oxi hóa khử, chất bị oxi hóa sẽ",
    "re": "mất electron"
  },
  {
    "con": "Nước có công thức hóa học H2O",
    "re": "Nước là một hợp chất"
  },
  {
    "con": "Các nguyên tố trong cùng một nhóm của bảng tuần hoàn có cùng số electron hóa trị",
    "re": "Chúng có tính chất hóa học tương tự nhau"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học",
    "re": "Tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Một dung dịch có pH < 7",
    "re": "Dung dịch đó là axit"
  },
  {
    "con": "Khi một kim loại phản ứng với axit",
    "re": "Sẽ tạo ra khí hydro và muối"
  },
  {
    "con": "Phản ứng giữa axit và bazơ",
    "re": "Sẽ tạo ra muối và nước"
  },
  {
    "con": "Khối lượng của một chất không thay đổi trong một phản ứng hóa học",
    "re": "Đó là định luật bảo toàn khối lượng"
  },
  {
    "con": "Khi nhiệt độ giảm trong một phản ứng hóa học tỏa nhiệt",
    "re": "Phản ứng sẽ chậm lại"
  },
  {
    "con": "Một chất có điểm sôi thấp hơn điểm sôi của nước",
    "re": "Chất đó sẽ bay hơi ở nhiệt độ phòng"
  },
  {
    "con": "Khi một chất bị oxi hóa",
    "re": "Chất đó mất electron"
  },
  {
    "con": "Phát biểu nào sau đây đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Tinh thể chất rắn X không màu, vị ngọt, dễ tan trong nước. X có nhiều trong mật ong nên làm cho\nmật ong có vị ngọt sắc. Trong công nghiệp, X được điều chế bằng phản ứng thủy phân chất Y. Tên gọi của\nX và Y lần lượt là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất A có công thức hóa học H2O và là dung môi phổ biến nhất trong tự nhiên.",
    "re": "Chất A là nước"
  },
  {
    "con": "Khi đun nóng một hợp chất hữu cơ chứa carbon, hydro và oxy, nếu sản phẩm tạo ra là CO2 và H2O thì hợp chất đó có thể là",
    "re": "chất hữu cơ"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao và áp suất lớn, thì tốc độ phản ứng sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Khi một kim loại phản ứng với axit, nếu sản phẩm tạo ra là khí H2 thì kim loại đó có thể là",
    "re": "kẽm hoặc sắt"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là",
    "re": "axit"
  },
  {
    "con": "Khi một chất rắn tan trong nước và tạo thành dung dịch trong suốt, thì chất đó được gọi là",
    "re": "chất tan"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra mà không có sự thay đổi về khối lượng, thì phản ứng đó tuân theo định luật",
    "re": "bảo toàn khối lượng"
  },
  {
    "con": "Khi một chất khí được nén lại và nhiệt độ không thay đổi, thì áp suất của chất khí đó sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một hợp chất có điểm sôi cao hơn nước, thì hợp chất đó có thể chứa",
    "re": "liên kết hydro mạnh"
  },
  {
    "con": "Phát biểu nào sau đây đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch",
    "re": "Phản ứng sẽ dịch chuyển theo chiều tỏa nhiệt"
  },
  {
    "con": "Số mol của chất khí ở cùng điều kiện nhiệt độ và áp suất",
    "re": "Sẽ có cùng thể tích"
  },
  {
    "con": "Một dung dịch có pH < 7",
    "re": "Là dung dịch axit"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Khi một kim loại phản ứng với axit",
    "re": "Sẽ tạo ra khí hidro"
  },
  {
    "con": "Khi nhiệt độ giảm trong một phản ứng hóa học tỏa nhiệt",
    "re": "Phản ứng sẽ dịch chuyển theo chiều thu nhiệt"
  },
  {
    "con": "Khi một chất điện phân được hòa tan trong nước",
    "re": "Sẽ phân ly thành các ion"
  },
  {
    "con": "Khi có sự thay đổi trong cấu trúc của một phân tử",
    "re": "Sẽ dẫn đến sự thay đổi tính chất hóa học"
  },
  {
    "con": "Khi nồng độ của sản phẩm trong phản ứng đạt đến một mức độ nhất định",
    "re": "Phản ứng sẽ dừng lại hoặc đạt trạng thái cân bằng"
  },
  {
    "con": "Cho m gam Fe tác dụng hết với dung dịch CuSO _{4} dư, thu được 19,2 gam Cu. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Dung dịch NaCl có pH bằng 7",
    "re": "Dung dịch này là trung tính"
  },
  {
    "con": "Khi đun nóng NaHCO3, sẽ sinh ra khí CO2",
    "re": "Phản ứng phân hủy xảy ra"
  },
  {
    "con": "Nếu cho 1 mol H2 tác dụng với 1 mol O2, sẽ tạo ra 1 mol H2O",
    "re": "Phản ứng này là phản ứng tổng hợp"
  },
  {
    "con": "Khi hòa tan 1 mol NaOH vào nước, nhiệt độ của dung dịch sẽ tăng lên",
    "re": "Phản ứng này là phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu cho 2 mol HCl tác dụng với 1 mol CaCO3, sẽ sinh ra 1 mol CaCl2",
    "re": "Phản ứng này là phản ứng trung hòa"
  },
  {
    "con": "Khi cho dung dịch AgNO3 vào dung dịch NaCl, sẽ xuất hiện kết tủa trắng",
    "re": "Kết tủa này là AgCl"
  },
  {
    "con": "Nếu pH của dung dịch nhỏ hơn 7, thì dung dịch đó là axit",
    "re": "Dung dịch này có tính axit"
  },
  {
    "con": "Khi đun nóng muối ăn (NaCl), nó không bị phân hủy",
    "re": "Muối ăn có tính ổn định nhiệt"
  },
  {
    "con": "Nếu cho 1 mol khí NH3 vào 1 mol khí HCl, sẽ tạo ra 1 mol NH4Cl",
    "re": "Phản ứng này là phản ứng kết hợp"
  },
  {
    "con": "Dẫn 0,02 mol hỗn hợp X (gồm hơi nước và khí CO_{2}) qua cacbon nung đỏ, thu được 0,035 mol hỗn hợp Y gồm CO, H_{2} và CO_{2}. Cho Y đi qua ống đựng 10 gam hỗn hợp gồm Fe _{2}O _{3} và CuO (dư, nung nóng), sau khi các phản ứng xảy ra hoàn toàn, thu được m gam chất rắn. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 1 mol NaCl vào 1 lít nước, nồng độ ion Na+ và Cl- trong dung dịch sẽ là",
    "re": "1 mol/lít"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ và áp suất không đổi, thì năng lượng tự do Gibbs của hệ sẽ",
    "re": "giảm khi phản ứng tiến hành theo chiều thuận"
  },
  {
    "con": "Khi thêm axit vào dung dịch kiềm, pH của dung dịch sẽ",
    "re": "giảm"
  },
  {
    "con": "Nếu một chất rắn tan trong nước tạo thành dung dịch, thì chất đó được gọi là",
    "re": "chất tan"
  },
  {
    "con": "Khi nhiệt độ tăng, độ hòa tan của khí trong chất lỏng sẽ",
    "re": "giảm"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì khi đạt đến trạng thái cân bằng, tốc độ phản ứng thuận sẽ",
    "re": "bằng tốc độ phản ứng nghịch"
  },
  {
    "con": "Khi cho một lượng axit mạnh vào dung dịch, thì ion H+ trong dung dịch sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một chất có độ âm điện cao hơn một chất khác, thì nó sẽ",
    "re": "có khả năng hút electron mạnh hơn"
  },
  {
    "con": "Khi một kim loại phản ứng với axit, sản phẩm thu được sẽ là",
    "re": "muối và khí hidro"
  },
  {
    "con": "Cho sơ đồ các phản ứng sau:\n        a) X _{1} + H_{2}O \\xrightarrow[điện phân dung dịch]{có màn ngăn} X _{2} + X _{3} + H_{2}\n        b) X_{2} + X_{4}   BaCO _{3} + K _{2}CO _{3} + H_{2}O        (X_{2} là KOH và X_{4} là Ba(HCO_{3}) _{2})\n        c) X_{2} + X_{3}   X_{1} + X_{5} + H_{2}O        (X_{3} là Cl_{2} ; X_{1} là KCl va X_{5} là KClO) \n        d) X_{4} + X_{6}   BaSO_{4} + K_{2}SO_{4} + CO_{2} + H_{2}O        (X_{6} là KHSO_{4})\n        X_{5} và X_{6} thỏa mãn sơ đồ trên lần lượt là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất khí CO2 được hòa tan trong nước",
    "re": "tạo thành dung dịch axit carbonic H2CO3"
  },
  {
    "con": "Khi một kim loại phản ứng với axit",
    "re": "sẽ tạo ra muối và khí hidro"
  },
  {
    "con": "Nếu nhiệt độ của một phản ứng hóa học tăng lên",
    "re": "thì tốc độ phản ứng thường tăng lên"
  },
  {
    "con": "Khi một dung dịch bão hòa được làm nguội",
    "re": "thì có thể xảy ra hiện tượng kết tinh"
  },
  {
    "con": "Nếu một chất có độ pH nhỏ hơn 7",
    "re": "thì chất đó được coi là axit"
  },
  {
    "con": "Khi một muối hòa tan trong nước",
    "re": "thì nó sẽ phân ly thành các ion"
  },
  {
    "con": "Nếu có sự hiện diện của chất xúc tác trong phản ứng",
    "re": "thì năng lượng kích hoạt của phản ứng sẽ giảm"
  },
  {
    "con": "Khi một chất bị oxi hóa",
    "re": "thì nó sẽ mất electron"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch",
    "re": "thì nó có thể diễn ra theo cả hai chiều"
  },
  {
    "con": "Nung nóng 0,1 mol C4H10 có xúc tác thích hợp, thu được hỗn hợp X gồm H_{2}, CH_{4}, C_{2}H_{4}, C_{2}H_{6}, C_{3}H_{6}, C_{4}H_{8} và C_{4}H_{10}. Dẫn X qua bình đựng dung dịch Br_{2} dư, sau khi phản ứng hoàn toàn khối lượng bình tăng 3,64 gam và có hỗn hợp khí Y thoát ra. Đốt cháy hoàn toàn Y cần vừa đủ V lít khí O_{2}. Giá trị của V là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 1 mol NaCl vào 1 lít nước, nồng độ dung dịch NaCl đạt 1 mol/lít",
    "re": "Dung dịch NaCl có nồng độ 1 mol/lít"
  },
  {
    "con": "Khi đun nóng 1 mol H2 và 1 mol O2 trong điều kiện thích hợp, phản ứng sẽ xảy ra tạo ra nước",
    "re": "Sẽ thu được 2 mol H2O"
  },
  {
    "con": "Nếu cho 1 mol axit clohidric (HCl) vào 1 mol natri hydroxide (NaOH), phản ứng trung hòa sẽ xảy ra",
    "re": "Sẽ thu được 1 mol natri clorua (NaCl) và 1 mol nước (H2O)"
  },
  {
    "con": "Khi cho 1 mol CO2 vào dung dịch kiềm, CO2 sẽ phản ứng với kiềm tạo thành muối carbonate",
    "re": "Sẽ tạo ra muối carbonate tương ứng"
  },
  {
    "con": "Nếu cho 1 mol axit sulfuric (H2SO4) vào 1 mol natri bicarbonate (NaHCO3), phản ứng sẽ tạo ra khí CO2",
    "re": "Sẽ có khí CO2 thoát ra"
  },
  {
    "con": "Khi đun nóng 1 mol glucozơ (C6H12O6) trong điều kiện thiếu oxy, sẽ xảy ra quá trình lên men",
    "re": "Sẽ thu được ethanol (C2H5OH) và CO2"
  },
  {
    "con": "Nếu cho 1 mol amoniac (NH3) vào dung dịch axit clohidric (HCl), sẽ xảy ra phản ứng tạo muối amoni clorua (NH4Cl)",
    "re": "Sẽ thu được muối amoni clorua (NH4Cl)"
  },
  {
    "con": "Khi cho 1 mol kali (K) vào nước, phản ứng sẽ tạo ra kali hydroxide (KOH) và khí hydro (H2)",
    "re": "Sẽ có khí H2 thoát ra"
  },
  {
    "con": "Nếu cho 1 mol sắt (Fe) vào dung dịch axit sulfuric (H2SO4), sẽ xảy ra phản ứng tạo ra muối sắt (II) sulfate (FeSO4)",
    "re": "Sẽ thu được muối sắt (II) sulfate (FeSO4) và khí hydro (H2)"
  },
  {
    "con": "Hòa tan hoàn toàn m gam hỗn hợp gồm Na_{2}O và Al_{2}O_{3} (tỉ lệ mol tương ứng là 4 : 3) vào nước, thu được dung dịch X. Cho từ từ dung dịch HCl 1M vào X, kết quả thí nghiệm được ghi ở bảng sau\nGiá trị của a và m lần lượt là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cho một mẫu khí CO2 vào dung dịch nước vôi trong, nếu có kết tủa xuất hiện thì",
    "re": "Dung dịch nước vôi trong đã phản ứng với CO2 tạo thành CaCO3"
  },
  {
    "con": "Khi đun nóng một hợp chất hữu cơ chứa nhóm chức -OH, nếu có mùi thơm tỏa ra thì",
    "re": "Hợp chất đó có thể là este"
  },
  {
    "con": "Khi cho dung dịch NaOH vào dung dịch HCl, nếu pH của dung dịch tăng lên thì",
    "re": "Phản ứng trung hòa giữa NaOH và HCl đang diễn ra"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit tạo ra khí H2, thì",
    "re": "Kim loại đó phải nằm ở vị trí cao hơn trong dãy hoạt động hóa học"
  },
  {
    "con": "Khi cho dung dịch AgNO3 vào dung dịch NaCl, nếu có kết tủa trắng xuất hiện thì",
    "re": "Dung dịch NaCl chứa ion Cl- đã phản ứng với Ag+ tạo thành AgCl"
  },
  {
    "con": "Nếu một dung dịch có pH = 7 thì",
    "re": "Dung dịch đó là dung dịch trung tính"
  },
  {
    "con": "Khi đun nóng dung dịch chứa muối amoni, nếu có khí bay lên thì",
    "re": "Khí đó có thể là NH3"
  },
  {
    "con": "Nếu một hợp chất có công thức phân tử CnH2n+2 thì",
    "re": "Hợp chất đó là ankan"
  },
  {
    "con": "Khi cho dung dịch H2SO4 vào dung dịch Na2CO3, nếu có khí thoát ra thì",
    "re": "Khí đó là CO2 do phản ứng giữa H2SO4 và Na2CO3"
  },
  {
    "con": "Cho các phát biểu sau :\n(a) Mỡ lợn hoặc dầu dừa có thể dùng làm nguyên liệu để sản xuất xà phòng.\n(b) Nước ép của quả nho chín có thể tham gia phản ứng tráng bạc.\n(c) Trong tơ tằm có các gốc α-amino axit.\n(d) Cao su lưu hóa có tính đàn hồi, lâu mòn và khó tan hơn cao su thường.\n(e) Một số este có mùi thơm được dùng làm chất tạo hương cho thực phẩm và mỹ phẩm.\nSố phát biểu đúng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong phản ứng hóa học",
    "re": "thường làm tăng tốc độ phản ứng"
  },
  {
    "con": "Một chất điện ly mạnh trong dung dịch",
    "re": "sẽ phân ly hoàn toàn thành ion"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7",
    "re": "dung dịch đó trở thành axit"
  },
  {
    "con": "Khi một kim loại phản ứng với axit",
    "re": "sẽ tạo ra khí hidro và muối"
  },
  {
    "con": "Khi một hợp chất hữu cơ có nhóm chức -OH",
    "re": "nó được gọi là ancol"
  },
  {
    "con": "Khi nhiệt độ của một chất rắn tăng lên",
    "re": "nó có thể chuyển sang trạng thái lỏng"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong môi trường kín",
    "re": "khối lượng tổng thể của hệ thống sẽ không thay đổi"
  },
  {
    "con": "Khi một dung dịch bão hòa được làm nguội",
    "re": "có thể xảy ra hiện tượng kết tinh"
  },
  {
    "con": "Khi một chất phản ứng với oxy",
    "re": "nó sẽ xảy ra phản ứng oxi hóa"
  },
  {
    "con": "Đốt cháy hoàn toàn 17,16 gam triglixerit X, thu được H_{2}O và 1,1 mol CO_{2}. Cho 17,16 gam X tác dụng với dung dịch NaOH vừa đủ, thu được glyxerol và m gam muối.Mặt khác, 17,16 gam X tác dụng được tối đa với 0,04 mol Br_{2} trong dung dịch. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 1 mol NaCl vào nước, nhiệt độ của dung dịch sẽ giảm do quá trình hòa tan là quá trình thu nhiệt",
    "re": "Nhiệt độ của dung dịch sẽ giảm"
  },
  {
    "con": "Khi một chất rắn được nung nóng đến nhiệt độ cao, nếu nó bắt đầu chuyển sang trạng thái lỏng, thì chất đó đang trải qua quá trình nóng chảy",
    "re": "Chất đó đang trải qua quá trình nóng chảy"
  },
  {
    "con": "Nếu một dung dịch có pH = 7, thì dung dịch đó được coi là trung tính",
    "re": "Dung dịch đó được coi là trung tính"
  },
  {
    "con": "Khi một axit phản ứng với một bazơ, sản phẩm của phản ứng sẽ là muối và nước",
    "re": "Sản phẩm của phản ứng sẽ là muối và nước"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước, thì chất đó thường là chất ion hoặc phân cực",
    "re": "Chất đó thường là chất ion hoặc phân cực"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên, thì áp suất hơi của dung dịch sẽ giảm",
    "re": "Áp suất hơi của dung dịch sẽ giảm"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng thường sẽ tăng lên",
    "re": "Tốc độ phản ứng thường sẽ tăng lên"
  },
  {
    "con": "Khi một chất khí được nén lại, nếu nhiệt độ không thay đổi, thì áp suất của chất khí sẽ tăng lên",
    "re": "Áp suất của chất khí sẽ tăng lên"
  },
  {
    "con": "Nếu một dung dịch có nồng độ ion H^+ cao, thì dung dịch đó sẽ có pH thấp",
    "re": "Dung dịch đó sẽ có pH thấp"
  },
  {
    "con": "Thực hiện các thí nghiệm sau :\na) Sục khí CO_{2} vào dung dịch NaOH dư.\nb) Cho kim loại Cu vào dung dịch FeCl_{3} dư.\nc)  Cho dung dịch HCl vào dung dịch NaAlO_{2} dư.\nd)  Cho dung dịch Fe(NO_{3})_{2} vào dung dịch AgNO_{3} dư.\ne) Cho dung dịch NaHCO_{3} vào dung dịch Ca(OH) _{2} dư\nSau khi các phản ứng kết thúc, số thí nghiệm thu được kết tủa là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Thực hiện phản ứng giữa axit clohidric (HCl) và natri hidroxit (NaOH)",
    "re": "Sẽ tạo ra nước (H2O) và natri clorua (NaCl)"
  },
  {
    "con": "Thực hiện phản ứng giữa axit sulfuric (H2SO4) và đồng (Cu)",
    "re": "Sẽ tạo ra đồng(II) sulfate (CuSO4) và khí hydro (H2)"
  },
  {
    "con": "Thực hiện phản ứng giữa canxi cacbonat (CaCO3) và axit axetic (CH3COOH)",
    "re": "Sẽ tạo ra canxi axetat (Ca(CH3COO)2), nước (H2O) và khí carbon dioxide (CO2)"
  },
  {
    "con": "Thực hiện phản ứng giữa kali permanganat (KMnO4) và natri bisulfite (NaHSO3) trong môi trường axit",
    "re": "Sẽ xảy ra phản ứng oxi hóa khử, tạo ra mangan(II) ion (Mn^2+) và sulfate (SO4^2-)"
  },
  {
    "con": "Thực hiện phản ứng giữa sắt (Fe) và oxi (O2) trong không khí",
    "re": "Sẽ tạo ra sắt(III) oxit (Fe2O3)"
  },
  {
    "con": "Thực hiện phản ứng giữa amoniac (NH3) và axit clohidric (HCl)",
    "re": "Sẽ tạo ra muối amoni clorua (NH4Cl)"
  },
  {
    "con": "Thực hiện phản ứng giữa natri bicarbonat (NaHCO3) và axit citric (C6H8O7)",
    "re": "Sẽ tạo ra khí carbon dioxide (CO2), nước (H2O) và muối natri citrat"
  },
  {
    "con": "Thực hiện phản ứng giữa đồng(II) oxit (CuO) và axit sulfuric (H2SO4)",
    "re": "Sẽ tạo ra đồng(II) sulfate (CuSO4) và nước (H2O)"
  },
  {
    "con": "Thực hiện phản ứng giữa kali nitrat (KNO3) và natri clorua (NaCl) trong dung dịch",
    "re": "Sẽ không xảy ra phản ứng hóa học, chỉ tạo ra dung dịch muối"
  },
  {
    "con": "Cho sơ đồ các phản ứng theo đúng tỉ lệ mol:\n        (a) X  + 4AgNO_{3} + 6NH_{3} + 2H_{2}O \\xrightarrow X_{1} + 4Ag + 4NH_{4}NO_{3}                \n        (b) X_{1} + 2NaOH \\xrightarrow  X_{2} + 2NH_{3} + 2H_{2}O\n        c) X_{2} + 2HCl \\xrightarrow  X_{3} + 2NaCl\n        d) X_{3} + C_{2}H_{5}OH \\xrightleftarrow[H_{2}SO_{4}] X_{4} + H_{2}O (X_{4} : C_{2}H_{5}-OOC-COOH)\nBiết X là hợp chất hữu cơ no, mạch hở, chỉ chứa một loại nhóm chức. Khi đốt cháy hoàn toàn X_{2}, sản phẩm thu được chỉ gồm CO_{2} và Na_{2}CO_{3}. Phân tử khối của X_{4} là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức phân tử C_{n}H_{2n+2} thì",
    "re": "hợp chất đó là ankan"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao và áp suất lớn thì",
    "re": "phản ứng có thể xảy ra theo hướng thuận"
  },
  {
    "con": "Nếu pH của dung dịch axit nhỏ hơn 7 thì",
    "re": "dung dịch đó có tính axit"
  },
  {
    "con": "Nếu một hợp chất có điểm sôi cao hơn nước thì",
    "re": "hợp chất đó có thể có liên kết hydro mạnh"
  },
  {
    "con": "Nếu một phản ứng xảy ra với sự tham gia của chất xúc tác thì",
    "re": "tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Nếu nồng độ của một dung dịch tăng lên thì",
    "re": "tính chất hóa học của dung dịch có thể thay đổi"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit tạo ra khí hidro thì",
    "re": "kim loại đó phải nằm trên hydro trong dãy hoạt động hóa học"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước thì",
    "re": "chất đó có thể là một muối hoặc đường"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng oxi hóa khử thì",
    "re": "có sự chuyển giao electron giữa các chất tham gia"
  },
  {
    "con": "Tiến hành thí nghiệm theo các bước sau:\nBước 1: Cho vào hai ống nghiệm mỗi ống 2 ml etyl axetat.\nBước 2: Thêm 2 ml dung dịch H_{2}SO_{4} 20% vào ống thứ nhất; 4 ml dung dịch NaOH 30% vào ống thứ hai.\nBước 3: Lắc đều cả hai ống nghiệm, lắp ống sinh hàn, đun sôi nhẹ trong khoảng 5 phút, để nguội.\nCho các phát biểu sau:\na) Sau bước 2, chất lỏng trong cả hai ống nghiệm đều phân thành hai lớp.\nb) Sau bước 3, Chất lỏng trong cả hai ống nghiệm đều đồng nhất.\nc) Sau bước 3, ở hai ống nghiệm đều thu được sản phẩm giống nhau.\nd) Ở bước 3, có thể thay việc đun sôi nhẹ bằng đun cách thủy (ngâm trong nước nóng).\ne) Ống sinh hàn có tác dụng hạn chế sự thất thoát của các chất lỏng trong ống nghiệm.\nSố phát biểu đúng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan muối natri clorua trong nước,\nchất lỏng thu được sẽ dẫn điện tốt.",
    "re": "Điện phân có thể xảy ra"
  },
  {
    "con": "Khi đun nóng một hợp chất hữu cơ có chứa liên kết đôi,\nliên kết đôi có thể bị đứt và tạo thành sản phẩm mới.",
    "re": "Phản ứng hóa học xảy ra"
  },
  {
    "con": "Khi thêm axit vào dung dịch kiềm,\nphản ứng trung hòa sẽ xảy ra và tạo ra muối và nước.",
    "re": "pH của dung dịch sẽ giảm"
  },
  {
    "con": "Khi cho kim loại vào dung dịch axit,\nkim loại sẽ phản ứng và giải phóng khí hidro.",
    "re": "Khí hidro sẽ xuất hiện"
  },
  {
    "con": "Khi thực hiện phản ứng oxi hóa khử,\nchất khử sẽ mất electron và chất oxi hóa sẽ nhận electron.",
    "re": "Số oxi hóa của chất khử sẽ tăng"
  },
  {
    "con": "Khi tiến hành phản ứng giữa axit và bazơ,\nđiều kiện cần thiết là hai chất phải tương tác với nhau.",
    "re": "Sản phẩm tạo thành sẽ là muối và nước"
  },
  {
    "con": "Khi một chất rắn tan trong dung môi,\nkhối lượng của dung dịch sẽ tăng lên.",
    "re": "Nồng độ của dung dịch sẽ thay đổi"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao,\nđiều này có thể làm tăng tốc độ phản ứng.",
    "re": "Tốc độ phản ứng sẽ tăng"
  },
  {
    "con": "Khi một chất khí được làm lạnh,\nkhối lượng của chất khí sẽ không thay đổi nhưng thể tích sẽ giảm.",
    "re": "Áp suất của chất khí có thể tăng lên"
  },
  {
    "con": "Hòa tan hoàn toàn m gam hỗn hợp gồm CuSO_{4} và NaCl vào nước, thu được dung dịch X. Tiến hành điện phân X với các điện cực trơ, màn ngăn xốp, dòng điện có cường độ không đổi. Tổng số mol khí thu được trên cả hai điện cực (n) phụ thuộc vào thời gian điện phân (t) được mô tả như đồ thị bên (đồ thị gấp khúc tại các điểm M, N). Giả thuyết hiệu suất điện phân là 100%, bỏ qua sự bay hơi của nước. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi cho một lượng axit mạnh như HCl vào dung dịch NaOH, phản ứng trung hòa xảy ra và sản phẩm tạo thành là nước và muối NaCl.",
    "re": "pH của dung dịch sau phản ứng sẽ gần bằng 7"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit tạo ra khí H_{2}, thì kim loại đó phải nằm trong dãy hoạt động hóa học của kim loại.",
    "re": "Kim loại đó là kim loại hoạt động"
  },
  {
    "con": "Khi nhiệt độ của một phản ứng hóa học tăng lên, nếu phản ứng đó là phản ứng thuận nghịch, thì tốc độ phản ứng thuận sẽ tăng nhanh hơn tốc độ phản ứng nghịch.",
    "re": "Cân bằng hóa học sẽ dịch chuyển sang phía sản phẩm"
  },
  {
    "con": "Nếu một dung dịch có nồng độ ion H^{+} là 10^{-3} mol/L, thì pH của dung dịch đó sẽ là",
    "re": "3"
  },
  {
    "con": "Khi cho một lượng bột kim loại Mg vào dung dịch HCl, nếu phản ứng xảy ra hoàn toàn, thì lượng khí H_{2} thu được sẽ tỉ lệ thuận với lượng Mg đã sử dụng.",
    "re": "Số mol H_{2} thu được sẽ bằng số mol Mg phản ứng"
  },
  {
    "con": "Nếu một hợp chất hữu cơ có công thức phân tử C_{n}H_{2n+2}, thì hợp chất đó có thể là một ankan.",
    "re": "Hợp chất đó là bão hòa"
  },
  {
    "con": "Khi cho dung dịch NaOH vào dung dịch CuSO_{4}, nếu có kết tủa xanh xuất hiện, thì phản ứng xảy ra là phản ứng giữa ion Cu^{2+} và ion OH^{-}.",
    "re": "Kết tủa xanh là Cu(OH)_{2}"
  },
  {
    "con": "Nếu một chất rắn không tan trong nước nhưng tan trong dung dịch axit, thì chất đó có thể là một muối không tan.",
    "re": "Chất đó có thể là muối của kim loại kiềm thổ"
  },
  {
    "con": "Khi một dung dịch chứa ion Ag^{+} được thêm vào dung dịch chứa ion Cl^{-}, nếu có kết tủa trắng xuất hiện, thì phản ứng xảy ra là phản ứng giữa ion Ag^{+} và ion Cl^{-}.",
    "re": "Kết tủa trắng là AgCl"
  },
  {
    "con": "Hòa tan hết m gam hỗn hợp X gồm Fe, FeO, Fe_{2}O_{3} và Fe_{3}O_{4} vào dung dịch HCl dư, thu được 0,04 mol H_{2} và dung dịch chứa 36,42 gam hỗn hợp muối. Mặt khác, hòa tan hoàn toàn m gam X trong dung dịch chứa 0,625 mol H_{2}SO_{4} (đặc) đun nóng, thu được dung dịch Y và a mol SO_{2} (sản phẩm khử duy nhất của S+6). Cho 450 ml dung dịch NaOH 1M vào Y, sau khi phản ứng kết thúc thu được 10,7 gam một chất kết tủa. Giá trị của a là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hòa tan 10 gam NaCl vào 100 ml nước,",
    "re": "thu được dung dịch NaCl 0,1M"
  },
  {
    "con": "Khi đun nóng dung dịch HCl với kim loại Zn,",
    "re": "sẽ thu được khí H_{2} và dung dịch ZnCl_{2}"
  },
  {
    "con": "Khi cho dung dịch NaOH vào dung dịch HCl,",
    "re": "sẽ xảy ra phản ứng trung hòa tạo ra muối NaCl và nước"
  },
  {
    "con": "Khi cho dung dịch AgNO_{3} vào dung dịch NaCl,",
    "re": "sẽ thu được kết tủa AgCl trắng"
  },
  {
    "con": "Khi đốt cháy 1 mol C trong không khí,",
    "re": "sẽ tạo ra 1 mol CO_{2}"
  },
  {
    "con": "Khi hòa tan 5 gam CaCO_{3} vào dung dịch HCl,",
    "re": "sẽ thu được khí CO_{2} và dung dịch CaCl_{2}"
  },
  {
    "con": "Khi cho dung dịch H_{2}SO_{4} vào dung dịch NaOH,",
    "re": "sẽ thu được muối Na_{2}SO_{4} và nước"
  },
  {
    "con": "Khi cho dung dịch Ba(OH)_{2} vào dung dịch H_{2}SO_{4},",
    "re": "sẽ thu được kết tủa BaSO_{4} trắng"
  },
  {
    "con": "Khi hòa tan 10 gam đường glucose vào 100 ml nước,",
    "re": "sẽ thu được dung dịch glucose 0,1M"
  },
  {
    "con": "Cho 7,34 gam hỗn hợp E gồm hai este mạch hở X và Y (đều tạo bởi axit cacboxylic và ancol ; MX<MY<150) tác dụng vừa đủ với dung dịch NaOH, thu được một ancol Z và 6,74 gam hỗn hợp muối T. Cho toàn bộ Z tác dụng với Na dư, thu được 1,12 lít khí H_{2}. Đốt cháy hoàn toàn T, thu được H_{2}O, Na_{2}CO_{3} và 0,05 mol CO_{2}. Phần trăm khối lượng của X trong E là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một kim loại tác dụng với axit, sản phẩm tạo thành là muối và khí H2",
    "re": "Kim loại phản ứng với axit"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó là axit",
    "re": "Dung dịch có tính axit"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng lên",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Nếu một hợp chất có công thức phân tử CnH2n+2, thì hợp chất đó là ankan",
    "re": "Hợp chất là ankan"
  },
  {
    "con": "Khi một este bị thủy phân trong môi trường axit, sản phẩm thu được là ancol và axit",
    "re": "Sản phẩm là ancol và axit"
  },
  {
    "con": "Nếu một chất có độ tan trong nước cao, thì chất đó thường là ion hoặc phân cực",
    "re": "Chất có tính tan tốt"
  },
  {
    "con": "Khi một phản ứng oxi hóa xảy ra, electron sẽ được chuyển từ chất bị oxi hóa sang chất bị khử",
    "re": "Chuyển electron giữa các chất"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol/lít cao, thì khả năng phản ứng của các ion trong dung dịch cũng cao",
    "re": "Khả năng phản ứng cao"
  },
  {
    "con": "Khi một hợp chất hữu cơ có nhóm chức -OH, thì hợp chất đó có thể là rượu",
    "re": "Hợp chất có thể là rượu"
  },
  {
    "con": "Hòa tan hết 23,18 gam hỗn hợp X gồm Fe, Mg và Fe(NO_{3})_{3} vào dung dịch chứa 0,92 mol HCl và 0,01 mol NaNO_{3}, thu được dung dịch Y (chất tan chỉ có 46,95 gam hỗn hợp muối) và 2,92 gam hỗn hợp Z gồm ba khí không màu (trong đó hai khí có số mol bằng nhau). Dung dịch Y phản ứng được tối đa 0,91 mol KOH, thu được 29,18 gam kết tủa. Biết các phản ứng xảy ra hoàn toàn. Phần trăm thể tích của khí có phân tử khối lớn nhất trong Z là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nung 10 gam CaCO_{3} ở nhiệt độ cao, sản phẩm thu được là",
    "re": "10,88 gam CaO và 4,4 gam CO_{2}"
  },
  {
    "con": "Khi cho 1 mol H_{2} phản ứng với 1 mol O_{2} trong điều kiện tiêu chuẩn, sản phẩm thu được là",
    "re": "2 mol H_{2}O"
  },
  {
    "con": "Khi hòa tan 58,5 gam NaCl vào 1 lít nước, nồng độ mol của dung dịch NaCl là",
    "re": "1 mol/L"
  },
  {
    "con": "Nếu 2 mol HCl phản ứng với 1 mol NaOH, thì sản phẩm thu được là",
    "re": "2 mol NaCl và 2 mol H_{2}O"
  },
  {
    "con": "Khi cho 1 mol NH_{3} vào 1 mol HCl, thì sản phẩm thu được là",
    "re": "1 mol NH_{4}Cl"
  },
  {
    "con": "Nếu 10 gam H_{2} phản ứng với 80 gam O_{2}, thì lượng nước thu được là",
    "re": "90 gam H_{2}O"
  },
  {
    "con": "Khi hòa tan 10 gam KCl vào 100 ml nước, nồng độ mol của dung dịch KCl là",
    "re": "0,85 mol/L"
  },
  {
    "con": "Nếu 1 mol CO_{2} được hấp thụ hoàn toàn trong dung dịch NaOH, thì lượng NaOH tiêu tốn là",
    "re": "1 mol"
  },
  {
    "con": "Khi cho 1 mol Fe vào dung dịch HCl, thì sản phẩm thu được là",
    "re": "1 mol FeCl_{2} và 1 mol H_{2}"
  },
  {
    "con": "Chất X (C_{n}H_{2}_{n+4}O_{4}N_{2}) là muối amoni của axit cacboxylic đa chức, chất Y (C_{m}H_{2}_{m+4}O_{2}N_{2}) là muối amoni của một amino axit. Cho m gam E gồm X và Y (có tỉ lệ mol tương ứng là 7 : 3) tác dụng hết với lượng dư dung dịch NaOH đun nóng, thu được 0,17 mol etyl amin và 15,09 gam hỗn hợp muối. Phần trăm khối lượng của X trong E có giá trị gần nhất với giá trị nào sau đây ?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch có pH = 7 thì dung dịch đó là trung tính",
    "re": "Không có ion H+ hay OH- dư thừa"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra theo phương trình cân bằng, thì tổng số mol của các chất phản ứng sẽ bằng tổng số mol của các sản phẩm sau khi cân bằng",
    "re": "Phản ứng được cân bằng"
  },
  {
    "con": "Nếu nhiệt độ tăng lên trong một phản ứng hóa học tỏa nhiệt, thì vị trí cân bằng sẽ dịch chuyển sang bên trái",
    "re": "Sản phẩm sẽ giảm và phản ứng sẽ chậm lại"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước, thì nó sẽ dễ dàng hòa tan và tạo thành dung dịch",
    "re": "Nồng độ ion trong dung dịch sẽ tăng"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit, thì sản phẩm của phản ứng sẽ bao gồm muối và khí hidro",
    "re": "Kim loại đã tham gia phản ứng"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng, thì nó có khả năng tồn tại dưới dạng đồng phân quang học",
    "re": "Chất có thể có nhiều dạng đồng phân"
  },
  {
    "con": "Nếu một dung dịch có nồng độ ion H+ cao, thì pH của dung dịch đó sẽ thấp hơn 7",
    "re": "Dung dịch đó là axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao, thì vị trí cân bằng sẽ dịch chuyển về phía có ít mol khí hơn",
    "re": "Phản ứng sẽ có xu hướng tạo ra sản phẩm"
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn nước, thì nó sẽ không bay hơi dễ dàng ở nhiệt độ phòng",
    "re": "Chất đó có thể tồn tại ở trạng thái lỏng"
  },
  {
    "con": "Trong quá trình bảo quản, một mẫu muối FeSO_{4}.7H_{2}O (có khối lượng m gam) bị oxi hóa bởi oxi không khí tạo thành hỗn hợp X chứa các hợp chất của Fe (II) và Fe (III). Hòa tan toàn bộ X trong dung dịch loãng chứa 0,025 mol H_{2}SO_{4}, thu được 100 ml dung dịch Y. Tiến hành hai thí nghiệm với Y:\n        Thí nghiệm 1: Cho lượng dư dung dịch BaCl_{2} vào 20 ml dung dịch Y, thu được 2,33 gam kết tủa.\n        Thí nghiệm 2: Thêm dung dịch H_{2}SO_{4} (loãng, dư) vào 20 ml dung dịch Y, thu được dung dịch Z. Nhỏ từ từ dung dịch KMnO_{4} 0,1M vào Z đến khi phản ứng đủ thì hết 8,6 ml.\nGiá trị của m và phần trăm số mol Fe (II) đã bị oxi hóa trong không khí lần lượt là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một hợp chất ion được hòa tan trong nước, nếu nó tạo ra ion H^{+} thì dung dịch sẽ có tính axit.",
    "re": "pH của dung dịch giảm"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng sẽ tăng lên.",
    "re": "Năng lượng kích hoạt sẽ được cung cấp"
  },
  {
    "con": "Khi một chất rắn được hòa tan trong dung môi, nếu nhiệt độ của dung môi tăng lên, thì khả năng hòa tan của chất rắn sẽ tăng.",
    "re": "Sự hòa tan diễn ra nhanh hơn"
  },
  {
    "con": "Nếu một dung dịch chứa ion Ag^{+} được thêm vào dung dịch chứa ion Cl^{-}, thì sẽ xảy ra phản ứng tạo thành kết tủa AgCl.",
    "re": "Kết tủa AgCl sẽ xuất hiện"
  },
  {
    "con": "Khi một chất oxi hóa mạnh như KMnO_{4} được thêm vào dung dịch chứa ion Fe^{2+}, thì ion Fe^{2+} sẽ bị oxi hóa thành ion Fe^{3+}.",
    "re": "Màu tím của KMnO_{4} sẽ nhạt đi"
  },
  {
    "con": "Nếu một dung dịch kiềm được thêm vào dung dịch axit, thì pH của dung dịch sẽ tăng.",
    "re": "Dung dịch trở nên ít axit hơn"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong môi trường kín, nếu nhiệt độ tăng lên, thì áp suất trong hệ thống sẽ tăng.",
    "re": "Theo định luật Gay-Lussac"
  },
  {
    "con": "Nếu một chất khí được nén lại trong một bình kín, thì thể tích của chất khí sẽ giảm.",
    "re": "Áp suất của chất khí sẽ tăng lên"
  },
  {
    "con": "Khi một muối hòa tan trong nước, nếu ion của muối đó phản ứng với ion trong dung dịch, thì sẽ tạo ra một kết tủa.",
    "re": "Kết tủa sẽ xuất hiện trong dung dịch"
  },
  {
    "con": "Hỗn hợp X gồm ba este mạch hở đều tạo bởi axit cacboxylic với ancol, trong đó hai este có cùng số nguyên tử cacbon trong phân tử. Xà phòng hóa hoàn toàn 7,76 gam X bằng dung dịch NaOH vừa đủ, thu được hỗn hợp Y gồm hai ancol đơn chức, kế tiếp trong dãy đồng đẳng và hỗn hợp Z gồm hai muối. Cho toàn bộ Y vào bình đựng kim loại Na dư, sau phản ứng có khí H_{2} thoát ra và khối lượng bình tang 4 gam. Đốt cháy hoàn toàn Z cần vừa đủ 0,09 mol O_{2}, thu được Na_{2}CO_{3} và 4,96 gam hỗn hợp CO_{2} và H_{2}O. Phần trăm khối lượng của este có phân tử khối nhỏ nhất trong X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch chứa ion Ag^+ được thêm vào dung dịch chứa ion Cl^-, thì",
    "re": "sẽ tạo ra kết tủa AgCl trắng"
  },
  {
    "con": "Nếu nhiệt độ của một phản ứng hóa học tăng lên, thì",
    "re": "tốc độ phản ứng thường sẽ tăng lên"
  },
  {
    "con": "Nếu một hợp chất có công thức phân tử C_nH_{2n+2}, thì",
    "re": "hợp chất đó là ankan"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì",
    "re": "dung dịch đó là axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra theo phương trình cân bằng, thì",
    "re": "nồng độ của các chất tham gia và sản phẩm sẽ không thay đổi theo thời gian"
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn chất khác, thì",
    "re": "chất đó thường có lực liên kết giữa các phân tử mạnh hơn"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit, thì",
    "re": "sẽ sinh ra khí H_{2} và muối của kim loại đó"
  },
  {
    "con": "Nếu một dung dịch chứa ion OH^- được thêm vào dung dịch chứa ion H^+, thì",
    "re": "sẽ xảy ra phản ứng trung hòa tạo ra nước"
  },
  {
    "con": "Nếu một hợp chất hữu cơ có nhóm chức -OH, thì",
    "re": "hợp chất đó có thể là ancol hoặc phenol"
  },
  {
    "con": "Saccarozơ là một loại đisaccarit có nhiều trong cây mía, hoa thốt nốt, củ cải đường. Công thức phân tử của saccarozơ là",
    "re": "C12H22O11"
  },
  {
    "con": "Nước là một hợp chất được hình thành từ phản ứng giữa hydro và oxy. Công thức phân tử của nước là",
    "re": "H2O"
  },
  {
    "con": "Khi một kim loại phản ứng với axit, sản phẩm tạo thành thường là muối và khí hidro. Ví dụ, khi kẽm phản ứng với axit clohidric, sản phẩm tạo thành là",
    "re": "kẽm clorua và khí hidro"
  },
  {
    "con": "Trong phản ứng hóa học, nếu tổng khối lượng của các chất phản ứng bằng tổng khối lượng của các sản phẩm, thì điều này thể hiện",
    "re": "định luật bảo toàn khối lượng"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng lên. Điều này là do",
    "re": "các phân tử có năng lượng cao hơn và va chạm nhiều hơn"
  },
  {
    "con": "Nếu một dung dịch có pH nhỏ hơn 7, thì dung dịch đó được coi là",
    "re": "axit"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước và tạo thành dung dịch, thì chất đó được gọi là",
    "re": "chất tan"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí, thì sản phẩm tạo thành có thể là",
    "re": "cồn hoặc axit lactic"
  },
  {
    "con": "Khi một chất khí được làm lạnh, thể tích của nó sẽ giảm. Điều này được giải thích bởi",
    "re": "định luật Boyle"
  },
  {
    "con": "Nếu một hợp chất có điểm sôi cao hơn nước, thì hợp chất đó thường có",
    "re": "liên kết hydro mạnh hơn"
  },
  {
    "con": "Nung nóng Fe(OH)_{3} đến khối lượng không đổi, thu được chất rắn là",
    "re": "Fe2O3"
  },
  {
    "con": "Khi hòa tan NaCl trong nước, dung dịch thu được sẽ có",
    "re": "ion Na+ và Cl-"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7, dung dịch đó sẽ",
    "re": "có tính axit"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, năng lượng thường được",
    "re": "giải phóng hoặc hấp thụ"
  },
  {
    "con": "Khi đun nóng một hợp chất hữu cơ, nếu có khí thoát ra, có thể có",
    "re": "phản ứng phân hủy"
  },
  {
    "con": "Khi thêm axit vào dung dịch kiềm, sẽ xảy ra",
    "re": "phản ứng trung hòa"
  },
  {
    "con": "Khi một kim loại phản ứng với axit, sản phẩm thường là",
    "re": "muối và khí hidro"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên, tốc độ phản ứng sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Khi một chất rắn tan trong dung dịch, nó sẽ",
    "re": "tạo thành dung dịch đồng nhất"
  },
  {
    "con": "Khi nhiệt độ tăng, độ hòa tan của hầu hết các chất rắn trong nước sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Trùng hợp vinyl clorua thu được polime có tên gọi là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học là",
    "re": "H2O"
  },
  {
    "con": "Khi axit hydrochloric phản ứng với natri hydroxide, sản phẩm tạo thành là",
    "re": "Natri clorua và nước"
  },
  {
    "con": "Trong phản ứng oxi hóa, chất bị oxi hóa sẽ",
    "re": "mất electron"
  },
  {
    "con": "Nếu nhiệt độ tăng, tốc độ phản ứng hóa học thường",
    "re": "tăng lên"
  },
  {
    "con": "Khi một chất tan trong nước tạo ra ion, chất đó được gọi là",
    "re": "chất điện ly"
  },
  {
    "con": "Nếu pH của dung dịch nhỏ hơn 7, dung dịch đó được coi là",
    "re": "axit"
  },
  {
    "con": "Khi một kim loại phản ứng với axit, sản phẩm tạo thành thường là",
    "re": "muối và khí hydro"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yên tĩnh, thì",
    "re": "năng lượng được giải phóng hoặc hấp thụ có thể thấp hơn"
  },
  {
    "con": "Trong bảng tuần hoàn, các nguyên tố cùng nhóm có",
    "re": "tính chất hóa học tương tự"
  },
  {
    "con": "Các loại phân lân đều cung cấp cho cây trồng nguyên tố",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nước có công thức hóa học H2O",
    "re": "Nước là một hợp chất"
  },
  {
    "con": "Các nguyên tố trong bảng tuần hoàn được sắp xếp theo số nguyên tử tăng dần",
    "re": "Bảng tuần hoàn phản ánh tính chất hóa học của nguyên tố"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng",
    "re": "Nhiệt độ ảnh hưởng đến động học phản ứng"
  },
  {
    "con": "Các axit có khả năng cho proton (H+) trong dung dịch",
    "re": "Axit là chất có tính axit"
  },
  {
    "con": "Khi một chất phản ứng với oxy, sản phẩm thường là khí carbon dioxide và nước",
    "re": "Đó là phản ứng cháy"
  },
  {
    "con": "Các ion mang điện tích trái dấu sẽ hút nhau",
    "re": "Sự tương tác giữa các ion tạo ra lực điện"
  },
  {
    "con": "Hợp chất ion thường có điểm nóng chảy cao",
    "re": "Hợp chất ion có cấu trúc tinh thể"
  },
  {
    "con": "Khi pH của dung dịch giảm, nồng độ ion H+ tăng",
    "re": "Dung dịch trở nên axit hơn"
  },
  {
    "con": "Các phản ứng hóa học có thể được biểu diễn bằng phương trình hóa học",
    "re": "Phương trình hóa học thể hiện sự bảo toàn khối lượng"
  },
  {
    "con": "Sục khí axetilen vào dung dịch AgNO_{3} trong NH_{3} thu được kết tủa màu",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cho axit clohidric vào dung dịch natri hidroxit",
    "re": "Phản ứng trung hòa xảy ra, tạo ra muối natri clorua và nước"
  },
  {
    "con": "Đun nóng dung dịch muối amoni clorua",
    "re": "Giải phóng khí amoniac"
  },
  {
    "con": "Cho kim loại kẽm vào dung dịch đồng(II) sulfat",
    "re": "Kim loại đồng sẽ được giải phóng ra ngoài"
  },
  {
    "con": "Pha loãng axit sulfuric đặc với nước",
    "re": "Phản ứng tỏa nhiệt mạnh và có thể gây bỏng"
  },
  {
    "con": "Cho dung dịch phenol vào dung dịch brom",
    "re": "Xuất hiện kết tủa trắng do phản ứng tạo thành bromophenol"
  },
  {
    "con": "Cho dung dịch kali permanganat vào dung dịch axit",
    "re": "Kali permanganat sẽ bị khử và chuyển màu từ tím sang không màu"
  },
  {
    "con": "Đun nóng dung dịch natri bicarbonat",
    "re": "Giải phóng khí carbon dioxide"
  },
  {
    "con": "Cho dung dịch axit nitric vào dung dịch bạc nitrat",
    "re": "Tạo ra kết tủa bạc clorua"
  },
  {
    "con": "Cho dung dịch axit acetic vào dung dịch natri cacbonat",
    "re": "Sẽ có bọt khí carbon dioxide thoát ra"
  },
  {
    "con": "Kim loại nào sau đây có nhiệt độ nóng chảy cao nhất?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức hóa học là H2O,",
    "re": "thì đó là nước."
  },
  {
    "con": "Nếu pH của dung dịch là 7,",
    "re": "thì dung dịch đó được coi là trung tính."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao,",
    "re": "thì tốc độ phản ứng thường tăng lên."
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6,",
    "re": "thì nguyên tố đó là carbon."
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol là 1M,",
    "re": "thì có 1 mol chất tan trong 1 lít dung môi."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt,",
    "re": "thì nó giải phóng năng lượng dưới dạng nhiệt."
  },
  {
    "con": "Nếu một hợp chất có liên kết ion,",
    "re": "thì nó thường có điểm nóng chảy cao."
  },
  {
    "con": "Nếu một nguyên tố có tính kim loại mạnh,",
    "re": "thì nó có xu hướng mất electron dễ dàng."
  },
  {
    "con": "Nếu một dung dịch có tính axit,",
    "re": "thì nó có khả năng cho proton (H+) vào dung dịch."
  },
  {
    "con": "Chất nào sau đây là muối axit?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong phản ứng hóa học thì tốc độ phản ứng sẽ tăng.",
    "re": "Điều này đúng với hầu hết các phản ứng hóa học."
  },
  {
    "con": "Nếu một chất có độ pH dưới 7 thì chất đó là axit.",
    "re": "Điều này đúng theo định nghĩa về pH."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong môi trường nước thì nó có thể tạo ra dung dịch.",
    "re": "Điều này thường xảy ra với các phản ứng ion."
  },
  {
    "con": "Nếu một chất có khả năng dẫn điện trong dung dịch thì chất đó là muối hoặc axit.",
    "re": "Điều này đúng vì chúng phân ly thành ion."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng tỏa nhiệt thì năng lượng được giải phóng.",
    "re": "Điều này có thể được đo bằng nhiệt độ tăng lên."
  },
  {
    "con": "Nếu một chất có công thức hóa học CnH2n+2 thì chất đó là ankan.",
    "re": "Điều này đúng với các hydrocarbon bão hòa."
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn nước thì chất đó có thể có liên kết hydro mạnh.",
    "re": "Điều này thường xảy ra với các phân tử có nhóm -OH."
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng oxi hóa khử thì có sự chuyển giao electron.",
    "re": "Điều này là đặc trưng của phản ứng oxi hóa khử."
  },
  {
    "con": "Nếu một chất có tính axit mạnh thì nó sẽ ion hóa hoàn toàn trong dung dịch.",
    "re": "Điều này đúng với các axit mạnh như HCl."
  },
  {
    "con": "Chất nào sau đây tác dụng được với dung dịch HCl?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi cao hơn 100 độ C,",
    "re": "thì chất đó có thể là một chất lỏng ở nhiệt độ phòng."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra tỏa nhiệt,",
    "re": "thì phản ứng đó được gọi là phản ứng tỏa nhiệt."
  },
  {
    "con": "Nếu một dung dịch có pH < 7,",
    "re": "thì dung dịch đó được coi là axit."
  },
  {
    "con": "Nếu một chất có công thức hóa học là NaCl,",
    "re": "thì chất đó là muối ăn."
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6,",
    "re": "thì nguyên tố đó là carbon."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí,",
    "re": "thì sản phẩm có thể là rượu hoặc axit lactic."
  },
  {
    "con": "Nếu một chất có độ tan trong nước cao,",
    "re": "thì chất đó có thể là một muối hoặc đường."
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử là C2H5OH,",
    "re": "thì chất đó là ethanol."
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra giữa axit và bazơ,",
    "re": "thì sản phẩm sẽ là muối và nước."
  },
  {
    "con": "Chất nào sau đây tác dụng được với dung dịch KHCO_{3}?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong phản ứng hóa học thì tốc độ phản ứng sẽ tăng lên.",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Chất điện ly mạnh trong dung dịch thì sẽ phân ly hoàn toàn thành ion.",
    "re": "Tạo ra ion trong dung dịch"
  },
  {
    "con": "Khi pH của dung dịch giảm thì nồng độ ion H^+ trong dung dịch tăng.",
    "re": "Dịch trở nên axit hơn"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn nước thì nó sẽ bay hơi nhanh hơn ở nhiệt độ phòng.",
    "re": "Chất sẽ bay hơi nhanh hơn"
  },
  {
    "con": "Khi thêm chất xúc tác vào phản ứng hóa học thì năng lượng kích hoạt sẽ giảm.",
    "re": "Phản ứng xảy ra nhanh hơn"
  },
  {
    "con": "Nếu một dung dịch có nồng độ ion OH^- cao thì nó sẽ có tính kiềm.",
    "re": "Dung dịch sẽ có tính kiềm"
  },
  {
    "con": "Khi một chất phản ứng với axit thì sản phẩm có thể là muối và nước.",
    "re": "Tạo ra muối và nước"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch thì có thể xảy ra cả hai chiều.",
    "re": "Phản ứng có thể diễn ra theo cả hai chiều"
  },
  {
    "con": "Khi nồng độ của một chất trong phản ứng tăng lên thì tốc độ phản ứng cũng sẽ tăng.",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Nguyên tố crom có số oxi hóa +3 trong hợp chất nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất chứa ion Na+ và Cl-, thì hợp chất đó là gì?",
    "re": "Natri clorua (NaCl)"
  },
  {
    "con": "Nếu nhiệt độ tăng lên trong một phản ứng hóa học, thì tốc độ phản ứng sẽ như thế nào?",
    "re": "Tăng lên"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là gì?",
    "re": "Axit"
  },
  {
    "con": "Nếu một nguyên tố có số proton là 6, thì nguyên tố đó là gì?",
    "re": "Cacbon (C)"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yếm khí, thì sản phẩm chính có thể là gì?",
    "re": "Cồn hoặc khí metan"
  },
  {
    "con": "Nếu một hợp chất hữu cơ có công thức CnH2n+2, thì hợp chất đó thuộc loại gì?",
    "re": "Hydrocarbon bão hòa"
  },
  {
    "con": "Nếu một nguyên tố có số oxi hóa -2 trong hợp chất, thì nguyên tố đó thường là gì?",
    "re": "Oxy"
  },
  {
    "con": "Nếu một phản ứng hóa học là phản ứng trao đổi, thì sản phẩm của phản ứng sẽ là gì?",
    "re": "Hai hợp chất mới"
  },
  {
    "con": "Nếu một dung dịch có nồng độ molarity cao, thì dung dịch đó có tính chất gì?",
    "re": "Có khả năng dẫn điện tốt hơn"
  },
  {
    "con": "Tên gọi của hợp chất CH3-CHO là",
    "re": "acetaldehyde"
  },
  {
    "con": "Hệ số cân bằng của phản ứng 2H2 + O2 → 2H2O là",
    "re": "2, 1, 2"
  },
  {
    "con": "Nhiệt độ sôi của nước là",
    "re": "100 độ C ở áp suất 1 atm"
  },
  {
    "con": "Hợp chất NaCl là",
    "re": "muối ăn"
  },
  {
    "con": "Phản ứng giữa axit và bazơ tạo ra",
    "re": "muối và nước"
  },
  {
    "con": "Khối lượng mol của nước (H2O) là",
    "re": "18 g/mol"
  },
  {
    "con": "Khi pH của dung dịch nhỏ hơn 7 thì dung dịch đó là",
    "re": "axit"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường",
    "re": "tăng lên"
  },
  {
    "con": "Hợp chất hữu cơ chứa nhóm chức -OH được gọi là",
    "re": "rượu"
  },
  {
    "con": "Khi một nguyên tố mất electron, nó trở thành",
    "re": "ion dương"
  },
  {
    "con": "Vào mùa đông, nhiều gia đình sử dụng bếp than đặt trong phòng kín để sưởi ấm gây ngộ độc khí, có thể dẫn tới tử vong. Nguyên nhân gây ngộ độc là do khí nào sau đây?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một chất rắn được hòa tan trong nước, nếu chất đó là muối thì",
    "re": "nó sẽ tạo ra dung dịch điện ly"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao thì",
    "re": "tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7 thì",
    "re": "dung dịch đó trở thành axit"
  },
  {
    "con": "Nếu một nguyên tố có số hiệu nguyên tử là 6 thì",
    "re": "nguyên tố đó là carbon"
  },
  {
    "con": "Khi một chất khí được nén lại ở nhiệt độ không đổi thì",
    "re": "áp suất của chất khí đó sẽ tăng lên"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao hơn dung dịch khác thì",
    "re": "nó sẽ có khả năng hút nước từ dung dịch kia"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và sản phẩm có năng lượng thấp hơn phản ứng thì",
    "re": "phản ứng đó là phản ứng tỏa nhiệt"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100 độ C thì",
    "re": "chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng"
  },
  {
    "con": "Khi một ion dương kết hợp với một ion âm thì",
    "re": "chúng sẽ tạo thành một hợp chất ion"
  },
  {
    "con": "Số đồng phân este ứng với công thức phân tử C_{3}H_{6}O_{2} là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ sôi của nước là 100 độ C ở áp suất 1 atm",
    "re": "Nước sẽ chuyển sang trạng thái khí"
  },
  {
    "con": "Một phản ứng hóa học xảy ra khi các chất phản ứng có năng lượng kích thích đủ cao",
    "re": "Phản ứng sẽ tạo ra sản phẩm mới"
  },
  {
    "con": "Số mol của một chất được tính bằng khối lượng chia cho khối lượng mol",
    "re": "Kết quả sẽ cho biết số mol của chất đó"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7",
    "re": "Dung dịch sẽ trở nên axit"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước",
    "re": "Chất đó sẽ được coi là chất tan tốt"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng",
    "re": "Phản ứng sẽ xảy ra nhanh hơn"
  },
  {
    "con": "Nếu một hợp chất có liên kết ion",
    "re": "Hợp chất đó sẽ có điểm nóng chảy cao"
  },
  {
    "con": "Khi một chất bị oxi hóa",
    "re": "Chất đó sẽ mất electron"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao",
    "re": "Dung dịch sẽ có khả năng dẫn điện tốt hơn"
  },
  {
    "con": "Dẫn khí CO dư qua ống sứ đựng 16 gam bột Fe_{2}O_{3} nung nóng, thu được hỗn hợp khí X. Cho toàn bộ X vào nước vôi trong dư, thu được m gam kết tủa. Biết các phản ứng xảy ra hoàn toàn. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 10 gam NaCl vào 100 ml nước, nồng độ mol của dung dịch NaCl là",
    "re": "0.17 M"
  },
  {
    "con": "Nếu cho 1 mol H2 vào 1 mol O2 trong điều kiện thích hợp, thì sản phẩm thu được là",
    "re": "2 mol H2O"
  },
  {
    "con": "Khi đun nóng 10 gam bột Mg trong 20 gam bột S, thì sản phẩm tạo thành là",
    "re": "MgS"
  },
  {
    "con": "Nếu cho 50 ml dung dịch HCl 1M phản ứng với 50 ml dung dịch NaOH 1M, thì sản phẩm thu được là",
    "re": "Dung dịch NaCl và nước"
  },
  {
    "con": "Khi cho 5 gam bột Fe vào 50 ml dung dịch H2SO4 1M, thì sản phẩm thu được là",
    "re": "FeSO4 và khí H2"
  },
  {
    "con": "Nếu cho 10 gam bột Cu vào 100 ml dung dịch AgNO3 0.5M, thì lượng Ag thu được là",
    "re": "5 gam"
  },
  {
    "con": "Khi hòa tan 20 gam bột CaCO3 vào 100 ml dung dịch HCl, thì sản phẩm thu được là",
    "re": "CaCl2, CO2 và nước"
  },
  {
    "con": "Nếu cho 1 mol NH3 vào 1 mol HCl, thì sản phẩm thu được là",
    "re": "NH4Cl"
  },
  {
    "con": "Khi đun nóng 10 gam bột Al với 30 gam bột CuO, thì sản phẩm tạo thành là",
    "re": "Al2O3 và Cu"
  },
  {
    "con": "Cặp chất nào sau đây cùng tồn tại trong một dung dịch?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch?",
    "re": "Phản ứng sẽ dịch chuyển theo chiều phản ứng ngược"
  },
  {
    "con": "Một chất có độ pH dưới 7?",
    "re": "Chất đó là axit"
  },
  {
    "con": "Một phản ứng hóa học xảy ra khi hai chất phản ứng với nhau?",
    "re": "Sẽ tạo ra sản phẩm mới"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên?",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Khi một chất bị oxi hóa?",
    "re": "Chất đó sẽ mất electron"
  },
  {
    "con": "Khi một chất bị khử?",
    "re": "Chất đó sẽ nhận electron"
  },
  {
    "con": "Khi nhiệt độ của một chất khí tăng lên?",
    "re": "Áp suất của chất khí đó sẽ tăng lên nếu thể tích không đổi"
  },
  {
    "con": "Khi một dung dịch có nồng độ ion hydroxide (OH-) cao?",
    "re": "Dung dịch đó là kiềm"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện yếm khí?",
    "re": "Sẽ không có sự tham gia của oxy"
  },
  {
    "con": "Cho 9,85 gam hỗn hợp gồm hai amin đơn chức tác dụng vừa đủ với V ml dung dịch HCl 1M, thu được dung dịch chứa 18,975 gam hỗn hợp muối. Giá trị của V là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một kim loại tác dụng với axit, sản phẩm tạo thành sẽ là muối và khí hidro nếu kim loại đó đứng trước hidro trong dãy hoạt động hóa học",
    "re": "Sản phẩm tạo thành là muối và khí hidro"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là",
    "re": "Dung dịch axit"
  },
  {
    "con": "Khi nhiệt độ tăng, nếu áp suất không đổi, thì độ hòa tan của khí trong chất lỏng sẽ",
    "re": "Giảm"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra tỏa nhiệt, thì enthalpy của sản phẩm sẽ",
    "re": "Thấp hơn enthalpy của các phản ứng"
  },
  {
    "con": "Khi cho một lượng chất rắn vào dung dịch, nếu chất rắn không tan, thì dung dịch đó đã đạt đến",
    "re": "Điểm bão hòa"
  },
  {
    "con": "Nếu nồng độ của một dung dịch tăng lên, thì áp suất hơi của dung dịch đó sẽ",
    "re": "Giảm"
  },
  {
    "con": "Khi một chất điện ly mạnh hòa tan trong nước, thì nó sẽ phân ly hoàn toàn thành",
    "re": "Ion"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra theo chiều thuận, thì tốc độ phản ứng sẽ",
    "re": "Giảm khi nồng độ chất phản ứng giảm"
  },
  {
    "con": "Khi một chất rắn được nung nóng đến nhiệt độ cao, nếu nó chuyển thành hơi mà không qua trạng thái lỏng, thì hiện tượng này gọi là",
    "re": "Sublimation"
  },
  {
    "con": "Cho m gam glucozơ (C_{6}H_{12}O_{6}) tác dụng hết với lượng dư dung dịch AgNO_{3} trong NH_{3}, thu được 3,24 gam Ag. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 10 gam NaCl vào 100 ml nước, nồng độ mol của dung dịch NaCl là",
    "re": "0,17 M"
  },
  {
    "con": "Khi đun nóng 1 mol H_{2} với 1 mol O_{2}, sản phẩm tạo thành là",
    "re": "2 mol H_{2}O"
  },
  {
    "con": "Nếu một dung dịch có pH = 3, thì nồng độ ion H^{+} trong dung dịch đó là",
    "re": "1 x 10^{-3} M"
  },
  {
    "con": "Khi cho 1 mol axit clohidric (HCl) tác dụng với 1 mol natri hidroxit (NaOH), sản phẩm tạo thành là",
    "re": "1 mol NaCl và 1 mol H_{2}O"
  },
  {
    "con": "Nếu 2 mol khí CO tác dụng với 1 mol O_{2} thì sản phẩm tạo thành là",
    "re": "2 mol CO_{2}"
  },
  {
    "con": "Khi cho 1 mol CaCO_{3} tác dụng với axit clohidric (HCl), sản phẩm khí thoát ra là",
    "re": "CO_{2}"
  },
  {
    "con": "Nếu 1 mol NH_{3} phản ứng với 1 mol HCl, thì sản phẩm tạo thành là",
    "re": "1 mol NH_{4}Cl"
  },
  {
    "con": "Khi cho 1 mol Fe tác dụng với 3/2 mol O_{2}, sản phẩm tạo thành là",
    "re": "1 mol Fe_{2}O_{3}"
  },
  {
    "con": "Nếu 1 mol KOH hòa tan trong nước, thì nhiệt độ của dung dịch sẽ",
    "re": "tăng lên do phản ứng tỏa nhiệt"
  },
  {
    "con": "Thực hiện thí nghiệm như hình vẽ bên. Kết thúc thí nghiệm, dung dịch Br_{2} bị mất màu",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan NaCl vào nước, dung dịch trở nên dẫn điện",
    "re": "Có sự hiện diện của ion trong dung dịch"
  },
  {
    "con": "Khi đun nóng một hợp chất hữu cơ, nếu có khí thoát ra và có mùi đặc trưng",
    "re": "Hợp chất đó có thể là một este hoặc anđehit"
  },
  {
    "con": "Khi thêm axit vào dung dịch kiềm, nếu có hiện tượng sủi bọt",
    "re": "Có sự tạo thành khí CO2"
  },
  {
    "con": "Khi thực hiện phản ứng giữa axit và bazơ, nếu pH của dung dịch thay đổi từ 7 sang 3",
    "re": "Dung dịch trở nên axit hơn"
  },
  {
    "con": "Khi cho kim loại vào dung dịch muối của nó, nếu kim loại bị ăn mòn",
    "re": "Kim loại đó có tính khử mạnh hơn ion kim loại trong dung dịch"
  },
  {
    "con": "Khi thực hiện phản ứng oxi hóa khử, nếu có sự thay đổi số oxi hóa",
    "re": "Có sự chuyển giao electron giữa các chất"
  },
  {
    "con": "Khi hòa tan một chất rắn vào nước và không thấy hiện tượng gì xảy ra",
    "re": "Chất đó không tan trong nước"
  },
  {
    "con": "Khi thực hiện phản ứng giữa axit và muối, nếu có kết tủa xuất hiện",
    "re": "Có sự tạo thành một hợp chất không tan"
  },
  {
    "con": "Khi đo nhiệt độ của một phản ứng hóa học và thấy nhiệt độ tăng lên",
    "re": "Phản ứng đó là phản ứng tỏa nhiệt"
  },
  {
    "con": "Cho các chất: anilin, phenylamoni clorua, alanin, Gly-Ala. Số chất phản ứng được với NaOH trong dung dịch là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thuận nghịch thì",
    "re": "phản ứng sẽ dịch chuyển theo chiều tỏa nhiệt"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7 thì",
    "re": "dung dịch trở thành axit"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước thì",
    "re": "chất đó có khả năng tạo thành dung dịch"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên thì",
    "re": "tốc độ phản ứng hóa học có thể tăng lên"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện áp suất cao thì",
    "re": "phản ứng sẽ có xu hướng chuyển dịch về phía có ít phân tử khí hơn"
  },
  {
    "con": "Khi thêm chất xúc tác vào một phản ứng hóa học thì",
    "re": "tốc độ phản ứng sẽ tăng lên mà không làm thay đổi trạng thái cân bằng"
  },
  {
    "con": "Nếu một ion kim loại có hóa trị +2 thì",
    "re": "ion đó có khả năng tạo thành muối với các anion có hóa trị -2"
  },
  {
    "con": "Khi một chất bị oxi hóa thì",
    "re": "chất đó mất electron"
  },
  {
    "con": "Nếu một dung dịch có màu xanh lam thì",
    "re": "có thể chứa ion đồng (Cu²⁺)"
  },
  {
    "con": "Cho 0,425 gam hỗn hợp X gồm Na và K vào nước dư, thu được 0,168 lít khí H_{2} (đktc). Khối lượng kim loại Na trong X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng lên",
    "re": "do năng lượng va chạm giữa các phân tử tăng"
  },
  {
    "con": "Khi pH của dung dịch axit giảm, nồng độ ion H+ trong dung dịch tăng",
    "re": "dung dịch trở nên axit hơn"
  },
  {
    "con": "Khi cho một lượng NaOH vào dung dịch HCl, pH của dung dịch sẽ tăng",
    "re": "do NaOH trung hòa HCl"
  },
  {
    "con": "Khi một chất rắn tan trong nước, nếu nhiệt độ của nước giảm, thì quá trình tan sẽ",
    "re": "hấp thụ nhiệt"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng, áp suất hơi của dung dịch sẽ",
    "re": "giảm"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện kín, nếu sản phẩm phản ứng là khí, thì áp suất trong bình sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Khi một kim loại phản ứng với axit, sản phẩm thu được sẽ là",
    "re": "muối và khí H2"
  },
  {
    "con": "Khi nhiệt độ của một chất lỏng tăng, độ hòa tan của chất rắn trong chất lỏng đó thường",
    "re": "tăng lên"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra, nếu năng lượng tự do Gibbs giảm, thì phản ứng đó",
    "re": "có khả năng xảy ra tự phát"
  },
  {
    "con": "Thủy phân hoàn toàn a mol triglixerit X trong dung dịch NaOH vừa đủ, thu được glixerol và m gam hỗn hợp muối. Đốt cháy hoàn toàn a mol X thu được 1,375 mol CO_{2} và 1,275 mol H_{2}O. Mặt khác, a mol X tác dụng tối đa với 0,05 mol Br_{2} trong dung dịch. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi hòa tan 1 mol NaCl vào 1 lít nước, nồng độ mol của dung dịch NaCl là",
    "re": "1 M"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ và áp suất không đổi, thì năng lượng tự do Gibbs của hệ thống sẽ",
    "re": "giảm khi phản ứng tiến tới trạng thái cân bằng"
  },
  {
    "con": "Khi một axit mạnh phản ứng với một bazơ mạnh, sản phẩm chính thu được là",
    "re": "muối và nước"
  },
  {
    "con": "Nếu một chất khí có thể hòa tan trong nước, thì áp suất hơi của chất khí đó trong dung dịch sẽ",
    "re": "thấp hơn áp suất hơi của chất khí nguyên chất"
  },
  {
    "con": "Khi nhiệt độ tăng, độ hòa tan của hầu hết các muối trong nước sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Nếu một dung dịch có pH = 7, thì dung dịch đó được coi là",
    "re": "trung tính"
  },
  {
    "con": "Khi một kim loại phản ứng với axit, sản phẩm chính thu được là",
    "re": "muối và khí hidro"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì khi đạt đến trạng thái cân bằng, tốc độ phản ứng thuận sẽ",
    "re": "bằng tốc độ phản ứng nghịch"
  },
  {
    "con": "Khi một dung dịch chứa ion Ag^+ được thêm vào dung dịch chứa ion Cl^-, thì sẽ xảy ra hiện tượng",
    "re": "kết tủa AgCl"
  },
  {
    "con": "Cho các chất: NaOH, Cu, HCl, HNO_{3}, AgNO_{3}, Mg. Số chất phản ứng được với dung dịch Fe(NO_{3})_{2} là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ tăng lên trong một phản ứng hóa học thì tốc độ phản ứng",
    "re": "tăng lên"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7 thì dung dịch đó",
    "re": "có tính axit"
  },
  {
    "con": "Khi một kim loại phản ứng với axit thì sản phẩm tạo thành là",
    "re": "muối và khí hidro"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước thì chất đó",
    "re": "là chất tan tốt"
  },
  {
    "con": "Khi nồng độ dung dịch tăng thì áp suất hơi của dung dịch",
    "re": "giảm"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yên tĩnh thì năng lượng tự do của hệ",
    "re": "giảm"
  },
  {
    "con": "Khi có sự thay đổi về nhiệt độ trong một phản ứng hóa học thì trạng thái cân bằng",
    "re": "có thể bị dịch chuyển"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng thì chất đó",
    "re": "có thể là đồng phân quang học"
  },
  {
    "con": "Khi một ion dương kết hợp với một ion âm thì chúng",
    "re": "tạo thành một hợp chất ion"
  },
  {
    "con": "Hòa tan 27,32 gam hỗn hợp E gồm hai muối M_{2}CO_{3} và MHCO_{3} vào nước, thu được dung dịch X. Chia X thành hai phần bằng nhau. Cho phần một tác dụng hoàn toàn với dung dịch Ba(OH) _{2} dư, thu được 31,52 gam kết tủa. Cho phần hai tác dụng hoàn toàn với dung dịch BaCl_{2} dư, thu được 11,82 gam kết tủa. Phát biểu nào dưới đây đúng?",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi đun nóng một muối nitrat, nếu muối đó là muối nitrat của kim loại kiềm thổ, thì sản phẩm khí thu được sẽ là NO_{2}.",
    "re": "Sản phẩm khí thu được là NO_{2}."
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó được coi là axit.",
    "re": "Dung dịch đó được coi là axit."
  },
  {
    "con": "Khi cho axit clohidric tác dụng với natri hidroxit, nếu phản ứng xảy ra hoàn toàn, thì sản phẩm thu được sẽ là natri clorua và nước.",
    "re": "Sản phẩm thu được sẽ là natri clorua và nước."
  },
  {
    "con": "Nếu một hợp chất có công thức phân tử C_{n}H_{2n}O_{n}, thì hợp chất đó có thể là một loại đường đơn giản.",
    "re": "Hợp chất đó có thể là một loại đường đơn giản."
  },
  {
    "con": "Khi cho khí CO_{2} vào dung dịch nước vôi trong, nếu có kết tủa xuất hiện, thì khí CO_{2} đã phản ứng với Ca(OH)_{2}.",
    "re": "Khí CO_{2} đã phản ứng với Ca(OH)_{2}."
  },
  {
    "con": "Nếu một kim loại có điện cực âm hơn so với một kim loại khác trong dãy điện hóa, thì kim loại đó sẽ dễ bị oxi hóa hơn.",
    "re": "Kim loại đó sẽ dễ bị oxi hóa hơn."
  },
  {
    "con": "Khi cho dung dịch axit sulfuric tác dụng với đồng, nếu phản ứng xảy ra, thì sản phẩm khí thu được sẽ là khí hidro.",
    "re": "Sản phẩm khí thu được sẽ là khí hidro."
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol/lít cao hơn 1, thì dung dịch đó được coi là đậm đặc.",
    "re": "Dung dịch đó được coi là đậm đặc."
  },
  {
    "con": "Khi cho dung dịch kali clorua vào dung dịch bạc nitrat, nếu có kết tủa trắng xuất hiện, thì phản ứng đã xảy ra.",
    "re": "Phản ứng đã xảy ra."
  },
  {
    "con": "Cho các phát biểu sau:\n(a) Phản ứng thế brom vào vòng thơm của anilin dễ hơn benzen.\n(b) Có hai chất hữu cơ đơn chức, mạch hở có cùng công thức C_{2}H_{4}O_{2}.\n(c) Trong phân tử, các amino axit đều chỉ có một nhóm NH_{2} và một nhóm COOH.\n(d) Hợp chất H_{2}N-CH_{2}-COO-CH_{3} tác dụng được với dung dịch NaOH và dung dịch HCl.\n(e) Thủy phân hoàn toàn tinh bột và xenlulozơ đều thu được glucozơ.\n(g) Mỡ động vật và dầu thực vật chứa nhiều chất béo",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Chất khí CO_{2} được sinh ra khi đốt cháy hoàn toàn một hợp chất hữu cơ chứa carbon",
    "re": "Có thể xác định sự hiện diện của carbon trong hợp chất đó"
  },
  {
    "con": "Khi hòa tan muối natri clorua trong nước, ion Na^{+} và Cl^{-} sẽ tách ra",
    "re": "Dung dịch sẽ dẫn điện"
  },
  {
    "con": "Nếu một dung dịch có pH < 7",
    "re": "Dung dịch đó là axit"
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường tăng lên",
    "re": "Do các phân tử có năng lượng cao hơn và va chạm nhiều hơn"
  },
  {
    "con": "Nếu một hợp chất có điểm sôi cao hơn nước",
    "re": "Hợp chất đó có thể có liên kết hydro mạnh"
  },
  {
    "con": "Khi cho axit vào dung dịch kiềm",
    "re": "Sẽ xảy ra phản ứng trung hòa tạo ra muối và nước"
  },
  {
    "con": "Nếu một chất có công thức phân tử C_{n}H_{2n+2}",
    "re": "Chất đó là ankan"
  },
  {
    "con": "Khi một kim loại phản ứng với axit",
    "re": "Sẽ sinh ra khí hidro và muối"
  },
  {
    "con": "Nếu một chất có tính oxi hóa mạnh",
    "re": "Chất đó có khả năng nhận electron từ chất khác"
  },
  {
    "con": "Nhỏ từ từ đến dư dung dịch Ba(OH)2 vào dung dịch chứa m gam hỗn hợp Al_{2}(SO_{4})_{3} và Al(NO_{3})_{3}. Sự phụ thuộc của khối lượng kết tủa (y gam) vào số mol Ba(OH) _{2} (x mol) được biểu diễn bằng đồ thị bên. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nung một mẫu chất rắn chứa NaCl ở nhiệt độ cao, thì chất rắn sẽ bị phân hủy thành Na và Cl2.",
    "re": "NaCl không bền ở nhiệt độ cao"
  },
  {
    "con": "Khi hòa tan NaOH vào nước, thì nhiệt độ của dung dịch sẽ tăng lên do phản ứng tỏa nhiệt.",
    "re": "NaOH là một chất tan tốt trong nước"
  },
  {
    "con": "Nếu cho dung dịch HCl vào dung dịch NaOH, thì sẽ xảy ra phản ứng trung hòa tạo ra NaCl và nước.",
    "re": "NaCl là muối được hình thành"
  },
  {
    "con": "Khi thêm phenolphthalein vào dung dịch NaOH, thì dung dịch sẽ chuyển sang màu hồng.",
    "re": "Phenolphthalein là chỉ thị pH"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7, thì chất đó được coi là axit.",
    "re": "Axit có khả năng cho proton"
  },
  {
    "con": "Khi đun nóng dung dịch chứa CaCO3, thì sẽ xảy ra phản ứng phân hủy tạo ra CaO và CO2.",
    "re": "CaCO3 là một muối không bền khi đun nóng"
  },
  {
    "con": "Nếu một chất có khối lượng mol nhỏ hơn 18 g/mol, thì chất đó có thể là nước.",
    "re": "Nước là chất có khối lượng mol 18 g/mol"
  },
  {
    "con": "Khi cho dung dịch AgNO3 vào dung dịch NaCl, thì sẽ xuất hiện kết tủa AgCl.",
    "re": "AgCl là kết tủa không tan trong nước"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra với sự thay đổi năng lượng, thì phản ứng đó có thể là phản ứng tỏa nhiệt hoặc thu nhiệt.",
    "re": "Phản ứng hóa học có thể thay đổi năng lượng"
  },
  {
    "con": "Đốt cháy hoàn toàn 0,1 mol hỗn hợp X gồm CH_{4}, C_{2}H_{2}, C_{2}H_{4} và C_{3}H_{6}, thu được 4,032 lít CO_{2} (đktc) và 3,78 gam H_{2}O. Mặt khác 3,87 gam X phản ứng được tối đa với a mol Br_{2} trong dung dịch. Giá trị của a là trị của a là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hòa tan 1 mol NaCl vào 1 lít nước, nồng độ mol của dung dịch NaCl là",
    "re": "1 M"
  },
  {
    "con": "Khi cho 0,5 mol H_{2} và 0,25 mol O_{2} vào bình kín, phản ứng xảy ra hoàn toàn, số mol nước thu được là",
    "re": "0,25 mol"
  },
  {
    "con": "Khi đun nóng 1 mol CaCO_{3}, sản phẩm thu được là",
    "re": "0,5 mol CO_{2} và 1 mol CaO"
  },
  {
    "con": "Khi cho 2 mol H_{2} phản ứng với 1 mol O_{2}, sản phẩm thu được là",
    "re": "2 mol H_{2}O"
  },
  {
    "con": "Khi hòa tan 58,5 gam NaCl vào 1 lít nước, khối lượng mol của NaCl là",
    "re": "58,5 g/mol"
  },
  {
    "con": "Khi cho 1 mol HCl vào 1 lít dung dịch, pH của dung dịch là",
    "re": "0"
  },
  {
    "con": "Khi cho 1 mol NH_{3} vào 1 lít nước, nồng độ mol của dung dịch NH_{3} là",
    "re": "1 M"
  },
  {
    "con": "Khi đốt cháy hoàn toàn 1 mol C_{3}H_{8}, sản phẩm thu được là",
    "re": "3 mol CO_{2} và 4 mol H_{2}O"
  },
  {
    "con": "Khi cho 1 mol H_{2} vào 1 mol Cl_{2}, sản phẩm thu được là",
    "re": "2 mol HCl"
  },
  {
    "con": "Câu 67.        Tiến hành các thí nghiệm sau:\n(a) Cho kim loại Cu dư vào dung dịch Fe(NO_{3})_{3}\n(b) Sục khí CO_{2} dư vào dung dịch NaOH.\n(c) Cho Na_{2}CO_{3} vào dung dịch Ca(HCO_{3})_{2} (tỉ lệ mol 1 : 1).\n(d) Cho bột Fe dư vào dung dịch FeCl_{3}\n(e) Cho hỗn hợp BaO và Al_{2}O_{3} (tỉ lệ mol 1 : 1) vào nước dư.\n(g) Cho hỗn hợp Fe_{2}O_{3} và Cu (tỉ lệ mol 1 : 1) vào dung dịch HCl dư\nSau khi các phản ứng xảy ra hoàn toàn, số thí nghiệm thu được dung dịch chứa một muối là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Kim loại kiềm phản ứng với nước",
    "re": "sinh ra khí H_{2} và dung dịch kiềm"
  },
  {
    "con": "Khi đun nóng dung dịch NaCl với bột Al",
    "re": "sẽ xảy ra phản ứng nhường electron và tạo ra Na và AlCl_{3}"
  },
  {
    "con": "Khi cho axit HCl vào dung dịch NaHCO_{3}",
    "re": "sẽ sinh ra khí CO_{2} và nước"
  },
  {
    "con": "Khi cho dung dịch AgNO_{3} vào dung dịch NaCl",
    "re": "sẽ tạo ra kết tủa AgCl"
  },
  {
    "con": "Khi đun nóng CaCO_{3}",
    "re": "sẽ phân hủy thành CaO và CO_{2}"
  },
  {
    "con": "Khi cho dung dịch H_{2}SO_{4} vào bột Zn",
    "re": "sẽ sinh ra khí H_{2} và dung dịch ZnSO_{4}"
  },
  {
    "con": "Khi cho dung dịch NaOH vào dung dịch HCl",
    "re": "sẽ xảy ra phản ứng trung hòa tạo ra NaCl và nước"
  },
  {
    "con": "Khi cho bột Fe vào dung dịch CuSO_{4}",
    "re": "sẽ xảy ra phản ứng trao đổi và tạo ra Cu và dung dịch FeSO_{4}"
  },
  {
    "con": "Khi cho dung dịch Ba(OH)_{2} vào dung dịch NH_{4}Cl",
    "re": "sẽ tạo ra khí NH_{3} và dung dịch BaCl_{2}"
  },
  {
    "con": "Cho kim loại M và các hợp chất X, Y, Z thỏa mãn các phương trình hóa học sau:\na)        2M+3Cl_{2}\\xrightarrow[to]2MCl_{3}\nb)        2M+6HCl \\xrightarrow  2MCl_{3}+3H_{2}\nc)        2M+2X+2H\\xrightarrow _{2}O  2Y+3H_{2}\nd)        Y+CO_{2}+2H_{2}O \\xrightarrow  Z+KHCO_{3}\nCác chất X, Y, Z lần lượt là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một hợp chất ion hòa tan trong nước, nó sẽ phân ly thành các ion thành phần.",
    "re": "Giải phóng các ion trong dung dịch"
  },
  {
    "con": "Nếu nhiệt độ của một phản ứng hóa học tăng lên, thì tốc độ phản ứng sẽ tăng.",
    "re": "Tăng tốc độ phản ứng"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7, thì chất đó được coi là axit.",
    "re": "Chất đó có tính axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện không có không khí, thì sản phẩm phản ứng có thể khác so với khi có không khí.",
    "re": "Sản phẩm phản ứng có thể khác nhau"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit, thì nó sẽ tạo ra muối và khí hydro.",
    "re": "Tạo ra muối và khí hydro"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao hơn, thì nó sẽ dẫn điện tốt hơn.",
    "re": "Dẫn điện tốt hơn"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn điểm sôi của nước, thì nó sẽ bay hơi ở nhiệt độ phòng.",
    "re": "Chất đó sẽ bay hơi"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì nó có thể diễn ra theo cả hai chiều.",
    "re": "Có thể diễn ra theo cả hai chiều"
  },
  {
    "con": "Nếu một chất có cấu trúc phân tử không đối xứng, thì nó có thể có đồng phân quang học.",
    "re": "Có thể có đồng phân quang học"
  },
  {
    "con": "Cho các phát biểu sau:\n(a) Cho khí H_{2} dư qua hỗn hợp bột Fe_{2}O_{3} và CuO nung nóng, thu được Fe và Cu.\n(b) Cho kim loại Ba tác dụng với dung dịch CuSO_{4}, thu được kim loại Cu.\n(c) Cho AgNO_{3} tác dụng với dung dịch FeCl_{3}, thu được kim loại Ag.\n(d) Để gang trong không khí ẩm lâu ngày có xảy ra ăn mòn điện hóa học.\n(e) Dùng bột lưu huỳnh để xử lí thủy ngân khi nhiệt kế bị vỡ.\nSố phát biểu đúng là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Cho một dung dịch NaCl vào nước,",
    "re": "NaCl sẽ phân ly thành Na^+ và Cl^- trong dung dịch."
  },
  {
    "con": "Khi đun nóng một hợp chất hữu cơ,",
    "re": "nó có thể phân hủy thành các sản phẩm khác nhau tùy thuộc vào cấu trúc hóa học của nó."
  },
  {
    "con": "Khi cho axit HCl vào dung dịch NaOH,",
    "re": "phản ứng trung hòa xảy ra và tạo ra nước và muối NaCl."
  },
  {
    "con": "Khi một kim loại phản ứng với axit,",
    "re": "sẽ sinh ra khí hidro và muối của kim loại đó."
  },
  {
    "con": "Khi cho dung dịch AgNO3 vào dung dịch NaCl,",
    "re": "sẽ xảy ra phản ứng kết tủa tạo ra AgCl."
  },
  {
    "con": "Khi một chất rắn được hòa tan trong dung môi,",
    "re": "nó sẽ tạo thành dung dịch đồng nhất nếu chất đó tan được."
  },
  {
    "con": "Khi nhiệt độ tăng, tốc độ phản ứng hóa học thường",
    "re": "tăng lên do các phân tử có năng lượng cao hơn."
  },
  {
    "con": "Khi cho bột nhôm vào dung dịch CuSO4,",
    "re": "nhôm sẽ đẩy đồng ra khỏi dung dịch và tạo ra Cu."
  },
  {
    "con": "Khi một chất bị oxi hóa,",
    "re": "nó sẽ mất electron và tăng số oxi hóa."
  },
  {
    "con": "Hợp chất hữu cơ X (C_{8}H_{15}O_{4}N) tác dụng với dung dịch NaOH dư, đun nóng, thu được sản phẩm hữu cơ gồm muối đinatri glutamat và ancol. Số công thức cấu tạo của X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Khi một kim loại tác dụng với axit, sản phẩm thu được là muối và khí hidro",
    "re": "Phản ứng xảy ra"
  },
  {
    "con": "Nếu nhiệt độ tăng lên trong một phản ứng hóa học, thì tốc độ phản ứng thường tăng lên",
    "re": "Phản ứng diễn ra nhanh hơn"
  },
  {
    "con": "Khi pH của dung dịch giảm xuống dưới 7, thì dung dịch đó trở thành axit",
    "re": "Tính axit tăng lên"
  },
  {
    "con": "Nếu một hợp chất có liên kết đôi trong cấu trúc, thì nó có khả năng tham gia phản ứng cộng",
    "re": "Phản ứng hóa học có thể xảy ra"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước, nếu nhiệt độ của dung dịch tăng lên, thì độ hòa tan của chất rắn thường tăng",
    "re": "Chất rắn hòa tan tốt hơn"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện yên tĩnh, thì sản phẩm thu được có thể khác so với khi phản ứng xảy ra trong điều kiện khuấy trộn",
    "re": "Sản phẩm có thể khác nhau"
  },
  {
    "con": "Khi một dung dịch muối được điện phân, thì sản phẩm thu được có thể là kim loại và khí",
    "re": "Phản ứng điện phân xảy ra"
  },
  {
    "con": "Nếu nồng độ của một chất trong dung dịch tăng lên, thì tốc độ phản ứng hóa học có thể tăng lên",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Khi một hợp chất hữu cơ bị oxi hóa, thì nó có thể mất đi các nguyên tử hydro",
    "re": "Phản ứng oxi hóa xảy ra"
  },
  {
    "con": "Kết quả thí nghiệm của các chất X, Y, Z với các thuốc thử được ghi ở bảng sau:\nChất        Thuốc thử        Hiện tượng\nX        Quỳ tím        Quỳ tím chuyển màu hồng\nY        Dung dịch AgNO_{3} trong NH_{3}        Tạo kết tủa Ag\nZ        Nước brom        Tạo kết tủa trắng\nCác chất X, Y, Z lần lượt là:",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nhiệt độ của một phản ứng hóa học tăng lên",
    "re": "Tốc độ phản ứng sẽ tăng lên"
  },
  {
    "con": "Một chất có độ pH dưới 7",
    "re": "Chất đó là axit"
  },
  {
    "con": "Một phản ứng hóa học xảy ra trong môi trường nước",
    "re": "Phản ứng đó có thể tạo ra dung dịch"
  },
  {
    "con": "Số mol của một chất được tính bằng khối lượng chia cho khối lượng mol",
    "re": "Số mol sẽ cho biết lượng chất có trong phản ứng"
  },
  {
    "con": "Khi một kim loại phản ứng với axit",
    "re": "Sẽ tạo ra muối và khí hidro"
  },
  {
    "con": "Khi nồng độ của một chất trong dung dịch tăng lên",
    "re": "Độ dẫn điện của dung dịch sẽ tăng lên"
  },
  {
    "con": "Khi một chất rắn hòa tan trong nước",
    "re": "Sẽ tạo ra dung dịch đồng nhất"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra và tạo ra khí",
    "re": "Khối lượng của hệ thống sẽ giảm"
  },
  {
    "con": "Khi nhiệt độ của một chất khí giảm",
    "re": "Áp suất của chất khí sẽ giảm nếu thể tích không đổi"
  },
  {
    "con": "Cho các sơ đồ phản ứng theo đúng tỉ lệ mol:                    \na)        X+2NaOH \\xrightarrow[t^o]  X_{1}+X2+H_{2}O\nb)        X_{1}+H_{2}SO_{4} \\xrightarrow X_{3}+Na_{2}SO_{4}\nc)        nX_{3}+nX_{4}\\xrightarrow[t^o, xt]  poli(etylen terephtalat)+2nH_{2}O\nd)        X_{3}+2X_{2} \\xrightleftarrow[H_{2}SO_{4} (đặc, t^o)]  X_{5}+2H_{2}O\nCho biết: X là hợp chất hữu cơ có công thức phân tử C_{10}H_{10}O_{4}; X_{1}, X_{2}, X_{3}, X_{4}, X_{5} là các hợp chất hữu cơ khác nhau. Phân tử khối của X_{5} là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hòa tan một muối trong nước và đo pH của dung dịch",
    "re": "Nếu muối đó là muối axit, pH sẽ thấp hơn 7"
  },
  {
    "con": "Thực hiện phản ứng giữa axit và bazơ",
    "re": "Sẽ tạo ra muối và nước"
  },
  {
    "con": "Đun nóng một hợp chất hữu cơ có chứa nhóm chức -OH",
    "re": "Có thể xảy ra phản ứng khử nước để tạo thành anken"
  },
  {
    "con": "Cho một kim loại vào dung dịch axit",
    "re": "Kim loại sẽ phản ứng và giải phóng khí hidro nếu kim loại đó đứng trước hidro trong dãy hoạt động hóa học"
  },
  {
    "con": "Sử dụng quỳ tím để thử nghiệm pH",
    "re": "Quỳ tím sẽ chuyển sang màu đỏ trong môi trường axit và màu xanh trong môi trường bazơ"
  },
  {
    "con": "Trộn hai dung dịch chứa ion đối kháng",
    "re": "Sẽ xảy ra phản ứng kết tủa nếu sản phẩm của phản ứng là một chất không tan"
  },
  {
    "con": "Đo nhiệt độ của một phản ứng hóa học",
    "re": "Nếu phản ứng tỏa nhiệt, nhiệt độ sẽ tăng lên"
  },
  {
    "con": "Thực hiện phản ứng oxi hóa khử",
    "re": "Một chất sẽ bị oxi hóa và một chất khác sẽ bị khử"
  },
  {
    "con": "Cho một chất rắn vào dung dịch",
    "re": "Chất rắn sẽ tan nếu nó là chất tan trong dung môi đó"
  },
  {
    "con": "Hòa tan hết 18,32 gam hỗn hợp X gồm Al, MgCO_{3}, Fe, FeCO_{3} trong dung dịch chứa 1,22 mol NaHSO_{4} và 0,25 mol HNO_{3}, thu được dung dịch Z (chỉ chứa muối trung hòa) và 7,97 gam hỗn hợp khí Y gồm CO_{2}, N_{2}, NO, H_{2} (trong Y có 0,025 mol H_{2} và tỉ lệ mol NO : N_{2} = 2 : 1). Dung dịch Z phản ứng được tối đa với 1,54 mol NaOH, lọc lấy kết tủa đem nung trong không khí đến khối lượng không đổi, thu được 8,8 gam chất rắn. Biết các phản ứng xảy ra hoàn toàn. Phần trăm khối lượng Fe đơn chất trong X là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hòa tan 10 gam NaCl vào 100 ml nước, nồng độ mol của dung dịch NaCl là",
    "re": "0,17 mol/L"
  },
  {
    "con": "Khi đun nóng 1 mol H2 và 1 mol O2 trong điều kiện thích hợp, sản phẩm thu được là",
    "re": "2 mol H2O"
  },
  {
    "con": "Nếu một dung dịch có pH = 3, thì nồng độ ion H+ trong dung dịch đó là",
    "re": "0,001 mol/L"
  },
  {
    "con": "Khi cho 0,5 mol HCl phản ứng với 0,5 mol NaOH, sản phẩm thu được là",
    "re": "0,5 mol NaCl và 0,5 mol H2O"
  },
  {
    "con": "Nếu một chất có điểm sôi cao hơn điểm sôi của nước, thì chất đó sẽ",
    "re": "không bay hơi ở nhiệt độ 100 độ C"
  },
  {
    "con": "Khi cho 1 mol CaCO3 vào dung dịch HCl, sản phẩm khí sinh ra là",
    "re": "CO2"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra tỏa nhiệt, thì nhiệt độ của hệ sẽ",
    "re": "tăng lên"
  },
  {
    "con": "Khi cho 2 mol NaOH vào 1 mol H2SO4, sản phẩm thu được là",
    "re": "1 mol Na2SO4 và 2 mol H2O"
  },
  {
    "con": "Nếu một chất có khối lượng mol nhỏ hơn 18 g/mol, thì chất đó có thể là",
    "re": "H2O hoặc H2"
  },
  {
    "con": "Cho m gam hỗn hợp X gồm Fe, Fe_{3}O_{4} và FeCO_{3} (tỉ lệ mol tương ứng là 6 : 1 : 2) phản ứng hoàn toàn với dung dịch H_{2}SO_{4} (đặc, nóng) thu được dung dịch Y chứa hai muối và 2,128 lít (đktc) hỗn hợp khí Z gồm CO_{2} và SO_{2}. Biết Y phản ứng tối đa với 0,2m gam Cu. Hấp thụ toàn bộ Z vào dung dịch Ca(OH) _{2} dư, thu được a gam kết tủa. Giá trị của a là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hỗn hợp khí gồm H_{2} và Cl_{2} phản ứng với nhau trong điều kiện thích hợp",
    "re": "sẽ tạo ra HCl"
  },
  {
    "con": "Khi cho dung dịch NaOH vào dung dịch HCl",
    "re": "sẽ xảy ra phản ứng trung hòa tạo ra NaCl và nước"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit tạo ra khí H_{2}",
    "re": "thì kim loại đó phải nằm trên H trong dãy hoạt động hóa học"
  },
  {
    "con": "Khi đun nóng một muối nitrat",
    "re": "sẽ phân hủy thành oxit kim loại, khí NO_{2} và O_{2}"
  },
  {
    "con": "Nếu cho dung dịch Ba(OH)_{2} vào dung dịch H_{2}SO_{4}",
    "re": "sẽ tạo ra kết tủa BaSO_{4}"
  },
  {
    "con": "Khi một hợp chất hữu cơ bị oxi hóa hoàn toàn",
    "re": "sẽ tạo ra CO_{2} và H_{2}O"
  },
  {
    "con": "Nếu một dung dịch có pH < 7",
    "re": "thì dung dịch đó là axit"
  },
  {
    "con": "Khi cho dung dịch AgNO_{3} vào dung dịch NaCl",
    "re": "sẽ tạo ra kết tủa AgCl"
  },
  {
    "con": "Nếu một chất có nhiệt độ nóng chảy thấp hơn nhiệt độ phòng",
    "re": "thì chất đó sẽ tồn tại ở trạng thái lỏng ở nhiệt độ phòng"
  },
  {
    "con": "Hỗn hợp E gồm chất X (C_{m}H_{2}_{m+4}O_{4}N_{2}, là muối của axit cacboxylic hai chức) và chất Y (C_{n}H_{2}_{n+3}O_{2}N, là muối của axit cacboxylic đơn chức). Đốt cháy hoàn toàn 0,2 mol E cần vừa đủ 0,58 mol O_{2}, thu được N_{2}, CO_{2} và 0,84 mol H_{2}O. Mặt khác, cho 0,2 mol E tác dụng hết với dung dịch NaOH, cô cạn dung dịch sau phản ứng, thu được một chất khí làm xanh quỳ tím ẩm và a gam hỗn hợp hai muối khan. Giá trị của a là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Dung dịch chứa ion Cl- và ion Ag+ được trộn lẫn với nhau",
    "re": "sẽ tạo ra kết tủa AgCl trắng"
  },
  {
    "con": "Khi một axit mạnh như HCl được hòa tan trong nước",
    "re": "nó sẽ hoàn toàn phân ly thành ion H+ và Cl-"
  },
  {
    "con": "Khi nhiệt độ tăng, áp suất của một khí trong một bình kín không thay đổi",
    "re": "thì thể tích của khí đó sẽ tăng theo định luật Charles"
  },
  {
    "con": "Khi một muối được hòa tan trong nước và tạo ra dung dịch bão hòa",
    "re": "thì nồng độ của muối trong dung dịch sẽ không thay đổi nữa"
  },
  {
    "con": "Khi cho một kim loại phản ứng với axit hydrochloric",
    "re": "sẽ sinh ra khí H2 và muối clorua của kim loại đó"
  },
  {
    "con": "Khi một chất hữu cơ có nhóm chức -OH tác dụng với axit",
    "re": "sẽ tạo ra este và nước"
  },
  {
    "con": "Khi một dung dịch có pH < 7 được trung hòa bằng dung dịch kiềm",
    "re": "thì pH của dung dịch sẽ tăng lên đến 7"
  },
  {
    "con": "Khi một phản ứng hóa học xảy ra trong điều kiện nhiệt độ và áp suất không đổi",
    "re": "thì năng lượng tự do Gibbs của hệ sẽ giảm"
  },
  {
    "con": "Khi cho một chất rắn vào dung dịch, nếu chất đó không tan",
    "re": "thì nó sẽ không làm thay đổi nồng độ của dung dịch"
  },
  {
    "con": "Hỗn hợp X gồm Al, K, K_{2}O và BaO (trong đó oxi chiếm 10% khối lượng của X). Hòa tan hoàn toàn m gam X vào nước dư, thu được dung dịch Y và 0,056 mol khí H_{2}. Cho từ từ đến hết dung dịch chứa 0,04 mol H_{2}SO_{4} và 0,02 mol HCl vào Y, thu được 4,98 gam hỗn hợp kết tủa và dung dịch Z chỉ chứa 6,182 gam hỗn hợp các muối clorua và muối sunfat trung hòa. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch chứa 0,1 mol/L NaCl và 0,1 mol/L AgNO3 được trộn lẫn, thì sẽ xuất hiện kết tủa AgCl.",
    "re": "Kết tủa AgCl hình thành"
  },
  {
    "con": "Nếu nhiệt độ của một phản ứng hóa học tăng lên, thì tốc độ phản ứng sẽ thường tăng lên.",
    "re": "Tốc độ phản ứng tăng"
  },
  {
    "con": "Nếu một chất có độ pH dưới 7, thì chất đó được coi là axit.",
    "re": "Chất đó là axit"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện không có không khí, thì sản phẩm tạo ra sẽ không bị oxi hóa.",
    "re": "Sản phẩm không bị oxi hóa"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol/L cao hơn, thì khả năng dẫn điện của dung dịch đó sẽ cao hơn.",
    "re": "Khả năng dẫn điện cao hơn"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit, thì sẽ sinh ra khí hidro.",
    "re": "Khí hidro được sinh ra"
  },
  {
    "con": "Nếu một chất rắn tan trong nước, thì chất đó được gọi là chất tan.",
    "re": "Chất đó là chất tan"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì có thể xảy ra cả phản ứng tiến và phản ứng lùi.",
    "re": "Cả hai phản ứng đều xảy ra"
  },
  {
    "con": "Nếu một chất có điểm sôi thấp hơn 100°C, thì chất đó có thể tồn tại ở trạng thái khí ở nhiệt độ phòng.",
    "re": "Chất đó có thể tồn tại ở trạng thái khí"
  },
  {
    "con": "Điện phân dung dịch X gồm CuSO_{4} và KCl (tỉ lệ mol tương ứng là 1 : 5) với điện cực trơ, màng ngăn xốp, cường độ dòng điện không đổi I = 2A. Sau 1930 giây, thu được dung dịch Y và hỗn hợp khí gồm H_{2} và Cl_{2} (có tỉ khối so với H_{2} là 24). Mặt khác, nếu điện phân X trong thời gian t giây thì khối lượng dung dịch giảm 2,715 gam. Giả thiết hiệu suất điện phân là 100%, các khí sinh ra không tan trong nước và nước không bay hơi trong quá trình điện phân. Giá trị của t là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch chứa NaCl được đun nóng, thì độ hòa tan của NaCl trong nước sẽ tăng lên.",
    "re": "NaCl sẽ tan nhiều hơn trong nước nóng"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao, thì tốc độ phản ứng sẽ tăng lên.",
    "re": "Phản ứng sẽ diễn ra nhanh hơn"
  },
  {
    "con": "Nếu pH của dung dịch giảm xuống dưới 7, thì dung dịch đó sẽ trở thành axit.",
    "re": "Dung dịch có tính axit"
  },
  {
    "con": "Nếu một kim loại phản ứng với axit, thì sản phẩm của phản ứng sẽ bao gồm muối và khí hydro.",
    "re": "Sẽ sinh ra muối và H_{2} khí"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol cao, thì áp suất thẩm thấu của dung dịch đó sẽ lớn.",
    "re": "Áp suất thẩm thấu tăng"
  },
  {
    "con": "Nếu một chất rắn được hòa tan trong nước, thì dung dịch sẽ có khả năng dẫn điện nếu chất đó là muối ion.",
    "re": "Dung dịch sẽ dẫn điện"
  },
  {
    "con": "Nếu một phản ứng hóa học là thuận nghịch, thì có thể xảy ra cả phản ứng tiến và phản ứng lùi.",
    "re": "Phản ứng có thể diễn ra theo cả hai chiều"
  },
  {
    "con": "Nếu nhiệt độ của một khí tăng lên trong một bình kín, thì áp suất của khí đó sẽ tăng.",
    "re": "Áp suất khí sẽ tăng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ ion OH^{-} cao, thì dung dịch đó sẽ có tính kiềm.",
    "re": "Dung dịch có tính kiềm"
  },
  {
    "con": "Cho 0,08 mol hỗn hợp X gồm bốn este mạch hở phản ứng vừa đủ với 0,17 mol H_{2} (xúc tác Ni, t^o), thu được hỗn hợp Y. Cho toàn bộ Y phản ứng vừa đủ với 110 ml dung dịch NaOH 1M, thu được hỗn hợp Z gồm hai muối của hai axit cacboxylic no có mạch cacbon không phân nhánh và 6,88 gam hỗn hợp T gồm hai ancol no, đơn chức. Mặt khác, đốt cháy hoàn toàn 0,01 mol X cần vừa đủ 0,09 mol O_{2}. Phần trăm khối lượng của muối có phân tử khối lớn hơn trong Z là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một dung dịch chứa 0,1 mol NaCl được pha loãng đến 1 lít, thì nồng độ mol của dung dịch mới là",
    "re": "0,1 M"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra theo phương trình cân bằng, thì tổng số mol của các chất phản ứng sẽ bằng tổng số mol của các sản phẩm sau khi cân bằng",
    "re": "đúng"
  },
  {
    "con": "Nếu nhiệt độ của một hệ thống tăng lên, thì áp suất của khí trong hệ thống đó sẽ tăng theo định luật Gay-Lussac",
    "re": "đúng"
  },
  {
    "con": "Nếu một chất rắn tan trong nước tạo thành dung dịch, thì chất đó được gọi là chất tan",
    "re": "đúng"
  },
  {
    "con": "Nếu một axit phản ứng với một bazơ, thì sản phẩm của phản ứng sẽ là muối và nước",
    "re": "đúng"
  },
  {
    "con": "Nếu một chất có độ pH lớn hơn 7, thì chất đó được coi là bazơ",
    "re": "đúng"
  },
  {
    "con": "Nếu một phản ứng oxi hóa khử xảy ra, thì có sự chuyển giao electron giữa các chất tham gia phản ứng",
    "re": "đúng"
  },
  {
    "con": "Nếu một dung dịch có nồng độ mol 0,5 M, thì trong 1 lít dung dịch đó có 0,5 mol chất tan",
    "re": "đúng"
  },
  {
    "con": "Nếu một chất khí có thể hòa tan trong nước, thì nó có thể tạo thành dung dịch axit hoặc bazơ",
    "re": "đúng"
  },
  {
    "con": "Cho X, Y, Z là ba peptit mạch hở (có số nguyên tử cacbon trong phân tử tương ứng là 5, 7, 11); T là este no, đơn chức, mạch hở. Chia 234,72 gam hỗn hợp E gồm X, Y, Z, T thành hai phần bằng nhau. Đốt cháy hoàn toàn phần một cần vừa đủ 5,37 mol O_{2}. Thủy phân hoàn toàn phần hai bằng dung dịch NaOH vừa đủ, thu được ancol metylic và hỗn hợp G (gồm bốn muối của Gly, Ala, Val và axit cacboxylic). Đốt cháy hoàn toàn G, thu được Na2CO_{3}, N_{2}, 2,58 mol CO_{2} và 2,8 mol H_{2}O. Phần trăm khối lượng của Y trong E là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Nếu một hợp chất có công thức phân tử C_nH_{2n}O, thì hợp chất đó là ancol no",
    "re": "Công thức phân tử của ancol no"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra trong điều kiện nhiệt độ cao và áp suất lớn, thì phản ứng đó có thể là phản ứng tổng hợp",
    "re": "Phản ứng tổng hợp có thể xảy ra"
  },
  {
    "con": "Nếu một dung dịch có pH < 7, thì dung dịch đó là dung dịch axit",
    "re": "Dung dịch axit có tính axit"
  },
  {
    "con": "Nếu một chất có nhiệt độ sôi cao hơn nước, thì chất đó có thể là một hợp chất hữu cơ có liên kết hydro",
    "re": "Hợp chất hữu cơ có liên kết hydro"
  },
  {
    "con": "Nếu một muối được tạo thành từ axit mạnh và bazơ yếu, thì muối đó sẽ có tính axit",
    "re": "Muối có tính axit"
  },
  {
    "con": "Nếu một phản ứng oxi hóa khử xảy ra, thì có sự chuyển giao electron giữa các chất tham gia",
    "re": "Chuyển giao electron xảy ra"
  },
  {
    "con": "Nếu một chất có độ tan cao trong nước, thì chất đó có thể là một muối hoặc ancol",
    "re": "Muối hoặc ancol có độ tan cao"
  },
  {
    "con": "Nếu một hợp chất có cấu trúc phân tử phức tạp, thì hợp chất đó có thể có nhiều tính chất hóa học khác nhau",
    "re": "Hợp chất có nhiều tính chất hóa học"
  },
  {
    "con": "Nếu một phản ứng hóa học xảy ra với sự giải phóng nhiệt, thì phản ứng đó là phản ứng tỏa nhiệt",
    "re": "Phản ứng tỏa nhiệt xảy ra"
  },
  {
    "con": "Cho m gam hỗn hợp X gồm ba este đều đơn chức tác dụng tối đa với 350 ml dung dịch NaOH 1M, thu được hỗn hợp Y gồm hai ancol cùng dãy đồng đẳng và 28,6 gam hỗn hợp muối Z. Đốt cháy hoàn toàn Y, thu được 4,48 lít khí CO_{2} (đktc) và 6,3 gam H_{2}O. Giá trị của m là",
    "re": "Câu trả lời đúng"
  },
  {
    "con": "Hòa tan 10 gam Na vào 200 ml nước, thì thu được 22,4 lít khí H_{2} (đktc) và dung dịch NaOH.",
    "re": "Phản ứng xảy ra hoàn toàn"
  },
  {
    "con": "Khi cho 1 mol H_{2} tác dụng với 1 mol O_{2} trong điều kiện thích hợp, thì sản phẩm thu được là 2 mol H_{2}O.",
    "re": "Phản ứng tạo nước xảy ra"
  },
  {
    "con": "Khi đun nóng 1 mol glucozơ với 1 mol HCl, thì thu được 1 mol fructozơ.",
    "re": "Phản ứng đồng phân hóa xảy ra"
  },
  {
    "con": "Khi cho 2 mol axit axetic tác dụng với 1 mol ancol etylic trong điều kiện axit sulfuric đặc, thì thu được 1 mol etyl axetat và 1 mol nước.",
    "re": "Phản ứng este hóa xảy ra"
  },
  {
    "con": "Khi cho 1 mol NH_{3} tác dụng với 1 mol HCl, thì thu được 1 mol NH_{4}Cl.",
    "re": "Phản ứng trung hòa xảy ra"
  },
  {
    "con": "Khi đốt cháy hoàn toàn 1 mol butan, thì thu được 4 mol CO_{2} và 5 mol H_{2}O.",
    "re": "Phản ứng cháy hoàn toàn xảy ra"
  },
  {
    "con": "Khi cho 1 mol CaO tác dụng với 1 mol H_{2}O, thì thu được 1 mol Ca(OH)_{2}.",
    "re": "Phản ứng tạo thành dung dịch kiềm xảy ra"
  },
  {
    "con": "Khi cho 1 mol NaCl vào 100 ml nước, thì thu được dung dịch NaCl có nồng độ 1M.",
    "re": "Dung dịch bão hòa không xảy ra"
  },
  {
    "con": "Khi cho 1 mol axit sulfuric tác dụng với 1 mol NaOH, thì thu được 1 mol NaHSO_{4}.",
    "re": "Phản ứng trung hòa xảy ra"
  }
]